Repository: DSigmund/doc-admin
Catalog: i18n/doc-admin.*.po
Languages: ja, ru, sw

source: ACLs can be directly entered into the <filename>Kernel/Config.pm</filename> file. whoever this is not any more recommended as OTRS comes now with a GUI <link linkend="adminarea-groups">Access Control Lists</link> in the Admin panel that allows to save the ACLs in the Database as the first step and then deploy them into a file when they are ready.
ru: ACL могут быть непосредственно вставлены в файл <filename>Kernel/Config.pm</filename> file, однако, теперь, мы не рекомендуем этот способ, так как в OTRS теперь существует специальный GUI <link linkend="adminarea-groups">Списки управления доступом ACL</link> в панели администратора, позволяющий сохранять ACL в базе данных на первом шаге создания и, затем, синхронизировать их в файл, по готовности.

source: This chapter has some ACL examples which will walk you trough the process of defining ACL definitions, and a reference of all possible important ACL settings.
ru: Этот раздел содержит ряд примеров ACL, который показывает процесс задания параметров ACL и краткое справочное руководство по наиболее важным параметрам ACL.

source: The default user 'root@localhost' is not affeced by the Ticket ACls
ru: Пользователь по умолчанию 'root@localhost' не обрабатывается в Ticket ACls

source: Definition
ru: Описание

source: The ACL definition can be split into two big parts, 'Matching' and 'Change'. In the matching sections the ACLs contains attributes that has to be met in order to use the ACL, if the attributes defined in the ACL does not match with the attributes that are sent, then the ACL does not take any affect, but any other match ACL will. The change sections contains the rules to reduce the possible options for a ticket.
ru: Текст ACL состоит из двух больших разделов, 'Matching/Условия' и 'Change/Действия'. В разделе Условия указываются атрибуты которые проверяются на соответствие заданным образцам и при несовпадении, ACL не применяется. Раздел Действий, содержит правила, ограничивающие возможные опции заявки при выполнении заданных условий.

source: Matching Sections
ru: Разделы Условий

source: This section contains matching options that can be changed on the fly, for example on a ticket creation time the data of the ticket changes dynamically as the agent sets the information, if an ACL is set to match a ticket attribute then only when the matching attribute is selected the ACL will be active and might reduce other ticket attributes, but as soon as another value is selected the ACL will not take any affect.
ru: Этот раздел содержит опции, которые могут меняться "на лету", например, при создании заявки, ее данные изменяются динамически по мере ввода информации, если ACL содержит проверку значения атрибута заявки, то только при совпадении введенного/выбранного значения с образцом в ACL, он может быть активирован и, возможно, повлиять на значения других атрибутов заявки, в противном случае, этого не произойдет.

source: This section is similar to 'Properties' but does not take changes in ticket attributes that are not saved into the DataBase, this means that changing an attribute without submit will not make any affect. This section is not use for ticket creation screens (as tickets are not yet created in the Database).
ru: Этот раздел похож на 'Properties', но не может изменять данные заявки, не сохраненные в базе данных, это означает, что изменение атрибутов без ввода заявки в базу не будут иметь места. Не используется для экранов создания заявки (т.к. заявки еще нет в БД). То есть оперирует с данными ранее созданной заявки.

source: Change Sections
ru: Раздел Действий

source: Possible section resets the data to be reduce to only the elements that are set in this section.
ru: Секция Possible сужает список доступных действий или значений до указанных в этой секции.

source: Elements in PossibleAdd section add missing elements that where reduced in other ACLs. PossibleAdd is only used in together with other ACLs that have Possible or PossibleNot sections.
ru: Элементы в секции PossibleAdd добавляет пропущенные элементы, которые были ограничены другими ACL. PossibleAdd используется только вместе с другими ACL, в которых есть секции Possible или PossibleNot .

source: This section is used to remove specific elements from the current data. It could be used stand alone or together with other ACLs with a Possible or PossibleAdd sections.
ru: Эта секция используется для удаления отдельных элементов/значений из списка доступных в текущий момент. Она может использоваться самостоятельно или вместе с другими ACL с секциями Possible или PossibleAdd.

source: In order to make the development of ACLs easier and more powerful there is a set of so called modifiers for the attributes on each section. This modifiers as explained below:
ru: Чтобы сделать разработку ACL проще и более развитой, имеется набор, так называемых модификаторов для атрибутов в каждой секции. Эти модификаторы объяснены ниже:

source: Modifiers
ru: Модификаторы

source: This modifier is used to negate a value for example: '[Not]2 low' in this case talking about ticket priorities will be the same as to have: '1 very low', '3 normal', '4 high', '5 very high'.
ru: Он используется для исключения значения, например: '[Not]2 low' в данном случае речь идет о приоритетах заявки и будет иметь тот же результат, что и перечисление: '1 very low', '3 normal', '4 high', '5 very high'.

source: It is use to define a regular expression for matching several values, for example '[RegExp]low' talking about priorities is the same as '1 very low', '2 low'.
ru: Служит для задания регулярного выражения для проверки соответствия нескольким значениям, например '[RegExp]low' для приоритетов будет аналогично списку '1 very low', '2 low'.

source: It is very similar to [RegExp] but it is case insensitive.
ru: Аналогично по действию с [RegExp] но нечувствителен к регистру символов.

source: Negated regular expressions for example '[NotRegExp]low' talking about priorities is the same as '3 normal', '4 high', '5 very high.
ru: Отрицательное регулярное выражение, например, '[NotRegExp]low' для списка приоритетов аналогично '3 normal', '4 high', '5 very high'.

source: It is very similar to [NotRegExp] but it is case insensitive.
ru: Аналогично [NotRegExp], но нечувствительно к регистру.

source: The following examples are shown in both ways graphical and text based.
ru: Следующие примеры показывают оба способа представления ACL - в графическом и текстовом виде.

source: This example shows you the basic structure of an ACL. First, it needs to have a name. In this case, it is "ACL-Name-2". Note that the ACLs will be numerically sorted before execution, so you should use the names carefully.
ru: Этот пример показывает базовую структуру ACL. Во-первых, необходимо указать имя. В данном случае это "ACL-Name-2". Помните, что ACL будут численно отсортированы перед выполнением, т.е. используйте имена аккуратно.

source: Secondly, you have a "Properties" section which is a filter for your tickets. All the criteria defined here will be applied to a ticket to determine if the ACL must be applied or not. In our example, a ticket will match if it is in the queue "Raw" and has priority "5 very high". This is also affected by changes in the form (e.g. if the ticket is the queue "raw" and had a priority "3 normal" at this moment the ACL will not match, but then priority drop-down is selected and the priority is changed now to "5 very high" then will also match).
ru: Затем, следует секция "Properties", которая отфильтровывает ваши заявки. Все критерии, заданные здесь, применяются к заявке для определения должен ли ACL применяться для нее. В нашем примере, заявка проверяется на принадлежность к очереди "Raw" и наличии приоритета "5 very high". Это также зависит от изменений в форме ввода (т.е. если заявка в очереди "raw" и имеет приоритет "3 normal" - в этот момент соответствия нет, но, затем, при выборе поля Приоритет и из выпадающего списка выбирается "5 very high", то соответствие наступает).

source: ACL to restrict a Process in the customer frontend using the CustomerID.
ru: ACL для ограничения доступа к Процессу в интерфейсе клиента по CustomerID.

source: ACL 105-Disallow-Process-For-CustomerID
ru: ACL 105-Disallow-Process-For-CustomerID - Запретить Процессы для этого CustomerID

source: Please see the <link linkend="process-management-acl">section on ACLs</link> in the <link linkend="process-management">ProcessManagement</link> documentation for a detailed description of how to use ACLs for process tickets.
ru: Смотрите <link linkend="process-management-acl">секция ACL</link> в <link linkend="process-management">ProcessManagement</link> документации для детального рассмотрения использования ACL для процессных заявок.

source: Be aware that in ticket search screens (AgentTicketSearch and CustomerTicketSearch) the only affected attributes by ACLs are the Dynamic Fields. This means that this screens you can not restrict any other attribute like ticket type, state, queue, etc.
ru: Помните, что на экранах поиска (AgentTicketSearch и CustomerTicketSearch) - единственно доступные атрибуты для ACL это динамические поля. Это означает, что для этих экранов вы не можете ограничить любые другие атрибуты, такие как Тип заявки, Состояние, Очередь и т.д.

source: From OTRS 3.4.x 'Action' parameter is not longer a hash but an array reference and it can be used in any of the Change sections using any of the Modifiers.
ru: Начиная с OTRS 3.4.x, параметр 'Action' больше является не hash, а ссылкой на массив и может быть использован в любой секции Изменения, используя различные модификаторы/Modifiers.

source: Cache
ru: Кэш

source: Please note that this will be a non-permanent storage that will be lost on server reboot. All your sessions (if you store them in the filesystem) and your cache data will be lost.
ru: Не забывайте, что это не постоянное хранилище, данные в котором будут потеряны после перезагрузки сервера. Все ваши сеансы (если вы их храните в файловой системе) и данные в кэше будут утрачены.

source: Alternatively, you can use LDAP groups to determine group memberships or roles in OTRS. For more information and examples, see Kernel/Config/Defaults.pm. Here is an example for synchronizing from LDAP into OTRS groups.
ru: Кроме того вы можете использовать группы LDAP для определения принадлежности к группам и ролям в OTRS. Для дополнительной информации и примеров смотрите файл Kernel/Config/Defaults.pm. Вот пример синхронизации LDAP с группами OTRS.

source: The OTRS Scheduler is an independent system process that executes tasks in background. These kind of processes are know as <emphasis>daemons</emphasis> in Unix / Linux systems. It is independent but that doesn't mean that the Scheduler does everything alone, it is fully integrated into OTRS and can use any OTRS module as needed to complete each task.
ru: Планировщик OTRS/Scheduler это независимый системный процесс, котрый выполняет задания в фоновом режиме. Этот тип процессов известен как <emphasis>daemons</emphasis> в Unix / Linux системах. Он независим, но это не означает, что Планировщик может существовать отдельно, он полностью интегрирован в OTRS и может использовать модули OTRS необходимые для его работы.

source: Included with OTRS there commandline interface (CLI) tools for the scheduler.
ru: В комплект поставки OTRS включен интерфейс командной строки (CLI) для планировщика.

source: OTRS can send emails via SMTP (<ulink url="http://www.ietf.org/rfc/rfc821.txt">Simple Mail Transfer Protocol / RFC 821</ulink>) or Secure SMTP.
ru: OTRS может посылать письма через SMTP (<ulink url="http://www.ietf.org/rfc/rfc821.txt">Simple Mail Transfer Protocol / RFC 821</ulink>) или Secure SMTP.

source: On a normal installation, the mail will be fetched every 10 minutes by the <filename>postmaster_mailbox</filename> cron job. For further information about modifying cron jobs, please refer to the <link linkend="installation-source-cronjobs">"Setting up the cron jobs for OTRS"</link> section.
ru: При обычной установке, почта будет получаться каждые 10 минут с помощью задания cron - <filename>postmaster_mailbox</filename>. Для более подробной информации об изменении заданий cron обратитесь к разделу документации <link linkend="installation-source-cronjobs">"Настройка планировщика задач cron jobs для OTRS"</link>.

source: The Generic Interface is the framework that makes it possible to create Web Services for OTRS in a predefined way, using already made building blocks that are independent from each other and interchangeable.
ru: Generic Interface - это инструмент, который позволяет создавать Web-сервисы для OTRS предопределенным образом, используя уже готовые блоки, которые независимы друг от друга и взаимозаменяемы.

source: System Maintenance
ru: Обслуживание системы

source: System Maintenance give the option to schedule one or more maintenance periods for the system. During this period no agents or customers can login into the system (except for Agents in the "admin" group). Current logged users and customers receive a notification about the maintenance (before and during the maintenance period). Administrators have the option to kill the sessions for logged agents and customers, all this in preparation to be able to make changes in the system (e.g. a system update) in a "safe" environment.
ru: Раздел конфигурации "Обслуживание системы" дает возможность управлять одним или более периодами технического обслуживания системы. В течение этого периода, агенты и клиенты не могут подключиться к системе (за исключением агентов, включенных в группу "admin"). Уже подключенные пользователи получат уведомление о техобслуживании (до и и в течение периода техобслуживания). Администраторы имеют возможность закрыть сеансы подключенных агентов и клиентов, все это в рамках подготовки, чтобы иметь возможность вносить изменения в систему (например, обновление системы) в "безопасном" среде.

source: System maintenance overview screen
ru: Экран обзора Управления обслуживанием

source: <emphasis>Figure: The system maintenance overview screen with some scheduled periods.</emphasis>
ru: <emphasis>Рисунок: Экран обзора Управления обслуживанием с несколькими запланированными периодами.</emphasis>

source: The Start Date and the Stop Date are required fields, and the only rule for this combination is that Start Date can not be a date before the Stop Date.
ru: Дата начала и Дата окончания - обязательные поля, и единственное правило для этой комбинации является то, что Дата начала не может быть позже Даты окончания.

source: System maintenance edit screen
ru: Экран редактирования Управления обслуживанием

source: <emphasis>Figure: The system maintenance edit screen.</emphasis>
ru: <emphasis>Рисунок: Экран редактирования Управления обслуживанием.</emphasis>

source: After a new maintenance period is defined an overview and details about the current active sessions is shown, from there administrators can kill this sessions one by one or all of them (except current) if it is needed.
ru: После ввода нового периода обслуживания, отображается обзор и подробности о текущих активных сеансах, используя который, администратор может закрыть эти сеансы (исключая активные), если это необходимо.

source: System logs are available via the web interface only on Linux / Unix systems.
ru: Системный журнал доступен через веб-интерфейс только на Linux / Unix системах.

source: This setting affects: Escalation View, Locked View, Queue View, Responsible View, Status View, Service View and Watch View screens.
ru: Этот параметр влияет на: Escalation View, Locked View, Queue View, Responsible View, Status View, Service View и Watch View обзоры.

source: Path can contain variables in the form of ':&lt;VariableName&gt;' each path string that fits on the position of the variable name will be added to the request payload using the variable name defined in this setting.
ru: Путь может содержать переменные в виде ':&lt;ИмяПеременной&gt;' каждая строка части пути заполняемая вместо переменной будет добавлена к запросу, используя имя переменной заданной в этом параметре.

source: Valid requests:
ru: Допустимые запросы:

source: Invalid requests:
ru: Недопустимые запросы:

source: In the first example ID = 1 and Color = Red, while in the second ID = 123 and Color = Blue.
ru: В первом примере ID = 1 and Цвет = Красный, тогда как во втором ID = 123 and Цвет = Синий.

source: Valid request methods for Operation '&lt;OperationName&gt;':
ru: Допустимые методы запроса для Операции '&lt;ИмяОперации&gt;':

source: Host
ru: Сервер

source: The host name or IP Address and port of the remote system, if no port is specified, port 80 is used by default.
ru: Имя хоста/сервера или IP адрес и порт удаленной системы, если порт не задан, по умолчанию используется порт 80.

source: For data: Var1 = One, Var2 = Two, Var3 = Three and Var4 = Four.
ru: Для данных: Var1 = One, Var2 = Two, Var3 = Three and Var4 = Four.

source: After Replacements:
ru: После замен:

source: Remaining Data:
ru: Оставшиеся данные:

source: Default command
ru: Команда по умолчанию

source: cURL Examples for REST Requests
ru: cURL Примеры для REST запросов

source: Given the above example on a REST configuration for Generic Ticket Connector we have that:
ru: В приведенном выше примере настройки REST для Generic Ticket Connector имеем следующее:

source: <command>For Ticket Create: </command>use POST method on /Ticket path.
ru: <command>Для Ticket Create: </command>используйте POST метод в /Ticket path.

source: <command>For Ticket Search: </command>use GET method on /Ticket path.
ru: <command>Для Ticket Search: </command>используйте GET метод в /Ticket path.

source: Create a New Ticket
ru: Создать новую заявку

source: Response:
ru: Ответ:

source: { "ArticleID":5484, "TicketNumber":"1001936", "TicketID":"1686" }
ru: { "ArticleID":5484, "Номер заявки":"1001936", "TicketID":"1686" }

source: Get Ticket Details
ru: Получить подробности заявки

source: Update Ticket
ru: Обновить заявку

source: Search for Tickets
ru: Поиск заявок

source: This chapter describes the installation and basic configuration of the central OTRS framework. It covers information on installing OTRS from source, or with a binary package such as an RPM.
ru: В этой главе описывается установка и базовая конфигурация главного OTRS-фреймворка. Здесь вы найдете информацию об установке OTRS из исходных кодов или из бинарных пакетов, например RPM.

source: Tickets in My Services
ru: Заявки в Моих сервисах

source: The tickets that are assigned to services where the agent define as "My Services" and are on queues with at least read-only permissions.
ru: Заявки, которым назначены сервисы, указанные агентом в "Моих Сервисах" и находятся в очередях, где агент имеет хотя бы права - только чтение - ro.

source: Select the services you want to monitor in "My Services".
ru: Выберите сервисы, которые вы желаете контролировать в "Моих Сервисах".

source: Set the refresh period for the overviews (Dashboard, LockedView, QueueView).
ru: Установите период обновления информации в обзорах (Дайджест, Просмотр блокированных, Просмотр очередей).

source: Upgrading OTRS from 3.3 to 4
ru: Обновление с 3.3 до 4

source: These instructions are for people upgrading OTRS from <emphasis>3.3</emphasis> to <emphasis>4</emphasis> or from a <emphasis>4</emphasis> to a later patchlevel release <emphasis>4</emphasis> and applies both for RPM and source code (tarball) upgrades.
ru: Эти инструкции предназначены для тех, кто переходит с OTRS <emphasis>3.3</emphasis> к <emphasis>4</emphasis> или с <emphasis>4</emphasis> к более поздним patchlevel релизам <emphasis>4</emphasis> и применимы к обоим способам обновления из RPM и из исходных кодов (tarball).

source: If you are running a lower version of OTRS you have to follow the upgrade path to 3.3 first (1.1->1.2->1.3->2.0->2.1->2.2->2.3->2.4->3.0->3.1->3.2->3.3)! You need to perform a full upgrade to every version in between, including database changes and the upgrading perl script.
ru: Если вы работаете на ранних версиях OTRS, то должны следовать такому порядку обновления - сначала до 3.3 (1.1->1.2->1.3->2.0->2.1->2.2->2.3->2.4->3.0->3.1->3.2->3.3)! Вы должны выполнить полное обновление до каждой версии в промежутке, включая изменения структуры БД и perl-скриптов обновления.

source: Please note that if you upgrade from OTRS 2.2 or earlier, you have to take <ulink url="http://bugs.otrs.org/show_bug.cgi?id=6798">an extra step</ulink>.
ru: Помните, что если вы делаете обновление с OTRS 2.2 или более ранней, вы должны выполнить <ulink url="http://bugs.otrs.org/show_bug.cgi?id=6798">дополнительный шаг</ulink>.

source: Within a single minor version you can skip patch level releases if you want to upgrade. For instance you can upgrade directly from OTRS 4 patchlevel 2 to version 4 patchlevel 6. If you need to do such a "patch level upgrade", you should skip steps 6, 11, 13 and 14.
ru: Внутри одной версии, вы можете пропустить промежуточные релизы/patch level при обновлении. К примеру, вы можете провести обновление прямо с OTRS 4 patchlevel 2 до версии 4 patchlevel 6. Если вы желаете выполнить такое "patch level" обновление, Вы должны пропустить шаги 6, 11, 13 и 14.

source: It is highly recommended to perform a test update on a separate testing machine first.
ru: Настоятельно рекомендуем выполнить сначала тестовое обновление в отдельной тестовой среде.

source: Step 1: Stop all relevant services
ru: Шаг 1: Остановите все соответствующие службы

source: Please make sure there are no more running services or cronjobs that try to access OTRS. This will depend on your service configuration, here is an example: <placeholder type="screen" id="0"/> Stop OTRS cronjobs and the scheduler (in this order): <placeholder type="screen" id="1"/>
ru: Убедитесь, что никакие сервисы или задания cron, которые обращаются к OTRS не выполняются. Это зависит от конфигурации вашей системы, далее приведен пример: <placeholder type="screen" id="0"/> Остановить OTRS cronjobs и Планировщик (в следующем порядке): <placeholder type="screen" id="1"/>

source: Step 2: Backup everything below <filename>/opt/otrs/</filename>
ru: Шаг 2: Выполните резервное копирование содержимого папок ниже <filename>/opt/otrs/</filename>

source: as well as the database
ru: а также базы данных

source: Step 3: Make sure that you have backed up everything ;-)
ru: Шаг 3: Убедитесь, что вы создали резервную копию всех данных ;-)

source: Step 4: Install the new release (tar or RPM)
ru: Шаг 4: Установите новую версию/релиз (из tar-архива или с помощью RPM-пакетов).

source: Step 4.1: With the tarball:
ru: Шаг 4.1: С помощью tarball:

source: In order to let OTRS continue with the correct ticket number, restore the <filename>TicketCounter.log</filename> to <filename>/opt/otrs/var/log/</filename>. This is especially important if you use incremental ticketnumbers.
ru: Чтобы после обновления OTRS продолжил нумеровать заявки правильно, восстановите <filename>TicketCounter.log</filename> в <filename>/opt/otrs/var/log/</filename>. Это особенно важно, если вы используете последовательную нумерацию заявок.

source: If you configured OTRS to store article data in the filesystem you have to restore the <filename>article</filename> folder to <filename>/opt/otrs/var/</filename>.
ru: Если вы настроили хранение данных сообщений/заметок в OTRS в файловой системе нужно восстановить <filename>article</filename> папку в <filename>/opt/otrs/var/</filename>.

source: Set file permissions
ru: Установка прав доступа к файлам.

source: Please execute <placeholder type="screen" id="0"/> with the permissions needed for your system setup. For example:
ru: Выполните <placeholder type="screen" id="0"/> с необходимыми для вашей системы правами. Например:
