Repository: DSigmund/doc-admin
Catalog: i18n/doc-admin.*.po
Languages: ja, ru, sw

source: To install one of the modules from above via CPAN, you have to execute the command <command>perl -e shell -MCPAN</command>. The Perl shell will be started in interactive mode and the CPAN module will be loaded. If CPAN is already configured, you can install the modules with the command <command>install</command> followed by the name of the module. CPAN takes care of the dependencies of a module to other Perl modules and will let you know if other modules are needed.
ja: 上記のCPAN経由でモジュールのうちの1つをインストールするために、コマンド<command>perl -e shell -MCPAN</command>を実行しなければなりません。Perlシェルは会話型の中で開始され、CPANモジュールがロードされます。CPANが既に構成されている場合、モジュールの名前に続いて、コマンド<command>install</command>でモジュールをインストールすることができます。CPANは、他のPerl・モジュールにモジュールの依存性に気を配り、他のモジュールが必要かどうかを知らせます。

source: Execute also the commands <command>perl -cw bin/cgi-bin/index.pl</command> <command>perl -cw bin/cgi-bin/customer.pl</command> and <command>perl -cw bin/otrs.PostMaster.pl</command> after changing into the directory <filename>/opt/otrs</filename>. If the output of both commands is "syntax OK", your Perl is properly set up (see Script below).
ja: コマンド<command>perl -cw bin/cgi-bin/index.pl</command> <command>perl -cw bin/cgi-bin/customer.pl</command> を実行し、ディレクトリ<filename>/opt/otrs</filename>に変更した後で、<command>perl -cw bin/otrs.PostMaster.pl</command>を実行します。 両方のコマンドの出力が"シンタックス OK"である場合、Perlは適切にセット・アップされます(下記のスクリプトを参照)。

source: <emphasis>Script: Syntax check.</emphasis>
ja: <emphasis>スクリプト：シンタックス・チェック</emphasis>

source: Configuring the Apache web server
ja: Apacheウェブサーバの構成

source: First of all, you should install the Apache2 web server and mod_perl; you'd typically do this from your systems package manager. Below you'll find the commands needed to set up Apache on the most popular Linux distributions.
ja: 第一に、Apache2ウェブサーバおよびmod_perlをインストールするべきです;典型的にはシステム・パッケージ・マネージャーからこれをします。以下の、最も人気のあるLinuxディストリビューション上でApacheを設定するために必要なコマンドをご覧ください。
ru: Сначала, вы должны установить веб-сервер Apache2 и mod_perl; это обычно делается с помощью системного менеджера пакетов. Ниже вы найдете команды, необходимые для установки Apache на наиболее распостраненные дистрибутивы Linux.
sw: Kwanza kabisa, unatakiwa kusanidi seva ya wavuti ya Apache2 na mod_perl; utafanya hivi kutoka kwenye meneja kifurushi. Hapa chini utakuta amri zinazohitajika kuseti Apache kwenye usambazaji wa Linux maarufu.

source: To access the web interface of OTRS via a short URL, Alias and ScriptAlias entries are needed. Most <application>Apache</application> installations have a <filename>conf.d</filename> directory included. On Linux systems you can usually find this directory under <filename>/etc/apache</filename> or <filename>/etc/apache2</filename>. Log in as root, change to the <filename>conf.d</filename> directory and copy the appropriate template in <filename>/opt/otrs/scripts/apache2-httpd.include.conf</filename> to a file called <filename>otrs.conf</filename> in the Apache configuration directory.
ja: 短いURL、エイリアスおよびScriptAliasエントリー経由でOTRSのウェブ・インターフェースにアクセスすることは必要です。ほとんどの<application>Apache</application>インストレーションは<filename>conf.d</filename>ディレクトリを含みます。Linuxシステムにおいては、通常<filename>/etc/apache</filename>あるいは<filename>/etc/apache2</filename>の下にこのディレクトリーを見つけることができます。rootとしてログインして、<filename>conf.d</filename>ディレクトリーを変更して、アパッチ構成ディレクトリー中の<filename>otrs.conf</filename>と呼ばれるファイルに<filename>/opt/otrs/scripts/apache2-httpd.include.conf</filename>の中の適切なテンプレートをコピーしてください。
sw: Kufikia kiolesura cha wavuti cha OTRS kupitia URL fupi, maingizo ya Lakabu na HatiLakabu yanahitajika. Usakinishaji mwingi wa <application>Apache</application> una mpangilio orodha <filename>conf.d</filename> umejumuishwa. Kwenye mifumo ya Linux unaweza kukuta huu mpangilio orodha chini ya <filename>/etc/apache</filename> or <filename>/etc/apache2</filename>. Ingia kama mzizi, badilisha kwenda mpangilio orodha <filename>conf.d</filename> na nakili kiolezo husika katika <filename>/opt/otrs/scripts/apache2-httpd.include.conf</filename> kwenda kwenye faili liitwalo <filename>otrs.conf</filename> katika mpangilio orodha wa usanidi wa Apache.

source: Restart your web server to load the new configuration settings. On most systems you can start/restart your web server with the command <command>/etc/init.d/apache2 restart</command> (see Script below).
ja: 新しい構成設定をロードするためにウェブサーバを再起動してください。ほとんどのシステムにおいては、コマンド<command>/etc/init.d/apache2 restart</command> でウェブサーバを開始/再起動することができます(下記のスクリプトを参照)。

source: <emphasis>Script: Restarting the web server.</emphasis>
ja: <emphasis>スクリプト：ウェブサーバの再起動</emphasis>

source: Now your web server should be configured for OTRS.
ja: ここで、ウェブサーバはOTRS用に構成されるべきです。
ru: Теперь веб-сервер полностью настроен для работы OTRS.
sw: Sasa seva yako ya wavuti inabidi iwe na usanidi wa OTRS.

source: Configuring the database
ja: データベースの構成

source: Installing the OTRS database manually
ja: OTRSデータベースのマニュアル・インストール

source: The recommended way to configure the database is to run the <link linkend="web-installer">Web Installer</link>. If you can't use this for some reason, you can also configure the database manually, as described in this chapter. If you can't use the web installer to setup the OTRS database, you have to set it up manually. Scripts with the SQL statements to create and configure the database are located in <filename>scripts/database</filename>, in the home directory of the 'otrs' user (see Script below).
ja: データベースを構成する推奨方法は、<link linkend="web-installer">Web Installer</link>を走らせることです。何らかの理由でこれを使用することができなければ、本章に述べられているように、データベースを手動で構成することもできます。OTRSデータベースをセットアップするためのウェブ・インストーラーを使用することができない場合、それを手動でセット・アップしなければなりません。データベースを作成し構成するSQLステートメントを備えたスクリプトは「otrs」ユーザのホームディレクトリーに、<filename>scripts/database</filename>に位置します(下記のスクリプトを参照)。

source: <emphasis>Script: Files needed to create and configure the database.</emphasis>
ja: <emphasis>スクリプト：データベースを作成し構成するために必要なファイル</emphasis>

source: To setup the database for the different database back-ends, the .sql files must be processed in a specific order.
ja: 異なるデータベースバックエンド用にデータベースをセットアップするために、.sqlファイルは特殊な順番で処理されなければなりません。

source: Create the OTRS database manually step by step
ja: OTRSデータベースを手動でステップバイステプで作成します

source: Creating the DB: Create the database that you want to use for OTRS, with your database client or your database interface.
ja: DBの作成:データベース・クライアントあるいはデータベース・インターフェースで、OTRSのために使用したいデータベースを作成してください。

source: Creating the tables: With the otrs-schema.DatabaseType.sql files (e.g. <filename>otrs-schema.oracle.sql</filename>, <filename>otrs-schema.postgresql.sql</filename>) you can create the tables in your OTRS database.
ja: テーブルの作成: otrs-schema.DatabaseType.sqlファイル(例えば<filename>otrs-schema.oracle.sql</filename>, <filename>otrs-schema.postgresql.sql</filename>)で、OTRSデータベースにテーブルを作成することができます。

source: Inserting the initial system data: OTRS needs some initial system data to work properly (e.g. the different ticket states, ticket and notification types). Depending on the type of database that you are using, you will need to use one of the following files: <filename>otrs-initial_insert.mysql.sql</filename>, <filename>otrs-initial_insert.oracle.sql</filename>, <filename>otrs-initial_insert.postgresql.sql</filename> or <filename>otrs-initial_insert.mssql.sql </filename>.
ja: 初回のシステムデータの挿入: OTRSは、適切に稼働するためにある初回のシステムデータ（例えば異なるチケット状態、チケットとその通知タイプ)を必要とします。使用しているデータベースのタイプによって、次のファイルのうちの1つを使用する必要があります:<filename>otrs-initial_insert.mysql.sql</filename>, <filename>otrs-initial_insert.oracle.sql</filename>, <filename>otrs-initial_insert.postgresql.sql</filename> あるいは <filename>otrs-initial_insert.mssql.sql </filename>。

source: Creating references between tables: The last step is to create the references between the different tables in the OTRS database. Use the otrs-schema-post.DatabaseType.sql file to create these (e.g. <filename>otrs-schema-oracle.post.sql</filename>, <filename>otrs-schema-post.postgresql.sql</filename>).
ja: テーブル間の参照の作成: 最後のステップは、OTRSデータベースに異なるテーブル間の参照を作成することです。これらを作成するためにotrs-schema-post.DatabaseType.sql ファイルを使用します。(例えば. <filename>otrs-schema-oracle.post.sql</filename>, <filename>otrs-schema-post.postgresql.sql</filename>)。

source: After you have finished the database setup, you should check and set proper access rights for the OTRS database. It should be enough to grant access to one user. Depending on the database server you are using, setting up the access rights differs, but it should be possible either with your database client or your graphical database front-end.
ja: データベース・セットアップを終了後、OTRSデータベース用の適切なアクセス権をチェックし設定するべきです。1人のユーザにアクセスを許可することで十分です。使用しているデータベース・サーバによって、アクセス権の設定は異なります。しかし、それは、データベース・クライアントあるいはグラフィカルなデータベースのフロントエンドのいずれかで可能であるべきです。

source: If your database and the access rights are configured properly, you have to tell OTRS which database back-end you want to use and how the ticket system can connect to the database. Open the file <filename>Kernel/Config.pm</filename> located in the home directory of the 'otrs' user, and change the parameters shown in the script below according to your needs.
ja: データベースとアクセス権が適切に構成される場合、どのデータベース・バックエンドを使用したいか、また、チケット・システムがどのようにデータベースに接続することができるかOTRSに伝えなければなりません。「otrs」ユーザのホームディレクトリにあるファイル<filename>Kernel/Config.pm</filename>を開き、必要に応じてスクリプトの中で下に示されるパラメーターを変更してください。

source: # DatabaseHost # (The database host.) $Self->{'DatabaseHost'} = 'localhost'; # Database # (The database name.) $Self->{Database} = 'otrs'; # DatabaseUser # (The database user.) $Self->{DatabaseUser} = 'otrs'; # DatabasePw # (The password of database user.) $Self->{DatabasePw} = 'some-pass';
ja: # DatabaseHost # (データベースホスト.) $Self->{'DatabaseHost'} = 'localhost'; # Database # (データベース名.) $Self->{Database} = 'otrs'; # DatabaseUser # (データベースユーザ.) $Self->{DatabaseUser} = 'otrs'; # DatabasePw # (データベースユーザのパスワード.) $Self->{DatabasePw} = 'some-pass';

source: <emphasis>Script: Parameters to be customized.</emphasis>
ja: <emphasis>スクリプト：カスタマイズ用パラメタ</emphasis>

source: Setting up the cron jobs for OTRS
ja: OTRS用cronジョブのセットアップ

source: OTRS needs some cron jobs to work properly. The cron jobs should be run with the same user rights that were specified for the OTRS modules. That means that the cron jobs must be inserted into the crontab file of the 'otrs' user.
ja: OTRSは、適切に稼働するいくつかのcronジョブを必要とします。cronジョブは、OTRSモジュール用に指定されたのと同じユーザー権利で実行されるべきです。それは、cronジョブが「otrs」ユーザのcrontabファイルに挿入されなければならないことを意味します。

source: All scripts with the cron jobs are located in <filename>var/cron</filename>, in the home directory of the 'otrs' user (see Script below).
ja: cronジョブを備えたスクリプトはすべて「otrs」ユーザのホームディレクトリーに、<filename>var/cron</filename>にあります(下記のスクリプトを参照)。

source: <emphasis>Script: Files needed to create the cron jobs.</emphasis>
ja: <emphasis>スクリプト：cronジョブを作成する必要のあるファイル</emphasis>

source: These scripts have a suffix of '.dist'. You should copy them to files with the suffix removed. If you use bash, you might want to use the command listed in Script below.
ja: これらのスクリプトには「．dist」の接尾辞があります。接尾辞を削除して、ファイルにそれらをコピーするべきです。bashを使用すれば、以下のスクリプトにリストされたコマンドを使用したいと思うかもしれません。

source: <emphasis>Script: Copying and renaming all the files needed to create the cron jobs.</emphasis>
ja: <emphasis>スクリプト：cronジョブを作成する必要のある全てのファイルをコピーして改名する</emphasis>

source: Table 3-2 describes the different cron jobs.
ja: テーブル 3-2 は異なるcronジョブを記述しています。

source: Description of several cron job scripts.
ja: いくつかのcronジョブ・スクリプトの記述

source: Sets the basics for the crontab of the 'otrs' user.
ja: 「otrs」ユーザのcrontab用基本を設定します。

source: Removes expired cache entries from disk. Clears the loader cache for CSS and JavaScript files.
ja: ディスクから失効したキャッシュを削除します。CCS及びJavaScript用ローダー・キャッシュをクリアします

source: Used only if new mails will be fetched with fetchmail into the ticket system.
ja: 新しいメールがチケット・システムの中へのfetchmailで取って来られる場合のみ使用されます。

source: Executes the jobs of the GenericAgent that are not stored in the database but in own config files.
ja: データベースに格納されず、自身のconfigファイルにあるGenericAgentのジョブを実行します。

source: Executes the jobs of the GenericAgent that are stored in the database.
ja: データベースに格納されるGenericAgentのジョブを実行します。

source: Checks system for pending tickets, and closes them or sends reminders if needed.
ja: 保留チケット用システムをチェックし、それらを完了します。あるいは必要ならばリマインダを送信します。

source: Checks the message queue of the ticket system, and delivers messages that are still in the queues.
ja: チケット・システムのメッセージ・キューをチェックし、キューにまだあるメッセージを配布します。

source: Fetches the mails from the POP3 accounts that were specified in the admin area, in the section for "PostMaster Mail Accounts".
ja: 「PostMasterメールアカウント」用セクションの管理者エリアで指定されたPOP3アカウントからメールを取ってきます。

source: Rebuilds the ticket index, which improves the speed of the QueueView.
ja: キュー・ビューの速度を改善するチケット・インデックスを再構築します。

source: Removes old and no longer needed session IDs.
ja: 古くもう必要のないセクションIDを削除します。

source: Unlocks tickets in the system.
ja: システムのチケットをアンロック

source: To setup all cron jobs, the script <filename>bin/Cron.sh</filename> located in the home directory of the 'otrs' user can be used. When this script is executed, it needs a parameter to specify whether you want to install, remove, or reinstall the cron jobs. The following parameters can be used:
ja: セットアップに、すべてのcronジョブ、「otrs」ユーザのホームディレクトリーにあるスクリプト<filename>bin/Cron.sh</filename>は使用することができます。このスクリプトを実行する場合、cronジョブをインストールするか、削除するか、再インストールするかどうかを明示するためにパラメーターを必要とします。次のパラメーターを使用することができます:

source: Because the cron jobs need to be installed in the crontab file of the 'otrs' user, you need to be logged in as 'otrs'. If you are logged in as root, you can switch to 'otrs' with the command <command>su otrs</command>. Execute the commands specified in Script below to install the cron jobs.
ja: cronジョブは「otrs」ユーザのcrontabファイルにインストールする必要があるので、「otrs」としてログインする必要があります。rootとしてログインする場合は、<command>su otrs</command>で「otrs」に変わることができます。cronジョブをインストールするために下記スクリプト中で指定されたコマンドを実行してください。

source: Please note that other crontab entries of the 'otrs' user will be overwritten or removed by the <filename>Cron.sh</filename> script. Please change the <filename>Cron.sh</filename> script to retain other crontab entries as needed.
ja: 「otrs」ユーザの他のcrontabエントリーが<filename>Cron.sh</filename>スクリプトによって上書きされるか削除されるだろうことに注意してください。必要な他のcrontabエントリーを保持するために<filename>Cron.sh</filename>スクリプトを変更してください。

source: <emphasis>Script: Installing the cron jobs.</emphasis>
ja: <emphasis>スクリプト：cronジョブのインストール</emphasis>

source: The command <command>crontab -l -u otrs</command>, which can be executed as root, shows you the crontab file of the 'otrs' user, and you can check if all entries are placed correctly (see Script below).
ja: rootとして実行可能なコマンド<command>crontab -l -u otrs</command>は、「otrs」ユーザのcrontabファイルを示します。また、全てのエントリーが正確に置かれるかどうかをチェックすることができます(下記のスクリプトを参照)。

source: <emphasis>Script: Crontab file.</emphasis>
ja: <emphasis>スクリプト：Cronタブ・ファイル</emphasis>

source: OTRS Scheduler Service
ja: OTRSスケジューラ・サービス

source: OTRS comes with a scheduler service that is used to perform asynchronous tasks.
ja: OTRSには、非同期タスクを行なうために利用されるスケジューラ・サービスが付属しています。

source: The OTRS RPMs will set up the Scheduler Service automatically. If you install from source, you can install the service by copying the <filename>scripts/otrs-scheduler-linux</filename> file to <filename>/etc/init.d</filename> and giving it the appropriate permissions. This will make sure the scheduler service starts when the system starts up.
ja: OTRS RPMはスケジューラ・サービスを自動的にセット・アップします。ソースからインストールすれば、<filename>/etc/init.d</filename>に<filename>scripts/otrs-scheduler-linux</filename>ファイルをコピーしそれに適切なアクセス許可を与えることにより、サービスをインストールすることができます。これで、システム開始時には必ずスケジューラ・サービスが開始するようになります。

source: Using the web installer
ja: ウェブ・インストーラの使用
ru: Использование веб установщика
sw: Kutumia kisakinishi cha wavuti

source: You can use the OTRS Web Installer, after you installed the OTRS software, to set up and configure the OTRS database. The Web Installer is a web page you can visit in your browser. The URL for the web installer is <ulink url="http://localhost/otrs/installer.pl"> <citetitle>http://localhost/otrs/installer.pl</citetitle> </ulink> .
ja: OTRSデータベースをセット・アップおよび構成するためにOTRSソフトウェアをインストールした後、OTRSウェブ・インストーラを使用することができます。ウェブ・インストーラはブラウザから訪れることができるウェブ・ページです。ウェブ・インストーラ用のURLは<ulink url="http://localhost/otrs/installer.pl"> <citetitle>http://localhost/otrs/installer.pl</citetitle> </ulink>です。
ru: Вы можете использовать веб-установщик OTRS, после установки OTRS для установки и настройки базы данных OTRS. Веб-установщик это страница браузера, которую можно открыть по ссылке <ulink url="http://localhost/otrs/installer.pl"> <citetitle>http://localhost/otrs/installer.pl</citetitle> </ulink>.
sw: Unaweza kutumia Kisakinishi cha Wavuti cha OTRS, baada ya kusakinisha programu ya OTRS, kuseti na kusanidi hifadhidata ya OTRS. Kisakinishi cha Wavuti ni ukurasa wa tovuti ambayo unaweza kuitembelea kwenye kivinjari chako. URL ya hicho kisakinishi cha wavuti ni <ulink url="http://localhost/otrs/installer.pl"> <citetitle>http://localhost/otrs/installer.pl</citetitle> </ulink> .

source: When the web installer starts, please follow the following steps to setup your system:
ja: ウェブ・インストーラが開始したらシステムをセットアップする次のステップにしたがって下さい。
ru: Когда запустится веб-инсталлятор, выполните, пожалуйста, следующие шаги для установки системы:
sw: Pale kisakinishi cha wavuti kinapoanza, tafadhali fuata hatua zifuatazo kuseti mfumo wako:

source: 1. Check out the information about the OTRS offices and click on next to continue (see figure below).
ja: 1. OTRSオフィスに関する情報をチェックして、次に進むをクリックします（下図参照）。
ru: 1. Проверьте информацию об OTRS-офисах и нажмите кнопку Далее (см. Рис ниже).
sw: 1. Angalia taarifa kuhusu ofisi za OTRS na bofya kwenye inayofuata kuendelea (ona kielelezo chini).

source: installer.pl screen - Welcome screen
ja: installer.pl 画面 - ウェルカム画面
ru: installer.pl - экран приветствия
sw: skrini ya installer.pl - Skrini ya ukaribisho

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="installer.pl - screenshot" scale="40" fileref="screenshots/installer1.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="installer.pl - スクリーンショット" scale="40" fileref="screenshots/installer1.png"></graphic>

source: <emphasis>Figure: Welcome screen.</emphasis>
ja: <emphasis>図：ウェルカム画面</emphasis>
ru: <emphasis>Рисунок: Экран приветствия.</emphasis>
sw: <emphasis>Kielelezo: Skrini ya kukukaribisha.</emphasis>

source: 2. Read the GNU Affero General Public License (see Figure below) and accept it, by clicking the corresponding button at the bottom of the page.
ja: 2 GNU Affero General Public Licenseを読み（下図参照）、ページ下部にある対応するボタンをクリックしてそれを受諾します。
ru: 2. Прочитайте соглашения лицензии GNU Affero General Public License (см. Рисунок ниже) и примите их, нажав на соответствующую кнопку внизу страницы.
sw: 2. Soma GNU Affero General Public License (ona Kielelezo chini) na ikubali, kwa kubofya kitufe husika upande wa chini wa kurasa.

source: installer.pl screen - License
ja: installer.pl 画面 - ライセンス
ru: installer.pl страница - Лицензионное соглашение
sw: skrini ya installer.pl - Leseni

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="installer.pl - screenshot" scale="40" fileref="screenshots/installer2.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="installer.pl - スクリーンショット" scale="40" fileref="screenshots/installer2.png"></graphic>

source: <emphasis>Figure: GNU Affero General Public License.</emphasis>
ja: <emphasis>図: GNU Affero General Public ライセンス</emphasis>
ru: <emphasis>Рисунок: GNU Affero General Public License.</emphasis>
sw: <emphasis>Kielelezo: GNU Affero General Public License.</emphasis>

source: 3. Choose the database that you want to use with OTRS. If you choose MySQL, PostgreSQL or Microsoft SQL Server as a database, you can also select here if you want the web installer to create a database for you or if your database administrator has already created an empty database for you that you would like to use. After that, click the Next button (see figure below).
ja: 3 OTRSで使用したいデータベースを選択します。データベースとして、MySQL、PostgreSQL あるいは Microsoft SQL Serverを選択する場合、また、データベースを作成するためにウェブ・インストーラーが必要ならば、あるいはデータベース管理者が、使用したい空のデータベースを既に作成していれば、ここで選択することもできます。その後、次ボタンをクリックしてください(下記の図を参照)。
ru: 3. Выберите СУБД, которую вы будете использовать с OTRS. Если вы выбрали MySQL, PostgreSQL или Microsoft SQL Server в качестве СУБД, вы также можете выбрать, будете ли вы использовать веб-установщик для создания базы данных или ваш администратор БД уже создал пустую базу данных. После этого нажмите кнопку "Далее" (см. рисунок ниже).
sw: 3. Chagua hifadhidata utakayotaka kutumia na OTRS. Kama ukichagua MySQL, PostgreSQL au Microsoft SQL kama Seva za hifadhidata, unaweza kuchagua kama utataka kisakinishi cha wavuti kikutengenezee hifadhidata yako au msimamizi wa hifadhidata wako ameshatengeneza hifadhidata tupu kwa ajili ya wewe kutumia. Baada ya hapo, bonyeza kitufe kuwndelea (ona kielelezo chini).

source: installer.pl screen - Select database type
ja: installer.pl 画面 - データベースタイプの選択
ru: installer.pl страница - Выбор типа базы данных
sw: skrini ya installer.pl - Chagua aina ya hifadhidata

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="installer.pl - screenshot" scale="40" fileref="screenshots/installer3.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="installer.pl - スクリーンショット" scale="40" fileref="screenshots/installer3.png"></graphic>

source: <emphasis>Figure: Database Selection.</emphasis>
ja: <emphasis>図：データベース選択</emphasis>
ru: <emphasis>Рисунок: Выбор Базы данных.</emphasis>
sw: <emphasis>Kielelezo: Uchaguzi wa Hifadhidata.</emphasis>

source: 4. Depending of the database you chose and if you wanted the web installer to create a database or use an existing one in the previous step, this screen might differ a little. Enter the credentials for the database in this screen.
ja: 4. 選んだデータベースによって、および、データベースを作成するためにウェブ・インストーラを必要とするか、または、前ステップの既存のものを使用するか、によって、この画面は少し異なるかもしれません。この画面でデータベース用に認証情報を入力してください。
ru: 4. В зависимости от того, какую СУБД вы выбрали и желаете использовать веб-установщик для создания БД или использовать существующую БД, на предыдущем шаге, этот экран может иметь различный вид. Введите ваши данные/полномочия для доступа к БД на этом экране.
sw: 4. Hii skrini inaweza kuwa tofauti kidogo kutegemeana na hifadhidata uliyochagua na kama ulitaka kisakinishi cha mtandao kutengeneza hifadhidata au kutumia iliyopo katika hatua iliyopita. Ingiza hati tambulishi za hifadhidata kwenye hii skrini.

source: installer.pl screen - Database details screen
ja: installer.pl 画面 - データベース詳細画面
ru: installer.pl страница - Подробные настройки базы данных
sw: skrini ya installer.pl - Skrini ya undani wa hifadhidata

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="installer.pl - screenshot" scale="40" fileref="screenshots/installer4.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="installer.pl - スクリーンショット" scale="40" fileref="screenshots/installer4.png"></graphic>

source: <emphasis>Figure: Database credentials.</emphasis>
ja: <emphasis>図：データベース認証情報</emphasis>
ru: <emphasis>Рисунок: Учетные записи базы данных.</emphasis>
sw: <emphasis>Kielelezo: Hati tambulishi za hifadhidata.</emphasis>

source: 5. Create a new database user, choose a name for the database and click on 'Next' (see Figure below).
ja: 5. 新規データベースユーザを作成し、データベース名を選択し、「次」をクリックして下さい（下図参照）。
ru: 5. Создайте нового пользователя базы данных, выберите имя базы данных и нажмите кнопку 'Далее' (см. Рисунок ниже).
sw: 5. Tengeneza mtumiaji mpya wa hifadhidata, chagua jina la hifadhidata na bofya kitufe cha kuendelea (ona Kielelezo chihi).
