Repository: DSigmund/doc-admin
Catalog: i18n/doc-admin.*.po
Languages: ja, ru, sw

source: # CustomerUser # (customer database backend and settings) $Self->{CustomerUser} = { Name => 'Database Backend', Module => 'Kernel::System::CustomerUser::DB', Params => { # if you want to use an external database, add the # required settings # DSN => 'DBI:odbc:yourdsn', # Type => 'mssql', # only for ODBC connections # DSN => 'DBI:mysql:database=customerdb;host=customerdbhost', # User => '', # Password => '', Table => 'customer_user', }, # customer unique id CustomerKey => 'login', # customer # CustomerID => 'customer_id', CustomerValid => 'valid_id', CustomerUserListFields => ['first_name', 'last_name', 'email'], # CustomerUserListFields => ['login', 'first_name', 'last_name', 'customer_id', 'email'], CustomerUserSearchFields => ['login', 'last_name', 'customer_id'], CustomerUserSearchPrefix => '', CustomerUserSearchSuffix => '*', CustomerUserSearchListLimit => 250, CustomerUserPostMasterSearchFields => ['email'], CustomerUserNameFields => ['title', 'first_name', 'last_name'], CustomerUserEmailUniqCheck => 1, # # show not own tickets in customer panel, CompanyTickets # CustomerUserExcludePrimaryCustomerID => 0, # # generate auto logins # AutoLoginCreation => 0, # AutoLoginCreationPrefix => 'auto', # # admin can change customer preferences # AdminSetPreferences => 1, # # cache time to live in sec. - cache database queries # CacheTTL => 0, # # just a read only source # ReadOnly => 1, Map => [ # note: Login, Email and CustomerID needed! # var, frontend, storage, shown (1=always,2=lite), required, storage-type, http-link, readonly, http-link-target [ 'UserTitle', 'Title', 'title', 1, 0, 'var', '', 0 ], [ 'UserFirstname', 'Firstname', 'first_name', 1, 1, 'var', '', 0 ], [ 'UserLastname', 'Lastname', 'last_name', 1, 1, 'var', '', 0 ], [ 'UserLogin', 'Username', 'login', 1, 1, 'var', '', 0 ], [ 'UserPassword', 'Password', 'pw', 0, 0, 'var', '', 0 ], [ 'UserEmail', 'Email', 'email', 1, 1, 'var', '', 0 ], [ 'UserCustomerID', 'CustomerID', 'customer_id', 0, 1, 'var', '', 0 ], [ 'UserPhone', 'Phone', 'phone', 1, 0, 'var', '', 0 ], [ 'UserFax', 'Fax', 'fax', 1, 0, 'var', '', 0 ], [ 'UserMobile', 'Mobile', 'mobile', 1, 0, 'var', '', 0 ], [ 'UserRoom', 'Room', 'room', 1, 0, 'var', '', 0 ], [ 'UserStreet', 'Street', 'street', 1, 0, 'var', '', 0 ], [ 'UserZip', 'Zip', 'zip', 1, 0, 'var', '', 0 ], [ 'UserCity', 'City', 'city', 1, 0, 'var', '', 0 ], [ 'UserCountry', 'Country', 'country', 1, 0, 'var', '', 0 ], [ 'UserComment', 'Comment', 'comments', 1, 0, 'var', '', 0 ], [ 'ValidID', 'Valid', 'valid_id', 0, 1, 'int', '', 0 ], ], # default selections Selections => { UserTitle => { 'Mr.' => 'Mr.', 'Mrs.' => 'Mrs.', }, }, };
ja: # CustomerUser # （顧客データベース・バックエンドと設定） $Self->{CustomerUser} = { Name => 'Database Backend', Module => 'Kernel::System::CustomerUser::DB', Params => { # 外部データベースを使いたければ、 # 必須設定を追加する必要があります。 # DSN => 'DBI:odbc:yourdsn', # Type => 'mssql', # only for ODBC connections # DSN => 'DBI:mysql:database=customerdb;host=customerdbhost', # User => '', # Password => '', Table => 'customer_user', }, # customer unique id CustomerKey => 'login', # customer # CustomerID => 'customer_id', CustomerValid => 'valid_id', CustomerUserListFields => ['first_name', 'last_name', 'email'], # CustomerUserListFields => ['login', 'first_name', 'last_name', 'customer_id', 'email'], CustomerUserSearchFields => ['login', 'last_name', 'customer_id'], CustomerUserSearchPrefix => '', CustomerUserSearchSuffix => '*', CustomerUserSearchListLimit => 250, CustomerUserPostMasterSearchFields => ['email'], CustomerUserNameFields => ['title', 'first_name', 'last_name'], CustomerUserEmailUniqCheck => 1, # # 顧客パネルで自身のチケットではなく顧客チケットを表示します。 # CustomerUserExcludePrimaryCustomerID => 0, # # 自動ログインを生成します。 # AutoLoginCreation => 0, # AutoLoginCreationPrefix => 'auto', # # 管理者は顧客の選択（選好）を変更できます。 # AdminSetPreferences => 1, # # キャッシュが生存する秒数 - キャッシュ・データベース必須 # CacheTTL => 0, # # 読み込み専用のソース # ReadOnly => 1, Map => [ # ノート：ログイン、Eメール、顧客IDは必要です！ # 変数、フロントエンド、保存場所、表示(1=常時,2=軽度)、必須、 # 保存タイプ、httpリンク、読み込み専用、httpリンク・ターゲット。 [ 'UserTitle', 'Title', 'title', 1, 0, 'var', '', 0 ], [ 'UserFirstname', 'Firstname', 'first_name', 1, 1, 'var', '', 0 ], [ 'UserLastname', 'Lastname', 'last_name', 1, 1, 'var', '', 0 ], [ 'UserLogin', 'Username', 'login', 1, 1, 'var', '', 0 ], [ 'UserPassword', 'Password', 'pw', 0, 0, 'var', '', 0 ], [ 'UserEmail', 'Email', 'email', 1, 1, 'var', '', 0 ], [ 'UserCustomerID', 'CustomerID', 'customer_id', 0, 1, 'var', '', 0 ], [ 'UserPhone', 'Phone', 'phone', 1, 0, 'var', '', 0 ], [ 'UserFax', 'Fax', 'fax', 1, 0, 'var', '', 0 ], [ 'UserMobile', 'Mobile', 'mobile', 1, 0, 'var', '', 0 ], [ 'UserRoom', 'Room', 'room', 1, 0, 'var', '', 0 ], [ 'UserStreet', 'Street', 'street', 1, 0, 'var', '', 0 ], [ 'UserZip', 'Zip', 'zip', 1, 0, 'var', '', 0 ], [ 'UserCity', 'City', 'city', 1, 0, 'var', '', 0 ], [ 'UserCountry', 'Country', 'country', 1, 0, 'var', '', 0 ], [ 'UserComment', 'Comment', 'comments', 1, 0, 'var', '', 0 ], [ 'ValidID', 'Valid', 'valid_id', 0, 1, 'int', '', 0 ], ], # default selections Selections => { UserTitle => { 'Mr.' => 'Mr.', 'Mrs.' => 'Mrs.', }, }, };

source: <emphasis>Script: Changing the map array.</emphasis>
ja: <emphasis>スクリプト: マッピング配列の変更</emphasis>
ru: <emphasis>Сценарий: Внесение изменений в map-массив.</emphasis>
sw: <emphasis>Hati: Kubadilisha miunganiko ya mkusanyiko.</emphasis>

source: Customizing the customer_user table in the OTRS DB
ja: OTRS DBでcustomer_userテーブルのカスタマイズ
ru: Настройка таблицы customer_user в Базе Данных OTRS DB
sw: Kugeuza kukufaa jedwali la mteja_mtumiaji katika hifadhidata ya OTRS

source: The last step is to add the new room number column to the customer_user table in the OTRS database (see Script below). In this column, the entries for the room numbers will be stored.
ja: 最後のステップは、新しいroom番号カラムをOTRSデータベース中customer_userテーブルに追加することです(下記のスクリプトを参照)。このカラムでは、room番号へのエントリーは格納されます。
ru: Последним шагом является добавление нового столбца с номером комнаты в таблицу customer_user базы данных OTRS (см. нижеприведенный сценарий). В этой колонке будет хранится информация для номера комнаты.
sw: Hatua ya mwisho ni kuongeza nambari mpya ya safuwima ya chumba katika jedwali la mteja_mtumiaji kwenye hifadhidata ya OTRS (ona Kielelezo chini). Katika safuwima hii, maingizo ya nambari ya chumba yatahifadhiwa.

source: <emphasis>Script: Adding a new column to the customer_user table.</emphasis>
ja: <emphasis>スクリプト:新しいカラムをcustomer_userテーブルに追加</emphasis>
ru: <emphasis>Сценарий: Добавление новой колонки в таблицу customer_user.</emphasis>
sw: <emphasis>Hati: Kuongeza safuwima mpya kwenye jedwali la mteja_mtumiaji.</emphasis>

source: Now the new field for the room should be displayed in the Customer Information panel if filled, and in the Customer User administration screens. Also, new customers should have to insert their room number if they register a new account. If you use OTRS on Microsoft IIS, you should restart the web server to activate the changes made in <filename>Config.pm</filename>.
ja: room用の新規フィールドに入力されたら、顧客情報パネルに表示され、顧客・ユーザ管理画面にも表示されます。さらに、新しいアカウントを登録する場合、新しい顧客はroom番号を挿入しなければなりません。マイクロソフトのIISの上でOTRSを使用する場合、<filename>Config.pm</filename>の中で行なわれた変更を活性化するためにウェブサーバを再起動するべきです。
ru: Теперь новое поле для номера комнаты должно отображатся в панели информации о клиенте и экранах управления клиентами. Когда новые клиенты будут регистрировать аккаунт, им нужно будет вписать номер комнаты. Если для работы OTRS используется Microsoft IIS, то чтобы новые изменения вступили в силу в <filename>Config.pm</filename> нужно перезапустить веб-сервер.
sw: Sasa sehemu mpya ya chumba lazima ionyeshwe katika paneli ya taarifa za Mteja kama imejazwa, na kwenye skrini za usimamizi wa Mteja Mtumiaji. Pia, wateja wapya wanatakiwa kuingiza namba zao za chumba kama wakisajili akaunti mpya. Kama ukitumia OTRS katika Microsoft IIS, unatakiwa kuanzisha upya seva ya tovuti kuamilisha mabadiliko yaliyofanywa katika <filename>Config.pm</filename>.

source: OTRS Scheduler
ja: OTRSスケジューラ
ru: Планировщик OTRS
sw: Mratibu wa OTRS

source: The OTRS Scheduler is an independent system process that executes tasks in background. These kind of processes are know as <emphasis>daemons</emphasis> in Unix / Linux systems or as <emphasis>services</emphasis> on Windows environments. It is independent but that doesn't mean that the Scheduler does everything alone, it is fully integrated into OTRS and can use any OTRS module as needed to complete each task.
ja: OTRSスケジューラは背景のタスクを実行する独立したシステムプロセスです。これらのプロセスはUnix / Linuxシステムでは<emphasis>デーモン</emphasis>として、またWindows環境上では<emphasis>サービス</emphasis>として知られています。それは独立していますが、スケジュールが全て単独で独立しているという意味ではありません。それは十分にOTRSに統合されていて、必要な時に各タスクを完了するためにいかなるOTRSモジュールをも使うことができます。
sw: Mratibu wa OTRS ni mchakato huru wa mfumo ambao unachakatisha kazi katika mandharinyuma. Hizi aina za michakato zinajulikana kama <emphasis>daemons</emphasis> katika mifumo ya Unix / Linux au kama <emphasis>huduma</emphasis> kwenye mazingiro ya Window. Ni huru lakini hii haimaanishi kwamba Mratibu anafanya kila kitu mwenyewe, imeunganishwa kikamilifu na OTRS na inaweza kutumia moduli yoyote ya OTRS kama inavyohitajika kukamilisha kila kazi.

source: For sanity reasons the Scheduler process needs to be restarted from time to time. This is done automatically by the scheduler process itself once a day, but it can be adjusted as needed using the SysConfig by editing the "Scheduler::RestartAfterSeconds" setting.
ja: 正常な理由のためにスケジューラ・プロセスはときどきリスタートする必要があります。これは、一日に一度スケジューラ・プロセス自体によって自動的に行われます。しかし、必要な時、SysConfigを使用して「Scheduler::RestartAfterSeconds」設定の編集すればそれを調節することができます。
ru: По соображениям здравого смысла, Планировщик должен запускаться время от времени. Это выполняется автоматически раз в день, но может быть настроено при неоходимости в SysConfig редактированием параметра "Scheduler::RestartAfterSeconds".
sw: Kwa sababu za akili ya kawaida mchakato wa Mratibu unahitaji kuanzishwa muda hadi muda. Hii inafanyika kiotomatiki na mchakato wa mratibu mwenyewe mara moja kwa siku, lakini inaweza kurekebishwa kama ikihitajika kwa kutumia SysConfig kwa kuhariri mpangilio "Mratibu::AnzishaupyaBaadaYaSekunde".

source: The OTRS Scheduler is a fully automated process, the only needed human interaction is to check its status periodically and start or stop it as needed.
ja: OTRSスケジューラは完全に自動プロセスです。唯一の人間の介在が必要とされることは、そのステータスを周期的にチェックし、必要な時にそれをスタートするか停止することです。
ru: Планировщик OTRS является полностью автоматическим процессом, и взаимодействие с человеком состоит толко в том, чтобы периодически проверять его состояние, запускать или останавливать по мере необходимости.
sw: Mratibu wa OTRS ni mchakato otomatiki, binadamu anaingilia mchakato huu ili kuona hali yake mara kwa mara na kuanzisha au kusitisha mchakato.

source: If the Scheduler is stopped for any reason, all pending tasks and new tasks registered when the Scheduler is stopped will be executed as soon as the Scheduler starts again (unless the tasks are set to be executed in the future).
ja: スケジューラが何らかの理由で停止されたら、スケジューラが停止した時に登録された全ての保留タスクと新規タスクは、スケジューラが再開するとすぐに実行されます。(タスクがその後実行される準備ができていない限り)
ru: Если Планировщик остановлен по какой либо причине, все отложенные задания зарегистрированные во время его простоя будут выполнены как только он будет запущен вновь (если только их запуск не предусмотрен позднее в будущем).
sw: Kama Mratibu akisitishwa kwa sababu yoyote, kazi zote zinazosubiri na mpya zilizosajiliwa wakati mratibu amesitishwa zitatekelezwa mara tu mratibu atakapoanzishwa tena (isipokuwa kama kazi zimesetiwa kutekelezwa hapo baadaye)

source: Scheduler Graphical Interface
ja: スケジューラ・グラフィカル・インターフェース
ru: Графический интерфейс планировщика
sw: Kiolesura Michoro cha Mratibu

source: The Scheduler is not visible in the OTRS Graphical User Interface unless it stops running.
ja: スケジューラは、それが停止しない限り、OTRSグラフィカルユーザーインターフェイスにおいて不可視です。
ru: Планировщик не виден в Графическом Пользовательском Интерфейсе OTRS до того времени пока он остается работать.
sw: Mratibu haonekani katika Kiolesura cha Michoro cha Mtumiaji hadi kisitishe kufanya kazi.

source: Scheduler Not Running Notification
ja: スケジューラ停止中の通知
ru: Планировщик Не Запускает Уведомления
sw: Mratibu hatoi Taarfa

source: There are two different types of notifications if the system detects that the scheduler is not running. This detection is based on the update frequency of the Scheduler process. If the difference between current time and the last process update time is 2 times the process update frequency a warning message will be displayed in the OTRS notification area. If it is over 4 times the process frequency then an alert will be displayed instead.
ja: スケジューラが停止中をシステムが検知する場合、2つの異なるタイプの通知があります。この検知はスケジューラ・プロセスの更新頻度に基づきます。現在時刻と最終プロセス更新時刻の時間差が２倍以上ならば、OTRS通知エリア内にプロセス更新頻度警告メッセージが表示されます。それが4倍以上のプロセス頻度ならば、警告に変わって警戒メッセージが表示されます。
ru: Есть два типа уведомлений, если система обнаруживает, что Планировщик не запущен. Они базируются на частоте обновления состояния процесса Планировщика. Если разница между текущим временем и временем последнего обновления состояния в 2 раза больше частоты обновления процесса, предупреждающее сообщение будет отображаться в OTRS области уведомлений. Если она больше в 4 раза, то, вместо предупреждения, будет отображаться тревожное сообщение.
sw: Kuna taarifa za aina ambili tofauti kama mfumo ukitambua mratibu hafanyi kazi. Huu utambuzi unategemea ni mara ngapi usasishaji wa mchakato wa mratibu unafanyika. Kama tofauti kati ya muda wa sasa na muda wa mwisho wa usasishaji wa mchakato wa mwisho ni zaidi ya mara 2 ya usasishaji wa mchakato ujumbe wa onyo utaonyeshwa kwenye eneo la taarifa la OTRS . Kama ni zaidi ya mara 4 ya mchakato tahadhari itatolewa badala yake.

source: The Scheduler process update time can be configured via the SysConfig in the "Scheduler::PIDUpdateTime" setting.
ja: スケジューラ・プロセス更新時間は、「Scheduler::PIDUpdateTime」設定中のSysConfigによって構成することができます。警告メッセージを見ても必ずしも処置を講ずる必要はありません。
ru: Параметр Планировщика обновление времени может быть настроен с помощью параметра "Scheduler::PIDUpdateTime" в файле SysConfig.
sw: Muda wa kusasisha Mratibu wa mchakato unaweza kusanidiwa kupitia SysConfig kwenye mpangilio wa "Mratibu::PIDSasishaMuda".

source: If you see a warning message it is not always necessary to take an action, but it is highly recommended to check if the scheduler process is running. If you see an alert, then there is a high chance that the scheduler is in fact not running and should be started.
ja: しかし、スケジューラ・プロセスが走っているかどうかをチェックすることは強く推奨します。警戒メッセージを見たら、スケジューラが停止している可能性が高いのでスタートすべきです。
ru: Если вы видите предупреждающее сообщение, необязательно сразу предпринимать какие-то действия, но настоятельно рекомендуется проверить, что процесс запущен. Если отображентся тревожное сообщение, велика вероятность, что Планировщик действительно не работает и его следует запустить.
sw: Ukiona ujumbe wa onyo si lazima kuchukua hatua, lakini inashauriwa sana kukagua kama mratibu anafanya kazi. Kama ukiona tahadhari, basi kuna asilimia kubwa mratibu hafanyi kazi na inatakiwa kuanzishwa kwake.

source: By default the Scheduler not running notification is enabled, if there is a valid web service registered in the database, and is only displayed to the users in the "admin" group.
ja: データベースに有効なウェブサービスが登録されていたり、または「管理者」グループのユーザだけに表示されている場合、デフォルトでスケジューラは通知を有効ではありません。
ru: По умолчанию Планировщик не запускает уведомлений, если есть действительный веб-сервис, зарегистрированный в базе данных и он отображается только для пользователей из группы "admin".
sw: Kwa kawaida taarifa ya Mratibu hafanyi kazi imewezeshwa, kama kuna huduma ya tovuti halali iliyosajiliwa katika hifadhidata, na inaonyeshwa kwa watumiaji wa kundi la "msimamizi" tu.

source: To disable the notification (not recommended) or to change or add the notification groups, please edit the "Frontend::NotifyModule###800-Scheduler-Check" setting in the SysConfig.
ja: 通知を不能にするためには（推奨しませんが）あるいは、通知グループを変更・追加するためには、SysConfigの中の設定「Frontend::NotifyModule###800-Scheduler-Check」を編集してください。
ru: Чтобы отключить уведомления (не рекомендуется) или же изменить или добавить группы уведомлений, пожалуйста, отредактируйте настройку "Frontend::NotifyModule###800-Scheduler-Check" в файле SysConfig.
sw: Kulemeza taarifa (haishauriwi) au kubadilisha au kuongeza makundi ya taarifa, tafadhali hariri mpangilio wa "Mazingira ya mbele::ModuliTaarifa###800-Mratibu-Kagua" katika SysConfig.

source: Scheduler Notification
ja: スケジューラ通知
ru: Уведомления Планировщика
sw: Taarifa za Mratibu

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="scheduler notification - screenshot" scale="40" fileref="screenshots/scheduler-notify.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="スケジューラ通知 - スクリーンショット" scale="40" fileref="screenshots/scheduler-notify.png"></graphic>

source: <emphasis>Figure: Scheduler notification.</emphasis>
ja: <emphasis>図:スケジューラ通知</emphasis>
ru: <emphasis>Figure: Уведомления планировщика.</emphasis>
sw: <emphasis>Kielelezo: Taarifa za mratibu.</emphasis>

source: Start Scheduler
ja: スタート・スケジューラ
ru: Запуск Планировщика
sw: Mratibu Kuanza

source: By clicking on the Scheduler not running notification link (either warning or alert) a dialog box will open to let you start the Scheduler process again. The Scheduler can be started normally or forced to start, by clicking on the appropriate check box in the dialog.
ja: スケジューラ停止中通知リンク(警告か警戒のいずれか)をクリックすることによって、再びスケジューラ・プロセスをを再開させるためにダイアログ・ボックスを開きます。ダイアログ中のチェックボックスを適切にクリックすることでスケジューラは正常にスタートするか強制的にスタートさせられます。
ru: При нажатии на уведомление о том, что Плпнировщик не запущен (предупреждающее или тревожное) откроется диалоговое окно, позволяющее стартовать Планировщик заново. Планировщик может быть запущен в нормальном или форсированном режиме, активированием соответствущего поля выбора в этом окне.
sw: Kwa ku bofya kiungo cha Mratibu hafanyi kazi (aidha onyo au tahadhari) kisanduku kidadisi kitafunguka kukuwezesha kuanza mchakato wa Mratibu tena. Mratibu anaweza kuanzishwa kwa kawaida au kwa lazima, kwa kubofya kwenye kisanduku tiki kinachohusika.

source: A forced Scheduler start is only necessary if previous Scheduler process was terminated abnormally and the Process ID is still registered in the database.
ja: 強制的なスケジューラ・スタートは、前のスケジューラ・プロセスが異常に終了し、プロセスIDがデータベース中でまだ登録されている場合のみ、必要です。
ru: Форсированный старт Планировщика необходим только в случае ненормального завершения предыдущего процесса Планировщика и его Process ID уже занесен в базу данных.
sw: Kuanzisha Mratibu kwa lazima inahitajika endapo mchakato uliopita wa Mratibu ulisitishwa kwa hali isiyokuwa ya kawaida na Kitambulisho cha Mchakato bado kimesajiliwa kwenye hifadhidata.

source: To have full control of the Scheduler process and to check it real status please use the command line tools described below.
ja: スケジューラ・プロセスを十分にコントロールをするために、以下の述べるコマンドラインツールをつかって、その実際の状態をチェックして下さい。
ru: Используйте инструменты командной строки, описанные ниже, чтобы иметь полный контроль над процессами Планировщика и иметь возможность проверить его реальное состояние.
sw: Ili kuwa na udhibiti kamili wa Mratibu wa mchakato na kukagua hali yake halisi tafadhali tumia vifaa katika tungo amri kama ilivyoelezwa chini.

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="scheduler start - screenshot" scale="40" fileref="screenshots/scheduler-start.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="スケジューラ開始 - スクリーンショット" scale="40" fileref="screenshots/scheduler-start.png"></graphic>

source: <emphasis>Figure: Start Scheduler.</emphasis>
ja: <emphasis>図:スケジューラの開始</emphasis>
ru: <emphasis>Рисунок: Запуск Планировщика.</emphasis>
sw: <emphasis>Kielelezo: Anzisha Mratibu.</emphasis>

source: Scheduler Command Line Interface
ja: スケジューラ・コマンドライン・インタフェース
ru: Интерфейс командной строки Планировщика
sw: Kiolesura cha Tungo Amri ya Mratibu

source: The Scheduler command line tools let you control the Scheduler process (Start / Stop) or query it status. There are also tools to register the process to be controlled by the operating system.
ja: スケジューラ・コマンドライン・ツールによってスケジューラ・プロセス(スタート・ストップ)をコントロールし、スケジュールの状態を尋ねます。さらにオペレーティング・システムによってコントロールされるプロセスを登録するツールがあります。
ru: Командная строка Планировщика позволяет управлять процессами (Запуск / Остановка) или запрашивать их состояние. Также есть инструменты для регистрации процесса, который будет управлять операционной системой.
sw: Vifaa vya tungo amri ya Mratibu vinakuruhusu kudhibiti mchkato wa Mratibu (Kuanza / Kusitisha) au kuuliza hali yake. Pia kuna vifaa vya kusajili mchakato ili udhibitiwe na mfumo wa uendeshaji.

source: Included with OTRS there are two sets of CLI tools, one for Unix / Linux and another for Microsoft Windows.
ja: 2セットのCLIのツール、すなわちひとつはUnix/Linux用でもう一方はMicrosoft Windows用です。
sw: OTRS imejumuishwa na seti mbili za vifaa vya CLI, moja ya Unix / Linux na nyingine ya Microsoft Windows.

source: Init.d files are special scripts that are called by the operating system at startup and shutdown.
ja: init.d ファイルは、スタートアップとシャット・ダウンでオペレーティング・システムによって呼び出される特別なスクリプトです。
ru: Init.d файлы это специальные скрипты, которые вызываются операционной системой при старте и завершении работы.
sw: Mafaili ya init.d ni hati za kipekee ambazo huitwa na mfumo endeshi wakati wa kuanzisha na kuzima

source: OTRS provides init.d scripts to start / stop the OTRS Scheduler process automatically by the operating system. These scripts are located under OTRS_HOME/scripts.
ja: OTRSは、オペレーティング・システムによってOTRSスケジューラ・プロセスを自動的に始める/止めるためにinit.d スクリプトを提供します。これらのスクリプトはOTRS_HOME/scriptsの下にあります。
ru: OTRS предлагает init.d скрипты для автоматического процесса Планировщика старта/завершения OTRS опреционной системой. Эти скрипты расположены в OTRS_HOME/scripts.
sw: OTRS inatoa hati za init.d kuanza / kusitisha mchakato wa Mratibu wa OTRS kiotomatiki kwa kutumia mfumo wa uendeshaji. Hati hizo zinapatikana chini ya OTRS_NYUMBANI/hati.

source: The init.d scripts need to be copied to the correct location for your operating system. They need to have the proper permissions and some internal variables need to be set to work properly. If you used the OTRS RPMs to set up the system, this is taken care of automatically.
ja: init.d スクリプトは、ご利用のオペレーティング・システムに応じて正しい位置にコピーする必要があります。それらは適切な許可を持つ必要があります。また、いくつかの内部変数を適切に動くようにセットする必要があります。システムをセット・アップにOTRS RPMを使用したならば、これは自動的に処理されます。
ru: Скрипты init.d должны быть скопированы в соответствующее место вашей операционной системы. Им должны быть даны соответствующие права и установлены значения некоторых внутренних переменных для правильной работы. Если вы использовали OTRS RPMs для установки системы, это будет сделано автоматически.
sw: Hati za init.d zinahitaji kunakiliwa kwenda kwenye mahali sahihi kwa ajili ya mfumo endeshi wako. Zinahitaji kuwa na ruhusa sahihi na baadhi ya vishika nafasi vya ndani vinahitaji kusetiwa kufanya kazi vizuri. Kama ulitumia RPM za OTRS kuseti mfumo, hii inafanyika kiotomatiki.

source: Init.d Script Internal Variables
ja: init.d スクリプト内部変数
ru: Init.d Скрипт Внутренних Переменных
sw: Init.d Vishika nafasi vya Ndani vya Hati

source: <command>OTRS_HOME</command> - the path of your OTRS installation.
ja: <command>OTRS_HOME</command> - OTRSインストールのパス。
ru: <command>OTRS_HOME</command> - путь установки OTRS.
sw: <command>OTRS_NYUMBANI</command> - njia kwenda kwenye usanidi wa OTRS yako.

source: <command>User</command> - the apache process user name.
ja: <command>User</command> - the apache プロセスユーザ名。
ru: <command>User</command> - имя пользователя процесса apache.
sw: <command>Mtumiaji</command> - jina la mtumiaji wa mchakato wa apache.

source: <command>Group</command> - the apache process user's group name.
ja: <command>Group</command> - the apache OTRSインストールのグループ名。
ru: <command>Group</command> - apache обрабатывает группу пользователей с таким именем.
sw: <command>Kundi</command> - jina la kudni la mtumiaji wa apache.
