Repository: DSigmund/doc-admin
Catalog: i18n/doc-admin.*.po
Languages: ja, ru, sw

source: If performance is still not satisfactory, we suggest that you join the PostgreSQL Performance mailing list ( <ulink url="http://www.postgresql.org/community/lists/">http://www.postgresql.org/community/lists/</ulink> ), and ask questions there. The folks on the PostgreSQL list are very friendly and can probably help.
ja: パフォーマンスが不十分な場合、PostgreSQLパフォーマンス・メーリング・リスト( <ulink url="http://www.postgresql.org/community/lists/">http://www.postgresql.org/community/lists/</ulink> )に参加しそこに質問をすることを提案します。PostgreSQLリスト上の人々は非常にフレンドリーで、おそらく助けてくれることでしょう。
ru: Если производительность остается на неудовлетворительном уровне, мы предлагаем вам присоединится к спискам рассылки "PostgreSQL Performance" ( <ulink url="http://www.postgresql.org/community/lists/">http://www.postgresql.org/community/lists/</ulink> ) и задавать вопросы именно там. Люди в этом списке рассылке очень дружелюбны а всегада постараются вам помочь.
sw: Kama utendaji bado hauridhishi, tunashauri kwamba ujiunge na orodha ya watumiwa wa Utendaji wa PostgreSQL ( <ulink url="http://www.postgresql.org/community/lists/">http://www.postgresql.org/community/lists/</ulink> ), na kuuliza maswali hapo. Wahusika kwenye orodha ya PostgreSQL wakarimu na wanaweza kusaidia.

source: Webserver
ja: ウェブサーバ
ru: Веб-сервер
sw: Seva ya tovuti

source: Of course you should use mod_perl 2.0 ( <ulink url="http://perl.apache.org/"><citetitle>http://perl.apache.org/</citetitle></ulink> ). It's much faster (~ * 100) than pure cgi. But it needs more RAM.
ja: mod_perl 2.0( <ulink url="http://perl.apache.org/"><citetitle>http://perl.apache.org/</citetitle></ulink> )を使用するべきです。それは純粋なcgiよりはるかに速い(~ * 100)。しかし、それはより多くのRAMを必要とします。
ru: Конечно же нужно использовать mod_perl 2.0 ( <ulink url="http://perl.apache.org/"><citetitle>http://perl.apache.org/</citetitle></ulink> ). Он быстрее (~ * 100) чем "чистый" cgi. Но он требует больше оперативной памяти (RAM).
sw: Bila shaka unatakiwa kutumia mod_perl 2.0 ( <ulink url="http://perl.apache.org/"><citetitle>http://perl.apache.org/</citetitle></ulink> ). Ina kasi zaidi (~ * 100) zaidi ya cgi halisi. Lakini inahitaji RAM zaidi.

source: Pre-established database connections
ja: 事前に確立しているデータベース接続
ru: Предустановленное соединение с базой данных
sw: Miunganiko ya hifadhidata iliyotengenezwa.

source: You can have the database connections pre-established on startup of the web server. This saves time (see README.webserver).
ja: ウェブサーバのスタートアップに先んじてあらかじめデータベース接続を確立することができます。時間の節約になります(README.webserverを参照)。
ru: При запуске веб-сервера можно иметь заранее установленное соединение с базой данных. Такой подход существенно сэкономит время (см. README.webserver).
sw: Una miunganiko ya hifadhidata imewekwa tayari wakati wauanzishwaji wa seva ya tovuti. Hii inaokoa muda (pitia README.webserver).

source: Preloaded modules - startup.pl
ja: プレインストールされたモジュール - startup.pl
ru: Предварительно загруженные модули - startup.pl
sw: Moduli zilizopakiwa tayari -startup.pl

source: Use the startup script <filename>scripts/apache2-perl-startup.pl</filename> for preloaded/precompiled Perl modules on your mod_perl webserver to be faster, with a smaller memory footprint (see README.webserver).
ja: スタートアップ・スクリプト・スクリプト<filename>scripts/apache2-perl-startup.pl</filename>を使用して下さい。それはmod_perlウェブサーバ上の事前ロードされ、コンパイルされたPerlをより早くします。しかもより小さいメモリで。(README.webserverを参照)。
ru: Чтобы все работало быстрее и занимало меньше памяти используйте сценарий запуска <filename>scripts/apache2-perl-startup.pl</filename> для предварительной загрузки/компиляции Perl модулей на сервере с mod_perl (см. README.webserver).
sw: Tumia hati ya uwashaji <filename>scripts/apache2-perl-startup.pl</filename> kwa ajili ya moduli za Perl ambazo tayari zimepakiwa/zimekusanywa-zalishwa katika seva yajo ya tovuti ya mod_perl kuwa ya kasi zaidi, kwa utumiaji mdogo wa kumbukumbu (ona README.webserver).

source: Reload Perl modules when updated on disk
ja: ディスク上で更新された時パール・モジュールをリロードします。
ru: Перезагрузка Perl-модулей во время обновления с диска
sw: Pakia tena moduli za perl zinapo sasishwa kwnye diski

source: By default Apache::Reload is used in scripts/apache2-httpd.include.conf. Disable it and you will get 8% more speed. But remember to restart the web server if you install any modules via the OTRS Package Manager, or any values in your SysConfig or in Kernel/Config.pm. Important: this would also mean you can't use the OTRS Package Manager via the web interface, you need to use the command line variant - <filename>bin/otrs.PackageManager.pl</filename>.
ja: Apache::Reloadはデフォルトでscripts/apache2-httpd.include.conf.の中で使用されます。それを不能にすれば8%のスピードアップとなります。しかし、もしOTRSパッケージマネージャからなんらかのモジュールを、あるいは SysConfig 中または Kernel/Config.pm.中でなんらかの値を、インストールしているならば、忘れてはいけないことは ウェブサーバのリスタートです。重要:このことは、ウェブ・インターフェース経由でOTRSパッケージ・マネージャーを使用することができないことを意味します。コマンドラインから変数の - <filename>bin/otrs.PackageManager.pl</filename>をご利用下さい。
ru: По умолчанию Apachee::Reload используется в scripts/apache2-httpd.include.conf. Отключив его вы получите больше 8% прироста скорости. Не забудьте перезапустить веб-сервер, если устанавливаете модули через OTRS Package Manager, или устанавливаете любые значения в SysConfig или в Kernel/Config.pm. Важно: это также будет означать, что у вас не будет возможности использовать OTRS Package Manager через пользовательский веб-интерфейс. В таком случае необходимо воспользоваться командной строкой - <filename>bin/otrs.PackageManager.pl</filename>.
sw: Kwa kawaida Apache::Reload inatumika katika scripts/apache2-httpd.include.conf. Ilemaze na utapata ongezeko la kasi kwa 8% zaidi. Lakini kumbuka kuanzisha upya seva ya tovuti kama ukisakinisha moduli zozote kupitia Meneja Kifurushi wa OTRS, au thamani zozote katika SysConfig yako au katika Kernel/Config.pm. Muhimu: hii inamaanisha pia huwezi kutumia Meneja Kifurushi wa OTRS kupitia kiolesura cha tovuti, unahitaji kutumia lahaja ya tungo amri - <filename>bin/otrs.PackageManager.pl</filename>.

source: Choosing the Right Strategy
ja: 正しい戦略の選択
ru: Выбор Правильной Стратегии
sw: Kuchagua mkakati sahihi

source: If you have a larger installation, e.g. over 1,000 new tickets per day and over 40 agents, it is a good idea to read the chapters on Performance of the mod_perl User's Guide ( <ulink url="http://perl.apache.org/docs/2.0/user/index.html"><citetitle>http://perl.apache.org/docs/2.0/user/index.html</citetitle></ulink> ).
ja: より大きな装置(例えば40人以上担当者または1,000枚/day以上の新しいチケット)を持っているなら、mod_perlユーザ・ガイド( <ulink url="http://perl.apache.org/docs/2.0/user/index.html"><citetitle>http://perl.apache.org/docs/2.0/user/index.html</citetitle></ulink> )の性能についての章を読むと良いでしょう。
ru: Если у вас действительно большая система, более 1 000 новых заявок в день и больше 40 агентов, то советуем почитать статью "Производительность" в Руковдстве пользователя по mod_perl (<ulink url="http://perl.apache.org/docs/2.0/user/index.html"><citetitle>http://perl.apache.org/docs/2.0/user/index.html</citetitle></ulink> ).
sw: Kama una usakinishaji mkubwa, mf. zaidi ya tiketi mpya 1,000 kwa siku na zaidi ya mawakala 40, ni wazo zuri kusoma sura kuhusu Utendaji katika Mwongozo wa Mtumiaji wa mod_perl ( <ulink url="http://perl.apache.org/docs/2.0/user/index.html"><citetitle>http://perl.apache.org/docs/2.0/user/index.html</citetitle></ulink> ).

source: If your bandwidth is small, use mod_deflate for Apache2. If you have an html page with 45k, mod_gzip/mod_deflate compresses it to about 7k. The drawback is that this increases the load on the server side.
ja: 帯域幅が小さい場合は、Apache2用のmod_deflateをご利用ください。45000のHTMLページを持っているなら、mod_gzip/mod_deflate は約7000にそれを圧縮します。欠点は、これがサーバー側のロードを増加させるということです。
ru: Используйте mod_deflate для Apache2, если у вас "слабая" полоса пропускания . При загрузке html-страницы размером в 45к, mod_gzip/mod_deflate сожмет ее и страница будет занимать около 7к. Недостатком такого подхода является дополнительная нагрузка на сервер.
sw: Kama kipimo data chako ni kidogo, tumia mod_deflate kwa ajili ya Apache2. Kama una ukurasa wa html wenye 45k, mod_gzip/mod_deflate itaufinyaza kuwa takribani 7k. Hasara ni kwamba hii inaongeza mzigo kwenye upande wa seva.

source: Preface
ja: 序文
ru: Предисловие
sw: Utangulizi

source: This book is intended for use by OTRS administrators. It also serves as a good reference for OTRS newbies.
ja: OTRS 管理者向けの冊子です。OTRS 初心者のための参考書としても提供しています。
ru: Эта книга предназначена для использования OTRS-администраторами. Он также послужит хорошим справочником для новичков OTRS.
sw: Hiki kitabu kimelenga kutumiwa na Wasimamizi wa OTRS. Pia ni ki rejeo kizuri kwa watumiaji wapya wa OTRS.

source: The following chapters describe the installation, configuration, and administration of the OTRS software. The first third of the text describes key functionality of the software, while the remainder serves as a reference to the full set of configurable parameters.
ja: 次の章では、インストール、構成、および OTRS ソフトウェアの管理について説明します。テキストの最初の 3行で、ソフトウェアの主要な機能について説明しています。一方残りの部分は、構成可能なパラメタの完全なセットへの参照として提供されています。
ru: В следующих главах описывается установка, настройка и администрирование программы OTRS. В первой трети текста описываются ключевые функциональные возможности програмного обеспечения, в то время как остальной текст является ссылкой на полный набор настраиваемых параметров.
sw: Sura zinazofwata zinaelezea usakinishaji, usanidi, na usimamizi wa progwamu ya OTRS. Theluthi moja ya kwanza ya nakala hii inaelezea kazi za muhimu za programu, wakati zinazobakia inafanya kazi kama marejeo ya seti nzima ya parameta zinazoweza kusanidiwa.

source: This book continues to be a work in progress, given a moving target on new releases. We need your feedback in order to make this a high quality reference document: one that is usable, accurate, and complete. Please write to us if you find content missing in this book, if things are not explained sufficiently, or even if you see spelling mistakes, grammatical errors, or typos. Any kind of feedback is highly appreciated and should be made via our bug tracking system on <ulink url="http://bugs.otrs.org"> <citetitle>http://bugs.otrs.org</citetitle> </ulink>. Thanks in advance for your contributions!
ja: この本は新製品中の移動標的を与えられて、引き続き進行中の仕事です。私達はこれを使いやすく正確かつ完璧な高品質な参考文献にするためにあなたのフィードバックを必要としています。この本で内容の欠落、説明が不十分な点、スペルミス、文法のエラーあるいは誤植を見つけた場合は私達にお知らせ下さい。どのような種類のフィールドバックも正しく評価され、 <ulink url="http://bugs.otrs.org"> <citetitle>http://bugs.otrs.org</citetitle> </ulink>にある 私達の追跡システムによって反映されます。あなたの貢献に感謝申し上げます。
ru: Эта книга и дальше находится в стадии разработки и совершенствуется с выходом новых версий продукта. Чтобы сделать это справочное руководство более качественным, полным и точным нам нужна обратная связь с вами. Пожалуйста, напишите нам, если заметите отсутствие некоторых разделов в этой книге, если некоторые вещи обьясняются недостаточно хорошо или, если просто видите орфографические, граматические ошибки или опечатки. Мы будем признательны за любой вид обратной связи, которую можно осуществить посредством нашей системы отслеживания ошибок, которая находится по адресу <ulink url="http://bugs.otrs.org"> <citetitle>http://bugs.otrs.org</citetitle> </ulink>. Заранее благодарим вас за помощь!
sw: Hiki kitabu kinaendelea kuwa kazi iliyo kwenye mwendelezo, ikiwa lengo ni matoleo mapya. Tunahitaji maoni yenu ili kufanya hii nyaraka ya marejeo kuwa ya hali ya juu: ambayo inaweza kutumika, iko sahihi, na kamili. Tafadhali tuandikie kama unakuta kuna kitu hakipo kwenye hiki kitabu, kama vitu havijaelezewa kikamilifu, au kuna makosa ya kiuandishi na kisintaksia. Aina yoyote ya maoni yanathaminiwa na yanatakiwa kuwekwa kwenye mfumo wetu wa kufwatilia makosa katika <ulink url="http://bugs.otrs.org"> <citetitle>http://bugs.otrs.org</citetitle> </ulink>. Tunatanguliza shukrani kwa michango yenu.

source: Using external backends
ja: 外部バックエンドの使用
ru: Использование внешних хранилищ данных
sw: Kutumia mazingira ya nyuma ya nje

source: Customer data
ja: 顧客情報
ru: Данные клиентов
sw: Data za mteja

source: OTRS works with many customer data attributes such as username, email address, phone number, etc. These attributes are displayed in both the Agent and the Customer frontends, and also used for the authentication of customers.
ja: OTRSは、ユーザー名、メール・アドレス、電話番号などのような多くの顧客情報属性で動作しています。これらの属性は担当者および顧客フロント・エンドの両方に表示され、顧客の認証に使用されます。
ru: OTRS работает с различными атрибутами данных клиентов, такими как имя пользователя, адрес электронной почты, номер телефона и т.д. Эти атрибуты отображаются в обеих фронтэндах, для Агентов и Клиентов. Они также используются для проверки подлинности клиентов.
sw: OTRS inafanya kazi na sifa nyingi za data za mteja kama jina la mtumiaji, anuani ya barua pepe, nambari ya simu, na kadh. Hizi sifa zinaonyeshwa katika mazingira ya mbele ya Wakala na Mteja, na pia inatumika kwenye uthibitisho wa mteja.

source: Customer data used or displayed within OTRS is highly customizable. The following information is however always needed for customer authentication:
ja: OTRSの内に使用されるか表示された顧客情報は高度にカスタマイズ可能です。しかし次の情報は、顧客認証に常に必要とされます:
ru: Данные клиентов, которые используются и отображаются в OTRS очень легко настраиваются. Несмотря на это следующая информация будет всегда необходима для проверки подлинности клиента:
sw: Data za mteja zinazotumika au kuonyeshwa kwenye OTRS zinauwezekano mkubwa wa kugeuzwa kukufaa. Taarifa ifuatayo hata hivyo inahitajika muda wote kwa ajili ya uthibitisho wa mteja:

source: User login
ja: User login（ユーザーログイン）
ru: Вход пользователей
sw: Mtumiaji ingia

source: Email address
ja: Email address（Eメールアドレス）
ru: Адресс электронной почты
sw: Anwani ya barua pepe

source: Customer ID
ja: Customer ID（顧客ID）
ru: ID Клиента
sw: Kitambulisho cha mteja

source: Use the following SysConfig parameters if you want to display customer information in your agent interface.
ja: 担当者インターフェースの顧客情報を表示したければ、次のSysConfigパラメタを使用して下さい。
ru: Используйте следующие параметры SysConfig, если желаете отобразить информацию о клиенте в интерфейсе агента.
sw: Tumia parameta zifuatazo za SysConfig kama unataka kuonyesha taarifa za mteja katika kiolesura cha wakala wako.

source: # Ticket::Frontend::CustomerInfo* # (show customer info on Compose (Phone and Email), Zoom and # Queue view) $Self->{'Ticket::Frontend::CustomerInfoCompose'} = 1; $Self->{'Ticket::Frontend::CustomerInfoZoom'} = 1;
ja: # Ticket::Frontend::CustomerInfo* # （作成（電話とEメール）、ズーム、キュービュー時に顧客情報を表示） $Self->{'Ticket::Frontend::CustomerInfoCompose'} = 1; $Self->{'Ticket::Frontend::CustomerInfoZoom'} = 1;

source: <emphasis>Script: SysConfig configuration parameters.</emphasis>
ja: <emphasis>スクリプト：SysConfig構成パラメタ</emphasis>
ru: <emphasis>Скрипт: Параметры конфигурации SysConfig.</emphasis>
sw: <emphasis>Hati: parameta za usanidi za SysConfig.</emphasis>

source: Customer user backend
ja: 顧客ユーザ・バックエンド
ru: Пользовательский бэк-енд
sw: Mazingira ya nyuma ya Mtumiaji mteja

source: You can use two types of customer backends, DB and LDAP. If you already have another customer backend (e.g. SAP), it is of course possible to write a module that uses it.
ja: 2つのタイプの顧客バックエンド、DBおよびLDAPを使用することができます。あなたが別の顧客バックエンド(例えばSAP)を既に持っていれば、それを使用するモジュールを書くことはもちろん可能です。
ru: Вы можете использоваь два типа хранилища информации клиентов: Базу Данных DB и LDAP. Если у вас уже есть другой бэк-енд для хранения пользовательской информации (например SAP), также есть возможность написать модуль для использования этой функции.
sw: Unaweza kutumia aina mbili za mazingira ya nyuma ya mtumiaji, DB na LDAP. Kama tayari una mazingira mengine ya nyuma ya mteja (mf. SAP), inawezekana pia kuandika moduli ambayo inaitumia.

source: Database (Default)
ja: データベース(デフォルト)
ru: База Данных (По умолчанию)
sw: Hifadhidata (Chaguo-msingi)

source: Example 11-1 shows the configuration of a DB customer backend, which uses customer data stored in the OTRS database.
ja: 例11-1は、DB顧客バックエンドの構成を示します。それは、OTRSデータベースに保存された顧客情報を使用します。
ru: В Примере 11-1 приведена конфигурация базы данных, которая использует данные клиента, хранящиеся в базе данных OTRS.
sw: Mfano 11-1 unaonyesha usanidi wa mazingira ya nyuma ya DB ya mteja, ambayo inatumia data za mteja zilizohifadhiwa kwenye hifadhidata ya OTRS.

source: Configuring a DB customer backend
ja: DB顧客バックエンドの構成
ru: Настройка клиентского хранилища базы данных (DB)
sw: Usanidi wa hifadhidata ya mazingira ya nyuma ya mteja

source: # CustomerUser (customer database backend and settings) $Self->{CustomerUser} = { Name => 'Database Datasource', Module => 'Kernel::System::CustomerUser::DB', Params => { # if you want to use an external database, add the required settings # DSN => 'DBI:odbc:yourdsn', # Type => 'mssql', # only for ODBC connections # DSN => 'DBI:mysql:database=customerdb;host=customerdbhost', # User => '', # Password => '', Table => 'customer_user', # if your frontend is unicode and the charset of your # customer database server is iso-8859-1, use these options. # SourceCharset => 'iso-8859-1', # DestCharset => 'utf-8', # CaseSensitive will control if the SQL statements need LOWER() # function calls to work case insensitively. Setting this to # 1 will improve performance dramatically on large databases. CaseSensitive => 0, }, # customer unique id CustomerKey => 'login', # customer # CustomerID => 'customer_id', CustomerValid => 'valid_id', CustomerUserListFields => ['first_name', 'last_name', 'email'], CustomerUserSearchFields => ['login', 'last_name', 'customer_id'], CustomerUserSearchPrefix => '', CustomerUserSearchSuffix => '*', CustomerUserSearchListLimit => 250, CustomerUserPostMasterSearchFields => ['email'], CustomerUserNameFields => ['title','first_name','last_name'], CustomerUserEmailUniqCheck => 1, # # show not own tickets in customer panel, CompanyTickets # CustomerUserExcludePrimaryCustomerID => 0, # # generate auto logins # AutoLoginCreation => 0, # AutoLoginCreationPrefix => 'auto', # # admin can change customer preferences # AdminSetPreferences => 1, # # cache time to live in sec. - cache any database queries # CacheTTL => 0, # # just a read only source # ReadOnly => 1, Map => [ # note: Login, Email and CustomerID needed! # var, frontend, storage, shown (1=always,2=lite), required, storage-type, http-link, readonly, http-link-target [ 'UserTitle', 'Title', 'title', 1, 0, 'var', '', 0 ], [ 'UserFirstname', 'Firstname', 'first_name', 1, 1, 'var', '', 0 ], [ 'UserLastname', 'Lastname', 'last_name', 1, 1, 'var', '', 0 ], [ 'UserLogin', 'Username', 'login', 1, 1, 'var', '', 0 ], [ 'UserPassword', 'Password', 'pw', 0, 0, 'var', '', 0 ], [ 'UserEmail', 'Email', 'email', 1, 1, 'var', '', 0 ], # [ 'UserEmail', 'Email', 'email', 1, 1, 'var', '$Env{"CGIHandle"}?Action=AgentTicketCompose&amp;ResponseID=1&amp;TicketID=$Data{"TicketID"}&amp;ArticleID=$Data{"ArticleID"}', 0 ], [ 'UserCustomerID', 'CustomerID', 'customer_id', 0, 1, 'var', '', 0 ], # [ 'UserCustomerIDs', 'CustomerIDs', 'customer_ids', 1, 0, 'var', '', 0 ], [ 'UserPhone', 'Phone', 'phone', 1, 0, 'var', '', 0 ], [ 'UserFax', 'Fax', 'fax', 1, 0, 'var', '', 0 ], [ 'UserMobile', 'Mobile', 'mobile', 1, 0, 'var', '', 0 ], [ 'UserStreet', 'Street', 'street', 1, 0, 'var', '', 0 ], [ 'UserZip', 'Zip', 'zip', 1, 0, 'var', '', 0 ], [ 'UserCity', 'City', 'city', 1, 0, 'var', '', 0 ], [ 'UserCountry', 'Country', 'country', 1, 0, 'var', '', 0 ], [ 'UserComment', 'Comment', 'comments', 1, 0, 'var', '', 0 ], [ 'ValidID', 'Valid', 'valid_id', 0, 1, 'int', '', 0 ], ], # default selections Selections => { UserTitle => { 'Mr.' => 'Mr.', 'Mrs.' => 'Mrs.', }, }, };
ja: # CustomerUser (customer database backend and settings) $Self->{CustomerUser} = { Name => 'Database Datasource', Module => 'Kernel::System::CustomerUser::DB', Params => { # 外部データベースを使用したければ必要な設定を追加します。 # DSN => 'DBI:odbc:yourdsn', # Type => 'mssql', # only for ODBC connections # DSN => 'DBI:mysql:database=customerdb;host=customerdbhost', # User => '', # Password => '', Table => 'customer_user', # フロント・エンドがunicodeで顧客データベースサーバのcharsetが # iso-8859-1である場合は、これらのオプションを使用して下さい。 # SourceCharset => 'iso-8859-1', # DestCharset => 'utf-8', # CaseSensitive（大文字と小文字を区別せず評価するかどうかの指定値）は、 # 大文字小文字の評価を鈍感に動かすためにSQLステートメントが # LOWER()関数呼び出しを必要とするかどうかをコントロールします。 # これを1にセットすると、大きなデータベース上でパフォーマンスを # 劇的に改善するでしょう。 CaseSensitive => 0, }, # 顧客固有識別ID CustomerKey => 'login', # 顧客 # CustomerID => 'customer_id', CustomerValid => 'valid_id', CustomerUserListFields => ['first_name', 'last_name', 'email'], CustomerUserSearchFields => ['login', 'last_name', 'customer_id'], CustomerUserSearchPrefix => '', CustomerUserSearchSuffix => '*', CustomerUserSearchListLimit => 250, CustomerUserPostMasterSearchFields => ['email'], CustomerUserNameFields => ['title','first_name','last_name'], CustomerUserEmailUniqCheck => 1, # # 顧客パネルに自身のチケットを非表示とします, CompanyTicketsn# CustomerUserExcludePrimaryCustomerID => 0, # # 自動ログインを生成します # AutoLoginCreation => 0, # AutoLoginCreationPrefix => 'auto', # # admin は顧客の選択（選好）を変更できます。 # AdminSetPreferences => 1, # # キャッシュの生存時間（秒）- どのデータベース・クエリーのキャッシュでも # CacheTTL => 0, # # 読み取り専用のソース # ReadOnly => 1, Map => [ # ノート：ログイン、Eメールと顧客IDが必要！ # var, frontend, storage, shown (1=always,2=lite), required, storage-type, http-link, readonly, http-link-target [ 'UserTitle', 'Title', 'title', 1, 0, 'var', '', 0 ], [ 'UserFirstname', 'Firstname', 'first_name', 1, 1, 'var', '', 0 ], [ 'UserLastname', 'Lastname', 'last_name', 1, 1, 'var', '', 0 ], [ 'UserLogin', 'Username', 'login', 1, 1, 'var', '', 0 ], [ 'UserPassword', 'Password', 'pw', 0, 0, 'var', '', 0 ], [ 'UserEmail', 'Email', 'email', 1, 1, 'var', '', 0 ], # [ 'UserEmail', 'Email', 'email', 1, 1, 'var', '$Env{"CGIHandle"}?Action=AgentTicketCompose&amp;ResponseID=1&amp;TicketID=$Data{"TicketID"}&amp;ArticleID=$Data{"ArticleID"}', 0 ], [ 'UserCustomerID', 'CustomerID', 'customer_id', 0, 1, 'var', '', 0 ], # [ 'UserCustomerIDs', 'CustomerIDs', 'customer_ids', 1, 0, 'var', '', 0 ], [ 'UserPhone', 'Phone', 'phone', 1, 0, 'var', '', 0 ], [ 'UserFax', 'Fax', 'fax', 1, 0, 'var', '', 0 ], [ 'UserMobile', 'Mobile', 'mobile', 1, 0, 'var', '', 0 ], [ 'UserStreet', 'Street', 'street', 1, 0, 'var', '', 0 ], [ 'UserZip', 'Zip', 'zip', 1, 0, 'var', '', 0 ], [ 'UserCity', 'City', 'city', 1, 0, 'var', '', 0 ], [ 'UserCountry', 'Country', 'country', 1, 0, 'var', '', 0 ], [ 'UserComment', 'Comment', 'comments', 1, 0, 'var', '', 0 ], [ 'ValidID', 'Valid', 'valid_id', 0, 1, 'int', '', 0 ], ], # デフォルトの選択 Selections => { UserTitle => { 'Mr.' => 'Mr.', 'Mrs.' => 'Mrs.', }, }, };

source: If you want to customize the customer data, change the column headers or add new ones to the customer_user table in the OTRS database. As an example, the script below shows how to add a new field for room number.
ja: 顧客情報をカスタマイズしたい場合は、カラム・ヘッダーを変更するか、あるいは新規ものをOTRSデータベース中のcustomer_userテーブルに加えてください。例として、下記のスクリプトは、room番号用の新規フィールドを加える方法を教えます。
ru: Если нужно настроить данные клиентов, измените заголовки столбцов или добавьте новые к таблице customer_user базы данных OTRS. В качестве примера используйте нижеприведенный сценарий, в котором показано как добавить новое поле для номера комнаты.
sw: Ukitaka kugeuza data za mteja kukufaa, badili vichwa vya safuwima au ongeza mpya kwenye jedwali la mteja_mtumiaji kwenye hifadhidata ya OTRS. Kama mfano, hati hapa chini inaonyesha jinsi ya kuongeza sehemu mpya kwa ajili ya nambari ya chumba.

source: <emphasis>Script: Adding a room field to the customer_user table.</emphasis>
ja: <emphasis>スクリプト: roomフィールドのcustomer_userテーブルへの追加。</emphasis>
ru: <emphasis>Сценарий: Добавление поля "комната" в таблицу customer_user table. </emphasis>
sw: <emphasis>Hati: Kuongeza sehemu ya chumba katika jedwali la mteja_mtumiaji.</emphasis>
