Repository: DSigmund/doc-admin
Catalog: i18n/doc-admin.*.po
Languages: ja, ru, sw

source: The configuration parameters shown in the script below can be used to synchronize the user data from your LDAP directory into your local OTRS database. This reduces the number of requests to your LDAP server and speeds up the authentication with OTRS. The data synchronization is done when the agent authenticates the first time. Although the data can be syncronized into the local OTRS database, the LDAP directory is the last instance for the authentication, so an inactive user in the LDAP tree can't authenticate to OTRS, even when the account data is already stored in the OTRS database. The agent data in the LDAP directory can't be edited via the web interface of OTRS, so the data has to be managed directly in the LDAP tree.
ja: スクリプトの中で下に示される構成パラメータは、ローカルのOTRSデータベースの中へのLDAPディレクトリーからの利用者データを同期させるために使用することができます。これは、LDAPサーバーにリクエストの数を減らし、OTRSでの認証の速度を向上させます。担当者が最初に認証する場合、データ同期は終っています。ローカルのOTRSデータベースへデータを同期することができますが、LDAPディレクトリーは認証のための最後の実体（インスタンス）です、したがって、LDAPツリー内の活性化されていないユーザは認証することができません。アカウント・データがOTRSデータベースに既に保存されている場合さえ。LDAPディレクトリーの担当者データは、OTRSのウェブインターフェース経由で編集することができません。したがって、LDAPツリーにデータを直接管理しなければなりません。
ru: Параметры конфигурации приведенные в сценарии приведенном ниже могут быть использованы для синхронизации пользовательских данных из LDAP-каталога в локальную базу данных OTRS. Это уменьшает количество запросов к LDAP-серверу и ускоряет проверку подлинности в OTRS. Синхронизация данных завершена, когда агент аутентифицируется впервые. Несмотря на то, что данные могут быть синхронизированны в локальной базе данных OTRS, LDAP-каталог является последней инстанцией для проверки подлинности пользователей, таким образом пользователи, не активные для дерева каталогов LDAP не могут пройти аутентификацию в OTRS, даже в том случае, когда данные о пользователе уже хранятся в базе данных OTRS. Данные агентов в LDAP-директории не могут быть отредактированы с помощью веб-интерфейса OTRS, так что управление данными должно осуществлятся непосредственно в дереве каталогов LDAP.
sw: Mipangilio ya usanidi iliyoonyeshwa kwenye hati hapo chini inaweza kutumika kulandanisha data zote za mtumiaji kutoka kwenye mpangilio orodha wako wa LDAP kwenda kwenye hifadhidata yako ya OTRS ya ndani. Hii inapunguza idadi ya maombi kwenda kwenye seva yako ya LDAP na inaongeza kasi ya uthibitisho na OTRS. Ulandanishi wa data unafanyika pale wakala anapojithibitisha kwa mara ya kwanza. Hata hivyo hiyo data inaweza kulandanishwa na hifadhidata ya ndani ya OTRS, mpangilio orodha wa LDAP ni mfano wa mwisho wa uthibitisho, kwa hiyo mtumiaji aliye lemaa aliye katika matawi ya LDAP hawezi kujithibitisha kwenye OTRS, hata kama data za akaunti tayari zimehifadhiwa kwenye hifadhidata ya OTRS. Data za wakala kwenye mpangilio orodha wa LDAP haziwezi kuhaririwa kupitia kiolesura cha tovuti cha OTRS, kwa hiyo data inabidi isimamiwe moja kwa moja katika matawi ya LDAP.

source: # defines AuthSyncBackend (AuthSyncModule) for AuthModule # if this key exists and is empty, there won't be a sync. # example values: AuthSyncBackend, AuthSyncBackend2 $Self->{'AuthModule::UseSyncBackend'} = 'AuthSyncBackend'; # agent data sync against ldap $Self->{'AuthSyncModule'} = 'Kernel::System::Auth::Sync::LDAP'; $Self->{'AuthSyncModule::LDAP::Host'} = 'ldap://ldap.example.com/'; $Self->{'AuthSyncModule::LDAP::BaseDN'} = 'dc=otrs, dc=org'; $Self->{'AuthSyncModule::LDAP::UID'} = 'uid'; $Self->{'AuthSyncModule::LDAP::SearchUserDN'} = 'uid=sys, ou=user, dc=otrs, dc=org'; $Self->{'AuthSyncModule::LDAP::SearchUserPw'} = 'some_pass'; $Self->{'AuthSyncModule::LDAP::UserSyncMap'} = { # DB -> LDAP UserFirstname => 'givenName', UserLastname => 'sn', UserEmail => 'mail', }; [...] # AuthSyncModule::LDAP::UserSyncInitialGroups # (sync following group with rw permission after initial create of first agent # login) $Self->{'AuthSyncModule::LDAP::UserSyncInitialGroups'} = [ 'users', ];
ja: # AuthModule用にAuthSyncBackend (AuthSyncModule)定義します。 # キーが存在しそれが空ならば、Syncにならないでしょう。 # サンプル値: AuthSyncBackend, AuthSyncBackend2 $Self->{'AuthModule::UseSyncBackend'} = 'AuthSyncBackend'; # LDAPに対する担当者データ sync $Self->{'AuthSyncModule'} = 'Kernel::System::Auth::Sync::LDAP'; $Self->{'AuthSyncModule::LDAP::Host'} = 'ldap://ldap.example.com/'; $Self->{'AuthSyncModule::LDAP::BaseDN'} = 'dc=otrs, dc=org'; $Self->{'AuthSyncModule::LDAP::UID'} = 'uid'; $Self->{'AuthSyncModule::LDAP::SearchUserDN'} = 'uid=sys, ou=user, dc=otrs, dc=org'; $Self->{'AuthSyncModule::LDAP::SearchUserPw'} = 'some_pass'; $Self->{'AuthSyncModule::LDAP::UserSyncMap'} = { # DB -> LDAP UserFirstname => 'givenName', UserLastname => 'sn', UserEmail => 'mail', }; [...] # AuthSyncModule::LDAP::UserSyncInitialGroups # (最初の担当者のログインの初期の作成後に、rw許可を持つsync followingグループ） $Self->{'AuthSyncModule::LDAP::UserSyncInitialGroups'} = [ 'users', ];

source: <emphasis>Script: Synchronizing the user data from the LDAP directory into the OTRS database.</emphasis>
ja: <emphasis>スクリプト：OTRSデータベースの中へのLDAPディレクトリーからの利用者データを同期させること。</emphasis>
ru: <emphasis>Сценарий: Синхронизация пользовательских данных из LDAP-директориив базу данных OTRS.</emphasis>
sw: <emphasis>Hati: Kulandanisha data za mtumiaji kutoka kwenye mpangilio orodha wa LDAP kwenda kwenye hifadhidata ya OTRS.</emphasis>

source: HTTPBasicAuth for Agents
ja: 担当者のためのHTTPBasicAuth
ru: HTTPBasicAuth-аутентификация для Агентов
sw: HTTPBasicAuth za Wakala

source: If you want to implement a "single sign on" solution for all your agents, you can use HTTP basic authentication (for all your systems) and the HTTPBasicAuth module for OTRS (see Example 11-8 below).
ja: すべての担当者のための「シングル・サインオン」解決を実行したければ、OTRSのためにHTTP基本認証(すべてのシステム用の)およびHTTPBasicAuthモジュールを使用することができます(下記の例11-8を参照)。
ru: Если вы хотите реализовать решение "single sign on" для всех агентов, вы можете использовать базовую аунентификацию (для всех систем) и HTTPBasicAuth-модуль для OTRS (см. ниже Пример 11-8).
sw: Kama unataka kutekeleza suluhisho la "saini moja kwenye" kwa mawakala wako wote, unaweza kutumia uthibitisho msingi wa HTTP (kwa mifumo yako yote) na moduli ya HTTPBasicAuth ya OTRS (ona Mfano 11-8 chini).

source: Authenticate Agents using HTTPBasic
ja: HTTPBasicを使用して、担当者を認証します。
ru: Аутентификация Агентов с помощью HTTPBasic
sw: Halalisha Wakala kwa kutumia HTTPBasic

source: # This is an example configuration for an apache ($ENV{REMOTE_USER}) # auth. backend. Use it if you want to have a singe login through # apache http-basic-auth $Self->{'AuthModule'} = 'Kernel::System::Auth::HTTPBasicAuth'; # Note: # # If you use this module, you should use as fallback # the following configuration settings if the user is not authorized # apache ($ENV{REMOTE_USER}) $Self->{LoginURL} = 'http://host.example.com/not-authorised-for-otrs.html'; $Self->{LogoutURL} = 'http://host.example.com/thanks-for-using-otrs.html';
ja: # これはapache ($ENV{REMOTE_USER})認証バックエンド用のサンプル構成です。 # apache http-basic-authのシングル・サインオンを持ちたければそれを使います。 $Self->{'AuthModule'} = 'Kernel::System::Auth::HTTPBasicAuth'; # Note: # # このモジュールを使うなら、代替手段として次の構成設定を使うべきです。 #（もしユーザがapache ($ENV{REMOTE_USER})として認証されていないならば） $Self->{LoginURL} = 'http://host.example.com/not-authorised-for-otrs.html'; $Self->{LogoutURL} = 'http://host.example.com/thanks-for-using-otrs.html';

source: The configuration parameters shown in Example 11-9 can be used to authenticate agents against a Radius server.
ja: 例11-9において示される構成パラメータは、Radiusサーバーに対する担当者を認証するために使用することができます。
ru: Параметры конфигурации приведенные в Примере 11-9 могут быть использованы для аутентификации агентов с использованием Radius-сервера.
sw: Parameta za usanidi zilizoonyeshwa kwenye Mfano 11-9 zinaweza kutumika kuthibitisha mawakala katika seva ya Radius.

source: Authenticate Agents against a Radius backend
ja: Radiusバックエンドに対する担当者を認証します。
ru: Аутентификация (проверка подлинности) агентов с использованием Radius-сервера в качестве хранилища информации
sw: Thibitisha mawakala katika mazingira ya nyuma ya Radius.

source: # This is example configuration to auth. agents against a radius server $Self->{'AuthModule'} = 'Kernel::System::Auth::Radius'; $Self->{'AuthModule::Radius::Host'} = 'radiushost'; $Self->{'AuthModule::Radius::Password'} = 'radiussecret';
ja: # これは、radiusサーバに対するauth. agentsへのサンプル構成です。 $Self->{'AuthModule'} = 'Kernel::System::Auth::Radius'; $Self->{'AuthModule::Radius::Host'} = 'radiushost'; $Self->{'AuthModule::Radius::Password'} = 'radiussecret';

source: Authentication backends for Customers
ja: 顧客のための認証バックエンド
ru: Хранилища информации для аутентификации (проверки подлинности) клиентов
sw: Mazingira ya nyuma ya kuthibitisha Wateja

source: The default user authentication backend for customers in OTRS is the OTRS database. With this backend, all customer data can be edited via the web interface of OTRS (see Example 11-10 below).
ja: OTRSの中の顧客のための既定のユーザー認証バックエンドはOTRSデータベースです。このバックエンドで、顧客情報はすべて、OTRSのウェブインターフェース経由で編集することができます(下記の例11-10を参照)。
ru: Для аутентификации клиентов в OTRS, по умолчанию, используется база данных. Используя базу данных в качестве хранилища, все данные клиентов можно редактировать через веб-интерфейс OTRS (см. ниже Пример 11-10).
sw: Chaguo-msingi la kithibitisho cha mtumiaji cha mazingira ya nyuma katika OTRS ni hifadhidata ya OTRS. Kwa mazingira haya ya nyuma, unaweza kuhariri data zote za mteja kupitia kiolesura cha wavuti cha OTRS (ona Mfano 11-10 chini).

source: Customer user authentication against a DB backend
ja: DBバックエンドに対する顧客ユーザ認証
ru: Аутентификация Клиента в Базе Данных
sw: Uthibitisho wa mtumiaji mteja katika mazingira ya nyuma ya DB

source: # This is the auth. module against the otrs db $Self->{'Customer::AuthModule'} = 'Kernel::System::CustomerAuth::DB'; $Self->{'Customer::AuthModule::DB::Table'} = 'customer_user'; $Self->{'Customer::AuthModule::DB::CustomerKey'} = 'login'; $Self->{'Customer::AuthModule::DB::CustomerPassword'} = 'pw'; #$Self->{'Customer::AuthModule::DB::DSN'} = "DBI:mysql:database=customerdb;host=customerdbhost"; #$Self->{'Customer::AuthModule::DB::User'} = "some_user"; #$Self->{'Customer::AuthModule::DB::Password'} = "some_password";
ja: # これはthe otrs dbに対する認証モジュールです。 $Self->{'Customer::AuthModule'} = 'Kernel::System::CustomerAuth::DB'; $Self->{'Customer::AuthModule::DB::Table'} = 'customer_user'; $Self->{'Customer::AuthModule::DB::CustomerKey'} = 'login'; $Self->{'Customer::AuthModule::DB::CustomerPassword'} = 'pw'; #$Self->{'Customer::AuthModule::DB::DSN'} = "DBI:mysql:database=customerdb;host=customerdbhost"; #$Self->{'Customer::AuthModule::DB::User'} = "some_user"; #$Self->{'Customer::AuthModule::DB::Password'} = "some_password";

source: If you have an LDAP directory with all your customer data, you can use the LDAP module to authenticate your customers to OTRS (see Example 11-11 below). Because this module has only read-access to the LDAP backend, it is not possible to edit the customer data via the OTRS web interface.
ja: すべての顧客データを備えたLDAPディレクトリーを持っていれば、OTRSへの顧客を認証するためにLDAPモジュールを使用することができます(下記の例11-11を参照)。このモジュールがLDAPバックエンドに対して単に読み取り専用アクセスをしているので、OTRSウェブインターフェース経由で顧客情報を編集することはできません。
ru: Если у вас есть LDAP-каталог со всеми данными о клиентах, можно использовать модуль LDAP для аутентификации клиентов в OTRS (см. Пример 11-11 ниже). Поскольку этот модуль имеет права только для чтения для данных из LDAP-бэкенда, то нету возможности изменить данные клиента через веб.
sw: Kama una mpangilio orodha wa LDAP wenye data zako zote za mteja, unaweza kutumia moduli ya LDAP kuthibitisha wateja wako katika OTRS (ona Mfano 11-11 chini). Kwa kuwa moduli hii ina uwezo wa kusoma tu kwa mazingira ya nyuma ya LDAP, haiwezekani kuhariri data za mteja kupitia kiolesura cha wavuti cha OTRS.

source: Customer user authentication against an LDAP backend
ja: LDAPバックエンドに対する顧客ユーザ認証
ru: Аутентификация пользователей с помощью LDAP-бэкэнда
sw: Uthibitisho wa mtumiaji mteja katika mazingira ya nyuma ya LDAP

source: # This is an example configuration for an LDAP auth. backend. # (make sure Net::LDAP is installed!) $Self->{'Customer::AuthModule'} = 'Kernel::System::CustomerAuth::LDAP'; $Self->{'Customer::AuthModule::LDAP::Host'} = 'ldap.example.com'; $Self->{'Customer::AuthModule::LDAP::BaseDN'} = 'dc=example,dc=com'; $Self->{'Customer::AuthModule::LDAP::UID'} = 'uid'; # Check if the user is allowed to auth in a posixGroup # (e. g. user needs to be in a group xyz to use otrs) $Self->{'Customer::AuthModule::LDAP::GroupDN'} = 'cn=otrsallow,ou=posixGroups,dc=example,dc=com'; $Self->{'Customer::AuthModule::LDAP::AccessAttr'} = 'memberUid'; # for ldap posixGroups objectclass (just uid) $Self->{'Customer::AuthModule::LDAP::UserAttr'} = 'UID'; # for non ldap posixGroups objectclass (full user dn) #$Self->{'Customer::AuthModule::LDAP::UserAttr'} = 'DN'; # The following is valid but would only be necessary if the # anonymous user does NOT have permission to read from the LDAP tree $Self->{'Customer::AuthModule::LDAP::SearchUserDN'} = ''; $Self->{'Customer::AuthModule::LDAP::SearchUserPw'} = ''; # in case you want to add always one filter to each ldap query, use # this option. e. g. AlwaysFilter => '(mail=*)' or AlwaysFilter => '(objectclass=user)' $Self->{'Customer::AuthModule::LDAP::AlwaysFilter'} = ''; # in case you want to add a suffix to each customer login name, then # you can use this option. e. g. user just want to use user but # in your ldap directory exists user@domain. #$Self->{'Customer::AuthModule::LDAP::UserSuffix'} = '@domain.com'; # Net::LDAP new params (if needed - for more info see perldoc Net::LDAP) $Self->{'Customer::AuthModule::LDAP::Params'} = { port => 389, timeout => 120, async => 0, version => 3, };
ja: # これはLDAP認証バックエンド用サンプル構成です。 # Net::LDAPがインストールされていることを確認下さい。） $Self->{'Customer::AuthModule'} = 'Kernel::System::CustomerAuth::LDAP'; $Self->{'Customer::AuthModule::LDAP::Host'} = 'ldap.example.com'; $Self->{'Customer::AuthModule::LDAP::BaseDN'} = 'dc=example,dc=com'; $Self->{'Customer::AuthModule::LDAP::UID'} = 'uid'; # ユーザがposixGroupで認証することが可能かどうか確認します。 #（例えばユーザはOTRSを使うにはグループ xyzに属する必要があります。） $Self->{'Customer::AuthModule::LDAP::GroupDN'} = 'cn=otrsallow,ou=posixGroups,dc=example,dc=com'; $Self->{'Customer::AuthModule::LDAP::AccessAttr'} = 'memberUid'; # for ldap posixGroups objectclass (just uid) $Self->{'Customer::AuthModule::LDAP::UserAttr'} = 'UID'; # for non ldap posixGroups objectclass (full user dn) #$Self->{'Customer::AuthModule::LDAP::UserAttr'} = 'DN'; # 次は有効です。しかし 匿名ユーザがLDAPツリーから # 読み込み許可を持たない場合のみ必要です。 $Self->{'Customer::AuthModule::LDAP::SearchUserDN'} = ''; $Self->{'Customer::AuthModule::LDAP::SearchUserPw'} = ''; # 常にあるフィルタを各LDAPクエリに追加したい場合このオプションを使います # このオプションは例えば # AlwaysFilter => '(mail=*)' or AlwaysFilter => '(objectclass=user)'です。 $Self->{'Customer::AuthModule::LDAP::AlwaysFilter'} = ''; # ログイン名のに接頭辞を追加したければ、このオプションを使います。 # たとえばユーザがuserを使いたいが、LDAPにuser@domainが存在する場合。 #$Self->{'Customer::AuthModule::LDAP::UserSuffix'} = '@domain.com'; # Net::LDAP new params (if needed - for more info see perldoc Net::LDAP) $Self->{'Customer::AuthModule::LDAP::Params'} = { port => 389, timeout => 120, async => 0, version => 3, };

source: HTTPBasicAuth for customers
ja: 顧客のためのHTTPBasicAuth
ru: HTTPBasicAuth аутентификация для клиентов
sw: HTTPBasicAuth za wateja

source: If you want to implement a "single sign on" solution for all your customer users, you can use HTTPBasic authentication (for all your systems) and use the HTTPBasicAuth module with OTRS (no login is needed with OTRS any more). See Example 11-12 below.
ja: 全顧客ユーザに「シングル・サイン・オン」ソリューションを実行したければ、HTTPBasic認証（あなたの全てのシステムに対して）を使い、そしてOTRSのHTTPBasicAuthモジュールを使う（OTRSでログインが必要なくなります）。下記の例11-12を参照してください。
ru: Если для пользователей нужно внедрить "single sign on"-решение, можно использовать базовую, HTTPBasic аутентификацию (для всех систем) и использовать модуль HTTPBasicAuth с OTRS (больше не нужно логинится в OTRS). См. ниже Пример 11-12.
sw: Kama unataka kutekeleza suluhisho la "saini moja kwenye" kwa wateja watumiaji wako wote, unaweza kutumia uthibitisho wa HTTPBasic (kwa mifumo yako yote) na kutumia moduli ya HTTPBasicAuth na OTRS (hakuna kuingia kunakohitajika na OTRS tena). Ona Mfano 11-12 chini.

source: Customer user authentication with HTTPBasic
ja: HTTPBasicを備えた顧客ユーザ認証
ru: Аутентификация клиентов с помощью HTTPBasic
sw: Uthibitisho wa Mteja kwa kutumia HTTPBasic

source: # This is an example configuration for an apache ($ENV{REMOTE_USER}) # auth. backend. Use it if you want to have a singe login through # apache http-basic-auth $Self->{'Customer::AuthModule'} = 'Kernel::System::CustomerAuth::HTTPBasicAuth'; # Note: # If you use this module, you should use the following # config settings as fallback, if user isn't login through # apache ($ENV{REMOTE_USER}) $Self->{CustomerPanelLoginURL} = 'http://host.example.com/not-authorised-for-otrs.html'; $Self->{CustomerPanelLogoutURL} = 'http://host.example.com/thanks-for-using-otrs.html';
ja: # apache ($ENV{REMOTE_USER})認証バックエンド用のサンプル構成です。 # apache http-basic-authのシングル・サインオンを # 持ちたければそれを使います。 $Self->{'Customer::AuthModule'} = 'Kernel::System::CustomerAuth::HTTPBasicAuth'; # ノート: # このモジュールを使うなら、代替手段として次の構成設定を使うべきです。 # もしユーザがapache ($ENV{REMOTE_USER})として認証されていないならば $Self->{CustomerPanelLoginURL} = 'http://host.example.com/not-authorised-for-otrs.html'; $Self->{CustomerPanelLogoutURL} = 'http://host.example.com/thanks-for-using-otrs.html';

source: The settings shown in Example 11-13 can be used to authenticate your customers against a Radius server.
ja: 例11-13において示される設定はRadiusサーバーに対するあなたの顧客を認証するために使用することができます。
ru: Настройки приведенные в примере 11-13 могут быть использованы для аутентификации ваших клиентов с помощью Radius-сервера.
sw: Mipangilio iliyoonyeshwa kwenye Mfano 11-13 inaweza kutumika kuthibitisha wateja wako dhidi ya seva ya Radius.

source: Customer user authentication against a Radius backend
ja: Radiasのバックエンドに対する顧客ユーザ認証
ru: Аутентификация клиентов с использованием Radius
sw: Uthibitisho wa mtumiaji mteja katika mazingira ya nyuma ya Radius

source: # This is a example configuration to auth. customer against a radius server $Self->{'Customer::AuthModule'} = 'Kernel::System::Auth::Radius'; $Self->{'Customer::AuthModule::Radius::Host'} = 'radiushost'; $Self->{'Customer::AuthModule::Radius::Password'} = 'radiussecret';
ja: # これはRaduisサーバへの認証顧客へのサンプル構成です。 $Self->{'Customer::AuthModule'} = 'Kernel::System::Auth::Radius'; $Self->{'Customer::AuthModule::Radius::Host'} = 'radiushost'; $Self->{'Customer::AuthModule::Radius::Password'} = 'radiussecret';

source: Customizing the customer self-registration
ja: 顧客自己登録のカスタマイズ
ru: Настройка самостоятельной регистрации клиента
sw: Kugeuza kukufaa usajili binafsi wa mteja

source: It is possible to customize the self-registration for new customers, accessible via the customer.pl panel. New optional or required fields, like room number, address or state can be added.
ja: 新規顧客(customer.plパネルによってアクセス可能)のための自己登録をカスタマイズすることは可能です。新規の任意または必須フィールド（room番号、アドレスあるいは状態のような）を追加することができます。
ru: Есть возможность настроить самостоятельную регистрацию новых клиентов, доступную через панель customer.pl. Можно добавить новые дополнительные или обязательные поля, такие как номер комнаты, адрес или состояние.
sw: Inawezekana kugeuza kukufaa usajili binafsi kwa ajili ya wateja wapya, inafikika kupitia paneli ya customer.pl. Sehemu mpya za hiari au zinazohitajika, kama nambari ya chumba, anwani au hali zinaweza kuongezwa.

source: The following example shows how you can specify a required field in the customer database, in this case to store the room number of a customer.
ja: 次の例は、顧客のroom番号を格納するためには、この場合どのように顧客データベースの中であなたが必須フィールドを指定することができるか示します。
ru: В следующем примере показано каким образом можно указать обязательные для заполнения поля в базе данных клиентов, в данном случае, для хранения номера клиента.
sw: Mfano ufwatao unaonyesha jinsi unaweza kubainisha sehemu inayohitajika katika hifadhidata ya mteja, katika kesi hii hifadhi nambari ya chumba cha mteja.

source: Customizing the web interface
ja: ウェブインターフェースのカスタマイズ
ru: Настройка веб-интерфейса
sw: Kugeuza kiolesura cha wavuti kukufaa

source: To display the new field for the room number in the customer.pl web interface, the .dtl file responsible for the layout in this interface has to be modified. Edit the <filename>Kernel/Output/HTML/Standard/CustomerLogin.dtl</filename> file, adding the new field around line 80 (see Script below).
ja: customer.plウェブインターフェースのroom番号用の新規フィールドを表示するために、このインターフェースのレイアウトの責任者である.dtlファイルを修正しなければなりません。80行目のまわりの新規フィールドを加えて、<filename>Kernel/Output/HTML/Standard/CustomerLogin.dtl</filename>ファイルを編集してください。(下記のスクリプトを参照)。
ru: Для отображения нового поля для номера комнаты в веб-интерфейсе пользователя (customer.pl), нужно внести изменения в .dtl-файл, который отвечает за шаблон этого интерфейса. Отредактируйте файл <filename>Kernel/Output/HTML/Standard/CustomerLogin.dtl</filename> добавив новые поля после строки 80 (см. нижеприведенный сценарий).
sw: Kuonyesha sehemu mpya ya nambari ya chumba katika kiolesura cha tovuti cha customer.pl, faili la .dtl ambalo lina jukumu la muonekano katika hiki kiolesura lazima libadilishwe. Hariri faili la <filename>Kernel/Output/HTML/Standard/CustomerLogin.dtl</filename>, ongeza sehemu mpya maeneo ya mstari wa 80 (ona Hati chini).

source: <emphasis>Script: Displaying a new field in the web interface.</emphasis>
ja: <emphasis>スクリプト:ウェブインターフェースでの新規フィールドの表示</emphasis>
ru: <emphasis>Сценарий: Отображение новых полей в веб-интерфейсе.</emphasis>
sw: <emphasis>Hati: Kuonyesha sehemu mpya katika kiolesura cha wavuti.</emphasis>

source: Customer mapping
ja: 顧客マッピング
ru: Отображения клиентов
sw: Kuunganisha mteja

source: In the next step, the customer mapping has to be expanded with the new entry for the room number. To ensure that the changes are not lost after an update, put the "CustomerUser" settings from the <filename>Kernel/Config/Defaults.pm</filename> into the <filename>Kernel/Config.pm</filename>. Now change the MAP array and add the new room number field, as shown in the script below.
ja: 次のステップで、顧客マッピングはroom番号への新規エントリーで拡張しなければなりません。変更がアップデート後に失われないことを確実にするためには、<filename>Kernel/Config.pm</filename> に <filename>Kernel/Config/Defaults.pm</filename>からの「CustomerUser」設定を入れてください。スクリプト中で下に示されるように、MAP配列を変更して、新規room番号フィールドを追加してください。
ru: На следующем этапе, нужно внести изменения в маппинг (mapping), рассширив его новым элементом - номером комнаты. Чтобы убедится что изменения не потеряются после обновления, установите настройкы "CustomerUser" из файла <filename>Kernel/Config/Defaults.pm</filename> в файл <filename>Kernel/Config.pm</filename>. Теперь измените MAP-массив, добавив новое поле - номер комнаты, как это показано в нижеприведенном сценарии.
sw: Katika hatua inayofuata, muunganiko wa mteja inabidi upanuliwe na ingizo jipya kutoka kwenye nambari mpya. Kuhakikisha kwamba mabadiliko hayapotei baada ya usasishaji, weka mipangilio ya "MtumiajiMteja" kutoka kwenye <filename>Kernel/Config/Defaults.pm</filename> kwenda kwenye <filename>Kernel/Config.pm</filename>. Sasa badilisha mkusanyiko wa RAMANI na ongeza sehemu mpya ya nambari ya chumba, kama ilivyoonyeshwa kwenye hati chini.
