Repository: DSigmund/doc-admin
Catalog: i18n/doc-admin.*.po
Languages: ja, ru, sw

source: Examples of suitable formats for Transparent copies include: plain ASCII without markup, Texinfo input format, LaTeX input format, SGML or XML using a publicly available DTD, and standard-conforming simple HTML designed for human modification. Opaque formats include: PostScript, PDF, proprietary formats that can be read and edited only by proprietary word processors, SGML or XML for which the DTD and/or processing tools are not generally available, and the machine-generated HTML produced by some word processors for output purposes only.
ja: 透過的複製に適した形式のサンプルとしては、マークアップを含まないプレーンな ASCII形式、Texinfo入力形式、LaTeX入力形式、一般に入手可能なDTDを用いたSGMLあるいはXML、または人間による改変を想定して設計された、標準に準拠したシンプルなHTMLやPostScript、PDFなどが挙げられます。透過的な画像形式の例には、PNGやXCF、JPGが含まれます。非透過な形式としては、独占的なワードプロ セッサでのみ閲覧編集できる独占的なファイル形式、普通には入手できないDTDまたは処理系を使ったSGMLやXML、ある種のワードプロセッサが生成する、出力のみを目的とした機械生成のHTMLやPostScript、PDFなどが含まれます。
sw: Mifano ya maumbo yanayofaa kwa ajili ya nakala Angavu inajumuisha: ASCII wazi bila dhulisho mabadiliko, umbizo la maingizo la Texinfo, umbizo la maingizo la LaTeX, SGML au XML kwa kutumia DTD inayopatikana kwa umma, na HTML ya kawaida iliyoundwa kwa ajili ya mabadiliko ya mwanadamu. Maumbo yasiyo angavu yanajumuisha: PostScript, PDF, maumbo binafsi ambayo yanaweza kusomwa na kuhaririwa na vichakatishi vya maneno binafsi tu, SGML au XML ambazo DTD na/au vifaa vya uchakatishaji havipatikani kwa ujumla, na HTML zinazozalishwa na mashine zinazotengenezwa na baadhi ya vichakatishi maneno kwa ajili ya matokeo tu.

source: The "Title Page" means, for a printed book, the title page itself, plus such following pages as are needed to hold, legibly, the material this License requires to appear in the title page. For works in formats which do not have any title page as such, "Title Page" means the text near the most prominent appearance of the work's title, preceding the beginning of the body of the text.
ja: 「題扉 (Title Page)」とは、印刷された書籍に於いては、実際の表紙自身のみ ならず、この利用許諾契約書が表紙に掲載することを義務づける文章や図など を、読みやすい形で載せるのに必要なだけの、表紙に引き続く数ページをも意味する。表紙に類するものが無い形式で発表される著作物においては、「題扉」とは本文の始まりに先だって、その著作物の題名が最も目立つ形で現れる場所の近くに置かれる文章のことを指します。
sw: "Ukurasa wa mbele" inamaanisha, kwa kitabu kilichochapishwa, ukurasa wa mbele wenyewe, kujumuisha na kurasa zinazofwata kama zinavyohitajika kushikilia, kusomwa, vitu ambavyo hii Leseni inahitaji vionekane kwenye ukurasa wa mbele. Kwa kazi zenye maumbo ambayo hayana ukurasa wa mbele wowote kama huu, "Ukurasa wa Mbele" inamaanisha nakala karibu ya muonekano muhimu wa kichwa cha habari cha kazi, kabla ya mwanzo wa kiini cha nakala.

source: VERBATIM COPYING
ja: 逐語的に忠実な複製
sw: KUNAKILI BILA KUBADILISHA KITU

source: You may copy and distribute the Document in any medium, either commercially or non-commercially, provided that this License, the copyright notices, and the license notice saying this License applies to the Document are reproduced in all copies, and that you add no other conditions whatsoever to those of this License. You may not use technical measures to obstruct or control the reading or further copying of the copies you make or distribute. However, you may accept compensation in exchange for copies. If you distribute a large enough number of copies you must also follow the conditions in section 3.
ja: この利用許諾契約書、著作権表示、この契約書が文書に適用される旨述べた告知の三つがすべての複製物に複製され、かつあなたがこの契約書で指定されている以外のいかなる条件も追加しない限り、あなたはこの文書を、商用であるか否かを問わずいかなる形でも複製頒布することができます。あなたは、あなたが作成あるいは頒布する複製物に対して、閲覧や再複製を技術的な手法によって妨害、規制してはいけません。しかしながら、複製と引き換えに代価を得てもかまいません。あなたが相当量の複製物を頒布する際には、本契約書第3項で指定される条件にも従わなければなりません。
sw: Unaweza kunakili na kusambaza waraka kwa njia yoyote, aidha kwa biashara au sio kwa biashsara, ukizingatia kwamba hii Leseni, notisi za hakimiliki, na notisi za leseni zinasema hii Leseni inafanya kazi kwa waraka huu inakuwepo kwa kila nakala, na huongezi masharti mengine yoyote kwa yale yaliyopo kwenye hii leseni. Hutakiwi kutumia vipimo vya kiufundi kuzuia au kudhibiti usomaji au utengenezaji wa nakala zingine zaidi ya zile ulizotengeneza au kusambaza. Hata hivyo unaweza kupokea fidia kwa ajili ya nakala. Kama ukisambaza idadi ya kutosha ya nakala pia ni lazima ufuate masharti katika kifungu cha 3.

source: You may also lend copies, under the same conditions stated above, and you may publicly display copies.
ja: またあなたは、上記と同じ条件の下で、複製物を貸与したり複製物を公に開示 することができます。
sw: Unaweza pia kuazima nakala, chini ya masharti sawa na yaliyosemwa juu, na unaweza kuonyesha kwa umma.

source: COPYING IN QUANTITY
ja: 大量の複製
sw: KUNAKILI KATIKA IDADI

source: If you publish printed copies of the Document numbering more than 100, and the Document's license notice requires Cover Texts, you must enclose the copies in covers that carry, clearly and legibly, all these Cover Texts: Front-Cover Texts on the front cover, and Back-Cover Texts on the back cover. Both covers must also clearly and legibly identify you as the publisher of these copies. The front cover must present the full title with all words of the title equally prominent and visible. You may add other material on the covers in addition. Copying with changes limited to the covers, as long as they preserve the title of the Document and satisfy these conditions, can be treated as verbatim copying in other respects.
ja: もしあなたが、文書の印刷された (あるいは通常は印刷された表紙を持つ 媒体における)複製物を100部を超えて出版し、また文書の利用許諾告知が カバーテキストの掲載を要求している場合には、指定されたすべてのカバーテ キストを、表カバーテキストは表表紙に、裏カバーテキストは裏表紙に、はっ きりと読みやすい形で載せた表紙の中に複製物本体を綴じ込まなければなりません。また、両方の表紙において、それらの複製物の出版者としてのあなたをはっ きりとかつ読みやすい形で確認できなければなりません。表表紙では文書の完全な題名を、題名を構成するすべての語が等しく目立つようにして、視認可 能な形で示さなければなりません。それらの情報に加えて、表紙に他の文章や図 などを加えることは許可される。表紙のみを変更した複製物は、それが文書の題名を保存し上記の条件を満たす限り、ほかの点では逐語的に忠実な複製物として扱われます。
sw: Kama ukichapisha nakala za Nyaraka zenye idadi zaidi ya 100, na notisi ya leseni ya nyaraka inahitaji Nakala za Jalada, unatakiwa kujumuisha nakala zinazobeba, zinazosomeka na kuonekana kwa urahisi, Nakala za jalada zote hizi: Nakala za Jalada la Mbele katika jalada la mbele, na Nakala za Jalada la nyuma kwenye jalada la nyuma. Majalada yote lazima yaonyeshe kiurahisi na kwa kusomeka kwamba wewe ndiyo mchapishaji wa hizi nakala. Jalada la mbele lazima lionyeshe kichwa cha habari kizima chenye maneno yote yenye usawa na kuonekana. Unaweza kuongeza vitu vingine kwenye jalada kwa nyongeza. Kunakili na mabadiliko yenye kikomo kwa jalada, ikiwa tu zinahifadhi kichwa cha habari cha nyaraka na kuridhisha masharti haya, inaweza kuchukuliwa kama kunakili bila mabadilko kwa upande mwingine.

source: If the required texts for either cover are too voluminous to fit legibly, you should put the first ones listed (as many as fit reasonably) on the actual cover, and continue the rest onto adjacent pages.
ja: もしどちらかの表紙に要求されるカバーテキストの量が多すぎて読みやすく収 めることが不可能ならば、あなたはテキスト先頭の一文(あるいは適切に収まる だけ)を実際の表紙に載せ、続きは隣接したページに載せるべきです。
sw: Kama nakala zinazotakiwa kwa ajili ya majalada yote ni nyingi sana ili kutosha vizuri, unatakiwa kuweka za kwanza zikiwa zimeorodheshwa (nyingi kadri zitakavyotosha) katika jalada halisi, na kuendelea na zinazofwata katika kurasa za karibu.

source: If you publish or distribute Opaque copies of the Document numbering more than 100, you must either include a machine-readable Transparent copy along with each Opaque copy, or state in or with each Opaque copy a publicly-accessible computer-network location, containing a complete Transparent copy of the Document, free of added material, which the general network-using public has access to download anonymously, at no charge, using public-standard network protocols. If you use the latter option, you must take reasonably prudent steps, when you begin distribution of Opaque copies in quantity, to ensure that this Transparent copy will remain thus accessible at the stated location, until at least one year after the last time you distribute an Opaque copy (directly or through your agents or retailers) of that edition to the public.
ja: あなたが文書の「非透過的」複製物を100部を超えて出版あるいは頒布する場合、それぞれの非透過な複製物と一緒に機械で読み取り可能な透過的複製物を添付するか、それぞれの非透過な複製物(あるいはそれに付属する文書)中で、公にアクセス可能なコンピュータネットワーク上の所在地を記述しなければなりません。その場所には、非透過な複製物と内容的に寸分違わず、余計なものが 追加されていない完全な文書の透過的複製物が置かれ、またそこから、ネットワークを利用する一般公衆が、一般に標準的と考えられるネットワークプロ トコルを使ってダウンロードすることができなければなりません。もしあなたが後者の選択肢を選ぶならば、その版の非透過な複製物を公衆に(直接、あるいは あなたの代理人ないし小売業者が)最後に頒布してから最低1年間は、その透過的複製物が指定の場所でアクセス可能であり続けることを保証するよう、非透 過な複製物の大量頒布を始める際に十分に慎重な手順を踏まなければならなりません。
sw: Kama ukichapisha au kusambaza nakala Zisizo Angavu za Nyaraka idadi zaidi ya 100, lazima aidha ujumuishe nakala Angavu isomwayo na mashine pamoja na nakala Isiyo Angavu, au tamka kwenye au kwa kila nakala Isiyo Angavu eneo linalofikika na umma la mtandao wa kompyuta, lenye nakala kamili Angavu ya Nyaraka, isiyokuwa na nyongeza yoyote, ambayo mtandao wa ujumla wa umma una uwezo wa kupakua bila kujulikana, bila gharama yoyote, kwa kutumia kanuni za kawaida za mtandao wa umma. Kama ukitumia chaguo la mwisho, lazima uchukue hatua kwa uangalifu, ukianza usambazaji wa nakala Zisizo Angavu kwa idadi, kuhakikisha hii nakala Angavu itabakia ikipatikana katika eneo tajwa, mpaka angalau mwaka mmoja tangu mara ya mwisho umegawa nakala Isiyo Angavu (mwenyewe au kupitia mawakala wako au wauzaji wa rejareja) wa toleo hilo kwa umma.

source: It is requested, but not required, that you contact the authors of the Document well before redistributing any large number of copies, to give them a chance to provide you with an updated version of the Document.
ja: これは要望であり必要条件ではないが、文書の著者に、文書の更新された版をあなたに提供する機会を与えるため、透過非透過を問わず大量の複製物を再頒布し始める前には彼らにきちんと連絡しておいて下さい。
sw: Inaombwa na sio lazima, kwamba uwasiliane na waandishi wa nyaraka kabla ya kusambaza upya idadi kubwa ya nakala, kuwapa nafsi ya kukupa toleo lililosasishwa la nyaraka.

source: MODIFICATIONS
ja: 改変
sw: MABADILIKO

source: You may copy and distribute a Modified Version of the Document under the conditions of sections 2 and 3 above, provided that you release the Modified Version under precisely this License, with the Modified Version filling the role of the Document, thus licensing distribution and modification of the Modified Version to whoever possesses a copy of it. In addition, you must do these things in the Modified Version:
ja: 文書の改変版を、この利用許諾契約書と細部まで同一の契約の下で発表する限り、すなわち原本の役割を改変版で置き換えた形での頒布と改変を、その複製物を所有するすべての人々に許可する限り、あなたは改変版を上記第2項および第3項が指定する条件の下で複製および頒布することができます。さらに、あなたは改変版において以下のことを行わなければなりません。
sw: Unaweza kunakili na kusambaza Toleo Lililobadilishwa la Nyaraka chini ya masharti ya kifungu 2 na 3 juu, ikiwa kwamba unatoa Toleo Lililobadilishwa chini ya Leseni hii, na Toleo Lililobadilishwa likichukua jukumu la Nyaraka, hivyo usambazaji wa leseni na ubadilishaji wa Toleo Lililobadilishwa kwa yoyote anaemiliki nakala yake. Kwa zaidi, unatakiwa kufanya haya mambo kwenye Toleo Lililobadilishwa.

source: Use in the Title Page (and on the covers, if any) a title distinct from that of the Document, and from those of previous versions (which should, if there were any, be listed in the History section of the Document). You may use the same title as a previous version if the original publisher of that version gives permission.
ja: 題扉に(もしあればその他の表紙にも)、文書および文書のそれ以前の版と見分けがつく題名を載せること(もし以前の版があれば、文書の「履歴 (History)」の部分に列記されているはずです)。もし元の版の出版者から許可を得たならば、以前の版と同じ題名を使っても良いです。
sw: Tumia katika Ukurasa wa Mada (na kwenye majalada kama yapo) mada tofauti kutoka ile ya Nyaraka, na zile za matoleo ya nyuma (ambazo zinatakiwa, kama zilikwepo kuorodheshwa katika kifungu cha Historia cha Nyaraka). Unaweza kutumia mada sawa na ya toleo la nyuma kama mchapishaji halisi wa toleo hilo akitoa ruhusa.

source: List on the Title Page, as authors, one or more persons or entities responsible for authorship of the modifications in the Modified Version, together with at least five of the principal authors of the Document (all of its principal authors, if it has less than five).
ja: 題扉に、改変版における改変を行った1人以上の人物 か団体名を列記すること。あわせて元の『文書』の著者として、最低5人(も し5人以下ならばすべて)の主要著者を列記すること。
sw: Orodha kwenye Ukurasa wa Mbele, kama waandishi, mtu mmoja au zaidi au vyombo vilivyohusika na uandishi wa mabadiliko katika Matoleo Mapya, pamoja na japo waandishi wakuu watano wa Nyaraka (waandishi wakuu wote, kama ina chini ya watano).

source: State on the Title page the name of the publisher of the Modified Version, as the publisher.
ja: 改変版の出版者名を出版者として記載すること。
sw: Tamka katika ukurasa wa mbele jina la mchapishaji wa Toleo Lililobadilishwa, kama mchapishaji.

source: Preserve all the copyright notices of the Document.
ja: 文書にあるすべての著作権表示を残すこと。
sw: Hifadhi notisi za hakimiliki zote za Nyaraka.

source: Add an appropriate copyright notice for your modifications adjacent to the other copyright notices.
ja: 他の著作権表示の近くに、あなたの改変に対する適 当な著作権表示を追加すること。
sw: Ongeza notisi sahihi ya hakimiliki kwa mabadiliko yake karibu na na notisi nyingine za hakimiliki.

source: Include, immediately after the copyright notices, a license notice giving the public permission to use the Modified Version under the terms of this License, in the form shown in the Addendum below.
ja: 著作権表示のすぐ後に、改変版をこの契約書の条件 の下で利用することを公衆に対して許可する告知を含めること。その形式はこの契約書の末尾にある付記で示されている。
sw: Jumuisha, baada tu ya notisi za hakimiliki, notisi ya leseni kuupa umma ruhusa ya kutumia Toleo Lililobadilishwa chini ya sheria za Leseni, katika mfumo ulioonyeshwa katika kiambatanisho chini.

source: Preserve in that license notice the full lists of Invariant Sections and required Cover Texts given in the Document's license notice.
ja: 元の『文書』の利用許諾告知に書かれた、変更不可部分の完全な一覧と、要求されるカバーテキストとを、改変版の利用許諾告知でもそのまま残すこと。
sw: Hifadhi katika notisi hiyo ya leseni orodha kamili ya Vifungu Visivyoathirika na Nakala za Jalada zinazotakiwa zilizotolewa katika notisi ya leseni ya Nyaraka.

source: Include an unaltered copy of this License.
ja: この契約書の、変更されていない複製物を含めること。
sw: Ongeza nakala isiyobadilishwa ya Leseni hii.

source: Preserve the section entitled "History", and its title, and add to it an item stating at least the title, year, new authors, and publisher of the Modified Version as given on the Title Page. If there is no section entitled "History" in the Document, create one stating the title, year, authors, and publisher of the Document as given on its Title Page, then add an item describing the Modified Version, as stated in the previous sentence.
ja: 「履歴 (History)」と題された部分とその題名を保 存し、そこに改変版の、少なくとも題名、出版年、新しく変更した部分の著者名、出版者名を、題扉に掲載するのと同じように記載した一項を加えること。もし文書中に「履歴」と題された部分が存在しない場合には、文書の題名、出版年、著者、出版者を題扉に掲載するのと同じように記載した部分を用意し、上記で述べたような、改変版を説明する一項を加えること。
sw: Hifadhi kifungu kiitwacho "Historia", na mada yake, na iongezee kifaa kinachosema japo mada, mwaka, waandishi wapya, na mchapishaji wa Toleo Lililobadilishwa kama ilivyo kwenye Ukurasa wa Mada. Kama hakuna kifungu kiitwacho "Historia" katika Nyaraka, tengeneza moja inayosema mada, mwaka, waandishi, na mchapishaji wa Nyaraka kama ilivyo kwenye Ukurasa wa Mada, kisha ongeza kifaa kinacholelezea Toleo Lililobadilishwa, kama ilivyoelezwa kwenye sentensi iliyopita.

source: Preserve the network location, if any, given in the Document for public access to a Transparent copy of the Document, and likewise the network locations given in the Document for previous versions it was based on. These may be placed in the "History" section. You may omit a network location for a work that was published at least four years before the Document itself, or if the original publisher of the version it refers to gives permission.
ja: 文書中に、文書の透過的複製物への公共的アクセスのために指定されたネットワーク的所在地が記載されていたならば、 それを保存すること。同様に、その『文書』の元になった以前の版で指定されていたネットワーク的所在地も載っていたならば、それも保存すること。これらの情報は「履歴(History)」の部分に置いても良いです。ただし、それが 文書自身より少なくとも4年前に出版された著作物の情報であったり、あるいは改変版が参考にしている版の元々の出版者から許可を得たならば、その情報を削除してもかまいません。
sw: Hifadhi eneo la mtandao, kama lipo, ikiwa katika Nyaraka kwa ajili ya ufikivu wa umma kwenye nakala Wazi ya Nyaraka, na hivyo hivyo maeneo ya mtandao yaliyo kwenye Nyaraka kwa ajili ya matoleo yaliyopita iliyokuwa ikijikita. Hizi zinaweza kuwekwa kwenye kifungu "Historia". Unaweza kuondoa eneo la mtandao kwa kazi ambayo ilichapishwa japo miaka miine kabla ya Nyaraka yenyewe, au mchapishaji halisi wa toleo husika akiruhusu.

source: In any section entitled "Acknowledgements" or "Dedications", preserve the section's title, and preserve in the section all the substance and tone of each of the contributor acknowledgements and/or dedications given therein.
ja: 「謝辞 (Acknowledgement)」あるいは「献辞 (Dedication)」等と題されたいかなる部分も、その部分の題名を保存し、その部分の内容(各貢献者への謝意あるいは献呈の意)と語調を保存すること。
sw: Katika kifungu chochote kilichoandikwa "Shukrani" au "Kujitolea", hifadhi mada za vifungu, na hifadhi kwenye vifungu vitu vyote na muonekano wa kila Shukrani ya mchangiaji na/au kujitolea yaliyotolewa.

source: Preserve all the Invariant Sections of the Document, unaltered in their text and in their titles. Section numbers or the equivalent are not considered part of the section titles.
ja: 『文書』の変更不可部分を、その本文および題名を 変更せずに保存すること。章番号やそれに相当するものは部分の題名の一部とは見做さない。
sw: Hifadhi Vifungu vyote Visivyoathirika vya Nyaraka, bila kubadilishwa nakala na katika sheria zake. Nambari za Vifungu au kinachofanania hazichukuliwi kama sehemu ya kichwa cha kifungu.

source: Delete any section entitled "Endorsements". Such a section may not be included in the Modified Version.
ja: 「推薦の辞 (Endorsement)」というような章名が題された部分はすべて削除すること。そのような部分を改変版に含めてはいけません。
sw: Futa kifungu chochote kiitwacho "Idhini". Kifungu kama hicho hakitakiwi kuwepo katika Toleo Lililobadilishwa.

source: Do not retitle any existing section as "Endorsements" or to conflict in title with any Invariant Section.
ja: すでに存在する部分を「推薦の辞 (Endorsement)」 と題されるように改名したり、題名の点で変更不可部分のどれかと抵触するように改名してはいけません。
sw: Hutakiwi kukipa upya jina "Idhini" kipengele chochote kilichopo au kuingiliana majina na Kipengele Kisichobadilika chochote.

source: If the Modified Version includes new front-matter sections or appendices that qualify as Secondary Sections and contain no material copied from the Document, you may at your option designate some or all of these sections as invariant. To do this, add their titles to the list of Invariant Sections in the Modified Version's license notice. These titles must be distinct from any other section titles.
ja: もし改変版に、補遺部分としての条件を満たし、かつ文書から複製物され た文章や図などをいっさい含んでいない、前書き的な章あるいは付録が新しく含まれるならば、あなたは希望によりそれらの部分の一部あるいはすべてを変更不可と宣言することができます。変更不可を宣言するためには、それらの部分の題名を改変版の利用許諾告知中の変更不可部分一覧に追加すれば良いです。これらの題名は他の章名とは全く別のものでなければなりません。
sw: Kama Toleo Lililobadilishwa linajumuisha vifungu vya mambo ya mbele vipya au viambatanisho ambavyo vina sifa kama Vifungu vya Sekondari na havina kitu chochote kilichonakiliwa kutoka kwenye Nyaraka, unaweza kwa uamuzi wako mwenyewe kuteua baadhi au vifungu vyote hivi kuwa Visivyobadilika. Kufanya hivi, ongeza vichwa vyao vya habari kwenye orodha ya Vifungu Visivyobadilika katika Matoleo Yaliyobadilishwa ya notisi ya leseni. Hivi vichwa vya habari lazima viwe tofauti na vile vya vifungu vingine.

source: You may add a section entitled "Endorsements", provided it contains nothing but endorsements of your Modified Version by various parties--for example, statements of peer review or that the text has been approved by an organization as the authoritative definition of a standard.
ja: 含まれる内容が、さまざまな集団によるあなたの改変版に対する推薦の辞のみである限り、あなたは、「推薦の辞 (Endorsement)」と題された章を追加することができます。推薦の辞の例としては、ピアレビュー（内容審査）の陳述、あるいは文書がある標準の権威ある定義としてその団体に承認されたという声明などがあります。
sw: Unaweza kuongeza kipengele kiitwacho "Idhini", ikiwa kwamba haina kitu kingine lakini idhini au uthibitisho wa Toleo Lako jipya kutoka kwa makundi mbali mbali--kwa mfano, kauli ya mapitio ya watu au kwamba nakala imeidhinishwa na shirika au mamlaka ya ufafanuzi wa viwango.

source: You may add a passage of up to five words as a Front-Cover Text, and a passage of up to 25 words as a Back-Cover Text, to the end of the list of Cover Texts in the Modified Version. Only one passage of Front-Cover Text and one of Back-Cover Text may be added by (or through arrangements made by) any one entity. If the Document already includes a cover text for the same cover, previously added by you or by arrangement made by the same entity you are acting on behalf of, you may not add another; but you may replace the old one, on explicit permission from the previous publisher that added the old one.
ja: あなたは、 5語までの一文を表カバーテキストとして、 25語までの文を裏表紙テキストとして、改変版のカバーテキスト一覧の末尾に加えることができます。 一個人ないし一団体が直接(あるいは団体内で結ばれた協定によって)加えることができるのは、表カバーテキストおよび裏カバーテキストとしてそれぞれ一 文ずつのみである。もし以前すでにその文書において、表裏いずれかの表紙にあなたの(またはあなたが代表する同じ団体内で為された協定に基づく)カバー テキストが含まれていたならば、あなたが新たに追加することはできません。しかしあなたは、その古い文を加えた以前の出版者から明示的な許可を得たならば、古い文を置き換えることができます。
sw: Unaweza kuongeza kifungu cha mpaka maneno matano kama Nakala ya Jalada la Mbele, na kiungu cha mpaka maneno 25 kama Nakala ya Jalada la Nyuma, kwenye mwisho wa orodha ya Nakala za Majalada katika Toleo Lililobadilishwa. Kifungu kimoja tu cha Nakala ya Jalada la Mbele na Nakala ya Jalada la Nyuma kinaweza kuongezwa na (au kupitia mipango iliyofanywa na) chombo chochote kimoja. Kama nyaraka tayari inajumuisha nakala ya jalada kutoka kwenye jalada hilo hilo, iliyoongezwa kabla na wewe au kwa mpango uliofanywa na chombo kile kile ambacho unakitumikia, huwezi kuongeza nyingine; lakini unaweza kuwa mbadala wa lililokuwepo, kwa ruhusa ya wazi kutoka kwa mchapishaji aliyeongeza ya zamani.

source: The author(s) and publisher(s) of the Document do not by this License give permission to use their names for publicity for or to assert or imply endorsement of any Modified Version.
ja: 文書の著者あるいは出版者は、この利用許諾契約書によって、彼らの名前を利用することを許可しているわけではありません。彼らの名前を改変版の宣伝に使ったり、改変版への明示的あるいは黙示的な保証のために使うことを許可するものではありません。
sw: Mwandishi (waandishi) na mchapishaji (wachapishaji) wa nyaraka hawatoi ruhus akwa leseni hii kutumia majina yao kwa utangazaji au kwa madai au kama idhini ya Toleo lolote jipya.

source: COMBINING DOCUMENTS
ja: 文書の結合
sw: KUJUMUISHA NYARAKA

source: You may combine the Document with other documents released under this License, under the terms defined in section 4 above for modified versions, provided that you include in the combination all of the Invariant Sections of all of the original documents, unmodified, and list them all as Invariant Sections of your combined work in its license notice.
ja: あなたは、上記第4項において改変版に関して定義された条件の下で、この利用許諾契約書の下で発表された複数の文書を一つにまとめることができます。その際、原本となる文書にある変更不可部分を全て、改変せずに結合後の著作物中に含め、それらをあなたが統合した著作物の変更不可部分としてその利用許諾告知において列記し、かつ原本にある全ての保証否認警告を保存しなければなりません。
sw: Unaweza kuunganisha Nyaraka hiyo na Nyaraka nyingine zilizotolewa chini ya Leseni hii, chini ya masharti yaliyofafanuliwa katika kifungu 4 juu kwa matoleo yaliyobadilishwa, ikiwa kwamba unajumuisha katika muunganiko Vifungu vyote Visivyoathirika vya nyaraka zote halisi, ambazo hazijabadilishwa, na kuziorodhesha zote kama Vifungu Visivyoathirika vya kazi yako katika notisi yake ya leseni.

source: The combined work need only contain one copy of this License, and multiple identical Invariant Sections may be replaced with a single copy. If there are multiple Invariant Sections with the same name but different contents, make the title of each such section unique by adding at the end of it, in parentheses, the name of the original author or publisher of that section if known, or else a unique number. Make the same adjustment to the section titles in the list of Invariant Sections in the license notice of the combined work.
ja: 結合後の著作物についてはこの契約書の複製物を一つ含んでいればよく、同一内容の変更不可部分が複数ある場合には一つで代用してよいです。もし同じ題名だが内容の異なる変更不可部分が複数あるならば、そのような部分のそれぞれの題名の最後に、(もし分かっているならば)その部分の原著者あるいは出版者の名前で、あるいは他と重ならないような番号を括弧で括って記載することで、 それぞれ見分けが付くようにしなければなりません。結合後の著作物の利用許諾告知における変更不可部分の一覧においても、章の題名に同様の調整をするこ と。
sw: Kazi iliyounganishwa inahitaji kuwa na nakala moja ya hii Leseni, na Vifungu Visivyoathirika vingi vinavyofanana vinaweza kubadilishwa na nakala moja. Kama kuna Vifungu Visivyoathirika vingi vyenye jina moja lakini maudhui tofauti, fanya kichwa cha kila kifungu kuwa cha kipekee kwa kuongeza mwishoni mwake, katika mabano, jina la mwandishi halisi au mchapishaji wa kifungu hicho kama anajulikana, au namba ya kipekee. Fanya mabadiliko hayo hayo kwenye vichwa vya vifungu katika orodha ya Vifungu Visivyoathirika kwenye notisi ya leseni ya kazi iliyojumuishwa.
