Repository: DSigmund/doc-admin
Catalog: i18n/doc-admin.*.po
Languages: ja, ru, sw

source: Currently OTRS provides only init.d scripts for Linux platforms.
ja: 現在、OTRSは、Linuxプラットフォームのinit.d スクリプトだけを提供します。
ru: В настоящее время OTRS предоставляет сценарии init.d только для Linux-платформ.
sw: Kwa sasa OTRS inatoa hati za init.d tu kwa majukwaa ya Linux.

source: List of init scripts and supported Operating Systems
ja: テーブル4.7. init.d スクリプトのリストとサポートされるオペレーティング・システム
ru: Список init сценариев и поддерживаемых Операционных систем
sw: Orodha ya hati za init.d na mifumo endeshi inayotumika nayo

source: Supported OS
ja: サポートするOS
ru: Поддерживаемы операционные системы
sw: Mfumo endeshi unaokubalika

source: Example to start the OTRS Scheduler on linux
ja: Linux上でOTRSを開始するサンプル
ru: Пример для запуска OTRS-Планировщика в linux
sw: Mfano kuanzisha Mratibu wa OTRS kwenye linux

source: Available Actions
ja: 可能なアクション
ru: Возможные действия
sw: Vitendo vilivyopo.

source: <command>start</command> to start the OTRS Scheduler process.
ja: <command>start</command> - OTRSスケジューラ・プロセスを開始
ru: <command>start</command> запуск процесса OTRS-Планировщика.
sw: <command>anza</command> Kuanza mchakato wa Mratibu wa OTRS.

source: <command>stop</command> to stop the OTRS Scheduler process.
ja: <command>stop</command> - OTRSスケジューラ・プロセスを停止。
ru: <command>stop</command> остановка процесса OTRS-Планировщика.
sw: <command>sitisha</command> kusitisha mchakato wa Mratibu wa OTRS.

source: <command>restart</command> to restart the OTRS Scheduler process.
ja: <command>restart</command> - OTRSスケジューラ・プロセスを再開。
ru: <command>restart</command> перезапуск процесса OTRS-Планировщика.
sw: <command>anza upya</command> kuanza upya mchakato wa Mratibu wa OTRS.

source: <command>status</command> to query the OTRS Scheduler process status.
ja: <command>status</command> - OTRSスケジューラ・プロセス・ステータスをクエリー
ru: <command>status</command> запросить статус процесса OTRS-Планировщика.
sw: <command>hali</command> kuuliza hali ya mchakato wa Mratibu wa OTRS.

source: The Scheduler needs the database to be available to register its Process ID, for this reason is necessary to:
ja: スケジューラは、そのプロセスIDを登録することができるようにデータベースを必要とします。というのは、この理由は次のものに必要であるからです:
ru: Для корректной работы Планировщика необходима база данных, поскольку он регистрирует свой ID процесса, именно по этой причине необходимо:
sw: Mratibu anahitaji hifadhidata ipatikane kusajili kitambulisho chake cha Mchakato, kwasababu hii ni muhimu ku:

source: Execute the Scheduler init.d script to <emphasis>start</emphasis> the Scheduler process after the database process is up and running.
ja: データベース・プロセスの活動開始以後、スケジューラ・プロセスを<emphasis>開始する</emphasis>ためにスケジューラinit.d スクリプトを実行します。
ru: Выполните скрипт init.d для <emphasis>запуска</emphasis> процесса Планировщика, после того как запущен процес базы данных.
sw: Tekeleza hati ya init.d ya Mratibu ili <emphasis>kuanza</emphasis> mchakato wa Mratibu baada ya mchakato wa hifadhidata kuamka na kuanza kazi.

source: Execute the Scheduler init.d script to <emphasis>stop</emphasis> the Scheduler before the database process shuts down.
ja: データベース・プロセスがシャット・ダウンする前に、スケジューラを<emphasis>停止</emphasis>ためにスケジューラinit.d スクリプトを実行します。
ru: Выполните скрипт init.d для <emphasis>остановки</emphasis> процесса Планировщика, до того как процес базы данных остановлен.
sw: Tekeleza hati ya init.d ya Mratibu ili <emphasis>kusitisha</emphasis> mchakato wa Mratibu baada ya mchakato wa hifadhidata kuzimwa.

source: If you want the Scheduler to run at system startup, please read the documentation of the operating system to find out the right location to place the init.d scripts, how to configure them to run automatically and how to set the run order.
ja: スケジューラがシステム起動時に開始することを望むなら、オペレーティング・システムのドキュメンテーションを読んで、init.dスクリプトを置く正しい場所、それらの自動的に開始するための構成方法及び起動順の設定方法を見つけて下さい。
ru: Если вы желаете, чтобы Планировщик стартовал при загрузке системы, обратитесь к документации на операционную систему. Там вы найдете куда поместить скрипты init.d и как их настроить для автоматического старта, а также указать порядок их выполнения.
sw: Ukitaka Mratibu afanye kazi wakati wa uwashaji wa Mfumo, tafadhali soma waraka wa mfumo endeshi kujua sehemu sahihi ya kuweka hati za init.d, jinsi ya kufanya usanidi ziweze kuanza kiotomatiki na kuseti oda yao ya kazi.

source: Scheduler Daemon File
ja: スケジューラ・デーモン・ファイル
ru: Файл "Демона" Планировщика
sw: Faili la Daemon la Mratibu

source: This is the part of the Scheduler that stays running in the background checking for tasks to execute. It also provides the main functions to control the process.
ja: これは、実行すべきタスクをチェックしながらバックグラウンドで稼働し続けるスケジューラの部分です。さらに、それは、プロセスをコントロールするために主機能を提供します。
ru: Это часть Планировщика, который остается работать в фоновом режиме, проверяя задания, которые нужно выполнить. Она также обеспечивает основные функции для управления процессом.
sw: Hii ni sehemu ya Mratibu inayobakia ikifanya kazi katika mazingira ya nyuma kukagua kazi za kutekeleza. Pia inatoa kazi za muhimu kudhibiti mchakato.

source: All Unix / Linux uses the file <command>OTRS_HOME/bin/otrs.Scheduler.pl</command>.
ja: 全てのUnix/Linuxはファイル <command>OTRS_HOME/bin/otrs.Scheduler.pl</command>を使用します。
ru: Все Unix / Linux системы используют файл <command>OTRS_HOME/bin/otrs.Scheduler.pl</command>.
sw: Unix / Linux zote zinatumia faili <command>OTRS_HOME/bin/otrs.Scheduler.pl</command>.

source: Example To Start The OTRS Scheduler
ja: OTRSスケジューラを開始するサンプル
ru: Пример для Запуска OTRS-Планировщика
sw: Mfano Kuanza Mratibu wa OTRS

source: Available Options
ja: 利用可能なオプション
ru: Доступные Опции
sw: Machaguo Yaliyopo

source: <command>-a </command> action.
ja: <command>-a </command> アクション
ru: <command>-a </command> действие.
sw: <command>-a </command> kitendo.

source: <command>start</command>- to start the Scheduler process.
ja: <command>start</command> - スケジューラ・プロセスを開始。
ru: <command>start</command>- старт процесса Планировщика.
sw: <command>anza</command>-kuanza mchakato wa Mratibu.

source: <command>stop</command>- to stop the Scheduler process.
ja: <command>stop</command> - スケジューラ・プロセスを停止。
ru: <command>stop</command>- остановка процесса Планировщика.
sw: <command>sitisha</command>- kusitisha mchakato wa Mratibu.

source: <command>status</command>- to query Scheduler process status.
ja: <command>status</command> - スケジューラ・プロセス状態のクエリー。
ru: <command>status</command>- для запроса статуса процесса Планировщика.
sw: <command>hali</command>- kuuliza hali ya mchakato wa Mratibu.

source: <command>-f </command> to force the start or stop of the Scheduler process.
ja: <command>-f </command> スケジューラ・プロセスの強制的開始または停止。
ru: <command>-f </command> принудительный старт или остановка процесса Планировщика.
sw: <command>-f </command> kulazimisha kuanza au kusitisha mchakato wa Mratibu.

source: Example to force stop the OTRS Scheduler
ja: OTRSスケジューラを強要停止するサンプル
ru: Пример принудительной остановки Планировщика OTRS
sw: Mfano kulazimisha kusitisha Mratibu wa OTRS

source: Force stop the Scheduler is used remove the process ID from the database when the scheduler is not running and the process is still registered.
ja: スケジューラが走っておらず、プロセスがまだ登録されている時に、スケジューラを強制終了させることは、データベースからプロセスIDを取り除くことになります。
ru: Принудительная остановка Планировщика используется для удаления ID процесса из базы данных когда планировщик не работает и процесс остается зарегистрированным.
sw: Kusitisha Mratibu kwa lazima inatumika kuondoa kitambulisho cha mchakato kutoka kwenye hifadhidata wakati mratibu hafanyi kazi na mchakato bado umesajiliwa.

source: Force start the Scheduler is used to start the Scheduler process if the scheduler is not running and the process is registered.
ja: スケジューラが走っておらず、プロセスがまだ登録されていれば、スケジューラを強制終了させることは、スケジューラプロセスを開始することになります。
ru: Принудительный запуск Планировщика используется для старта его процесса, когда планировщик не работает и процесс зарегистрирован.
sw: Kuanzisha Mratibu kwa lazima inatumika kuanza mchakato wa Mratibu kama mratibu hafanyi kazi na mchakato bado umesajiliwa.

source: Force start or stop are only necessary if the start of the process is needed to be done before the process update time expires. Otherwise an expired entry in the database is discarded by normal start.
ja: 強制開始または強制停止は、プロセス開始がプロセス更新時間が失効する前になされる必要な場合のみ必要です。そうでなければ データベース内の失効エントリーは通常開始で破棄されます。
ru: Принудительные старт и остановка необходимы только если старт процесса необходимо выполнить до того как время обновления процесса истекло. В противном случае, истек запись an expired entry in the database is discarded by normal start.
sw: Kuanzisha au kusitisha kwa lazima ni muhimu kama kuanza kwa mchakato kunahitajika kufanyika kabla ya muda wa kusasisha mchakato haujaisha. La sivyo ingizo lilokwisha muda wake kwenye hifadhidata linapuuzwa na uanzaji wa kawaida.

source: Scheduler Service Installer
ja: スケジューラ・サービス・インストーラー
sw: Kisanikishi cha Huduma za Mratibu

source: On Windows, the OTRS Scheduler is registered as a Service via the Windows Service Control Manager (SCM). In order to have the OTRS Scheduler process to be controlled by the SCM is necessary to register this service. If you used the Windows Installer this is taken care of by the installer, and there are no manual actions required.
ja: Windowにおいては、OTRSスケジューラがWindow・サービス・コントロール・マネージャー(SCM)によってサービスとして登録されます。OTRSスケジューラを持つためには、SCMによってコントロールされるプロセスがこのサービスを登録する必要があります。Windowインストーラを使用した場合インストーラによって処理され、手動のアクションは必要ありません。
sw: Katika Windows, Mratibu wa OTRS amesajiliwa kama mchakato kupitia Meneja Udhibiti wa Huduma wa Windows (SCM). Ili kuufanya mchakato wa Mratibu wa OTRS kudhibitiwa na SCM ni muhimu kuanzisha huduma hii. Kama ulitumia kisakinishi cha Windows hii itashughulikiwa na kisakinishi, na hakuna vitendo vinavyohitajika visivyokuwa vya otomatiki.

source: OTRS provides the script <command>OTRS_HOME/bin/otrs.Scheduler4WinInstaller.pl</command> to register or unregister the OTRS Scheduler into the SCM.
ja: OTRSは、SCMへOTRSスケジューラを登録するか登録解除するためにスクリプト<command>OTRS_HOME/bin/otrs.Scheduler4WinInstaller.pl</command>を提供します。
sw: OTRS inatoa hati <command>OTRS_HOME/bin/otrs.Scheduler4WinInstaller.pl</command> kusajili au kutosajili Mratibu wa OTRS kwenye SCM.

source: Registering and de-registering can only be performed by members of the Administrator group on Windows. You might need to right-click on cmd.exe and select 'Run as Administrator' before you can register the service correctly.
ja: 登録および登録解除することはウィンドウズ上の管理者グループのメンバーによってのみ行なわれます。サービスを正確に登録する前に、cmd.exeを右クリックし、「管理者として運用」を選択するします。
sw: Kujisajili na kujiondoa vinaweza kufanywa na wanachama wa kundi la msimamizi katika Windows. Unaweza kuhitaji kubofya kulia katika cmd.exe na kuchagua 'Anzisha kama Msimamizi' kabla ya kusajili huduma kwa usahihi.

source: Example to register the OTRS Scheduler as a Windows Service
ja: WindowsサービスとしてOTRSスケジューラを登録するサンプル
sw: Mfano kusajili Mratibu wa OTRS kama Huduma ya Windows

source: <command>install</command>- to install the Scheduler process into the Windows SCM.
ja: <command>install</command>- ウィンドウズSCMへスケジューラ・プロセスをインストールしてください。
sw: <command>sakinisha</command>- kusakinisha mchakato wa Mratibu kweye Windows.

source: <command>remove</command>- to remove the Scheduler process from the Windows SCM.
ja: <command>remove</command>- ウィンドウズSCMからスケジューラ・プロセスを取り除いてください。
sw: <command>ondoa</command>- kuondoa mchakato wa Mratibu kutoka kwenye Windows.

source: After installing into the Windows SCM the OTRS Scheduler process can be used like any other service on Windows. It can be started, stopped and restarted and can be configured to be started manually or automatic.
ja: WindowsSCMへインストール後、OTRSスケジューラ・プロセスはウィンドウズ上で他のサービスのように使用することができます。それは開始、停止、再開することができ、手動あるいは自動での開始を構成できます。
sw: Baada ya usakinishaji kwenye Windows SCM mchakato wa Mratibu wa OTRS unaweza kutumika kama mchakato mwingine wowote katika Windows. Unaweza kuanzishwa, kusitishwa na kuanzishwa upya na inaweza kusanidiwa kuanzishwa kiotomatiki au kwa mikono.

source: To learn more about Windows Services and the Windows SCM please read the Windows documentation, and Microsoft online help.
ja: ウィンドウズ・サービスおよびウィンドウズSCMに関してもっと学習するために、ウィンドウズ・ドキュメンテーションおよびマイクロソフト・オンライン・ヘルプを読んでください。
sw: Kujifunza zaidi kuhusu Huduma za Windows na Windows SCM tafadhali soma nyaraka ya Windows, na usaidizi wa kwenye mtandao wa Microsoft.

source: Scheduler Service File
ja: スケジューラ・サービス・ファイル
sw: Faili la Huduma la Mratibu

source: Example to start the OTRS Scheduler on Windows
ja: ウィンドウズ上のOTRSスケジューラを開始するサンプル
sw: Mafano kuanza Mratibu wa OTRS kwenye Windows

source: Example to force stop the OTRS Scheduler on Windows
ja: Windows上でOTRSスケジューラを強制停止するサンプル
sw: Mfano kulazimisha kusitisha Mratibu wa OTRS kwenye Windows

source: Force stopping the Scheduler is used to remove the process ID from the database when the scheduler is not running and the process is still registered.
ja: スケジューラが走っておらず、プロセスがまだ登録されている時に、スケジューラを強制終了させることは、データベースからプロセスIDを取り除くことになります。
sw: Kusitisha Mratibu kwa lazima inatumika kuondoa kitambulisho cha mchakato kutoka kwenye hifadhidata wakati mratibu hafanyi kazi na mchakato bado umesajiliwa.

source: Force starting the Scheduler is used to start the Scheduler process if the scheduler is not running and the process is still registered.
ja: スケジューラが走っておらず、プロセスがまだ登録されていれば、スケジューラを強制開始することは、スケジューラプロセスを開始することになります。
sw: Kuanzisha Mratibu kwa lazima inatumika kuanza mchakato wa Mratibu kama mratibu hafanyi kazi na mchakato bado umesajiliwa.

source: Force start or stop are only necessary if starting the process is needed to be done before the process update time expires. Otherwise an expired entry in the database would be discarded by a normal start.
ja: 強制開始または強制停止は、プロセス開始がプロセス更新時間が失効する前になされる必要な場合のみ必要です。そうでなければデータベース内の失効エントリーは通常開始で破棄されます。
sw: Kuanzisha au kusitisha kwa lazima ni muhimu kama kuanza kwa mchakato kunahitajika kufanyika kabla ya muda wa kusasisha mchakato haujaisha. La sivyo ingizo lilokwisha muda wake kwenye hifadhidata linapuuzwa na uanzaji wa kawaida.

source: Sending/Receiving emails
ja: Eメールの送信/受信
ru: Отправка / получение электронной почты
sw: Kutuma/Kupokea barua pepe

source: Sending emails
ja: Eメールの送信
ru: Отправка почты
sw: Kutuma barua pepe

source: Via Sendmail (default)
ja: Sendmail(デフォルト)経由。
ru: через Sendmail (по умолчанию)
sw: Kupitia TumaBaruapepe (chaguo-msingi)

source: OTRS can send out emails via <ulink url="http://www.sendmail.org/">Sendmail</ulink>, <ulink url="http://www.postfix.org/">Postfix</ulink>, <ulink url="http://www.qmail.org">Qmail</ulink> or <ulink url="http://www.exim.org">Exim</ulink>). The default configuration is to use Sendmail and should work out-of-the-box.
ja: OTRSは、<ulink url="http://www.sendmail.org/">Sendmail</ulink>、<ulink url="http://www.postfix.org/">Postfix</ulink>、<ulink url="http://www.qmail.org">Qmail</ulink>あるいは<ulink url="http://www.exim.org">Exim</ulink>によってEメールを送信することができます。デフォルト構成はsendmailを使用し使用開始時に即稼働します。
ru: OTRS может отправлять сообщения электронной почты через <ulink url="http://www.sendmail.org/">Sendmail</ulink>, <ulink url="http://www.postfix.org/">Postfix</ulink>, <ulink url="http://www.qmail.org">Qmail</ulink> or <ulink url="http://www.exim.org">Exim</ulink>). По умолчанию используется Sendmail, он должен работать при установки системы "из коробки".
sw: OTRS inaweza kutuma nje barua pepe kupitia <ulink url="http://www.sendmail.org/">Tumabarua</ulink>, <ulink url="http://www.postfix.org/">Postfix</ulink>, <ulink url="http://www.qmail.org">Qmail</ulink> or <ulink url="http://www.exim.org">Exim</ulink>). Usanidi chaguo-msingi ni kutumia Tumabarua na inatakiwa kufanya kazi nje-ya-boksi.

source: You can configure the sendmail settings via the graphical configuration frontend (Framework::Core::Sendmail)
ja: グラフィカルな構成フロント・エンドによってsendmailの設定を構成することができます。(Framework::Core::Sendmail)
ru: Параметры sendmail можно настроить через графический веб-интерфейс для конфигурации (Framework::Core::Sendmail)
sw: Unaweza kusanidi mipangilio ya tumabarua kupitia mazingira ya mbele ya usanidi michoro (Kiunzi::Kiini::Tumabarua)

source: Via SMTP server or smarthost
ja: SMTPサーバまたは smarthost経由。
ru: Через SMTP-сервер или smarthost
sw: Kupitia SMTP au smarthost

source: OTRS can send emails via SMTP (<ulink url="http://www.ietf.org/rfc/rfc821.txt">Simple Mail Transfer Protocol / RFC 821</ulink>) or Secure SMTP. You will want to use this on non-UNIX platforms (e.g. Windows).
ja: OTRSは、SMTP(<ulink url="http://www.ietf.org/rfc/rfc821.txt">Simple Mail Transfer Protocol / RFC 821</ulink>)か安全なSMTPによってEメールを送信できます。非UNIXプラットフォーム(例えばウィンドウズ)上でこれを使用したいと思うでしょう。
sw: OTRS inaweza kutuma barua pepe kupitia SMTP (<ulink url="http://www.ietf.org/rfc/rfc821.txt">Simple Mail Transfer Protocol / RFC 821</ulink>) au SMTP iliyo salama. Utataka kutumia hii kwenye majukwaa yasiyo ya UNIX (mf. Windows).

source: The SMTP server settings can be configured via the SysConfig (Framework::Core::Sendmail). If you don't see SMTPS available as an option, the required Perl modules are missing. In that case, please refer to <link linkend="installation-of-perl-modules">"Installation of Perl modules required for OTRS"</link> for instructions.
ja: SMTPサーバー・セッティングは、SysConfig(Framework::Core::Sendmail)によって構成できます。オプションのSMTPSを利用可能として見つけることができないならば、必要なパール・モジュールがないということです。その場合は、<link linkend="installation-of-perl-modules">"OTRSに必要なパール・モジュールのインストレーション"</link>を参照してください。
ru: Параметры настройки SMTP-сервера могут быть сконфигурированны через SysConfig (Framework::Core::Sendmail). Если у вас нету SMTPS в качестве опции, значит вы пропустили установку соответствующих Perl-модулей. В таком случае, обратитесь пожалуйста к этой <link linkend="installation-of-perl-modules">"Установка Perl-модулей необходимых для работы OTRS"</link> инструкции.
sw: Mipangilio ya SMTP seva inaweza kusanidiwa kupitia SysConfig (Kiunzi::Kiini::Tumabarua). Kama huoni SMTP inayopatikana kama chaguo, moduli za perl zinazotakiwa hazipo. Katika kesi hiyo tafadhali tembelea <link linkend="installation-of-perl-modules">"Usakinishaji wa moduli za Perl zinazohitajika kwa aili ya OTRS"</link> kwa maelekezo.

source: Receiving emails
ja: Eメールの受信
ru: Получение сообщений электронной почты
sw: Kupokea barua pepe

source: Mail accounts configured via the OTRS GUI
ja: OTRS GUI OTRSで構成されたEメールアカウント
ru: Учетные записи электронной почты настраиваемые через графический пользовательский интерфейс OTRS
sw: Akaunti za barua pepe zilizo sanidiwa kupitia kiolesura michoro cha mtumiaji cha OTRS.

source: OTRS is able to receive emails from POP3, POP3S, IMAP, and IMAPS mail accounts.
ja: OTRSは、POP3、POP3S、IMAPおよびIMAPSメールアカウントからEメールを受け取ることができます。
ru: OTRS позволяет получать сообщения электронной почты через почтовые аккаунты POP3, POP3S, IMAP, и IMAPS.
sw: OTRS inaweza kupokea barua pepe kutoka akaunti za POP3, POP3S, IMAP, na IMAPS.

source: Configure your mail accounts via the PostMaster Mail Accounts link on the Admin page.
ja: 管理者ページのPostMasterメールアカウント・リンク経由でメールアカウントを構成して下さい。
ru: Для настройки почтовых аккаунтов воспользуйтесь ссылкой "Почтовые Аккаунты PostMaster" на странице администрирования.
sw: Sanidi akaunti zako za posta kupitia kiungo cha Akaunti za Posta za MkuuWaPosta kwenye ukurasa wa Msimamizi.

source: If a new mail account is to be created (see Figure below), then its mail server name, login name and password must be specified. Also, you need to select the mail server type, which can be POP3, POP3S, IMAP or IMAPS. If you don't see your server type available as an option, the required Perl modules are missing on your system. In that case, please refer to <link linkend="installation-of-perl-modules"> "Installation of Perl modules required for OTRS"</link> for instructions.
ja: 新規メールアカウントが作成されることになっている場合(下記の図を参照)そのメールサーバ名、ログイン名およびパスワードが指定されなければいけません。また、POP3, POP3S, IMAP あるいは IMAPS等のようなメールサーバタイプを選択する必要があります。サーバー・タイプのオプションとして利用可能なものが見あたらなければ、システムに必要なPerlモジュールがないことがその理由です。その場合、指示に関しては<link linkend="installation-of-perl-modules"> "OTRSに必要なパール・モジュールのインスタレーション"</link>を参照してください。
ru: Если создан новый почтовый аккаунт/ящик (см. нижеприведенный сценарий), то нужно еще указать имя его почтового сервера, логин и пароль. Также, необходимо выбрать тип почтового сервера: POP3, POP3S, IMAP или IMAPS. Если в опциях не видно типа сервера, который нужно использовать, значит вы не установили в системе все необходимые Perl-модули. В таком случае, за более подробной информацией обратитесь к инструкции <link linkend="installation-of-perl-modules"> "Установка Perl-модулей, необходимых для работы OTRS"</link>.
sw: Kama akaunti mpya ya barua inatakiwa kutengenezwa (ona Kielelezo chini), basi jina lake la seva ya barua, jina la kuingilia na nywila lazima ziwekwe bayana. Pia, unahitaji kuchagua aina ya seva ya barua, ambayo inaweza kuwa POP3, POP3S, IMAP au IMAPS. Kama huoni aina yako ya seva kuwepo kama chaguo, moduli za Perl zinazotakiwa hazipo katika mfumo wako. Katika kesi hiyo, tafadhali nenda kwenye <link linkend="installation-of-perl-modules"> "Usakinishaji wa moduli za Perl zinazohitajika na OTRS"</link> kwa maelekezo.

source: Adding a mail account
ja: メールアカウントの追加。
ru: Добавление учетной записи электронной почты
sw: Kuongeza akaunti ya barua pepe

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="Adminarea postmaster - screenshot" scale="40" fileref="screenshots/add-mailaccount.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="管理者ポストマスター - スクリーンショット" scale="40" fileref="screenshots/add-mailaccount.png"></graphic>

source: <emphasis>Figure: Adding a mail account.</emphasis>
ja: <emphasis>図:メールアカウントの追加。</emphasis>
ru: <emphasis>Рисунок Добавление учетной записи электронной почты.</emphasis>
sw: <emphasis>Kielelezo: Kuongeza akaunti ya barua pepe.</emphasis>

source: If you select Yes for the value of the Trusted option, any X-OTRS headers attached to an incoming message are evaluated and executed. Because the X-OTRS header can execute some actions in the ticket system, you should set the Trusted option to Yes only for known senders. X-OTRS-Headers are used by the <link linkend="adminarea-postmasterfilter">filter module</link> in OTRS. The X-OTRS headers are explained <link linkend="table-of-x-otrs-headers">in this table</link> in more detail. Any postmaster filter rules created are executed, irrespective of the Trusted option's setting.
ja: 信頼済オプションの値にYesを選べば、受信メッセージに付けられたどんなX-OTRSヘッダーも評価され実行されます。X-OTRSヘッダーがチケットシステムの中のいくつかのアクションを実行することができるので既知の送信者だけに信頼済オプションをYesにセットするべきです。X-OTRSヘッダーはOTRSでは<link linkend="adminarea-postmasterfilter">フィルタ・モジュール</link>によって使用されます。X-OTRSヘッダーは、<link linkend="table-of-x-otrs-headers">このテーブルの中で</link>より詳細に説明されます。作成されたどんなpostmasterフィルタ規則も、信頼されたオプションのセッティングに関係なく実行されます。
ru: Если для опции "Trusted" выбрано значение "Да", будут оцениваться и выполнятся любые X-OTRS-заголовки, присоединенные к входящему сообщению. Поскольку X-OTRS-заголовок может выполнять некоторые действия в системе обработки заявок, то для извесных отправителей опцию Trusted нужно установить только в значение Да. X-OTRS-заголовки используюся в OTRS <link linkend="adminarea-postmasterfilter"> модулем фильтрации </link>. Более подробно X-OTRS заголовки рассматриваются в <link linkend="table-of-x-otrs-headers">этой таблице</link>. Любые созданные и выполненные правила фильтрации независимы от параметров настроки Trusted.
sw: Kama ukichagua Ndiyo kwa thamani ya chaguo linaloaminiwa, kichwa chochote cha X-OTRS kilichoambatanishwa na ujumbe unaoingia kinatathminiwa na kutekelezwa. Kwa sababu kichwa cha X-OTRS kinaweza kutekeleza baadhi ya vitendo katika mfumo wa tiketi, unatakiwa kuseti chaguo la kuamini kuwa Ndiyo kwa watumaji wanaojulikana tu. Vichwa vya OTRS vinatumika na <link linkend="adminarea-postmasterfilter">moduli ya kuchuja</link> katika OTRS. Vichwa vya OTRS vinaelezewa <link linkend="table-of-x-otrs-headers">katika jedwali hili</link> kwa undani zaidi. Sheria zote za mkuu wa posta zilizotengenezwa zinatekelezwa, bila kujali mipangilio ya mchaguo linaloaminiwa.
