Repository: DSigmund/doc-admin
Catalog: i18n/doc-admin.*.po
Languages: ja, ru, sw

source: The heart of the Web Service is its configuration, where it is defined what actions the web service can perform internally (Operation), what actions the OTRS request can perform Remote System (Invokers), how data is converted from one system to the other (Mapping), and over which protocol the communication will take place (Transport)
ja: Webサービスの核心はその構成(Configuraiton)です。尚、ここで、以下が定義されます。ウェブサービスがどのアクションを内部に行なうことができるか(オペレーション)、どんなアクションが、OTRS要求がリモート・システムを実行できるか（依頼アクション(Invokers)）どのようにデータが他からひとつのシステムへ変換されるか（Mapping）そしてどのプロトコル上でコミュニケーションが発生するのはどのプロトコル上か（Transport）。
ru: Основой Web Service является его конфигурация, в которой определяется, какие действия он может выполнить сам внутри (Operation), какие действия запроса OTRS может выполнить Внешняя система (Invokers), каким образом данные преобразуются из одной системы в другую (Mapping), и с помощью какого протокола будет осуществляться взаимодействие (Transport)
sw: Moyo wa Huduma ya Wavuti ni usanidi wake, ambapo imefafanuliwa vitendo ambavyo huduma ya wavuti inaweza kufanya kwa ndani (Operesheni), vitendo gani maombi ya OTRS inaweza kufanya Mfumo wa Mbali (Wachochezi), jinsi gani data inabadilishwa kutoka mfumo mmoja kwenda mwingine (Kuunganisha), na kupitia itifaki gani mawasiliano yatapita (Usafirishaji)

source: The Generic Interface is the framework that makes it possible to create Web Services for OTRS in a pre-defined way, using already made building blocks that are independent from each other and interchangeable.
ja: 一般インターフェースは、互いから独立して、交換可能な、既に作られていたビルディングブロックを使用して、事前定義された方法でOTRSのためのWebサービスを作成することを可能にするフレームワークです。

source: Ticket priorities
ja: チケット・プロパティ
ru: Приоритеты заявок
sw: Vipaumbele vya tiketi

source: OTRS comes with five default priority levels that can be modified via the "Priorities" link on the Admin page. When creating a customized list of priorities, please keep in mind that they are sorted alphabetically in the priority selection box in the user interface. Also, OTRS orders tickets by internal database IDs in the QueueView.
ja: OTRSには、５つのデフォルトの優先度レベルが付属しています。それは、管理者ページにある「プロパティ」"Priorities" 経由で変更可能です。カスタマイズされた優先度リストを作成する場合、ユーザ・インターフェース中の優先度選択箱の中でそれらがアルファベット順にソートされると心に留めておいてください。さらに、OTRSはQueueViewの中の内部データベースIDによってチケットを順序づけします。
ru: OTRS поставляется с пятью предустановлеными уровнями приоритетов, которые можно изменить перейдя по ссылке "Приоритеты" на Панели Администрирования. При создании настраиваемого списка приоритетов, пожалуйста помните, что они сортируются в алфавитном порядке. Также OTRS сортирует заявки в QueueView по их внутреннему номеру (ID).
sw: OTRS inakuja na ngazi tano za chaguo-msingi la vipaumbele ambavyo vinaweza kubadilishwa kupitia kiubgo "Vipaumbele" katika ukurasa wa Msimamizi. Wakati wa kutengeneza orodha iliyogeuzwa kukufaa ya vipaumbele, tafadhali weka akilini kwamba zimepangwa kwa alfabeti katika kisanduku cha kuchagua kipaumbele katika kiolesura cha mtumiaji. Pia, OTRS ina agiza tiketi kwa Vitambulisho vya ndani vya hifadhidata katika MuonekanoWaFoleni.

source: As with other OTRS entities, priorities may not be deleted, only deactivated by setting the Valid option to <emphasis>invalid</emphasis> or <emphasis>invalid-temporarily</emphasis>.
ja: 他のOTRS実体でそうであるように、優先度は、削除できないかもしれませんし、有効オプションを<emphasis>無効</emphasis>まはた<emphasis>無効-暫定</emphasis>にする設定によって、単に非活性化されるかもしれません。
ru: Как и в случае с другими сущностями OTRS, приоритеты не могут быть удалены, а только деактивированы путем установки параметра Действительный в значение <emphasis>не действительный</emphasis> или <emphasis>не действительный-временно</emphasis>.
sw: Kama ilivyo kwa vyombo vingine vya OTRS, vipaumbele haviwezi kufutwa, vinalemazwa tu kwa kuseti chaguo Halali kuwa <emphasis>batili</emphasis> au <emphasis>batili-kwa muda</emphasis>.

source: If a new priority was added or if an existing one was changed, you might also want to modify some values in SysConfig:
ja: 新規優先度が加えられた場合、あるいは既存のものが変更された場合、SysConfigの中のいくつかの値を修正したいと思うかもしれません:
ru: Если был создан новый приоритет, или был изменен уже существующий, то можно также произвести изменения некоторых параметров в SysConfig:
sw: Kama kipaumbele kipya kimeongezwa au kama kilichopo kimebadilishwa, unaweza kutaka kubadilisha baadhi ya thamani katika SysConfig:

source: Ticket States
ja: チケットの状態
ru: Состояния заявок
sw: Hali za Tiketi

source: Predefined states
ja: 事前定義された状態
ru: Предопределенные состояния
sw: Hali zilizofasiliwa kabla

source: OTRS allows you to change predefined ticket states and their types, or even add new ones. Two attributes are important for a state: the state name and the state type.
ja: OTRSでは、事前定義されたチケット状態とタイプを変更または新規追加することができます。状態名と状態タイプという2つの属性が状態にとって重要です。
ru: OTRS позволяет изменять предопределенные состояния заявок и их типы, а также добавлять новые. Для состояния важны два атрибута: имя (state-name) и тип (state-type).
sw: OTRS inakuruhusu kubadilisha hali ya tiketi iliyofafanuliwa tayari na aina zake, au hata kuongeza mpya. Sifa mbili ni muhimu kwa ajili ya hali: jina la hali na aina ya hali.

source: The default states of OTRS are: 'closed successful', 'closed unsuccessful', 'merged', 'new', 'open', 'pending auto close+', 'pending auto close-', 'pending reminder' and 'removed'.
ja: OTRSのデフォルト状態は以下の通りです。「完了（成功）」（'closed successful'）、「完了（不成功）」（'closed unsuccessful'）、「結合済」（'merged'）、「新規」（'new'）、「対応中」（'open'）、「保留（自動完了＋）」（'pending auto close+'）、「保留（自動完了- 」（'pending auto close-'）、「保留（期限付）」（'pending reminder'）、「削除」（'removed'.）。
ru: Предустановленные состояния в OTRS: "закрыто успешно", "закрыто неудачно", "обьеденено", "новая", "открытая", "в ожидании с автозакрытием+", "в ожидании с автозакрытием-", "в ожидании с напоминанием", "удаленная".
sw: Hali chaguo-msingi ya OTRS ni: 'imefungwa kwa mafanikio', 'imefungwa pasipo mafanikio', 'unganishwa', 'mpya', 'wazi', 'inasubiri kufunga otomatiki+', 'inasubiri kufunga otomatiki-', 'inasumbiri kikumbusho' na 'ondolewa'.

source: New
ja: 「新規」（New）
ru: Новая
sw: Mpya

source: Tickets are usually in this state when created from incoming e-mails.
ja: チケットは、受信Eメールから作成された時、通常この状態です。
ru: Заявки находятся в этом состоянии, когда они создаются на основе входящих сообщений электронной почты.
sw: Tiketi huwa katika hali hii kama zimetengenezwa kutoka kwenye barua pepe zinazoingia.

source: Open
ja: 対応中（open）
ru: Открытая
sw: Wazi

source: This is the default state for tickets assigned to queues and agents.
ja: これはキューと担当者に割り当てられたチケットのためのデフォルト状態です。
ru: Это состояние по умолчанию для заявок, которые присвоены очередям или агентам.
sw: Hii ndio chaguo-msingi la hali ya tiketi zilizo chini ya foleni na wakala.

source: Pending reminder
ja: 保留（期限付）
ru: Ожидание с напоминанием
sw: Kikumbusho kinachosubiri

source: After the pending time has expired, the ticket owner will receive a reminder email concerning the ticket. If the ticket is not locked, the reminder will be sent to all agents in the queue. Reminder tickets will only be sent out during business hours, and are repeatedly sent every 24 hours until the ticket state is changed by the agent. Time spent by the ticket in this status will still add towards the escalation time calculation.
ja: 保留時間が終了すると、チケット所有者はチケットに関するリマインダーEメールを受信します。チケットがロックされていなければ、リマインダーはキュー中の全担当者へ送られます。リマインダーチケットは単に業務時間に送信され、チケット状態が担当者によって変更されるまで、24時間ごとに繰り返し送信されます。このステータスでのチケットによって費やされた時間は、さらにエスカレーション時間として追加計上されます。
ru: После того как время ожидания истекло, владелец заявки будет получать напоминание на электронную почту. Если заявка не закрыта, то напоминание о заявке будет отправлено всем агентам в очереди. Напоминание о заявках будет отправлено только в рабочее время и будет повторятся каждые 24-часа, пока агент не изменит состояние заявки. Время, которое заявка проведет с таким статусом будет добавлено к времени эскалации.
sw: Baada ya muda wa kusubiri kuisha, mmiliki wa tiketi atapokea kikumbusho cha barua pepe kuhusu tiketi. Kama tiketi haijafungwa, kikumbusho kitatumwa kwa mawakala wote kwenye foleni. Tiketi za ukumbusho zitatumwa tu katika masaa ya biashara, na kurudia kutumwa kila masaa 24 mpaka hali ya tiketi itakapobadilishwa na wakala. Muda uliotumika na tiketi katika hali hii utajumlishwa kwenye mahesabu ya muda wa kupanda.

source: Pending auto close-
ja: 保留（自動完了-）
ru: Ожидание авто-закрытие -
sw: Funga otomatiki inasubiri-

source: Tickets in this status will be set to "Closed Unsuccessful" if the pending time has expired. Time spent by the ticket in this status will still add towards the escalation time calculation.
ja: 保留時間が終了したらこの状態のチケットは「完了（不成功）」（'closed unsuccessful'）にセットされます。このステータスでのチケットによって費やされた時間は、さらにエスカレーション時間として追加計上されます。
ru: Если время ожидания вышло, заявки с этим статусом будут установлены в "Закрытые неуспешно". Время, проведенное заявкой в этом статусе будет добавлено к времени эскалации.
sw: Tiketi katika hali hii zitasetiwa kuwa "Hazijafungwa Kikamilifu" kama muda wa kusubiri umeisha. Muda uliotumiwa na tiketi katika hali hii utaongezwa kwenye mahesabu ya muda wa kupanda.

source: Pending auto close+
ja: 保留（自動完了＋）
ru: Ожидание авто-закрытие+
sw: Funga otomatiki inasubiri+

source: Tickets in this status will be set to "Closed Successful" if the pending time has expired. Time spent by the ticket in this status will still add towards the escalation time calculation.
ja: 保留時間が終了したらこの状態のチケットは「完了（成功）」（'closed successful'）にセットされます。この状態のチケットに費やされた時間は、さらにエスカレーション時間として追加計上されます。
ru: Если вышло время ожидания, заявки с этим статусом будут установлены в "Закрыто Успешно". Время, проведенное заявкой в этом статусе будет добавлено к времени эскалации.
sw: Tiketi katika hali hii zitasetiwa kuwa "Zimefungwa Kikamilifu" kama muda wa kusubiri umeisha. Muda uliotumiwa na tiketi katika hali hii utaongezwa kwenye mahesabu ya muda wa kupanda.

source: Merged
ja: 結合済
ru: Обьедененные
sw: Unganishwa

source: This is the state for tickets that have been merged with other tickets.
ja: これは他のチケットと結合されたチケットの状態です。
ru: Это состояние для заявок, которые были объеденены с другими заявками.
sw: Hii ni hali ya tiketi zilizounganishwa na tiketi nyingine.

source: Closed Successful
ja: 完了（成功）
ru: Закрыта Успешно
sw: Imafungwa kwa Mafanikio

source: This is the end state for tickets that have been successfully resolved. Depending on your configuration, you may or may not be able to reopen closed tickets.
ja: これはうまく解決されたチケットの最終状態です。構成に依存しますが、一旦完了したチケットを再対応可能にも不可能にも構成可能です。
ru: Это конечное состояние для заявок, которые были решены успешно. В зависимости от конфигурации, у вас будет или не будет возможности заново открыть ранее закрытые заявки.
sw: Hii ni hali ya mwisho kwa tiketi ambazo zimesuluhishwa kwa mafanikio. Kutegemeana na usanidi wako, unaweza au usiweze kufungua upya tiketi zilizofungwa.

source: Closed Unsuccessful
ja: 完了（不成功）
ru: Закрыта Неудачно
sw: Imefungwa Pasipo Mafanikio

source: This is the end state for tickets that have NOT been successfully resolved. Depending on your configuration, you may or may not be able to reopen closed tickets.
ja: これは解決できなかったチケット用の最終状態です。構成に依存しますが、一旦完了したチケットを再対応可能にも不可能にも構成可能です。
ru: Это конечное состояние для заявок которые НЕ были успешно решены. В зависимости от конфигурации, у вас будет или не будет возможности заново открыть ранее закрытые заявки.
sw: Hii ni hali ya mwisho kwa tiketi ambazo HAZIJASULUHISHWA kwa mafanikio. Kutegemeana na usanidi wako, unaweza au usiweze kufungua upya tiketi zilizofungwa.

source: Customizing states
ja: 状態のカスタマイズ
ru: Настраиваемы состояния
sw: Kugeuza hali kukufaa

source: Every state has a name (state-name) and a type (state-type). Click on the <link linkend="adminarea-status">States</link> link on the Admin page and press the button "Add state" to create a new state. You can freely choose the name of a new state. The state types can not be changed via the web interface. The database has to be directly modified if you want to add new types or change existing names. The default state types should typically not be modified as this can yield unpredictable results. For instance, escalation calculations and the unlock feature are based on specific state types.
ja: すべての状態は名(状態名)およびタイプ(状態タイプ)を持っています。管理ページの<link linkend="adminarea-status">状態</link>リンクをクリックします。そして新規状態を作成する"状態追加"ボタンを押します。新しい状態の名前は自由に選択することができます。ウェブインターフェイス経由では状態タイプを変更することはできません。 新規タイプを追加あるいは既存名を変更したい場合、データベース直接変更されなければいけません。概してデフォルトの状態タイプは変更すべきではありません。予測不能の結果を生むことがあるためです。例えば、エスカレーション計算とアンロック機能は特別な状態タイプに基いています。
ru: Каждое состояние имеет название (state-name) и тип (state-type). Чтобы создать новое состояние перейдите по ссылке <link linkend="adminarea-status">Состояния</link> на Панели Администрирования и нажмите кнопку "Добавить состояние". Можно свободно выбирать имя нового состояния. Типы состояний не могут изменятся посредством веб-интерфейса. Если нужно добавить новые типы или изменить существующие, - все изменения придется делать напрямую в базе данных. Предустановленные типы состояний не могут быть изменены, поскольку это может привести к непредсказуемым результатам. Например, расчет эскалации и фунция разблокирования основаны на конкретных типах состояний.
sw: Kila hali ina jina (jina-la-hali) na aina (aina-ya-hali). Bofya kwenye kiungo <link linkend="adminarea-status">Hali</link> katika kurasa ya Msimamizi na kubonyeza kitufe "Ongeza hali" kutengeneza hali mpya. Unaweza kuchagua kwa uhuru jina la hali mpya. Aina ya hali haiwezi kubadilishwa kupitia kiolesura cha wavuti. Hifadhidata inabidi ibadilishwe moja kwa moja kama utataka kuongeza aina mpya au kubadilisha majina yaliyopo. Aina chaguo-msingi la hali halitakiwi kubadilishwa kwa kuwa inaweza kutoa majibu yasiyotabirika. Kwa mfano, mahesabu ya upandaji na kipengele cha kufungua kwa kutegemea aina maalumu ya hali.

source: The name of an already existing state can be changed, or new states added through this screen. If the state "new" has been changed via the web interface, this change also has to be configured via the config file <filename>Kernel/Config.pm</filename> or via the SysConfig interface. The settings specified in the script below have to be modified to ensure that OTRS works with the changed state for "new".
ja: 既存の状態名は変更することができます。あるいは、新規状態はこの画面から追加されます。「新規」状態が、ウェブインターフェース経由で変更されたなら、この変更も、構成ファイル <filename>Kernel/Config.pm</filename>またはSysConfigインターフェイス経由で構成変更されねばなりません。以下のスクリプトで指定された設定は、「新規」に変更された状態で、OTRSが確実に稼働するように変更されなければなりません。
ru: Имя/название уже существующего состояния может быть изменено или новые состояния добавлены на этом экране. Если состояние "new" было изменено в веб-интерфейсе, это состояние также должно быть настроено в <filename>Kernel/Config.pm</filename> или через SysConfig. Параметры заданные в сценарии приведенном ниже должны быть изменены, чтобы убедиться в том, что OTRS работает с измененным состоянием для бывшего "new".
sw: Jina la hali iliyopo tayari linaweza kubadilishwa, au hali mpya zilizoongezwa kupitia hii skrini. Kama hali "mpya" imebadilishwa kupitia hiki kiolesura cha tovuti, haya mabadiliko pia lazima yafanyiwe usanidi kupitia faili la usanidi <filename>Kernel/Config.pm</filename> au kupitia kiolesura cha SysConfig. Mipangilio iliyowekwa bayana katika hati chini lazima ibadilishwe kuhakikisha OTRS inafanya kazi na hali iliyobadilishwa kwa ajili ya "mpya".

source: [...] # PostmasterDefaultState # (The default state of new tickets.) [default: new] $Self-&gt;{PostmasterDefaultState} = 'new'; # CustomerDefaultState # (default state of new customer tickets) $Self-&gt;{CustomerDefaultState} = 'new'; [...]
ja: [...] # PostmasterDefaultState # (新規チケットのデフォルト状態) [default: new] $Self-&gt;{PostmasterDefaultState} = 'new'; # CustomerDefaultState # (新規顧客チケットのデフォルト状態) $Self-&gt;{CustomerDefaultState} = 'new'; [...]

source: <emphasis>Script: Modifying the Kernel/Config.pm settings.</emphasis>
ja: <emphasis>スクリプト:Kernel/Config.pmの設定修正</emphasis>
ru: <emphasis>Сценарий: Изменение параметров настройки в Kernel/Config.pm.</emphasis>
sw: <emphasis>Hati: Kubadilisha mipangilio ya Kernel/Config.pm.</emphasis>

source: If a new state type should be added, the ticket_state_type table in the OTRS database needs to be modified with a database client program, as shown in the script below.
ja: 万一新規状態タイプが加えられるならば、OTRSデータベースにあるthe ticket_state_typeテーブルは、下記のスクリプトで表示されるように、データベース・クライアント・プログラムで変更される必要があります。
ru: Если нужно добавить новый тип состояния, то это можно сделать с помощью клиентской программы управления базами данных, изменив таблицу ticket_state_type базы данных OTRS, как это показано в нижеприведенном сценарии
sw: Kama aina mpya ya hali inatakiwa kuongezwa, Jedwali la tiketi_hali_aina katika hifadhidata ya OTRS inahitaji kubadilishwa na programu ya hifadhidata ya mteja, kama ilivyoonyeshwa kwenye hati chini.

source: <emphasis>Script: Modifying the OTRS database.</emphasis>
ja: <emphasis>スクリプト:OTRSデータベースの修正</emphasis>
ru: <emphasis>Script: Изменение базы данных OTRS.</emphasis>
sw: <emphasis>Hati: Kurekebisha hifadhidata ya OTRS .</emphasis>

source: Now it is possible to use the new state type you just created. After a state has been linked with this new state type, the OTRS configuration also has to be changed to ensure that the new state is usable. Just modify the following options via SysConfig:
ja: あなたが今作成した新規状態タイプを使用することは可能である。状態がこの新規状態タイプとリンクされた後、OTRS構成も、さらに新規状態が使用可能であることを確実にするために変更されなければならない。SysConfigにて次のオプションを修正してください:
ru: На данный момент можно использовать новый тип состояния, который вы только что создали. Как только состояние будет связано с этим новым типом состояния, то чтобы убедится что новое состояние используется и работает коректно нужно также изменить настройки OTRS. Используя SysConfig внесите изменения в следующие опции:
sw: Sasa inawezekana kutumia aina mpya za hali ulizotengeneza. Baada ya hali kuunganishwa na hii aina mpya ya hali, usanidi wa OTRS pia unatakiwa kunadilishwa kuhakikisha hali mpya inatumika. Badilisha machaguo yafuatayo tu kupitia SysConfig:

source: Ticket Responsibility &amp; Ticket Watching
ja: チケット責任者とチケットの監視
ru: Ответственность за Заявку &amp; Наблюдение за Заявкой
sw: Jukumu la Tiketi &amp; Kuangalia Tiketi

source: From OTRS 2.1 on, it is possible to assign a person as being responsible for a ticket, in addition to its owner. Moreover, all activities connected with the ticket can be watched by someone other than the ticket owner. These two functionalities are implemented with the TicketResponsible and TicketWatcher features, and facilitate the assignment of tasks and working within hierarchical team structures.
ja: OTRS 2.1からチケットの所有者に加えて、１チケットに対して１名の責任者を割り当てることが可能です。さらに、チケットと関係のある全ての活動はチケットの所有者以外の誰かに見られるようにできます。これらの2つの機能性は、チケット責任者（TicketResponsible）とチケット監視者（TicketWatcher）としてインプリメントされ、タスクの割り当ておよび階層的チーム構造内に働くことを手助けします。
ru: Начиная с OTRS 2.1 и выше, в дополнение к владельцу заявки можно определить ответственного за нее агента. Кроме того, все мероприятия, связанные с заявкой могут просматриваться не только владельцем но другими людьми. Эти две возможности системы реализованы с помощью функций TicketResponsible и TicketWatcher и также позволяют работать в рамках иерархической структуры команды.
sw: Kutoka OTRS 2.1 na kuendelea, inawezekana kumuweka mtu kama mhusika wa tiketi, zaidi ya mmiliki wake. Zaidi, shughuli zote zilizounganishwa na tiketi zinaweza kuangaliwa na mtu zaidi ya mmiliki wa tiketi. Hizi kazi mbili zinatekelezwa na sifa TiketiMhusika na TiketiMuangalizi, na kuwezesha ugawaji wa kazi na kufanya kazi ndani ya miundo msonge ya makundi.

source: Ticket Responsibility
ja: チケット責任者
ru: Ответственность за Заявку
sw: Jukumu la Tiketi

source: The ticket responsiblility feature facilitates the complete processing of a ticket by an agent other than the ticket owner. Thus an agent who has locked a ticket can pass it on to another agent, who is not the ticket owner, in order for the second to respond to a customer request. After the request has been dealt with, the first agent can withdraw the ticket responsibility from the second agent.
ja: チケット責任者の機能は、チケット所有者以外に担当者によってチケットの完全な処理を手助けします。したがってチケットをロックした担当者はそれをもう一人の担当者に渡すことができます。渡された担当者はチケットの所有者ではなく、顧客依頼に対する第二の返答者となります。依頼が取り扱われた後、最初の担当者は第2の担当者からチケット責任を譲り受けできます。
ru: Функция ответственности за заявку способствует ее полной обработки еагентом, который не является владельцем заявки. Таким образом агент, который заблокировал заявку может передать ее другому агенту, который не является владельцем заявки, для того, чтобы второй просто дал ответ на вопрос. После того как запрос был рассмотрен, первый агент может снять ответственность за заявку с второго агента.
sw: Kipengele cha jukumu la tiketi kinawezesha uchakatishaji kamili wa tiketi na wakala mwingine tofauti na mmiliki wa tiketi. Hivyo wakala ambaye amefunga tiketi anaweza kuiruhusu kutumika na wakala mwingine ambaye siyo mmiliki wa tiketi, ili wapili ajibu maombi ya mteja. Baada ya maombi kushughulikiwa, wakala wa kwanza anaweza kutoa jukumu la tiketi kutoka kwa wakala wa pili.

source: Ticket responsibility can be assigned by calling up the ticket content and clicking on the "Responsible" link in the ticket activities menu of a zoomed ticket in the agent interface (see the Figure below).
ja: チケット責任者は、チケット内容を呼び出して割り当てることができます。そしてチケット活動メニュー「責任者」リンク（担当者インターフェイスにあるズームチケットにある）をクリックします。（下図参照）
ru: Ответственность за заявку может быть назначена после открытия ее содержимого, нажав ссылку "Ответственность", соответсвующего меню в шаблоне просмотра подробной информации о заявке агентского веб-интерфейса (см. нижеприведенный сценарий).
sw: Majukumu ya tiketi yanaweza kugawiwa kwa kuita maudhui ya tiketi na kubofya kwenye kiungo "Jukumu" katika menyu ya shughuli za tiketi kwenye tiketi iliyokuzwa katika kiolesura cha wakala (ona kielelezo chini).

source: Responsible link on ticket zoom
ja: チケットズーム画面での責任者変更
ru: Ссылка на несущего ответственность в шаблоное просмотра подробной информации о заявке.
sw: Kiungo kinachowajibika katika kuza tiketi

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="index.pl - screenshot" scale="40" fileref="screenshots/ticket-zoom-responsible.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="index.pl - スクリーンショット" scale="40" fileref="screenshots/ticket-zoom-responsible.png"></graphic>

source: <emphasis>Figure: Changing the Responsibility of a ticket in its zoomed view.</emphasis>
ja: <emphasis>図:ズーム・ビューでのチケット責任者の変更</emphasis>
ru: <emphasis>Рисунок: Изменение Ответственного за заявку в шаблоне просмотра подробной инф. о заявке.</emphasis>
sw: <emphasis>Kielelezo: Kubadilisha Jukumu la tiketi katika muonekano wake uliokuzwa.</emphasis>

source: After clicking on "Responsible", a pop-up dialog to change the responsibility of that ticket will open (see Figure below). This dialog can also be used to send a message to the new responsible agent.
ja: 「責任者」をクリックしたのちに、チケットの責任者変更ダイアログのポップアップが開きます。（下図参照）このダイアログは新規責任者の担当者へメッセージを送信するために使用することもできます。
ru: После нажатия на кнопку "Ответственность", откроется всплывающее окно для изменения ответственности этой заявки (см. нижеприведенный Рисунок). Этот шаблон/диалог также может быть использован для отправки сообщения новому агенту, который будет нести ответственность за эту заявку.
sw: Baada ya kubofya "Jukumu", kisanduku ibukizi cha kubadilisha jukumu la tiketi kitafunguka (ona Kielelezo chini). Haya maongezi yanaweza pia kutumika kutuma ujumbe kwa wakala mpya husika.

source: Ticket Responsibility Pop-up Dialog
ja: チケットの責任者を変更するポップ・アップ・ダイアログ。
ru: Всплывающий диалог Ответственность за Заявку
sw: Maongezi ibukizi ya Jukumu la Tiketi

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="index.pl - screenshot" scale="40" fileref="screenshots/ticket-responsible.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="index.pl - スクリーンショット" scale="40" fileref="screenshots/ticket-responsible.png"></graphic>
