Repository: DSigmund/doc-admin
Catalog: i18n/doc-admin.*.po
Languages: ja, ru, sw

source: <link linkend="ConfigReference_Ticket:Frontend::Agent::Ticket::ViewClose:Ticket::Frontend::AgentTicketClose_StateType"> Ticket -&gt; Frontend::Agent::Ticket::ViewClose &gt; StateType </link> - to define the available next states in the close screen.
ru: <link linkend="ConfigReference_Ticket:Frontend::Agent::Ticket::ViewClose:Ticket::Frontend::AgentTicketClose_StateType"> Ticket -> Frontend::Agent::Ticket::ViewClose > StateType </link> - задает список последующих доступных состояний после закрытия заявки.
sw: <link linkend="ConfigReference_Ticket:Frontend::Agent::Ticket::ViewClose:Ticket::Frontend::AgentTicketClose_StateType"> Tiketi -&gt; Mazingira ya mbele::Wakala::Tiketi::OnaFunga &gt; HaliAina </link> - kufafanua hali zinazofuata zitakazopatikana katika skrini ya kufunga.

source: <link linkend="ConfigReference_Ticket:Frontend::Agent::Ticket::ViewCompose:Ticket::Frontend::AgentTicketCompose_StateDefault"> Ticket -&gt; Frontend::Agent::Ticket::ViewCompose &gt; StateDefault </link> - to define the default next state in the Compose (reply) screen.
ru: <link linkend="ConfigReference_Ticket:Frontend::Agent::Ticket::ViewCompose:Ticket::Frontend::AgentTicketCompose_StateDefault"> Ticket -&gt; Frontend::Agent::Ticket::ViewCompose &gt; StateDefault </link> - задает значение по умолчанию следующего состояния заявки на странице/экране создания сообщения (ответа) агентом.
sw: <link linkend="ConfigReference_Ticket:Frontend::Agent::Ticket::ViewCompose:Ticket::Frontend::AgentTicketCompose_StateDefault"> Tiketi -&gt; Mazingira ya mbele::Wakala::Tiketi::OnaTunga &gt; HaliChaguo-msingi </link> - kufafanua chaguo-msingi la hali inayofuata kwenye skrini ya Kutunga (jibu).

source: <link linkend="ConfigReference_Ticket:Frontend::Agent::Ticket::ViewCompose:Ticket::Frontend::AgentTicketCompose_StateType"> Ticket -&gt; Frontend::Agent::Ticket::ViewCompose &gt; StateType </link> - to define the available next states in the Compose (reply) screen.
ru: <link linkend="ConfigReference_Ticket:Frontend::Agent::Ticket::ViewCompose:Ticket::Frontend::AgentTicketCompose_StateType"> Ticket -&gt; Frontend::Agent::Ticket::ViewCompose &gt; StateType </link> - задает список доступных следующих состояний заявки на странице/экране создания сообщения (ответа) агентом.
sw: <link linkend="ConfigReference_Ticket:Frontend::Agent::Ticket::ViewCompose:Ticket::Frontend::AgentTicketCompose_StateType"> Tiketi -&gt; Mazingira ya mbele::Wakala::Tiketi::OnaTunga &gt; HaliAina</link> - kufafanua hali zifuatazo zitakazopatikana kwenye skrini ya Kutunga (jibu).

source: <link linkend="ConfigReference_Ticket:Frontend::Agent::Ticket::ViewForward:Ticket::Frontend::AgentTicketForward_StateDefault"> Ticket -&gt; Frontend::Agent::Ticket::ViewForward &gt; StateDefault </link> - to define the default next state after forwarding a ticket.
ru: <link linkend="ConfigReference_Ticket:Frontend::Agent::Ticket::ViewForward:Ticket::Frontend::AgentTicketForward_StateDefault"> Ticket -&gt; Frontend::Agent::Ticket::ViewForward &gt; StateDefault </link> - для задания следующего состояния после пересылки заявки.
sw: <link linkend="ConfigReference_Ticket:Frontend::Agent::Ticket::ViewForward:Ticket::Frontend::AgentTicketForward_StateDefault"> Tiketi -&gt; Mandhari ya mbele::Wakala::Tiketi::OnaMbele &gt; HaliChaguo-msingi </link> - kufafanua chaguo-msingi la hali inayofuata baada ya kupeleka mbele tiketi.

source: <link linkend="ConfigReference_Ticket:Frontend::Agent::Ticket::ViewForward:Ticket::Frontend::AgentTicketForward_StateType"> Ticket -&gt; Frontend::Agent::Ticket::ViewForward &gt; StateType </link> - to define the available next states in the Forward screen.
ru: <link linkend="ConfigReference_Ticket:Frontend::Agent::Ticket::ViewForward:Ticket::Frontend::AgentTicketForward_StateType"> Ticket -&gt; Frontend::Agent::Ticket::ViewForward &gt; StateType </link> - для задания списка доступных следующих состояний для экрана Переслать/Forward.
sw: <link linkend="ConfigReference_Ticket:Frontend::Agent::Ticket::ViewForward:Ticket::Frontend::AgentTicketForward_StateType"> Tiketi -&gt; Mazingira ya mbele::Wakala::Tiketi::OnaMbele &gt; HaliAina </link> - kufafanua hali zinazofuata zitakazopatikana kwenye skrini ya Kupeleka mbele..

source: <link linkend="ConfigReference_Ticket:Frontend::Agent::Ticket::ViewFreeText:Ticket::Frontend::AgentTicketFreeText_StateDefault"> Ticket -&gt; Frontend::Agent::Ticket::ViewForward &gt; StateDefault </link> - to define the default next state of a ticket in the free text screen.
ru: <link linkend="ConfigReference_Ticket:Frontend::Agent::Ticket::ViewFreeText:Ticket::Frontend::AgentTicketFreeText_StateDefault"> Ticket -> Frontend::Agent::Ticket::ViewForward > StateDefault </link> - задает следующее состояние по умолчанию после редактирования свободных полей заявки
sw: <link linkend="ConfigReference_Ticket:Frontend::Agent::Ticket::ViewFreeText:Ticket::Frontend::AgentTicketFreeText_StateDefault"> Tiketi -&gt; Mazingira ya mbele::Wakala::Tiketi::OnaMbele &gt; HaliChaguo-msingi </link> - kufafanua chaguo-msingi la hali inayofuata ya tiketi katika skrini ya nakala huru.

source: <link linkend="ConfigReference_Ticket:Frontend::Agent::Ticket::ViewFreeText:Ticket::Frontend::AgentTicketFreeText_StateType"> Ticket -&gt; Frontend::Agent::Ticket::ViewForward &gt; StateType </link> - to define the available next states in the free text screen.
ru: <link linkend="ConfigReference_Ticket:Frontend::Agent::Ticket::ViewFreeText:Ticket::Frontend::AgentTicketFreeText_StateType"> Ticket -> Frontend::Agent::Ticket::ViewForward > StateType </link> - задает список доступных состояний после редактирования свободных полей заявки
sw: <link linkend="ConfigReference_Ticket:Frontend::Agent::Ticket::ViewFreeText:Ticket::Frontend::AgentTicketFreeText_StateType"> Tiketi -&gt; Mazingira ya mbele::Wakala::Tiketi::OnaMbele &gt; HaliAina</link> - kufafanua kali zinazofuata zitakazopatikana katika skrini ya nakala huru.

source: <link linkend="ConfigReference_Ticket:Core::PostMaster:PostmasterDefaultState"> Ticket -&gt; Core::PostMaster &gt; PostmasterDefaultState </link> - to define the state of tickets created from emails.
ru: <link linkend="ConfigReference_Ticket:Core::PostMaster:PostmasterDefaultState"> Ticket -> Core::PostMaster > PostmasterDefaultState </link> - задает состояние заявки созданной из электронного письма.
sw: <link linkend="ConfigReference_Ticket:Core::PostMaster:PostmasterDefaultState"> Tiketi-&gt; Kiini::MkuuWaPosta&gt; MkuuwapostaHaliChaguo-msingi</link> - kufafanua hali ya tiketi zilizotengenezwa kutoka kwenye barua pepe.

source: <link linkend="ConfigReference_Ticket:Core::PostMaster:PostmasterFollowUpState"> Ticket -&gt; Core::PostMaster &gt; PostmasterFollowUpState </link> - to define the state of tickets after a follow-up has been received.
ru: <link linkend="ConfigReference_Ticket:Core::PostMaster:PostmasterFollowUpState"> Ticket -> Core::PostMaster > PostmasterFollowUpState </link> - задает состояние заявки после получения отклика клиента.
sw: <link linkend="ConfigReference_Ticket:Core::PostMaster:PostmasterFollowUpState"> Tiketi-&gt; Kiini::MkuuWaPosta&gt; MkuuwapostaUfuatiliajiHali</link> - kufafanua hali ya tiketi baada ya ufuatiliaji kupokelewa.

source: <link linkend="ConfigReference_Ticket:Core::PostMaster:PostmasterFollowUpStateClosed"> Ticket -&gt; Core::PostMaster &gt; PostmasterFollowUpStateClosed </link> - to define the state of tickets after a follow-up has been received on an already closed ticket.
ru: <link linkend="ConfigReference_Ticket:Core::PostMaster:PostmasterFollowUpStateClosed"> Ticket -> Core::PostMaster > PostmasterFollowUpStateClosed </link> - задает состояние заявок после получения отклика клиента на уже закрытую заявку.
sw: <link linkend="ConfigReference_Ticket:Core::PostMaster:PostmasterFollowUpStateClosed"> Tiketi-&gt; Kiini::MkuuWaPosta&gt; MkuuwapostaUfuatiliajiHaliUmefungwa </link> - kufafanua hali ya tiketi baada ya ufuatiliaji wa tiketi iliyofungwa kupokelewa.

source: <link linkend="ConfigReference_Ticket:Core::Ticket:Ticket::ViewableStateType"> Ticket -&gt; Core::Ticket &gt; ViewableStateType </link> - to define the state types that are displayed at various places in the system, for example in the Queueview.
ru: <link linkend="ConfigReference_Ticket:Core::Ticket:Ticket::ViewableStateType"> Ticket -> Core::Ticket > ViewableStateType </link> - задает типы состояний заявок, которые отображаются в различных обзорах системы, например, в Обзоре очередей.
sw: <link linkend="ConfigReference_Ticket:Core::Ticket:Ticket::ViewableStateType"> Tiketi -&gt; Kiini::Tiketi &gt; AinaHaliInayoonekana </link> - kufafanua aina za hali ambazo zinaonyeshwa katika maeneo tofauti ya mfumo, kwa mfano katika Muonekanofoleni.

source: <link linkend="ConfigReference_Ticket:Core::Ticket:Ticket::UnlockStateType"> Ticket -&gt; Core::Ticket &gt; UnlockStateType </link> - to define the state types for unlocked tickets.
ru: <link linkend="ConfigReference_Ticket:Core::Ticket:Ticket::UnlockStateType"> Ticket -> Core::Ticket > UnlockStateType </link> - задает список типов состояний для разблокированных заявок.
sw: <link linkend="ConfigReference_Ticket:Core::Ticket:Ticket::UnlockStateType"> Tiketi-&gt; Kiini::Tiketi &gt; FunguaHaliAina </link> - kufafanua aina za hali kwa ajili ya tiketi zilizofunguliwa.

source: <link linkend="ConfigReference_Ticket:Core::Ticket:Ticket::PendingReminderStateType"> Ticket -&gt; Core::Ticket &gt; PendingReminderStateType </link> - to define the state type for reminder tickets.
ru: <link linkend="ConfigReference_Ticket:Core::Ticket:Ticket::PendingReminderStateType"> Ticket -> Core::Ticket > PendingReminderStateType </link> - задает тип состояния для заявок с напоминанием.
sw: <link linkend="ConfigReference_Ticket:Core::Ticket:Ticket::PendingReminderStateType"> Tiketi-&gt; Kiini::Tiketi&gt; KikumbushoKinachosubiriHaliAina </link> - kufafanua aina ya hali kwa ajili ya tiketi za kumbukumbu.

source: <link linkend="ConfigReference_Ticket:Core::Ticket:Ticket::PendingAutoStateType"> Ticket -&gt; Core::Ticket &gt; PendingAutoStateType </link> - to define the state type for Pending Auto tickets.
ru: <link linkend="ConfigReference_Ticket:Core::Ticket:Ticket::PendingAutoStateType"> Ticket -> Core::Ticket > PendingAutoStateType </link> - задает тип состояния для отложенных заявок.
sw: <link linkend="ConfigReference_Ticket:Core::Ticket:Ticket::PendingAutoStateType"> Tiketi -&gt; Kiini::Tiketi &gt; KusubiriHaliOtomatikiAina </link> - kufafanua aina ya hali kwa ajili ya tiketi Otomatiki Zinazosubiri.

source: <link linkend="ConfigReference_Ticket:Core::Ticket:Ticket::StateAfterPending"> Ticket -> Core::Ticket > StateAfterPending </link> - to define the state a ticket is set to after the Pending Auto timer of the configured state has expired.
ru: <link linkend="ConfigReference_Ticket:Core::Ticket:Ticket::StateAfterPending"> Ticket -> Core::Ticket > StateAfterPending </link> - задает тип состояния для заявок с автоожиданием после итечения срока ожидания.
sw: <link linkend="ConfigReference_Ticket:Core::Ticket:Ticket::StateAfterPending"> Tiketi -> Kiini::Tiketi> HaliBaadaKusubiri</link> - kufafanua hali tiketi imesetiwa baada ya muda Otomatiki wa Kusubiri wa hali iliyosanidiwa kuisha.

source: With the configuration parameter <link linkend="ConfigReference_Ticket:Core::Ticket:Ticket::Responsible">Ticket::Responsible</link>, the ticket responsibility feature can be activated. This will cause 3 new links to appear in the ticket activities menu of a zoomed ticket in the agent interface.
ru: С помощью параметров конфигурации<link linkend="ConfigReference_Ticket:Core::Ticket:Ticket::Responsible">Ticket::Responsible</link>, можно активировать функцию ответственности за заявку. Это приведет к появлению в верхней части экрана 3-х дополнительных иконок/значков.
sw: Kwa parameta ya usanidi <link linkend="ConfigReference_Ticket:Core::Ticket:Ticket::Responsible">Tiketi::Jukumu</link>, kipengele cha jukumu la tiketi kinaweza kuamilishwa. Hii itasababisha viungo vipya 3 kutokea katika menyu ya shughuli za tiketi kwa tiketi iliyokuzwa katika kiolesura cha wakala.

source: The TicketWatcher feature can be activated with the configuration parameter <link linkend="ConfigReference_Ticket:Core::TicketWatcher:Ticket::Watcher">Ticket::Watcher</link> which adds new links to your actions toolbar. Using <link linkend="ConfigReference_Ticket:Core::TicketWatcher:Ticket::WatcherGroup">Ticket::WatcherGroup</link>, one or more user groups with permission to watch tickets can also be defined.
ru: Функция TicketWatcher может быть активирована с помощью параметра <link linkend="ConfigReference_Ticket:Core::TicketWatcher:Ticket::Watcher">Ticket::Watcher</link>, после чего в панели инструментов появлятся новые ссылки/иконки. Используя <link linkend="ConfigReference_Ticket:Core::TicketWatcher:Ticket::WatcherGroup"> Ticket::WatcherGroup </link> можно определить одну или несколько групп пользователей с правами просмотра/наблюдения заявок.
sw: Kipengele cha MuangaliziTiketi kinaweza kuamilishwa na parameta ya usanidi <link linkend="ConfigReference_Ticket:Core::TicketWatcher:Ticket::Watcher">Tiketi::Muangalizi</link> ambayo inaongeza viungo vipya kwenye mwambaa zana wako wa vitendo. Kwa kutumia <link linkend="ConfigReference_Ticket:Core::TicketWatcher:Ticket::WatcherGroup">Tiketi::MuangaliziKundi</link>, kundi moja au zaidi lenye ruhusa ya kuangalia tiketi linaweza kufafanuliwa.

source: admin
sw: msimaizi

source: stats
ru: отчеты
sw: takwimu

source: users
sw: watumiaji

source: move into
sw: hamia kwenye

source: create
sw: tengeneza

source: owner
sw: mmiliki

source: rw
sw: soma andikka

source: By default, the QueueView only lists tickets in queues that an agent has <emphasis>rw</emphasis> access to, i.e., the tickets the agent needs to work on. If you want to change this behaviour, you can set <link linkend="ConfigReference_Ticket:Frontend::Agent::Ticket::ViewQueue:Ticket::Frontend::AgentTicketQueue_ViewAllPossibleTickets"> Ticket::Frontend::AgentTicketQueue###ViewAllPossibleTickets </link> to <emphasis>Yes</emphasis>.
ru: По умолчанию, Обзор Очередей/QueueView отображает только заявки в очередях, в которых агент имеет права <emphasis>rw</emphasis>, т.е доступ к заявкам, с которыми он должен работать. Если вы хотите изменить этот порядок, вы можете установить параметр <link linkend="ConfigReference_Ticket:Frontend::Agent::Ticket::ViewQueue:Ticket::Frontend::AgentTicketQueue_ViewAllPossibleTickets"> Ticket::Frontend::AgentTicketQueue###ViewAllPossibleTickets </link> в значение <emphasis>Да</emphasis>.
sw: Kwa chaguo-msingi, MuonekanoWaFoleni unaorodhesha tiketi katika foleni pale wakala ana ufikivu wa <emphasis>kusoma na kuandika</emphasis>, ikimaanisha tiketi ambazo wakala anahitaji kuzifanyia kazi. Ukitaka kubadilisha hii tabia, unaweza kuseti <link linkend="ConfigReference_Ticket:Frontend::Agent::Ticket::ViewQueue:Ticket::Frontend::AgentTicketQueue_ViewAllPossibleTickets"> Tiketi::Mazingirayambele::WakalaTiketiFoleni###OnaTiketiZoteZinazowezekana</link> kwa <emphasis>Ndiyo</emphasis>.

source: Roles are really useful when dealing with complex organizations and when maintaining larger OTRS installations. Proper care is advised though. Mixing Agent to Group with Agent to Role mappings can make for a complex access control scheme, that is difficult to understand and maintain. If you wish to use only roles and disable the Agents &lt;-&gt; Groups option in the Admin area, you can do so by modifying the <link linkend="ConfigReference_Framework:Frontend::Admin::ModuleRegistration:Frontend::Module_AdminUserGroup">Frontend::Module###AdminUserGroup</link> in the SysConfig. Be aware that this won't remove already existing Agents to Group assignments!
ru: Роли действительно полезны когда мы имеем дело со сложно структурированными компаниями и управляем сложными системами OTRS. Тем не менее следует быть аккуратным с этм механизмом. Перемешивание назначения агентов в группы назначением агентам ролей может привести к переусложненной схеме, управлять которой, поддерживать актуальной и просто понимать будет затруднительно. Если вы желаете использовать только роли и отключить настройку Агенты &lt;-&gt; Группы в пангели администратора, можно сделать это в параметре <link linkend="ConfigReference_Framework:Frontend::Admin::ModuleRegistration:Frontend::Module_AdminUserGroup">Frontend::Module###AdminUserGroup</link> в SysConfig. Будьте аккуратны, во избежание удаления уже сделанных назначений агентов в группы!
sw: Majukumu ni muhimu ukihusika na mashirika makubwa na ukisimamia usakinishaji mkubwa wa OTRS. Umakini mkubwa unashauriwa. Kuchanganya miunganiko ya Wakala kwa Kundi na Wakala kwa Jukumu unaweza kutengeneza mpango mgumu wa kudhibiti ufikivu, ambao ni mgumu kuelewa na kudumisha. Kama ukiamua kutumia majukumu tu na kulemaza Mawakala &lt;-&gt; chaguo la Makundi kwenye eneo la Msimamizi, unaweza kufanya hiyo kwa kurekebisha <link linkend="ConfigReference_Framework:Frontend::Admin::ModuleRegistration:Frontend::Module_AdminUserGroup">Mazingira ya mbele::Moduli###MsimamiziMtumiajiKundi</link> katika SysConfig. Fahamu hii haitaondoa kazi zilizopo za Mawakala kwa Makundi!

source: The next step is to activate the customer group support. This can be done with the configuration parameter <link linkend="ConfigReference_Framework:Frontend::Customer:CustomerGroupSupport">CustomerGroupSupport</link>, from the Admin SysConfig option. Using the parameter <link linkend="ConfigReference_Framework:Frontend::Customer:CustomerGroupAlwaysGroups">CustomerGroupAlwaysGroups</link>, you can specify the default groups for a newly added customer, so that every new account will be automatically added to these groups.
ru: Следующим шагом будет включение поддержки групп клиентов . Это можно сделать используя параметр <link linkend="ConfigReference_Framework:Frontend::Customer:CustomerGroupSupport">CustomerGroupSupport</link> в SysConfig/Управлении Конфигурациями. Используя параметр <link linkend="ConfigReference_Framework:Frontend::Customer:CustomerGroupAlwaysGroups">CustomerGroupAlwaysGroups</link>, можно указать группы по умолчанию, к которым будет принадлежать новый клиент, таким образом каждая новая учетная запись будет добавляться в эти группы.
sw: Hatua inayofwata ni kuamilisha msaada wa kundi la mteja. Hii inaweza kufanywa na parameta ya usanidi <link linkend="ConfigReference_Framework:Frontend::Customer:CustomerGroupSupport">MsaadaKundiLaMteja</link>, kutoka kwenye chaguo la Msimamizi la SysConfig. Kutumia parameta <link linkend="ConfigReference_Framework:Frontend::Customer:CustomerGroupAlwaysGroups">MtejaKundiDaimaMakundi</link>, unaweza kubainisha makundi chaguo-msingi kwa mteja mpya aliyeongezwa, ili kila akaunti mpya iongezwe kiotomatiki kwenye haya makundi.

source: OTRS can process incoming S/MIME encoded messages and sign outgoing mails. Before this feature can be used, you need to activate it and change some <link linkend="ConfigReference_Framework:Crypt::SMIME">configuration parameters</link> in the SysConfig.
ru: OTRS может обрабатывать зашифрованные сообщения S/MIME и подписывать исходящие письма. Для исползования этой возможности необходимо вначале активировать ее и изменить ряд <link linkend="ConfigReference_Framework:Crypt::SMIME"> параметров </link> в SysConfig/Конфигурации системы.
sw: OTRS inaweza kuchakatisha ujumbe unaoingia wa S/MIME uliofanyiwa usimbaji na kusaini barua zinazotoka. Kabla ya kuweza kutumia hiki kipengele, unahitaji kukiamilisha na kubadilisha baadhi ya <link linkend="ConfigReference_Framework:Crypt::SMIME">parameta za usanidi</link> katika SysConfig.

source: OTRS handles PGP keys, which allows you to encrypt/decrypt messages and to sign outgoing messages. Before this feature can be used, you need to activate it and change some <link linkend="ConfigReference_Framework:Crypt::PGP"> configuration parameters </link> in the SysConfig.
ru: OTRS может обрабатывать ключи PGP, что позволяет шифровать/дешифровать и подписывать исходящие сообщения. Перед использованием этой возможности необходимо активировать ее и изменить некоторые <link linkend="ConfigReference_Framework:Crypt::PGP"> параметры конфигурации </link> в SysConfig.
sw: OTRS inashughulikia funguo za PGP, ambazo zinakuruhusu kusimba/kusimbua fiche ujumbe na kusaini ujumbe unaotoka nje. Kabla ya hiki kipengele kutumika, unahitaji kukiamilisha na kubadilisha baadhi ya <link linkend="ConfigReference_Framework:Crypt::PGP"> parameta za usanidi </link> katika SysConfig.

source: X-OTRS-DynamicField-&lt;DynamicFieldName&gt;:
sw: X-OTRS-SehemuInayobadilika-&lt;SehemuInayobadilikaJina&gt;:

source: In special cases, you might want to configure the Package Manager, e.g., to use a proxy or to use a local repository. Just take a look at the available options in SysConfig under <link linkend="ConfigReference_Framework:Core::Package">Framework:Core::Package</link>.
ru: В особых случаях, можно настроить Менеджер Пакетов, например, для использования прокси-сервера, или локального репозитория. Перейдя по ссылке <link linkend="ConfigReference_Framework:Core::Package">Framework:Core::Package</link>, можно увидеть на имеющиеся варианты в разделе Конфигурация системы/SysConfig.
sw: Katika kesi maalumu, unaweza kutaka kusanidi Meneja Vifurushi, mf., kutumia seva mbadala au kutumia hifadhi ya ndani. Tazama kwenye machaguo yaliyopo kwenye SysConfig chini ya <link linkend="ConfigReference_Framework:Core::Package">Kiunzi:Kiini::Kifurushi</link>.

source: Field1
ru: Поле1
sw: Sehemu1

source: My Field 1
ru: Мое Поле 1
sw: Sehemu yangu 1

source: Field2
ru: Поле2
sw: Sehemu2

source: My Field 2
ru: Мое Поле 2
sw: Sehemu yangu 2

source: Textarea
ru: Textarea/Длинный текст
sw: Eneo la nakala

source: Field3
ru: Поле3
sw: Sehemu3

source: My Field 3
ru: Мое Поле 3
sw: Sehemu yangu 3

source: Field4
ru: Поле4
sw: Sehemu4

source: My Field 4
ru: Мое Поле 4
sw: Sehemu yangu 4

source: Field5
ru: Поле5
sw: Sehemu5

source: My Field 5
ru: Мое Поле 5
sw: Sehemu yangu 5

source: Multiselect
ru: Multiselect (множественный выбор)
sw: Chaguanyingi

source: Field6
ru: Поле6
sw: Sehemu6

source: Field7
ru: Поле7
sw: Sehemu7

source: My Field 6
ru: Мое Поле 6
sw: Sehemu yangu 6

source: Date / Time
sw: Tarehe / Muda

source: Active
ru: Активный
sw: Amilifu

source: Block
sw: fungu

source: Column
ru: Поле
sw: Safuwima

source: $Env{"UserDynamicField_Field1"}
sw: $Env{"MtumiajiSehemuInayobadilika_Sehemu1"}

source: Key:
ru: Ключ:
sw: Ufunguo:

source: Label:
ru: Метка:
sw: Lebo:

source: Module:
sw: Moduli:

source: Kernel::Output::HTML::PreferencesGeneric
sw: Kiini::Matokeo::HTML::MapendeleoUjumla

source: PrefKey:
sw: MapendeleoUfunguo:

source: UserDynamicField_Field1
sw: MtumiajiSehemuInayobadilika_Sehemu1

source: Prio:
sw: Kipaumbele:

source: Debug
ru: Отладка
sw: Eua

source: Info
ru: Информация
sw: Maelezo

source: Error
ru: Ошибка
sw: Kasoro

source: &lt;OperationName&gt;
sw: &lt;JinaOperesheni&gt;

source: KeyMapRegEx
sw: UfunguoUnganishaRegEx

source: ValueMap
sw: ThamaniUnganisha

source: &lt;newkey&gt;
sw: &lt;ufunguompya&gt;

source: valueMapExact
sw: thamaniUnganishaHalisi

source: ValueMapRegEx
sw: ThamaniUnganishaRegEx

source: MappingOutbound
sw: KuunganishaZinazotoka

source: &lt;InvokerName&gt;
sw: &lt;MchocheziJina&gt;
