Repository: DSigmund/doc-admin
Catalog: i18n/doc-admin.*.po
Languages: ja, ru, sw

source: Whether the results of a statistic are to be cached or not can be setup in the configuration. Cached report results are stored as files in the <filename>var/tmp</filename>directory of the OTRS installation (in most cases <filename>/opt/otrs/var/tmp</filename>).
ja: 統計の結果がキャッシュされるかされないかは構成でセットアップされます。キャッシュ・レポート結果は、OTRSインストレーション(ほとんどの場合<filename>/opt/otrs/var/tmp</filename>)の<filename>var/tmp</filename> directoryでファイルとして格納されます。
ru: Результаты статистики должны быть сохранены в кэше или не могут быть установлены в конфигурации. Кэшированые результаты отчетов хранятся в файлах в каталоге <filename>var/tmp</filename> установленной системы OTRS (в большинстве случаев <filename>/opt/otrs/var/tmp</filename>).
sw: Kama matokeo ya takwimu yatawekwa kwenye hifadhi muda au la inaweza kusetiwa kwenye usanidi. Matokeo ya ripoti ya kwenye hifadhi muda yanahifadhiwa kama mafaili kwenye mpangilio orodha <filename>var/tmp</filename> wa usakinishaji wa OTRS (kwa mara nyingi <filename>/opt/otrs/var/tmp</filename>).

source: Cached stats can be recognized by the "Stats" prefix.
ja: キャッシュ・統計は、「Stat」接頭辞によって認識することができます。
ru: Кэшированная статистика может быть распознана с помощью префикса "Stats".
sw: Takwimu za hifadhi muda zinaweza kujulikana kwa kiambishi awali "Takwimu".

source: If the data is lost, no major damage is caused. The next time the report is called up, the stats module will not find the file any more and so will generate a new report. Of course this will probably take a little longer to run.
ja: データが失われるにしても、大きな被害を引き起こしません。次回レポートが呼び出される時には、統計モジュールはファイルを見つけることなく、新規レポートを生成するでしょう。もちろん、これは恐らく実行にもう少し長くかかるでしょう。
ru: В случае потери данных системе не будет принесено серьезного ущерба. При вызове модуля статистики в следующий раз, в случае если он не обнаружит файл, отчет сгенерируется заново. Конечно, это может занять немного больше времени.
sw: Kama data zimepotea, hakuna madhara makubwa yaliyosababishwa. Mara nyingine ripoti itakapoitwa, moduli ya hali haitatafuta faili hilo tena na kwa hiyo itazalisha ripoti mpya. Bila shaka hii itachukua muda zaidi kidogo kufanyika.

source: This file is saved in the <filename>bin</filename>directory. It facilitates the generation of report in the command line.
ja: このファイルは<filename>bin</filename> directoryに保存されます。それは、コマンドライン中のレポートの生成に役立ちます。
ru: Этот файл хранится в директории <filename>bin</filename>. Он позволяет генерировать статистику прямо из командрной строки.
sw: Hili faili linahifadhiwa kwenye mpangilio orodha <filename>bin</filename>. Inawezesha uzalishaji wa ripoti katika tungo amri.

source: As an example, see the command line call in the following script.
ja: 例として、次のスクリプトでコマンドライン呼び出しを参照してください。
ru: В качестве примера смотрите вызов Сценария из командной сторки, который приведен ниже.
sw: Kama mfano, ona ita ya tungo amri katika hati ifuatayo.

source: bin> perl otrs.GenerateStats.pl -n 10004 -o /output/dir
ja: bin&gt; perl otrs.GenerateStats.pl -n 10004 -o /output/dir

source: <emphasis>Script: Generating a report from the command line.</emphasis>
ja: <emphasis>スクリプト：コマンドラインからのレポートの生成</emphasis>
ru: <emphasis>Сценарий: Создание отчета из командной строки.</emphasis>
sw: <emphasis>Hati: Kuzalisha ripoti kutoka kwenye tungo amri.</emphasis>

source: A report from the stat configuration "Stat# 10004" is generated and saved as csv in the <filename>/output/dir</filename> directory.
ja: 統計構成「Stat# 10004」からのレポートは<filename>/output/dir</filename> ディレクトリー中でcsvとして生成され保存されます。
ru: Отчет из конфигурации статистики "Stat# 10004" генерируется и хранится в csv-формате в директории <filename>/output/dir</filename>.
sw: Ripoti kutoka kwenye usanidi wa takwimu "Stat#10004" unazalishwa na kuhifadhiwa kama csv katika mpangilio orodha <filename>/output/dir</filename>.

source: The generated report can also be sent as an e-mail. More information can be called up with the command in the script below.
ja: 生成されたレポートも、Eメールとして送ることができます。より多くの情報は、スクリプト中のコマンドで下に呼び出すことができます。
ru: Сгенерированный отчет также быть отправлен по электронной почте. Более подробную информацию можно получить выполнив команду из Сценария приведенног ниже.
sw: Ripoti iliyotengenezwa pia inaweza kutumwa kama barua pepe. Taarifa zaidi zinaweza patikana kwa agizo katika hati chini.

source: <emphasis>Script: Getting information about the otrs.GenerateStats.pl file.</emphasis>
ja: <emphasis>スクリプト: otrs.GenerateStats.plファイルに関する情報の入手</emphasis>
ru: <emphasis>Сценарий: Получение информации о файле otrs.GenerateStats.pl.</emphasis>
sw: <emphasis>Hati: Kupata taarifa kuhusu faili la otrs.GenerateStats.pl.</emphasis>

source: Automated stat generation - Cronjob
ja: 自動統計生成 - Cronジョブ
ru: Автоматическое создание статистики с помощью планировщика заданий - Cronjob
sw: Utengenezaji takwimu otomatiki - Kazi za mfumo zilizopangwa

source: It usually does not make sense to generate reports manually via the command line, as the stats module has a convenient graphical user interface. However, generating reports manually does make sense when combined with a Cronjob.
ja: 統計モジュールに便利なGUIがあるため、通常はコマンドラインによってレポートを手動で生成しても意味をなしません。しかしながら、Cronジョブと結合した時、手動によるレポートの生成は意味をなします。
ru: Очевидным является тот факт, что в действительности, нету необходимости генерировать отчеты вручную, из командной строки, так как модудь статистики имеет удобный графический веб-интерфейс пользователя. Однако, создание отчетов вручную имеет смысл в сочетании с Cronjob.
sw: Kwa kawaida haina maana kutengeneza ripoti kwa mikono kupitia tungo amri, kwani moduli ya takwimu ina kiolesura michoro rahisi. Lakini, kutengeneza ripoti kwa mikono inaleta maana ikiunganishwa na kazi za mfumo zilizopangwa.

source: Imagine the following scenario: On the first day of every month, the heads of department want to receive a report for the past month. By combining a cronjob and command line call the reports can be sent to them automatically by e-mail.
ja: 次のシナリオを想像してください:毎月の1日目に、部長は先月のレポートを受け取りたい。cronジョブとコマンドラインの呼び出しを組み合わせることによって、レポートは、Eメールでそれらに自動的に送ることができます。
ru: Представьте себе следующую ситуацию: Каждый первый день месяца, руководители отделов хотят получать отчет за последний месяц. Объединив cronjob с командой запуска сценария в командной строке, статистика может отправляться им по электронной почте автоматически.
sw: Fikiria mazingira yafuatayo: Kila siku ya kwanza ya mwezi, wakuu wa idara wanataka kupokea ripoti ya mwezi uliopita. Kwa kujumuisha kazi za mfumo zilizopangwa na muito wa tungo amri ripoti zinaweza kutumwa kwa kiotomatiki kwa barua pepe.

source: Static stats
ja: 静的な統計
ru: Статические отчеты
sw: Takwimu tuli

source: The stats module facilitates the generation of static statistics. For every static stat a file exists in which its content is precisely defined.
ja: 統計モジュールは、静的統計の生成に役立ちます。全ての静的統計はそのコンテンツが正確に定義されているファイルに存在します。
ru: Модуль статистики облегчает генерацию статической статистики. Для каждой статической статистики создается отдельный файл, в котором точто определено его содержание.
sw: Moduli ya takwimu inawezesha uzalishaji wa takwimu tuli. Kwa kila takwimu tuli faili linakuwepo ambalo maudhui yake yamefafanuliwa kwa ufasaha.

source: This way, very complex stats can be generated. The disadvantage is that they are not particularly flexible.
ja: このように非常に複雑な統計が生成されます。そのデメリットはそれらが特に柔軟ではないことです。
ru: Таким образом может быть сгенерирована очень сложная статистика. Главным недостатком является то, что этот способ есть не очень гибким.
sw: Njia hii, takwimu changamano zinaweza kuzalishwa. Kasoro yake ni hazibadiliki kirahisi.

source: The files are saved in the directory <filename>Kernel/System/Stats/Static/</filename>.
ja: ファイルはディレクトリ<filename>Kernel/System/Stats/Static/</filename> に保存されます。
ru: Файлы хранятся в директории <filename>Kernel/System/Stats/Static/</filename>.
sw: Mafili yanahifadhiwa kwenye mpangilio orodha <filename>Kernel/System/Stats/Static/</filename>.

source: Using old static stats
ja: 古い静的な統計の使用
ru: Использование устаревших данных статической статистики
sw: Kutumia takwimu tuli za zamani

source: Prior OTRS versions 1.3 and 2.0 already facilitated the generation of stats / reports. Various reports for OTRS versions 1.3 and 2.0 which have been specially developed to meet customers' requirements can be used in recent OTRS versions too.
ja: 先のOTRSバージョン1.3および2.0は、既に統計/レポートの生成を促進しました。顧客の必要条件を満たすために特に開発されているOTRSバージョン1.3および2.0のための様々なレポートは、最近のOTRSバージョンの中でまた使用することができます。
ru: Прежние версии OTRS 1.3 и 2.0 уже позволяли генерировать отчеты. Различные отчеты для OTRS версии 1.3 и 2.0 которые были специально разработаны для удовлетворения потребностей клиентов могут быть использованы в более позних версиях OTRS.
sw: Kabla ya OTRS 1.3 na 2.0 uzalishaji wa ripoti / takwimu ulishawezeshwa. Ripoti tofauti za matoleo ya OTRS 1.3 na 2.0 ambazo ziliundwa kufikia mahitaji ya wateja zinaweza kutumika katika matoleo ya OTRS ya sasa pia.

source: The files must merely be moved from the <filename>Kernel/System/Stats/</filename> path to <filename>Kernel/System/Stats/Static/</filename>. Additionally the package name of the respective script must be amended by "::Static".
ja: ただ、ファイルは、<filename>Kernel/System/Stats/</filename> のパスから<filename>Kernel/System/Stats/Static/</filename> のパスへ移動されなければいけません。さらに、「::Static」によってそれぞれのスクリプトのパッケージ名を修正しなければなりません。
ru: Файлы должны быть просто перемещены из <filename>Kernel/System/Stats/</filename> в <filename>Kernel/System/Stats/Static/</filename>. Кроме этого имя пакета соответствующего сценария должен быть заменен на "::Static".
sw: Mafaili lazima yahamishwe kutoka njia <filename>Kernel/System/Stats/</filename> kwenda <filename>Kernel/System/Stats/Static/</filename>. Pia jina la kifurushi cha hati hiyo lazima kirekebishwe na "::Tuli"

source: The following example shows how the first path is amended.
ja: 次の例は、最初のパスがどのように修正されるか示します。
ru: В следующем примере показано как изменяется первый путь.
sw: Mfano ufwatao unaonyesha jinsi njia ya kwanza inavyofanyiwa marekebisho.

source: Default stats
ja: Default stats（デフォルト統計）
ru: Статистика по умолчанию
sw: Takwimu zilizopo

source: "It is not always necessary to reinvent the wheel..."
ja: 「わかり切ったことを最初からやり直すことは必ずしも必要だとは限りません...」
ru: "Не всегда нужно изобретать велосипед..."
sw: "Sio muhimu wakati wote kuunda vitu ambavyo vipo tayari..... "

source: The stats module provides various default reports. Reports which are of interest for all OTRS users will in future be added to the default reports set of the stats module package. Default reports are saved in the stats module xml format in the<filename>scripts/test/sample/</filename> directory.
ja: 統計モジュールは様々なデフォルトレポートを提供します。すべてのOTRSユーザに興味深いレポートは、統計モジュール・パッケージのデフォルトレポートセットに今後加えられるでしょう。デフォルトレポートは、<filename>scripts/test/sample/</filename> ディレクトリー中の統計モジュールxmlフォーマットで保存されます。
ru: Модуль статистики предоставляет различные предустановленные отчеты. Предустановленные отчеты, которые могут заинтересовать всех OTRS пользователей можно в будущем добавить в модуль статистики. Предустановленные отчеты хранится в модуле статистики в xml-формате в директории <filename>scripts/test/sample/</filename>.
sw: Moduli ya takwimu inatoa ripoti chaguo-msingi mbali mbali. Ripoti ambazo ni za muhimu kwa watumiaji wote wa OTRS baadaye zitaongezwa kwenye seti ya ripoti chaguo-msingi za kifurushi cha moduli za takwimu. Ripoti chaguo-msingi zinahifadhiwa katika muundo wa xml wa moduli za takwimu kwenye mpangilio orodha <filename>scripts/test/sample/</filename>.

source: Installation
ja: インストレーション
ru: Установка
sw: Usanikishaji

source: This chapter describes the installation and basic configuration of the central OTRS framework. It covers information on installing OTRS from source, or with a binary package such as an RPM or a Windows exectuable.
ja: 本章は、主要なOTRSフレームワークのインストレーションおよび基礎的な構成について記述します。OTRSをインストールする情報を、ソース、あるいはRPMまたはウィンドウズ実行可能なバイナリ・パッケージでカバーします。

source: Topics covered here include configuration of the web and database servers, the interface between OTRS and the database, the installation of additional Perl modules, setting proper access rights for OTRS, setting up the cron jobs for OTRS, and some basic settings in the OTRS configuration files.
ja: ここでカバーするトピックは以下を含みます。ウェブおよびデータベース・サーバ、OTRSとデータベースの間のインターフェース、追加のパール・モジュールのインストール、OTRSのためのセットする適切なアクセス権、OTRSのためにcronジョブをセット・アップすること、OTRS設定ファイル中のいくつかの基礎的な設定の構成、です。
ru: В этой главе рассматриваются такие вопросы как: конфигурация веб-сервера и сервера базы данных, интефейса между OTRS и базой данных, установка дополнительных Perl-модулей, установка соответствующих прав доступа для OTRS, настройка планировщика задач cron jobs для OTRS и основных параметров в конфигурационных файлах.
sw: Mada zinazopitiwa hapa zinahusu usanidi wa seva za tovuti na za hifadhidata, kiolesura kati ya OTRS na hifadhidata, usakinishaji wa moduli za ziada za Perl, kuseti haki sawa za ufikivu za OTRS, kuanzisha kazi za mfumo zilizopangwa za OTRS, na baadhi ya mipangilio ya msingi katika mafaili ya usanidi ya OTRS.

source: Follow the detailed steps in this chapter to install OTRS on your server. You can then use its web interface to login and administer the system.
ja: 本章の詳細なステップに従ってOTRSをサーバにインストールしましょう。インストールが完了したらウェブ・インターフェースを使用してシステムにログインし管理することができます。
ru: Следуйте подробным шагам этой главы чтобы установить OTRS на своем сервере. Потом можно использовать его веб-интерфейс чтобы войти в систему и производить администрирование.
sw: Fuata hatua hizi za undani katika sura hii kusakinisha OTRS katika seva yako. Kisha utaweza kutumia kiolesura chake cha tovuti kuingia na kusimamia mfumo.

source: GNU Free Documentation License
ja: GNUフリー文書許諾契約書
sw: Leseni ya Nyaraka Huru ya GNU

source: Copyright (C) 2000 Free Software Foundation, Inc. 59 Temple Place, Suite 330, Boston, MA 02111-1307 USA Everyone is permitted to copy and distribute verbatim copies of this license document, but changing it is not allowed.
ja: Copyright (C) 2000 Free Software Foundation, Inc. 59 Temple Place, Suite 330, Boston, MA 02111-1307 USA このライセンス・ドキュメントの逐語的な原稿は誰でもコピーするおよび配布することを許可します。しかし変更は許可しません。
sw: Hakimiliki (C) 2000 Free Software Foundation, Inc. 59 Temple Place, Suite 330, Boston, MA 02111-1307 USA Kila mtu anaruhusiwa kuchukua nakala na kusambaza nakala za maneno yale yale za leseni ya nyaraka hii lakini kubadilisha hairuhusiwi.

source: PREAMBLE
ja: はじめに
sw: UTANGULIZI

source: The purpose of this License is to make a manual, textbook, or other written document "free" in the sense of freedom: to assure everyone the effective freedom to copy and redistribute it, with or without modifying it, either commercially or non-commercially. Secondarily, this License preserves for the author and publisher a way to get credit for their work, while not being considered responsible for modifications made by others.
ja: この利用許諾契約書の目的は、この契約書が適用されるマニュアルや教科書、 その他機能本位で実用的な文書を(無料ではなく)自由という意味で「フリー」 とすること、すなわち、改変の有無あるいは目的の営利非営利を問わず、文書 を複製し再頒布する自由をすべての人々に効果的に保証することです。加えて この契約書により、著者や出版者が自分たちの著作物に対して相応の敬意と賞 賛を得る手段も保護されます。また、他人が行った改変に対して責任を負わず に済むようになります。
sw: Lengo la hii Leseni ni kutengeneza mwongozo, daftari, au nyaraka nyingine iliyoandikwa "huru" katika hali ya uhuru: kumhakikishia kila mtu uhuru wa kunakili na kuisambaza upya, bila au kwa kuibadilisha, kwa biashara au sio kwa biashara. Kwa hali ya juu zaidi, hii Leseni inahifadhi kwa ajili ya mwandishi na mchapishaji jinsi ya kupata sifa kwa kazi zao, na sio kuonekana wahusika wa kubadili kaziza wengine.

source: This License is a kind of "copyleft", which means that derivative works of the document must themselves be free in the same sense. It complements the GNU General Public License, which is a copyleft license designed for free software.
ja: この利用許諾契約書は「コピーレフト」的なライセンスの一つであり、この契 約書が適用された文書から派生した著作物は、それ自身もまた原本と同じ意味 でフリーでなければなりません。この契約書は、フリーソフトウェアのために 設計されたコピーレフトなライセンスであるGNU一般公衆使用許諾契約書を補足 するものです。
sw: Hii Leseni ni aina ya "nakilikushoto", ambayo inamaanisha kwamba kazi zitokanazo na nyaraka lazima nazo ziwe huru katika hali hiyo hiyo. Inaongezea kwenye GNU Genera Public Licence, ambayo ni leseni ya nakalakushoto iliyoundwa kwa ajili ya programu za bure.

source: We have designed this License in order to use it for manuals for free software, because free software needs free documentation: a free program should come with manuals providing the same freedoms that the software does. But this License is not limited to software manuals; it can be used for any textual work, regardless of subject matter or whether it is published as a printed book. We recommend this License principally for works whose purpose is instruction or reference.
ja: この利用許諾契約書は、フリーソフトウェア用のマニュアルに適用することを 目的として書かれました。フリーソフトウェアはフリーな文書を必要としてお り、フリーなプログラムはそのソフトウェアが保証するのと同じ自由を提供す るマニュアルと共に頒布されるべきだからです。しかし、この契約書の適用範 囲はソフトウェアのマニュアルに留まりません。対象となる著作物において扱 われる主題が何であれ、あるいはそれが印刷された書籍として出版されるか否 かに関わらず、この契約書は文字で書かれたいかなる著作物にも適用すること が可能です。私たちとしては、主にこの契約書を解説や参照を目的とする著作 物に適用することをお勧めします。
sw: Tumeunda hii leseni ili kuweza kuitumia kwa ajili ya miongozo ya programu za bure, kwa sababau programu za bure zinahitaji nyaraka za bure: programu ya bure lazima ije na miongozo inayotoa uhuru sawa na ule unaotolewa na programu. Lakini hii leseni haina kikomo kwa miongozo ya programu; inaweza kutumika kwa ajili ya kazi zozote za nakala, bila kujali mada au kwamba inachapishwa kama kitabu. Tunashauri hii leseni kwa kazi ambazo lengo lake ni maelekezo au marejeo.

source: APPLICABILITY AND DEFINITIONS
ja: この利用許諾契約書の適用範囲と用語の定義
sw: UTUMIKAJI NA FASILI

source: This License applies to any manual or other work that contains a notice placed by the copyright holder saying it can be distributed under the terms of this License. The "Document", below, refers to any such manual or work. Any member of the public is a licensee, and is addressed as "you".
ja: 著作物がこの利用許諾契約書の定める条件の下で頒布される旨の告知を、著作 権者がその中に書いたすべてのマニュアルあるいはその他の著作物は、この契約書の適用対象となります。以下において、「『文書』(Document)」 とはそのような告知が記載されたマニュアルないし著作物すべてを指します。公衆の一員ならば誰でも契約の当事者となることができ、この契約書中では「あなた」と表現されます。
sw: Leseni inafanya kazi kwa mwongozo wowote au kazi nyingine ambayo ina notisi iliyowekwa na mmiliki wa hakimiliki inayosema inaweza kusambazwa chini ya makubaiano ya Leseni hii. "Waraka", hapa chini, unaashiria mwongozo wowote au kazi. Mwanachama yoyote wa umma ni mmiliki wa leseni, na anaitwa "wewe".

source: A "Modified Version" of the Document means any work containing the Document or a portion of it, either copied verbatim, or with modifications and/or translated into another language.
ja: 『文書』の「改変版 (Modified Version)」とは、一字一句忠実に複製したか、 あるいは改変や他言語への翻訳を行ったかどうかに関わらず、その『文書』の 全体あるいは一部分を含む著作物すべてを意味します。
sw: "Toleo Lililobadilishwa" la Nyaraka inamaanisha kazi yoyote yenye Nyaraka au sehemu yake, aidha nakala isiyobadilishwa, au yenye mabadiliko na/au iliyotafsiriwa kwenda lugha nyingine.

source: A "Secondary Section" is a named appendix or a front-matter section of the Document, that deals exclusively with the relationship of the publishers or authors of the Document to the Document's overall subject (or to related matters), and contains nothing that could fall directly within that overall subject. (For example, if the Document is in part a textbook of mathematics, a Secondary Section may not explain any mathematics.) The relationship could be a matter of historical connection with the subject or with related matters, or of legal, commercial, philosophical, ethical or political position regarding them.
ja: 「補遺部分 (Secondary Section)」とは、文書中でその旨指定された補遺 ないし本文に先だって前付けとして置かれる一部分であり、文書の出版者 あるいは著者と、文書全体の主題 (あるいはそれに関連する事柄)との関係のみを論じ、全体としての主題の範疇に直接属する内容を全く含まないものです (たとえば、文書の一部が数学の教科書だった場合、補遺部分では数学について何も解説してはなりません)。補遺部分で扱われる関係は、その主題あるいは関連する事柄との歴史的なつながりのことかも知れないし、それらに関する法的、商業的、哲学的、倫理的、あるいは政治的立場についてかも知れません。
sw: "Kifungu cha Sekondari" ni kiambatanisho kilichopewa jina au kifungu cha mambo ya mbele ya nyaraka, inayohusika kipekee na uhusiano wa mchapishaji au mwandishi wa nyaraka na kichwa cha habari cha ujumla cha nyaraka (au kwa mambo yanayohusiana), na haina kitu ambacho kinaweza kuingia moja kwa moja ndani ya kichwa cha habari cha ujumla. (Kwa Mfano, kama Nyaraka ni sehemu ya kitabu cha hisabati, Kifungu cha Sekondari hakiwezi kuelezea hesabu yoyote.) Uhusiano huo unaweza kuwa wa muunganiko wa kihistoria au mambo yanayohusika, au sheria, biashara, falsafa, maadili au nafasi ya siasa inayohusiana nazo.

source: The "Invariant Sections" are certain Secondary Sections whose titles are designated, as being those of Invariant Sections, in the notice that says that the Document is released under this License.
ja: 「変更不可部分 (Invariant Sections)」とは補遺部分の一種で、それらが変更 不可部分であることが、文書をこの利用許諾契約書の下で発表する旨述べ た告知中においてその部分の題名と共に明示されているものです。
sw: "Vifungu Visivyoathirika" ni Vifungu fulani vya Sekondari ambavyo vichwa vyao vimeteuliwa, kama vile vya Vifungu Visivyoathirika, katika notisi isemayo nyaraka imetolewa chini ya Leseni hii.

source: The "Cover Texts" are certain short passages of text that are listed, as Front-Cover Texts or Back-Cover Texts, in the notice that says that the Document is released under this License.
ja: 「カバーテキスト(Cover Texts)」とは、文書がこの利用許諾契約書の指定する条件の下で発表される旨述べた告知において、「表カバーテキスト」あるいは「裏カバーテキスト」として列挙された短い文章のことを指します。
sw: "Nakala za Jalada" ni vifungu vifupi vya maneno ambavyo vimeorodheshwa, kama Nakala za Mbele za Jalada au Nakala za Nyuma za Jalada, katika notisi inayosema Nyaraka imetolewa chini ya Leseni hii.

source: A "Transparent" copy of the Document means a machine-readable copy, represented in a format whose specification is available to the general public, whose contents can be viewed and edited directly and straightforwardly with generic text editors or (for images composed of pixels) generic paint programs or (for drawings) some widely available drawing editor, and that is suitable for input to text formatters or for automatic translation to a variety of formats, suitable for input to text formatters. A copy made in an otherwise Transparent file format, whose markup has been designed to thwart or discourage subsequent modification by readers is not Transparent. A copy that is not "Transparent" is called "Opaque".
ja: 文書の「透過的」複製物とは、機械による読み取りが可能な文書の複製物のことを指します。透過的な複製物の文書形式は、その仕様が一般の人々に入手可能で、文書の内容を一般的なテキストエディタ、または(画素で構成さ れる画像ならば)一般的なペイントプログラム、あるいは(図面ならば)いくつかの広く入手可能な製図エディタで簡単に改訂するのに適しており、なおかつテキストフォーマッタへの入力に適する(あるいはテキストフォーマッタへの入力に適する諸形式への自動的な変換に適する)ものでなければなりません。透過的なファイル形式への複製であっても、マークアップ、あるいはマークアップの不在が読者によるそれ以降の改変をわざと邪魔し阻害するように仕組まれたものは透過的であるとは見做されません。ある画像形式が、相当量のテキスト文章を表現するために使われた場合、それは透過的ではない。透過的ではない複製は「非透過的」複製と呼ばれます。
sw: Naka "Angavu" ya Nyaraka inamaanisha nakala inayoweza kusomwa na mashine, inayowakilishwa katika umbo ambalo ubainishwaji wake unapatikana kwa umma kwa ujumla, ambao maudhui yake yanaweweza kuonekana na kuhaririwa moja kwa moja na kwa urahisi kwa kutumia vihariri vya nakala za ujumla au (kwa ajili ya taswira zilizojengwa na pikseli) programu za uchoraji za ujumla au (kwa ajili ya michoro) baadhi ya vihariri vya michoro vinavyopatikana kirahisi, na ambavyo vinafaa kwa ajili ya ingizo la nakala kwenye vinavyoandaa umbizo au kwa ajili ya tafsiri otomatiki kwa maumbo mbali mbali, vinavyofaa kwa ajili ya ingizo la viandaa umbizo la nakala. Nakala iliyotengenezwa katika faili lenye umbizo Angavu, ambalo dhulisho mabadiliko yake imeundwa kuzuia au kukatisha tamaa maboresho ya wasomaji sio Angavu. Nakala ambayo siyo "Angavu" inaitwa "Isiyo angavu".
