Repository: DSigmund/doc-admin
Catalog: i18n/doc-admin.*.po
Languages: ja, ru, sw

source: All data for the mail accounts are saved in the OTRS database. The <filename>otrs.PostMasterMailbox.pl</filename> script, which is located in the <filename>bin</filename> directory of your OTRS installation, uses the settings in the database and fetches the mail. You can execute <filename>./bin/otrs.PostMasterMailbox.pl</filename> manually to check if all your mail settings are working properly.
ja: メールアカウント用データはすべてOTRSデータベースの中で保存されます。<filename>otrs.PostMasterMailbox.pl</filename> スクリプト(OTRSインストレーションの<filename>bin</filename>ディレクトリーにあります)は、データベースの中で設定を使用し、メールを取って来ます。全てのメール設定が適切に動いているかどうかをチェックするために<filename>./bin/otrs.PostMasterMailbox.pl</filename>を手動で実行することができます。
ru: Все данные для учетных записей электронной почты сохраняются в базе данных OTRS. Скрипт <filename>otrs.PostMasterMailbox.pl</filename>, который находится в директории <filename>bin</filename> вашей системы OTRS, использует настройки в базе данных и получает почту. Вы можете выполнить файл <filename>./bin/otrs.PostMasterMailbox.pl</filename> вручную чтобы проверить что все ваши настройки почты работают правильно.
sw: Data zote za akaunti za barua zinahifadhiwa kwenye hifadhidata ya OTRS. Hati ya <filename>otrs.PostMasterMailbox.pl</filename>, ambayo inapatikana kwenye mpangilio orodha wa <filename>bin</filename> wa usakinishaji wa OTRS, inatumia mipangilio ya hifadhidata na kutafuta hiyo barua. Unaweza kutekeleza <filename>./bin/otrs.PostMasterMailbox.pl</filename> kwa mikono ili kukagua kama mipangilio yako yote ya barua inafanya kazi kwa usahihi.

source: On a normal installation, the mail will be fetched every 10 minutes by the <filename>postmaster_mailbox</filename> cron job. For further information about modifying cron jobs, please refer to the <link linkend="cronjobs">"Setting up the cron jobs for OTRS"</link> section.
ja: 正常なインストレーションにおいては、<filename>postmaster_mailbox</filename> cronジョブによってメールが10分ごとに取って来られるでしょう。cronジョブの修正に関するさらに詳しい情報に関しては、<link linkend="cronjobs">"「OTRSのためにcronジョブをセット・アップする」"</link> セクションを参照してください。
sw: Katika usakinishaji wa kawaida, barua itatafutwa kila dakika 10 kwa kutumia kazi za mfumo zilizopangwa za <filename>postmaster_mailbox</filename>. Kwa taarifa zaidi kuhusu kuboresha kazi za mfumo zilizopangwa, tafadhali rejea kwenye kifungu <link linkend="cronjobs">"Kuanzisha kazi za mfumo zilizopangwa za OTRS"</link>

source: When fetching mail, OTRS deletes the mail from the POP or IMAP server. There is no option to also keep a copy on the server. If you want to retain a copy on the server, you should create forwarding rules on your mail server. Please consult your mail server documentation for details.
ja: メールを取って来る場合、OTRSはPOPかIMAPサーバーからメールを削除します。さらにサーバ上でコピーを保存するオプションはありません。サーバのコピーを保持したければ、メールサーバで転送規則を作成するとよいでしょう。詳細のためにメールサーバ・ドキュメンテーションを調べてください。
ru: При получении почты OTRS удаляет почту с POP или IMAP сервера. Нету такой опции, которая бы позволяла хранить копию сообщения на сервере. Если вы все же хотите чтобы такая возможность присутствовала, скорей всего нужно воспользоваться правилами переадресации на почтовый сервер. Оратитесь пожалуйста к документации по вашему почтовому серверу.
sw: Wakati wa kutafuta barua pepe, OTRS inafuta barua hiyo kutoka kwenye seva ya POP au IMAP. Hakuna njia ya kuweka nakala kwenye seva. Kama unataka kubakiwa na nakala kwenye seva, unatakiwa utengeneze sheria za kupeleka mbele katika seva yako ya barua. Tafadhali tembelea nyaraka zako za seva ya barua kwa undani.

source: Via command line program and procmail (otrs.PostMaster.pl)
ja: コマンドライン・プログラムおよびprocmail経由(otrs.PostMaster.pl)
ru: Через командную строку программы и например, procmail (otrs.PostMaster.pl)
sw: Kupitia programu ya tungo amri na procmail (otrs.PostMaster.pl)

source: If you cannot use mail accounts to get the email into OTRS, the command line program <filename>bin/otrs.PostMaster.pl</filename> might be a way around the problem. It takes the mails via STDIN and pipes them directly into OTRS. That means email will be available in your OTRS system if the MDA (mail delivery agent, e.g. procmail) executes this program.
ja: OTRSにEメールを入れるためにメールアカウントを使用することができなければ、コマンドライン・プログラム <filename>bin/otrs.PostMaster.pl</filename>はその問題を解決するひとつの方法かもしれません。それはSTDIN経由でメールを取り、OTRSにそれらを直接送ります。それは、MDA(メール配信エージェント(例えばprocmail))がこのプログラムを実行すれば、EメールがOTRSシステムにおいて利用可能だろうということを意味します。
ru: Если для получения электронной почты в OTRS нету возможности использовать учетные записи, то эту проблему можно решить с помощью программы командной строки <filename>bin/otrs.PostMaster.pl</filename>Она принимает сообщения электронной почты через STDIN и направляет их непосредственно в OTRS. Это значит что емейлы будут доступны в OTRS когда MDA (Mail Delivery Agent - Агент доставки почты) выполняет эту программу.
sw: Kama huwezi kutumia akaunti za barua kuingiza barua pepe kwenye OTRS, programu ya tungo amri <filename>bin/otrs.PostMaster.pl</filename>inaweza kuwa njia ya kutatua tatizo. Inazichukua barua kupitia STDIN na kuziingiza kwenye OTRS. Hii ina maanisha barua pepe zitapatikana kwenye mfumo wako wa OTRS kama MDA (wakala usambazaji wa barua mf. procmail) ikitekeleza programu hii.

source: To test <filename>bin/otrs.PostMaster.pl</filename> without an MDA, execute the command of the following script.
ja: MDAなしで <filename>bin/otrs.PostMaster.pl</filename>をテストするには、次のスクリプトのコマンドを実行してください。
ru: Для тестирования <filename>bin/otrs.PostMaster.pl</filename> без MDA, выполните команду приведенную в листинге нижеприведенного сценария.
sw: Kujaribu <filename>bin/otrs.PostMaster.pl</filename> bila MDA, tekeleza maagizo ya hati ifuatayo.

source: <emphasis>Script: Testing PostMaster without the MDA.</emphasis>
ja: <emphasis>スクリプト:MDAのないポストマスターのテスト</emphasis>
ru: <emphasis>Сценарий: Тестирование PostMaster без MDA.</emphasis>
sw: <emphasis>Hati: Kujaribisha MkuuWaPosta bila MDA.</emphasis>

source: If the email is shown in the QueueView, then your setup is working.
ja: EメールがQueueViewの中で表示される場合、あなたの設定は正しく動作しています。
ru: Если сообщения электронной почты отображаются в QueueView, значит вашы настройки работают.
sw: Kama barua pepe imeonyeshwa kwenye MuonekanoFoleni, basi mpangilio wako unafanya kazi.

source: Procmail is a very common e-mail filter in Linux environments. It is installed on most systems. If not, have a look at the <ulink url="http://www.procmail.org/"><citetitle>procmail homepage</citetitle></ulink>.
ja: ProcmailはLinux環境中でとても普及しているEメール・フィルタです。ほとんどのシステムにそれがインストールされます。そうでなければ、<ulink url="http://www.procmail.org/"><citetitle>procmailホームページ</citetitle></ulink>を見てください。
ru: Procmail - это очень распостраненный фильтр электронной почты в среде Linux. Он устанавливается на большинстве систем. Если нет, перейдите по ссылке <ulink url="http://www.procmail.org/"><citetitle>procmail homepage</citetitle></ulink>.
sw: Procmail ni kichujio cha barua pepe kinachojulikana sana katika mazingira ya Linux. Inasakinishwa katika mifumo mingi. Kama siyo, angalia katika <ulink url="http://www.procmail.org/"><citetitle>ukurasa wa nyumbani wa procmail</citetitle></ulink>.

source: To configure procmail for OTRS (based upon a procmail configured MTA such as sendmail, postfix, exim or qmail), use the <filename>~otrs/.procmailrc.dist</filename> file and copy it to <filename>.procmailrc</filename> and add the lines of the script below.
ja: OTRS用にprocmailを構成するためには(sendmail、postfix、eximあるいはqmailといったprocmail構成のMTAに基づいた）、<filename>~otrs/.procmailrc.dist</filename>ファイルを使用して、<filename>.procmailrc</filename>にそれをコピーして、スクリプトのラインを下に加えてください。
ru: Для настройки procmail для OTRS (требуется сконфигурированный транспортный агент MTA, например sendmail, postfix, exim or qmail), используйте файл <filename>~otrs/.procmailrc.dist</filename>, скопируйте его в <filename>.procmailrc</filename> а затем добавьте строки из нижеприведенного сценария.
sw: Kusanidi procmail kwa ajili ya OTRS (kutegemeana na MTA iliyosanidiwa na procmail kama sendmail, postfix, exim au qmail), tumia faili <filename>~otrs/.procmailrc.dist</filename> na nakili kwenda kwenye <filename>.procmailrc</filename> na ongeza mistari ya hati chini.

source: SYS_HOME=$HOME PATH=/bin:/usr/bin:/usr/local/bin # -- # Pipe all email into the PostMaster process. # -- :0 : | $SYS_HOME/bin/otrs.PostMaster.pl
ja: SYS_HOME=$HOME PATH=/bin:/usr/bin:/usr/local/bin # -- # 全てのEメールをthe PostMaster processへPipe します。 # -- :0 : | $SYS_HOME/bin/otrs.PostMaster.pl

source: <emphasis>Script: Configuring procmail for OTRS.</emphasis>
ja: <emphasis>スクリプト:OTRSのためのprocmailの構成。</emphasis>
ru: <emphasis>Сценарий: Настройка procmail для OTRS.</emphasis>
sw: <emphasis>Hati: Kusanidi procmail kwa ajili ya OTRS.</emphasis>

source: All email sent to the local OTRS user will be piped into <filename>bin/otrs.PostMaster.pl</filename> and then shown in your QueueView.
ja: localのOTRSユーザへ送られたEメールはすべて、<filename>bin/otrs.PostMaster.pl</filename>に送られ、QueueViewで表示されるでしょう。
ru: Все емейлы отсылаемые локальному OTRS-пользователю будут обрабатываться <filename>bin/otrs.PostMaster.pl</filename> и потом отображаться в QueueView.
sw: Barua pepe zote zitakazotumwa kwenye OTRS ya ndani zitapelekwa kwenye <filename>bin/otrs.PostMaster.pl</filename> na kisha kuonyeshwa kwenye MuonekanoFoleni wako.

source: Fetching emails via POP3 or IMAP and fetchmail for otrs.PostMaster.pl
ja: otrs.PostMaster.plのためのPOP3, IMAPおよびfetchmailによるEメールの取得
ru: Получение электронной почты по протоколу POP3 или IMAP и обработка для otrs.PostMaster.pl
sw: Kutafuta barua pepe kupitia POP3 au IMAP na kutafuta otrs.PostMaster.pl

source: In order to get email from your mail server, via a POP3 or IMAP mailbox, to the OTRS machine/local OTRS account and to procmail, use <ulink url="http://fetchmail.berlios.de/">fetchmail</ulink>.
ja: メールサーバから、POP3またはIMAPのメールボックス経由で、OTRSマシン/ローカルのOTRSアカウント、およびprocmailにEメールを受け取るために、<ulink url="http://fetchmail.berlios.de/">fetchmail</ulink>を使用します。
ru: Для того чтобы получить электронную почту с вашего почтового сервера через POP3 или IMAP и сохранить ее на компьютере на котором установлен OTRS, для локального аккаунта или в procmail, перейдите по ссылке <ulink url="http://fetchmail.berlios.de/">fetchmail</ulink>.
sw: Ili kupata barua pepe kutoka kwenye seva yako ya barua, kupitia kikasha barua cha POP3 au IMAP, kwenda kwenye OTRS akaunti ya OTRS ya machine/local na kwenye procmail, tumia <ulink url="http://fetchmail.berlios.de/">tafutabarua</ulink>.

source: A working SMTP configuration on the OTRS machine is required.
ja: OTRSマシン上で作動してるSMTP構成が必要です。
ru: Работающий и сконфигурированный SMTP необходим для работы OTRS.
sw: Usanidi wa SMTP unaofanya kazi unahitajika kwenye mashine ya OTRS.

source: You can use the <filename>.fetchmailrc.dist</filename> in the home directory of OTRS and copy it to <filename>.fetchmailrc</filename>. Modfiy/change it for your needs (see the Example 7-1 below).
ja: OTRSのホームディレクトリーの中で<filename>.fetchmailrc.dist</filename>を使用し、必要に応じて<filename>.fetchmailrc</filename>.Modfiy/changeにそれをコピーすることができます。(下記の例7-1を参照)
ru: Можно использовать файл <filename>.fetchmailrc.dist</filename> в домашней директории OTRS и скопировать его в <filename>.fetchmailrc</filename>. Изменить его в соответствии с вашими требованиями (см. ниже Пример 7-1).
sw: Unaweza kutumia <filename>.fetchmailrc.dist</filename> katika mpangilio orodha wa nyumbani wa OTRS na kuunakili kwenda <filename>.fetchmailrc</filename>. Iboreshe/Ibadilishe kwa mahitaji yako (ona Mfano 7-1 chini).

source: Don't forget to set the .fetchmailrc to 710 ("chmod 710 .fetchmailrc")!
ja: .fetchmailrcを710("chmod 710.fetchmailrc")にセットすることを忘れないでください!
ru: Не забудьте установить.fetchmailrc to 710 ("chmod 710 .fetchmailrc")!
sw: Usisahau kuseti .fetchmailrc kuwa 710 ("chmod 710 .fetchmailrc")!

source: With the <filename>.fetchmailrc</filename> from the Example 7-1 above, all email will be forwarded to the local OTRS account, if the command <command>fetchmail -a</command> is executed. Set up a cronjob with this command if you want to fetch the mails regularly.
ja: 上記の例7-1からの<filename>.fetchmailrc</filename>で、コマンド<command>fetchmail -a</command>が実行されれば、EメールはすべてローカルのOTRSアカウントへ転送されるでしょう。メールを規則的に取って来たい場合は、このコマンドでcronjobをセット・アップしてください。
ru: Из Листинга 7-1 выше, <filename>.fetchmailrc</filename> , все емейлы будут перенаправлены в локальный OTRS-аккаунт, если выполнена команда <command>fetchmail -a</command>. Установите эту команду в планировщике задач cronjob если хотите извлекать емейлы постоянно.
sw: Na <filename>.fetchmailrc</filename> kutoka kwenye Mfano 7-1 hapo juu, barua pepe zote zitapelekwa mbele kwenye akaunti ya ndani ya OTRS, kama agizo <command>fetchmail -a</command> limetekelezwa. Seti kazi ya mfumo iliyopangwa na agizo hili kama ukitaka kutafuta barua mara kwa mara.

source: Filtering/dispatching by OTRS/PostMaster modules (for more complex dispatching)
ja: OTRS/PostMasterモジュール(より多く複雑な送信用の)によるフィルター/送信
ru: Фильтрация/рассылка модулями OTRS/PostMaster (для более сложной диспетчеризации)
sw: Kuchuja/kutuma kwa moduli za OTRS/MkuuWaPosta (kwa ajili ya utumaji changamano)

source: If you use the bin/otrs.PostMaster.pl or bin/otrs.PostMasterMailbox.pl method, you can insert or modify X-OTRS header entries with the PostMaster filter modules. With the X-OTRS headers, the ticket system can execute some actions on incoming mails, sort them into a specific queue, change the priority or change the customer ID, for example. More information about the X-OTRS headers are available in the section about <link linkend="adminarea-postmasterpop3-account">adding mail accounts</link> from the OTRS Admin page.
ja: bin/otrs.PostMaster.plあるいはbin/otrs.PostMasterMailbox.plの方法を使用すれば、PostMasterフィルタ・モジュールを備えたX-OTRSヘッダー・エントリを挿入するか修正することができます。チケットシステムは、X-OTRSヘッダーによって、受信に対するいくつかのアクションを実行するか、特定のキューへそれらをソートするか、優先度を変更するか、あるいは例えば顧客IDを変更することができます。X-OTRSヘッダーに関してより多くの情報、OTRS管理者ページからの<link linkend="adminarea-postmasterpop3-account">「メールアカウントの追加」</link>に関するセクションにおいて利用可能です。
ru: Если вы используете метод bin/otrs.PostMaster.pl или bin/otrs.PostMasterMailbox.pl, то с модулем фильтрации PostMaster можно вставить или модифицировать X-OTRS заголовок. С помощью X-OTRS-заголовков, система обработки заявок может вызывать некоторые действия для входящих сообщений, сортировать их в определенные очереди, или, например, изменять приоритет или ID-клиента. Более подробную информацию о X-OTRS-заголовках можно найти в главе <link linkend="adminarea-postmasterpop3-account"> добавление аккаунтов электронной почты </link> в Панели Администрирования.
sw: Kama ukitumia njia ya bin/otrs.PostMaster.pl au bin/otrs.PostMasterMailbox.pl, unaweza kuingiza au kubadilisha maingizo ya vichwa vya X-OTRS kwa kutumia moduli za kuchuja za MkuuWaPosta. Na vichwa vya X-OTRS mfumo wa tiketi unaweza kutekeleza baadhi ya vitendo kwa barua zinazoingia, kuzipanga kwenye foleni maalumu, kubadili kipaumbele au kubadili kitambulisho cha mteja, kwa mfano. Taarifa zaidi kuhusu vichwa vya X-OTRS zinapatikana katika kifungu kuhusu <link linkend="adminarea-postmasterpop3-account">kuongeza akaunti za barua</link>kutoka kwenye kurasa ya Msimamizi wa OTRS.

source: There are some default filter modules:
ja: いくつかのデフォルト・フィルタ・モジュールがあります:
ru: Есть некоторые предустановленные модули фильтрации:
sw: Kuna baadhi ya moduli chaguo-msingi za kuchuja:

source: The job name (e.g. $Self-&gt;{'PostMaster::PreFilterModule'}-&gt;{'JobName'}) needs to be unique!
ja: ジョブ名 (e.g. $Self->{'PostMaster::PreFilterModule'}->{'JobName'}) はユニークである必要があります。
ru: Название задания (например $Self-&gt;{'PostMaster::PreFilterModule'}-&gt;{'JobName'}) должно быть уникальным!
sw: Jina la kazi (mf. $Self-&gt;{'MkuuWaPosta::ModuliUchujaji'}-&gt;{'JinaKazi'}) linahitaji kuwa la kipekee!

source: Kernel::System::PostMaster::Filter::Match is a default module to match on some email header (e.g. From, To, Subject, ...). It can set new email headers (e.g. X-OTRS-Ignore: yes or X-OTRS-Queue: spam) if a filter rule matches. The jobs of the Example 7-2 can be inserted in <filename>Kernel/Config.pm</filename>
ja: ernel::System::PostMaster::Filter::Match は、いくつかのEメールヘッダ(e.g. From, To, Subject, ...)をマッチさせるためのデフォルトモジュールです。 フィルタ規則がマッチすれば、それは新規Eメールヘッダ(例： X-OTRS-Ignore: yes or X-OTRSQueue:spam)にセットできます。例 7-2のジョブは <filename>Kernel/Config.pm</filename> に挿入可能です。
ru: Kernel::System::PostMaster::Filter::Match модуль по умолчанию для проверки совпадения заголовков определенных емейлов (например "От", "Кому", "Тема", ...). Он может устанавливать новые заголовки email (например X-OTRS-Ignore: да или X-OTRS-Queue: spam) если совпадают правила совпадения. Задания из Примера 7-2 могут быть прописаны в <filename>Kernel/Config.pm</filename>
sw: Kiini::Mfumo::MkuuWaPosta::Kichujio::Fananisha ni moduli chaguo-msingi kwa ajili ya kufananisha baadhi ya vichwa vya barua pepe (mf. Kutoka, Kwenda, Kichwa cha habari, ...). Inaweza kuseti vichwa vipya vya barua pepe (mf. X-OTRS-puuza:ndiyo au X-OTRS-Foleni:barua taka) kama sheria ya kuchuja imefanana. Kazi za Mfano 7-2 unaweza kuingizwa katika <filename>Kernel/Config.pm</filename>

source: Example jobs for the filter module Kernel::System::PostMaster::Filter::Match
ja: フィルタ・モジュールのためのサンプルジョブ
ru: Пример задания для модуля фильтрации Kernel::System::PostMaster::Filter::Match
sw: Kazi za mfano kwa moduli ya kuchuja Kiini::Mfumo::MkuuWaPosta::Kichujio::Fananisha

source: # Job Name: 1-Match # (block/ignore all spam email with From: noreply@) $Self-&gt;{'PostMaster::PreFilterModule'}-&gt;{'1-Match'} = { Module =&gt; 'Kernel::System::PostMaster::Filter::Match', Match =&gt; { From =&gt; 'noreply@', }, Set =&gt; { 'X-OTRS-Ignore' =&gt; 'yes', }, }; # Job Name: 2-Match # (sort emails with From: sales@example.com and Subject: **ORDER** # into queue 'Order') $Self-&gt;{'PostMaster::PreFilterModule'}-&gt;{'2-Match'} = { Module =&gt; 'Kernel::System::PostMaster::Filter::Match', Match =&gt; { To =&gt; 'sales@example.com', Subject =&gt; '**ORDER**', }, Set =&gt; { 'X-OTRS-Queue' =&gt; 'Order', }, };
ja: # Job Name: 1-Match # (noreply@からの全てのスパムEメールをブロックまたは無視) $Self-&gt;{'PostMaster::PreFilterModule'}-&gt;{'1-Match'} = { Module =&gt; 'Kernel::System::PostMaster::Filter::Match', Match =&gt; { From =&gt; 'noreply@', }, Set =&gt; { 'X-OTRS-Ignore' =&gt; 'yes', }, }; # Job Name: 2-Match # (件名: **ORDER**かつsales@example.comからのEメールをソート) # into queue 'Order') $Self-&gt;{'PostMaster::PreFilterModule'}-&gt;{'2-Match'} = { Module =&gt; 'Kernel::System::PostMaster::Filter::Match', Match =&gt; { To =&gt; 'sales@example.com', Subject =&gt; '**ORDER**', }, Set =&gt; { 'X-OTRS-Queue' =&gt; 'Order', }, };

source: Kernel::System::PostMaster::Filter::CMD is a default module to pipe the email into an external command. The output is given to STDOUT and if the result is true, then set new email header (e.g. X-OTRS-Ignore: yes or X-OTRS-Queue: spam). The Example 7-3 can be used in <filename>Kernel/Config.pm</filename>
ja: Kernel::System::PostMaster::Filter::CMDは外部コマンドにEメールを送る、デフォルト・モジュールです。出力はSTDOUTに与えられます、また、結果がTrueの場合、新規Eメール・ヘッダー(例えば、X-OTRS-Ignore: yes or X-OTRS-Queue: spam）をセットします。例7-3は <filename>Kernel/Config.pm</filename>で使用することができます。
ru: Kernel::System::PostMaster::Filter::CMD модуль по умолчанию для получения емейлов для внешних команд. Вывод передается в STDOUT и если результат истинна, то устанавливается новый заголовок (например X-OTRS-Ignore: да или X-OTRS-Queue: spam). Пример 7-3 может быть использован в <filename>Kernel/Config.pm</filename>
sw: Kiini::Mfumo::MkuuWaPosta::Chuja::CMD ni moduli chaguo-msingi ya kupeleka barua pepe kwenda kwenye amri ya nje. Matokeo yanapewa kwa STDOUT na kama majibu ni kweli, kisha seti kichwa kipya cha barua pepe (mf. X-OTRS-Puuza: ndiyo au X-OTRS-Foleni: barua taka). Mfano 7-3 unaweza kutumika katika <filename>Kernel/Config.pm</filename>

source: Example job for the filter module Kernel::System::PostMaster::Filter::CMD
ja: フィルタ・モジュールのためのサンプル・ジョブ Kernel::System::PostMaster::Filter::CMD
ru: Пример задания для модуля фильтрации Kernel::System::PostMaster::Filter::CMD
sw: Kazi ya mfano kwa moduli ya kuchuja Kiini::Mfumo::MkuuWaPosta::Kichujio::CMD

source: # Job Name: 5-SpamAssassin # (SpamAssassin example setup, ignore spam emails) $Self-&gt;{'PostMaster::PreFilterModule'}-&gt;{'5-SpamAssassin'} = { Module =&gt; 'Kernel::System::PostMaster::Filter::CMD', CMD =&gt; '/usr/bin/spamassassin | grep -i "X-Spam-Status: yes"', Set =&gt; { 'X-OTRS-Ignore' =&gt; 'yes', }, };
ja: # Job Name: 5-SpamAssassin # (SpamAssassin サンプルセットアップ, スパムメールを無視します) $Self-&gt;{'PostMaster::PreFilterModule'}-&gt;{'5-SpamAssassin'} = { Module =&gt; 'Kernel::System::PostMaster::Filter::CMD', CMD =&gt; '/usr/bin/spamassassin | grep -i "X-Spam-Status: yes"', Set =&gt; { 'X-OTRS-Ignore' =&gt; 'yes', }, };

source: Kernel::System::PostMaster::Filter::ExternalTicketNumberRecognition is a default module that adds the possibility to parse external identifiers, in the email subject, the body or both using regular expressions. It then stores this value in a defined dynamic field. When an email comes in, OTRS will first search for an external identifier and when it finds one, query OTRS on the pre-defined dynamic field field. If it finds an existing ticket, it will update this ticket, otherwise it will create a new ticket with the external reference number in the separate field.
ja: Kernel::System::PostMaster::Filter::ExternalTicketNumberRecognitionは、Eメールの件名、本文、または正規表現を使用する両方に、外部識別子を解析する可能性を加えるデフォルト・モジュールです。その後、それは定義された動的フィールドにこの値を格納します。Eメールが中へ入る時、OTRSは最初に外部識別子を検索し、1つ見つけると、あらかじめ定義された動的フィールドについてOTRSにクエリします。それは既存のチケットを見つければ、このチケットを更新するでしょう。そうでなければ、それは別々のフィールドに外部参照番号で新規チケットを作成するでしょう。
ru: Kernel::System::PostMaster::Filter::ExternalTicketNumberRecognition это модуль по умолчанию, который дает возможность разбора/парсинга внешних идентификаторов в теме письма, в его теле или в обоих полях с помощью регулярных выражений. Затем результат разбора сохраняется в заданном динамическом поле. При поступлении письма, OTRS сначала отыскивает внешний идентификатор и, при нахождении, запрашивает OTRS о заранее заданном значении динамического поля. Если найдена существующая заявка, она обновляется, в противном случае создается новая заявка со ссылкой на внешний номер в отдельном поле.
sw: Kiini::Mfumo::MkuuWaPosta::Chuja::UtambuziWaNambariYaTiketiYaNje ni moduli ya chaguo-msingi ambayo inaongeza uwezekano wa kuchanganua vitambulishi vya nje, katika somo la barua pepe, kiini au zote kwa kutumia semi za kawaida. Kisha inahifadhi thamani hii katika sehemu inayobadilika iliyofafanuliwa. Pale barua pepe inapoingia, OTRS kwanza itatafuta kitambulishi cha nje na ikikipata , uliza OTRS kuhusu sehemu inayobadilika iliyofafanuliwa kabla. Kama ikipata tiketi iliyopo, ita sasisha tiketi hii, la sivyo itatengeneza tiketi mpya yenye namba ya kumbukumbu ya nje katika sehemu tofauti.

source: OTRS SysConfig already provide 4 different settings to setup different external ticket numbers. If more settings are needed they need to need to be added manually. The following example can be used in <filename>Kernel/Config.pm</filename> to extend SysConfig settings.
ja: OTRS SysConfigは、異なる外部チケット番号を設定するために４つの異なる設定を既に供給していますより多くのセッティングが必要な場合、それらを手動で加える必要がある必要があります。次の例はSysConfig設定を拡張するために<filename>Kernel/Config.pm</filename>の中で使用することができます。
ru: OTRS SysConfig предлагает 4 разных варианта настройки внешних номеров заявки. Если требуются другие варианты, они должны быть добавлены вручную. Следующий пример может быть использован для расширения имеющихся настроек в <filename>Kernel/Config.pm</filename>.
sw: OTRS SysConfig tayari inatoa mipangilio mi 4 tofauti kuseti namba za tiketi za nje. Kama mipangilio zaidi itahitajika itabidi iongezwe kwa mikono. Mfano ufuatao unaweza kutumika katika <filename>Kernel/Config.pm</filename> kuendeleza mipangilio ya SysConfig.
