Repository: DSigmund/doc-admin
Catalog: i18n/doc-admin.*.po
Languages: ja, ru, sw

source: If in this case all the values of the process ticket and its dynamic fields that are needed for the Transition 'T2' are correct, the ticket will be moved from Activity 'A1' to 'A3'. After an ActivityDialog is submitted, or any other change is made to a ticket, it will be checked for possible Transitions from the current Activity. If multiple Transitions are possible, the first one will be used (based on nummerical sorting of the TransitionIDs).
ja: この場合、推移「T2」に必要とされるプロセス・チケットおよびその動的なフィールドの値がすべて正確ならば、チケットは活動「A1」から「A3」に移動されるだろう。ActivityDialogが提出されるか、あるいはチケットに他の変更が行なわれる後、それは現在のアクティビティからの可能な推移をチェックされるだろう。複数の推移が可能ならば、最初のものが使用されるだろう(TransitionIDsをソートする数値ソートに基づく)。
ru: Если, в этом случае, все значения процессной заявки и ее динамических полей, которые необходимы для Перехода 'T2' верны, заявка перейдет от Активности 'A1' к 'A3'. После выполнения Диалога Активности или других изменений в заявке, будут проверены возможные Переходы от текущей Активности. Если доступны несколько Переходов - начнет выполнятся первый из них (порядок Переходов основан на цифровом значении TransitionIDs, по возрастанию).
sw: Kama katika kesi hii thamani zote za tiketi ya mchakato na sehemu zake zinazobadilika ambazo zinahitajika kwa Mpito 'T2' ziko sawa, tiketi itahamishwa kutoka Shughuli 'A1' kwenda 'A3'. Baada ya MaongeziYaShughuli kuwasilishwa, au mabadiliko yoyote mengine yamefanywa kwenye tiketi, itakaguliwa kwa Mapito yawezekanayo kutoka kwenye Shughuli ya sasa. Kama Mapito zaidi ya moja yanawezekana, ya kwanza yatatumika (kutegemea na upangaji wa nambari za Vitambulisho vya Mpito).

source: Additionally, it is possible to assign Transition Actions to Transitions in the Path configuration. These are modules which are executed after a successful Transition. They have to be specified in array form as in the example, we'll talk about the details later.
ja: さらに、パス設定中の推移に推移アクションを割り当てることは可能です。これらは成功した推移の後に実行されるモジュールである。それらは例でのような配列形式で指定しなければならない。詳細は後述します。
ru: Дополнительно, имеется возможность назначить Действия Переходов при конфигурации Процесса. Это модули, которые будут выполняться после успешного Перехода. Они должны быть заданы в виде массива/таблицы, как в примере, подробности этого мы обсудим позже.
sw: Kwa nyongeza, inawezekana kugawia Vitendo vya Mpito kwa Mapito katika usanidi wa Njia. Hizi moduli ambazo zinatekelezwa baada ya mpito uliofanikiwa. Inabidi zibainishwe katika fomu ya mkusanyiko kama kwenye mfano, tutaongelea kwa undani baadaye.

source: Activity
ja: アクティビティ
ru: Активность
sw: Shughuli

source: An Activity contains one or more Activity Dialogs and models a 'step' in the process. All Activity Dialogs of the current Activity are displayed in the ticket zoom and can be used until the conditions of a Transition are fulfilled.
ja: アクティビティは1つ以上のアクティビティ・ダイアログを含んでおり、プロセスの「ステップ」をモデル化します。現在のアクティビティの全てのアクティビティダイアログはチケット・ズームで表示され、推移の条件が満たされるまで使用することができます。
ru: Активность содержит один или более Диалог Активности и представляет собой этап Процесса. Все Диалоги Активности отображаются на экране подробного просмотра заявки TicketZoom и используются, пока условия Перехода выполняются.
sw: Shughuli ina Maongezi ya Shughuli ya aina moja au zaidi na inatengeneza 'hatua' katika mchakato. Maongezi ya Shughuli yote ya Shughuli ya sasa yanaonyeshwa katika kuza tiketi na inaweza kutumika mpaka masharti ya Mpito yatimizwe.

source: Activity configuration
ja: アクティビティ構成
ru: Настройка Активности
sw: Sanidi ya shughuli

source: Let's see an example activity configuration:
ja: サンプルのアクティビティ構成を見ましょう:
ru: Давайте рассмотрим пример конфигурации активности:
sw: Tuone mfano wa sanidi ya shughuli:

source: The name of the activity.
ja: アクティビティの名前
ru: Название активности.
sw: Jina la shughuli.

source: The time when it was created.
ja: アクティビティの作成時刻
ru: Время создания.
sw: Muda ambao ilitengenezwa.

source: UID of the user who created the Activity.
ja: アクティビティの作成ユーザーのユーザのUID
ru: UID пользователя, создавшего эту Активность.
sw: UID ya mtumiaji aliyetengeneza shughuli.

source: The last time when it was changed.
ja: アクティビティの変更時刻
ru: Время последнего изменения.
sw: Muda wa mwisho ilipo badilishwa

source: UID of the last user who changed the Activity.
ja: アクティビティの最終変更ユーザのユーザのUID
ru: UID пользователя, последним изменявшего эту Активность.
sw: UID ya mtumiaji wa mwisho aliyebadilisha shughuli.

source: ActivityDialog
ja: ActivityDialog（アクティビティ・ダイアログ）
sw: MaongeziShughuli

source: Activity Dialog contains the list of Activity Dialogs which are available in this Activity. All Activity Dialogs of the current Activity are displayed in the ticket zoom. Their order is set by the order in the configuration, here 'AD5' is shown before 'AD6' and 'AD1'.
ja: アクティビティダイアログは、このアクティビティにおいて利用可能なアクティビティ・ダイアログのリストを含んでいます。現在のアクティビティの全てのアクティビティ・ダイアログはチケット・ズームで表示されます。それらの順序は、構成の中の順序でここでセットされます「AD5」は「AD6」および「AD1」の前に示されます。
ru: Раздел Диалог Активности содержит список Диалогов доступных для этой Активности. Все Диалоги текущей Активности отображаются в TicketZoom. Их порядок задается при настройке, в данном случае, 'AD5' отображается до 'AD6' и 'AD1'.
sw: Maongezi ya Shughuli yana orodha ya maongezi ya shughuli ambayo yanapatikana katika hii shughuli. Maongezi yote ya Shughuli ya sasa yanaonekana katika Kuza tiketi. Oda yao inasetiwa na oda ya kwenye sanidi, hapa 'AD5' inaonyeshwa kabla ya 'AD6' na 'AD1'.

source: An Activity Dialog is a particular screen and can be used in different Activities.
ja: アクティビティ・ダイアログは特別の画面で、異なるアクティビティの中で使用することができます。
ru: Диалог Активности это обычный экран и может быть использован в различных Активностях.
sw: Maongezi ya Shughuli ni skrini maalumu na inaweza kutumika katika shughuli mbali mbali.

source: ActivityDialog configuration
ja: ActivityDialog（アクティビティ・ダイアログ）の構成
ru: Настройка ActivityDialog/Далога Активности
sw: Sanidi ya MaongeziShughuli

source: Let's see an example config
ja: サンプルのコンフィグを見ましょう。
ru: Давайте рассмотрим пример конфигурации
sw: Tuone mfano wa usanidi

source: $Self->{'Process::ActivityDialog'} = { 'AD1' => { Name => 'ActivityDialog 1 optional', DescriptionShort => 'Basic info', DescriptionLong => 'Please insert the necessesary basic information for IT orders', CreateTime => '28-02-2012 13:37:00', CreateBy => '1', ChangeTime => '29-02-2012 13:37:00', ChangeBy => '1', Fields => { PriorityID => { DescriptionShort => 'Priority ID', DescriptionLong => 'Enter the priority here', Display => 2, }, }, FieldOrder => [ 'PriorityID' ], SubmitAdviceText => 'Note: If you submit the form...', SubmitButtonText => 'Send request', }, 'AD2' => { Name => 'ActivityDialog 2 optional', DescriptionShort => 'Basic info', DescriptionLong => 'Please insert the necessesary basic information for Book orders', CreateTime => '28-02-2012 13:37:00', CreateBy => '1', ChangeTime => '29-02-2012 13:37:00', ChangeBy => '1', Fields => { StateID => { DescriptionShort => 'State ID', DescriptionLong => 'Enter the state here', Display => 2, DefaultValue => '2', }, Queue => { DescriptionShort => 'Queue ID', DescriptionLong => 'Enter the queue here', Display => 2, DefaultValue => 'Raw', }, Title => { DescriptionShort => 'Title', DescriptionLong => 'Enter the title here', Display => 1, DefaultValue => 'Default Title', }, DynamicField_Anzahl => { DescriptionShort => 'Amount', DescriptionLong => 'Enter the amount here', Display => 2, DefaultValue => '4', }, }, FieldOrder => [ 'DynamicField_Anzahl', 'StateID', 'Queue', 'Title' ], SubmitAdviceText => 'Note: If you submit the form...', SubmitButtonText => 'Send request', }, };
ja: $Self->{'Process::ActivityDialog'} = { 'AD1' => { Name => 'ActivityDialog 1 optional', DescriptionShort => '基本情報', DescriptionLong => 'IT注文に関する必要な基本情報を挿入して下さい。', CreateTime => '28-02-2012 13:37:00', CreateBy => '1', ChangeTime => '29-02-2012 13:37:00', ChangeBy => '1', Fields => { PriorityID => { DescriptionShort => '優先度 ID', DescriptionLong => '優先度をここに入力して下さい。', Display => 2, }, }, FieldOrder => [ 'PriorityID' ], SubmitAdviceText => 'ノート：フォームを送信したい場合は...', SubmitButtonText => '要求を送信', }, 'AD2' => { Name => 'ActivityDialog 2 optional', DescriptionShort => '基本情報', DescriptionLong => '本の注文に関する必要な基本情報を挿入して下さい。', CreateTime => '28-02-2012 13:37:00', CreateBy => '1', ChangeTime => '29-02-2012 13:37:00', ChangeBy => '1', Fields => { StateID => { DescriptionShort => '状態 ID', DescriptionLong => '状態をここに入力して下さい。', Display => 2, DefaultValue => '2', }, Queue => { DescriptionShort => 'キュー ID', DescriptionLong => 'キューをここに入力して下さい。', Display => 2, DefaultValue => 'Raw', }, Title => { DescriptionShort => 'タイトル', DescriptionLong => 'タイトルをここに入力して下さい。', Display => 1, DefaultValue => 'Default Title', }, DynamicField_Anzahl => { DescriptionShort => '金額', DescriptionLong => '金額をここに入力して下さい。', Display => 2, DefaultValue => '4', }, }, FieldOrder => [ 'DynamicField_Anzahl', 'StateID', 'Queue', 'Title' ], SubmitAdviceText => 'ノート：フォームを送信する場合...', SubmitButtonText => '要求を送信', }, };

source: Name of the Activity Dialog.
ja: アクティビティ・ダイアログの名前
ru: Имя Диалога Активности.
sw: JIna la Maongezi Shughuli.

source: Time when it was created.
ja: アクティビティ・ダイアログ作成時刻
ru: Время, когда он был создан.
sw: Muda iliyotengenezwa.

source: UID of the user who created this Activity Dialog.
ja: このアクティビティ・ダイアログを作成したユーザのUID
ru: UID пользователя, создавшего этот Диалог Активности.
sw: UID ya mtumiaji aliyetengeneza haya Maongezi Shughuli.

source: Last time when it was changed.
ja: アクティビティ・ダイアログの最終変更時刻
ru: Время последнего изменения.
sw: Muda wa mwisho ilipobadilishwa

source: UID of the last user who changed this Activity Dialog.
ja: このアクティビティダイアログの最終変更者のユーザのUID
ru: UID пользователя, последним изменявшего этот Диалог Активности.
sw: UID ya mtumiaji wa mwisho aliyebadilisha haya Maongezi Shughuli.

source: Fields
ja: フィールド
ru: Поля
sw: Sehemu

source: Contains all fields which can be displayed in this Activity Dialog. The following fields can currently be used:
ja: このアクティビティダイアログで表示することができる全てのフィールドを含んでいます。次のフィールドは現在使用することができます:
ru: Содержит все поля, которые могут быть отображены в этом Диалоге Активности. Следующие поля могут быть использованы в данный момент:
sw: Ina sehemu zote ambazo zinaweza kuonyeshwa katika Maongezi ya Shughuli haya. Sehemu zifuatazo zinaweza kutumika sasa:

source: Title State StateID Priority PriorityID Lock LockID Queue QueueID Customer CustomerID CustomerNo CustomerUserID Owner OwnerID Type TypeID SLA SLAID Service ServiceID Responsible ResponsibleID PendingTime DynamicField_$FieldName # for all dynamic fields
ja: Title State StateID Priority PriorityID Lock LockID Queue QueueID Customer CustomerID CustomerNo CustomerUserID Owner OwnerID Type TypeID SLA SLAID Service ServiceID Responsible ResponsibleID PendingTime DynamicField_$FieldName # 全ての動的フィールド用

source: Example of a single field configuration:
ja: 単一のフィールド構成の例：
ru: Пример настройки отдельного поля:
sw: Mfano wa sanidi yen

source: Article => { DescriptionShort => 'Please insert your comment here.', DescriptionLong => '', Display => 1, Config => { ArticleType => 'note-internal', LabelSubject => '', LabelBody => '', }, },
ja: Article => { DescriptionShort => 'ここにコメントを挿入して下さい', DescriptionLong => '', Display => 1, Config => { ArticleType => 'note-internal', LabelSubject => '', LabelBody => '', }, },

source: The field "Article" is a special case. If it is present in a "Fields" configuration, the Activity Dialog will contain a complete Richtext editor with subject field and attachment handling. The entered text will then be added to the ticket as an article and sent by email. Let's see an example Article field configuration: <placeholder type="screen" id="0"/>
ja: フィールド「記事」は特殊なケースです。それが「フィールド」構成の中にあれば、アクティビティ・ダイアログは件名フィールドおよび添付ファイル取扱い可能な機能を持った完全なリッチテキスト・エディターを内蔵します。その後、入力されたテキストは、記事としてチケットに加えられ、電子メールで送られます。サンプルの記事フィールド構成を見ましょう: <placeholder type="screen" id="0"/>
ru: Поле "Article/Сообщение" это отдельный случай. Если оно присутствует в конфигурации "Fields/Поля", Диалог Активности будет содержать полноценный Richtext редактор, с полем Тема и возможностью управления вложениями. Введенный текст будет добавлен к заявке в качестве сообщения/заметки и отправлен почтой. Давайте рассмотрим пример конфигурации поля Сообщение: <placeholder type="screen" id="0"/>
sw: Sehemu "Makala" ni kesi maalumu. Kama ipo kwenye usanidi wa "Sehemu", Maongezi ya Shughuli yatakuwa na kihariri kamili cha Nakalatajiri chenye sehemu ya somo na ushughulikiaji viambatamishi. Nakala iliyoingizwa kisha itaongezwa kwenye tiketi kama nakala na kutumwa kwa barua pepe. Tuone mfano wa usanidi wa sehemu ya Makala: <placeholder type="screen" id="0"/>

source: Let's look at the field configuration options:
ja: フィールド構成オプションを見ましょう:
ru: Рассмотрим опции конфигурации полей:
sw: Tuangalie chaguo za usanidi wa sehemu:

source: DescriptionShort
ja: DescriptionShort（短い摘要）
ru: Краткое описание
sw: MaelezoMafupi

source: Optional short description that is shown with the field title.
ja: フィールドタイトルで表示される短い摘要（オプション）。
ru: Необязательное краткое описание, которое может отображаться вместе с заголовком поля.
sw: Maelezo mafupi ya hiari yanayo onyeshwa na mada ya sehemu.

source: DescriptionLong
ja: DescriptionLong（長い摘要）
ru: Полное описание
sw: MaelezoMarefu

source: Optional longer field description that is shown then the mouse is over the field, for example advice on how to fill out the field.
ja: マウスがフィールド上に乗る時、表示されるより長い摘要（オプション）。フィールドの入力方法についての例示アドバイス。
ru: Необязательное полное описание поля, отображаемое при наведении мыши на поле, например, указания по заполнению этого поля.
sw: Maelezo marefu ya sehemu ya hiari yanayo onyeshwa pale kipanya kinapokuwa juu ya eneo, kwa mfano ushauri wa jinsi ya kujaza eneo.

source: Display
ja: Display（表示）
ru: Отобразить
sw: Onyesha

source: Controls if the field is shown and/or mandatory. Possible values:
ja: フィールドが示される かつ、または 必須の場合のコントロール。可能な値:
ru: Задает, должно ли поле отображаться и/или обязательно. Возможные значения:
sw: Inadhibiti kama sehemu inaonekana au ni ya lazima. Thamani zinazowezekana:

source: '0': field is invisible. This can be helpful if field values should automatically be set. The configured DefaultValue will be stored in this case.
ja: '0': フィールドは不可視です。フィールド値が自動的にセットならより便利でしょう。構成されたDefaultValueはこのケースでは格納されるでしょう。
ru: "0": поле не отображается. Это может быть полезно, если значения полей заносятся автоматически. В этом случае будет использовано значение, заданное по умолчанию .
sw: '0': sehemu haionekani. Hii inakuwa na manufaa kama thamani za sehemu zinatakiwa kusetiwa kiotomatiki. ThamaniChaguo-msingi iliyosanidiwa itahifadhiwa katika kesi hii.

source: '1': field is visible, but optional.
ja: '1' :フィールドは可視ですが任意です。
ru: "1": поле отображается, но заполнение его необязательно.
sw: '1': sehemu inaonekana, lakini ni ya hiari.

source: '2': field is visible and mandatory. The following fields can only be invisible or mandatory: <placeholder type="screen" id="0"/>
ja: '2': fフィールドは可視でかつ必須です。次のフィールドが単に不可視にも必須にもなりえます: <placeholder type="screen" id="0"/>
ru: "2": поле отображается и обязательно для заполнения. Следующие поля могут быть только неотображаемыми и обязательными:<placeholder type="screen" id="0"/>
sw: '2': sehemu inaonekana na ni ya lazima. Sehemu zifuatazo zinaweza kuwa hazionekani na za lazima tu: <placeholder type="screen" id="0"/>

source: If fields are configured as optional, and no value is submitted by the user, the Default Value will be saved when the Activity Dialog is submitted by the user.
ja: フィールドが任意として設定され、ユーザが値を送信しなければ、アクティビティ・ダイアログがユーザによって送信される時、デフォルト値が保存されます。
ru: Если поля заданы как необязательные, и никакие значения не вводятся пользователем, умалчиваемое значение будет присвоено этому полю, когда пользователь нажимает Отправить для этого Диалога Активности.
sw: Kama sehemu zimesanidiwa kama za hiari, na hakuna thamani iliyowasilishwa na mtumiaji, Thamani Chaguo-msingi itahifadhiwa wakati Maongezi ya Shughuli yanawasilishwa na mtumiaji.

source: DefaultValue
ja: DefaultValue（デフォルト値）
ru: Значение по умолчанию
sw: ThamaniChaguo-msingi

source: For fields with 'ID' (like QueueID, OwnerID), this refers to the database ID of the value. For other fields without 'ID' (like Queue, Owner), the DefaultValue must contain the value itself. Example:
ja: 「ID'」(QueueID、OwnerIDのように)を備えたフィールドに関して、これは、値のデータベースIDを参照します。'ID'(キュー、オーナーのように)のない他のフィールドについては、DefaultValueは値自体を含んでいなければいけません。例:
ru: Для полей с суффиксом "ID" (таких как QueueID, OwnerID), система использует идентификатор в базе данных в качестве значения. Для других полей без "ID" (таких как Queue, Owner), значение по умолчанию должно содержать собственно значение. Например:
sw: Kwa sehemu zenye 'Kitambulisho' (kama KitambulishoChaFoleni, KitambulishoChaMmiliki), hii inamaanisha Kitambulisho cha hifadhidata ya thamani. Kwa sehemu nyingine zisizo na 'Kitambulisho' (kama Foleni, Mmiliki), ThamaniChaguo-msingi lazima iwe na thamani yenyewe. Mfano:

source: FieldOrder
ja: FieldOrder（フィールド順序）
ru: Порядок полей
sw: OdaSehemu

source: Here the display order of the fields is configured. IMPORTANT: Invisible fields also must be configured here, because only configured fields will be considered when saving. Fields which are not configured will not be saved.
ja: ここで、フィールドの表示順序は設定されます。重要:保存する時単に設定されたフィールドが考慮されるので、目に見えないフィールドはさらにここで設定されなければいけません。設定されないフィールドは保存されないでしょう。
ru: Здесь задается порядок отображения полей. ВАЖНО: Неотображаемые поля также должны быть заданы здесь, т.к. только описанные поля учитываются при сохранении. Значения полей не указанных здесь, не сохраняются.
sw: Hapa mpangilio wa muonekano wa sehemu unasanidiwa. MUHIMU: Sehemu zisizoonekana lazima zisanidiwe hapa, kwa sababu sehemu zilizosanidiwa tu zitahusishwa wakati wa kuhifadhi. Sehemu ambazo hazijasanidiwa hazita hifadhiwa.

source: SubmitAdviceText
ja: SubmitAdviceText（アドバイス用テキストの送信）
ru: Текст подсказки для кнопки
sw: WasilishaNakalaUshauri

source: Optional text to be shown right above the submit button for additional help or advice text.
ja: 補足的ヘルプかアドバイス用テキストのための送信ボタン上に示される任意のテキスト。
ru: Необязательный текст, отображаемый поверх указателя мыши при наведении на кнопку, содержит дополнительную подсказку или поясняющий текст.
sw: Nakala ya hiari kuonyeshwa juu ya kitufe cha kuwasilisha kwa msaada zaidi au nakala ya ushauri.

source: SubmitButtonText
ja: SubmitButtonText（送信ボタンのテキスト）
ru: Текст надписи на кнопке
sw: KitufeWasilishaNakala

source: Optional custom text for the submit button.
ja: 送信ボタンのための任意のカスタム・テキスト。
ru: Необязательный/альтернативный пользовательский текст/название для кнопки Отправить.
sw: Nakala ya kawaida ya hiari kwa ajili ya kitufe cha kuwasilisha.

source: Transition
ja: Transition（推移）
ru: Переход
sw: Mpito

source: A Transition decides - based on configurable conditions - which path in the Process is taken, i. e. to which Activity a Process ticket can be moved.
ja: 推移は、設定可能な条件に基づいて決定します。プロセス中でパスが取得されているような条件です。。（例えば プロセス・チケットが移動されうるアクティビティへのパスです）
ru: Результат Перехода - основанный на заданных условиях - дальнейший путь Процесса, т.е. к какой Активности должна перейти процессная заявка.
sw: Mpito unachagua - kutegemeana na masharti yanayoweza kusanidiwa - njia gani katika Mchakato inachukuliwa, yaani Shughuli gani tiketi ya Mchakato inaweza kupelekwa.

source: Transition configuration
ja: Transition configuration（推移構成）
ru: Конфигурирование Перехода
sw: Usanidi wa mpito

source: Let's see an example:
ja: サンプルを見ましょう:
ru: Давайте рассмотрим пример:
sw: Tuone mfano:

source: Name of the transition.
ja: 推移の名前。
ru: Имя Перехода
sw: Jina la mpito

source: UID of the user who created this Transition.
ja: この推移を作成したユーザのUID。
ru: UID пользователя, создавшего этот Переход
sw: UID ya mtumiaji aliyetengeneza huu Mpito.

source: UID of the last user who changed this Transition.
ja: この推移の最終変更者のユーザのUID。
ru: UID пользователя, последним изменявшего этот Переход.
sw: UID ya mtumiaji wa mwisho aliyebadilisha huu Mpito.

source: Condition
ja: Condition（条件）
ru: Условие
sw: Sharti

source: Contains all conditions that are neccessary for this Transition to take effect. Example:
ja: この推移が効果を現わす必須条件をすべて含んでいます。例:

source: Let's look at the condition configuration in detail.
ja: 構成の条件を詳細に見ましょう。
ru: Давайте рассмотрим подробно конфигурирование Условий.
sw: Tuangalie sharti la usanidi kwa undani.

source: Type (Condition)
ja: タイプ (条件)
ru: Тип (Условия)
sw: Aina (Sharti)

source: Specifies the way the different condition elements are connected to each other. Possible values:
ja: 異なる条件要素が互いに接続される方法を指定します。可能な値:
ru: Задает операторы для соединения элементов Условия. Возможные значения:
sw: Inaweka bayana uhusiano wa elementi za masharti kwa nyenzake. Thamani ziwezekanazo:

source: 'and': This is the default. All conditions must be met for the transition to take effect.
ja: 'and': これはデフォルトです。推移が有効になるために条件をすべて満たさなければなりません。
ru: "and": Умалчиваемое значение. Все условия должны быть верны для выполнения Перехода.
sw: 'na': Hili ni chaguo-msingi. Masharti yote lazima yafikiwe ili mpito ufanyike.

source: 'or': At least one condition must match.
ja: 'or': 少なくとも1つの条件は一致しなければいけません。
ru: "or"/"или": хотябы одно из условий должно быть верно.
sw: 'au': Angalau sharti moja lilingane.

source: 'xor': Exactly one condition must match, not more.
ja: 'xor': 1つの条件のみ一致しなければいけません。
ru: "xor": должно быть верным не более одного условия.
sw: 'xor': Lazima sharti moja tu lifanane, siyo zaidi.

source: This is the name of an example condition. It can be freely chosen. Conditions are evaluated in sorted order.
ja: これはサンプルの条件の名前です。それは自由に選ぶことができます。条件はソート順に評価されます。
ru: Это имя одного из условий примера. Имя выбирается произвольно. Условия вычисляются в порядке очередности.
sw: Hili ni jina la mfano wa sharti. Inaweza kuchaguliwa kwa uhuru. Mashrti yana tathminiwa katika oda iliyo pangwa.

source: Type (Cond)
ja: タイプ(Cond)
ru: Тип (Условия)
sw: Aina (Sharti)

source: Specifies the way how the individual field tests of this condition are connected to each other. Possible values:
ja: この条件の個々のフィールド試験が互いに接続される方法を指定します。可能な値:
ru: Задает способ, которым отдельные поля, проверяющие это условие, соединены друг с другом. Возможные значения:
sw: Inaweka bayana uhusiano baina ya vipimo vya maeneo binafsi ya hili sharti. Thamani ziwezekanazo:

source: 'and': This is the default. All field tests must match for this condition to match.
ja: 'and': これはデフォルトです。全てのフィールド・テスト条件をすべて満たさなければなりません。
ru: 'and': по умолчанию. Все проверяемые поля должны удовлетворять условию, чтобы результат был - "верно".
sw: 'na': Hili ni chaguo-msingi. Vipimo vya maeneo yote lazima vifanane ili sharti lilingane.

source: 'or': At least one field test must match.
ja: 'or': 少なくとも1つの条件は一致しなければいけません。
ru: 'or': хотя бы одно из полей должно удовлетворять условию.
sw: 'or' Angalau kipimo kimoja cha sehemu kifanane

source: 'xor': Exactly one field test must match, not more.
ja: 'xor': 1つの条件のみ一致しなければいけません。
ru: 'xor': не более одного поля должно соответствовать условию.
sw: 'xor': Lazima jatribio moja la eneo lifanane sio zaidi.

source: Specifies the particular fields whose values should be tested. From our example: <placeholder type="screen" id="0"/>
ja: その値がテストされるべき特別のフィールドを指定します。私たちの例から:<placeholder type="screen" id="0"/>
ru: Указывает отдельные поля, значения которых должны быть проверены. В нашем примере: <placeholder type="screen" id="0"/>
sw: Inabainisha sehemu maalumu ambazo thamani zake zinatakiwa kujaribiwa. Kutoka kwenye mfano wetu: <placeholder type="screen" id="0"/>

source: Example of a field name. The following ticket fields can be used: <placeholder type="screen" id="0"/>
ja: フィールド名の例。次のチケット・フィールドが使用されます。: <placeholder type="screen" id="0"/>
ru: Пример имени поля. Следующие имена полей заявки могут использоваться: <placeholder type="screen" id="0"/>
sw: Mfina wa jina la sehemu. Sehemu zifwatazo za tiketi zinaweza kutumika: <placeholder type="screen" id="0"/>
