Repository: DSigmund/doc-admin
Catalog: i18n/doc-admin.*.po
Languages: ja, ru, sw

source: Customers can access the system by providing their username and password. The CustomerID is needed by the system to identify the user and associated tickets. Since the email address is a unique value, it can be used as the ID.
ja: 顧客はそれらのユーザー名とパスワードの提供されることでシステムにアクセスすることができます。CustomerIDはユーザと関連チケットを識別するためにシステムによって必要です。メール・アドレスがユニークな値であるので、それはIDとして使用することができます。
ru: Клиент может получить доступ к системе путем ввода логина и пароля. CustomerID нужен для идентификации клиента и его заявок. Поскольку адресс электронной почты является уникальным, его можно использовать в качестве уникального идетнтификатора (ID).
sw: Wateja wanaweza kufikia mfumo kwa kutoa jina la mtumiaji na nywila. Kitambulisho cha Mteja kinahitajika na mfumo kutambua mtumiaji na tiketi zinazohusika. Kwa kuwa anwani ya barua pepe ni ya kipekee, inaweza kutumika kama kitambulisho.

source: As with agents, groups and roles, customers can not be deleted from the system, only deactivated by setting the Valid option to <emphasis>invalid</emphasis> or <emphasis>invalid-temporarily</emphasis>.
ja: 担当者、グループおよび役割でそうであったように、顧客は、システムから削除されません。単に、有効オプションが<emphasis>無効</emphasis>または<emphasis>無効-暫定</emphasis>に設定されることで非活性化されるだけです。
ru: Как и в случае с агентами, группами и ролями, система не позволяет удалять клиентов, а только деактивировать их, установив опцию Действительный в значение <emphasis>недействительный</emphasis> или <emphasis>недействительный-временно</emphasis>.
sw: Kama ilivyo kwa mawakala, makundi na majukumu, wateja hawawezi kufutwa kwenye mfumo, wanaweza kulemazwa kwa kuseti chaguo Halali kuwa <emphasis>batili</emphasis> au <emphasis>batili-kwa muda</emphasis>.

source: Customer Groups
ja: 顧客グループ
ru: Группы Клиентов
sw: Makundi ya Wateja

source: Customer users can also be added to a group, which can be useful if you want to add customers of the same company with access to one or a few queues. First create the group to which your customers will belong, via the <link linkend="adminarea-groups">Group management module</link>. Then add the <link linkend="adminarea-queue">queues</link> and select the new group for the queues.
ja: 顧客ユーザもグループに加えることができます。1つあるいは少数のキューへのアクセスと同じ会社の顧客を加えたければ、役立つでしょう。まず、<link linkend="adminarea-groups">グループ管理モジュール</link>によって、あなたの顧客が属するグループを作ってください。次に、<link linkend="adminarea-queue">キュー</link>を加えて、キューに新規グループを選んでください。
ru: Клиенты также могут быть добавлены в группу, что может быть полезно, если вы хотите обьеденить нескольких клиентов той же компании для доступа к одной или нескольким очередям. Сначала создайте группу, в которую будут входить клиенты, для этого перейдите по ссылке <link linkend="adminarea-groups">Модуль Управления Группами </link>. Затем добавьте <link linkend="adminarea-queue">очереди</link> и выберите новую группу для этих очередей.
sw: Wateja watumiaji wanaweza pia kuongezwa kwenye kundi, ambayo itakuwa na manufaa kama ukitaka kuongeza wateja wa kampuni moja wenye ufikivu kwa foleni moja ua zaidi. Kwanza tengeneza kundi ambalo wateja wako watakuwa wanachama, kupitia <link linkend="adminarea-groups">Moduli ya kusimamia kundi</link>. Kisha ongeza <link linkend="adminarea-queue">foleni</link> na chagua kundi jipya la foleni.

source: Through the link "Customers &lt;-&gt; Groups" you can manage which customer shall belong to the different groups (see Figure below).
ja: リンク"顧客&lt;-&gt; グループ" によって、異なるグループ(下記の図を参照)に属する顧客を管理できます。
ru: Перейдя по ссылке "Клиенты &lt;-&gt; Группы" вы можете управлять отношениями конкретного пользователя к разным группам (см. нижеприведенный Рисунок).
sw: Kupitia kiungo "Wateja &lt;-&gt; Makundi" unaweza kusimamia mteja yupi atakuwa kwenye makundi yapi (ona Kielelezo chini).

source: Customer Group management
ja: 顧客グループ管理
ru: Управления Группами Клиентов
sw: Usimamizi wa Makundi ya Wateja

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit=">Adminarea customer groups - screenshot" scale="40" fileref="screenshots/admin-customer-groups.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit=">管理エリア 顧客グループ - スクリーンショット" scale="40" fileref="screenshots/admin-customer-groups.png"></graphic>

source: <emphasis>Figure: Customer-Group relations management.</emphasis>
ja: <emphasis>図:顧客グループ関係管理</emphasis>
ru: <emphasis>Рисунок: Управление отношениями Клиент-Группа.</emphasis>
sw: <emphasis>Kielelezo: Usimamizi wa mahusiano ya Mteja-Kundi.</emphasis>

source: To define the different groups a customer should be part of and vice versa, click on the corresponding customer username or group (see below the Figures 5.16 and 5.17, respectively).
ja: 異なるグループを定義するために、顧客もその一部分であるべきです。対応する顧客名やグループをクリックします(図5.16および5.17以下にそれぞれ参照）。
ru: Для определения различных групп, в которые должен входить клиент, и наоборот, нажмите на соответствующее имя пользователя или группы (см. ниже Рисунок 5.16 и 5.17, соответственно).
sw: Kufafanua makundi tofauti ambayo mteja anatakiwa kuwapo na vinginevyo, bofya jina la mtumiaji la mteja au kundi (ona chini vielelezo 5.16 na 5.17 kwa mtiririko)

source: Change Group relations for a Customer
ja: 顧客用グループ関係の変更
ru: Изменение связи между Группой и Пользователем
sw: Badilisha mahusiano ya Makundi kwa Mteja

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="Adminarea customers and groups - screenshot" scale="40" fileref="screenshots/groups-customers-relations.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="管理者エリア 顧客とグループ - スクリーンショット" scale="40" fileref="screenshots/groups-customers-relations.png"></graphic>

source: <emphasis>Figure: Change Group relations for a Customer.</emphasis>
ja: <emphasis>図:顧客用グループ関係の変更</emphasis>
ru: <emphasis>Рисунок: Изменение связи между Группой и Клиентом.</emphasis>
sw: <emphasis>Kielelezo: Badilisha mahusiano ya Makundi kwa Mteja.</emphasis>

source: Change Customer relations for a Group
ja: グループのための顧客関係の変更
ru: Изменение связи между Клиентом и Группой
sw: Badilisha mahusiano ya Mteja kwa Kundi

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="Adminarea customer and groups - screenshot" scale="40" fileref="screenshots/groups-customers-relations2.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="管理者エリア 顧客とグループ - スクリーンショット" scale="40" fileref="screenshots/groups-customers-relations2.png"></graphic>

source: <emphasis>Figure: Change Customer relations for a Group.</emphasis>
ja: <emphasis>図:グループのための顧客関係の変更</emphasis>
ru: <emphasis>Рисунок: Изменение связи между Клиентом и Группой.</emphasis>
sw: <emphasis>Kielelezo: Badilisha mahusiano ya Mteja kwa Kundi.</emphasis>

source: Queues
ja: キュー
ru: Очереди
sw: Foleni

source: Clicking on the link "Queues" of the Admin page, you can manage the <link linkend="what-is-a-queue">queues</link> of your system (see Figure below). In a new OTRS installation there are 4 default queues: Raw, Junk, Misc and Postmaster. All incoming messages will be stored in the "Raw" queue if no filter rules are defined. The "Junk" queue can be used to store spam messages.
ja: 管理者ページをリンク「キュー」をクリックすると、システムの<link linkend="what-is-a-queue">キュー</link>を管理することができます(下記の図を参照)。新規OTRS装置では、4つのデフォルト・キューがあります:「未対応」、「ジャンク」、「その他」と「ポストマスター」。フィルタ規則が定義されなければ、受信メッセージはすべて「未対応の」キューに格納されるでしょう。「ジャンク」キューはスパム・メッセージを格納するために使用することができます。
ru: Используя ссылку "Очереди", находящуюся в Панели Администрирования, можете управлять <link linkend="what-is-a-queue">очередями</link> системы (см. нижеприведенный Рисунок). В новой, только установленной системе OTRS существует 4 предопределенных очереди: Junk, Misc, Postmaster и Raw. Если не используются ранее определенные фильтры и правила, все входящие сообщения сохраняются в очереди "Raw". Очередь "Junk" используется для хранения спам-сообщений.
sw: Kubofya kwenye kiungo "Foleni" cha kurasa ya Msimamizi, unaweza kusimamia <link linkend="what-is-a-queue">foleni</link> za mfumo wako (ona Kielelezo chini). Katika usakinishaji mpya wa OTRS kuna foleni 4: Mbichi, Barua taka, Mchanganyiko na Mkuu wa posta. Ujumbe wowote unaoingia utahifadhiwa kwenye foleni "Mbichi" kama hakuna sheria ya kuchuja iliyofafanuliwa. Foleni ya "Barua taka" inaweza kutumika kuhifadhi barua taka.

source: Queue management
ja: キュー管理
ru: Управления очередями
sw: Usimamizi wa foleni

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="Adminarea queue - screenshot" scale="40" fileref="screenshots/admin-queue.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="管理者エリア キュー - スクリーンショット" scale="40" fileref="screenshots/admin-queue.png"></graphic>

source: <emphasis>Figure: Queue management.</emphasis>
ja: <emphasis>図:キュー管理</emphasis>
ru: <emphasis>Рисунок: Управление очередями.</emphasis>
sw: <emphasis>Kielelezo: Usimamizi wa foleni.</emphasis>

source: Here you can add queues (see Figure below) and modify them. You can specify the group that should use the queue. You can also set the queue as a sub-queue of an existing queue.
ja: ここで、キュー(下記の図を参照)を加えて、それらを修正することができます。キューを使用するべきグループを指定することができます。さらに、既存のキューのサブキューとしてキューをセットすることができます。
ru: Здесь можно добавлять и корректировать очереди (см. нижеприведенный Рисунок). Можно определить группу, которая должна использовать очередь. Также очередь можно установить как под-очередь уже существующей очереди.
sw: Hapa unaweza kuongeza foleni (ona kielelezo chini) na kuzirekebisha. Unaweza kuweka bayana kundi ambalo litatumia hiyo foleni. Unaweza ku seti foleni kama sehemu ya foleni nyingine.

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="Adminarea queue - screenshot" scale="40" fileref="screenshots/add-queue.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="「管理者エリア キュー - スクリーンショット」" scale="40" fileref="screenshots/add-queue.png"></graphic>

source: <emphasis>Figure: Adding a new queue.</emphasis>
ja: <emphasis>図:新規キューの追加</emphasis>
ru: <emphasis>Рисунок: Добавление новой очереди.</emphasis>
sw: <emphasis>Kielelezo: Kuongeza foleni mpya.</emphasis>

source: You can define an unlock timeout for a queue - if an agent locks a ticket and does not close it before the unlock timeout has passed, the ticket will be automatically unlocked and made available for other agents to work on.
ja: キュー用のアンロック・タイムアウトを定義することができます。担当者がチケットをロックし、アンロックタイムアウトが過ぎる前に、それを完了しなければ、チケットが自動的にアンロックされ、他の担当者が継続して利用可能にされます。
ru: Для очереди можно определить время разблокировки - если агент заблокировал заявку и не закрыл ее до истечения времени блокировки, заявка будет автоматически разблокирована и доступна для других агентов.
sw: Unaweza kufafanua muda wa mwisho wa kufungua foleni - kama wakala akifunga tiketi na hajaifunga kabla ya muda wa mwisho wa kufungua kuisha, tiketi itafunguliwa kiotomatiki na kufanywa ipatikane kwa mawakala wengine kuifanyia kazi.

source: There are three escalation time settings that can be associated at queue level:
ja: キュー・レベルに関連可能な3つのエスカレーション時間設定があります:
ru: Есть три типа настроек эскалации времени, которые могут быть связаны на уровне очередей:
sw: Kuna mipamgilio ya muda wa kupanda mitatu inahusishwa katika ngazi ya foleni:

source: Escalation - First Response Time
ja: エスカレーション - 第1の応答時間
ru: Эскалация - Время Первого Отклика
sw: Kupanda - Muda wa kwanza wa kujibu

source: After creation of the ticket, if the time defined here expires without any communication with the customer, either by email or phone, the ticket is escalated.
ja: チケットの生成の後、顧客といかなるコミュニケーションも無く、定義された時間が失効した場合、Eメールであれ電話であれエスカレーションされます。
ru: После создания заявки, если истекает оговоренное время без какой-либо связи с клиентом как по электронной почте так и по телефону, - заявка будет эскалирована.
sw: Baada ya utengenezaji wa tiketi, kama muda uliofafanuliwa hapa ukiisha bila ya mawasiliano na mteja, ama kwa simu au barua pepe, tiketi inapandishwa.

source: Escalation - Update Time
ja: エスカレーション - 更新時間
ru: Эскалация - Время обновления
sw: Kupanda - Rekebisha Muda

source: If there is a customer followup either via e-mail or the customer portal, that is recorded in the ticket, the escalation update time is reset. If there is no customer contact before the time defined here expires, the ticket is escalated.
ja: Eメールあるいは顧客ポータル(それはチケットに記録される)のいずれかによって顧客フォローアップがある場合、エスカレーション更新時間はリセットされます。ここで定義された時間が失効するまでに顧客へのコンタクトがない場合、チケットはエスカレーションされます。
ru: Если какой-нибудь клиент прислал ответ на заявку по электронной почте или изменил ее через пользовательский портал, время эскалации будет обнулено. Если до истечения времени ожидания контакта с клиентом небыло, заявка эскалируется.
sw: Kama kuna ufwatiliaji wa mteja aidha kwa barua pepe au mlango wa mteja, ambao unarekodiwa kwenye tiketi, usasishaji wa muda wa kupanda unasetiwa upya. Kama hakuna mawasiliano ya mteja kabla muda uliofafanuliwa hapa haujaisha, tiketi inapandishwa.

source: Escalation - Solution Time
ja: エスカレーション - 解決時間
ru: Эскалация - Время решения
sw: Kupanda - Muda wa Suluhu

source: If the ticket is not closed before the time defined here expires, the ticket is escalated.
ja: ここで定義された時間が失効する前にチケットが完了（成功）しなかったら、チケットはエスカレーションされます。
ru: Если до истечения оговореного времени заявка не закрыта - она эскалируется.
sw: Kama tiketi haitafungwa kabla ya muda uliofafanuliwa kuisha, tiketi inapandishwa.

source: With 'Ticket lock after a follow-up', you can define if a ticket should be set to 'locked' to the old owner if a ticket that has been closed and later is re-opened. This ensures that a follow up for a ticket is processed by the agent that has previously handled that ticket.
ja: 「フォローアップの後のチケット・ロック」により、以下を定義できます。１．旧チケット・オーナーに対して「ロック」状態にセットすべきチケット。２．一旦完了してて、再度対応中となったチケットこれにより以前にそのチケットを扱った担当者が確実にフォローアップ・チケットが処理することができます。
ru: Используя опцию 'Ticket lock after a follow-up', можно определить будет ли заявка установлена в значение 'заблокирована' для старого владельца, если она была закрыта а потом открыта заново. Такое поведение гарантирует, что последующая заявка будет обрабатываться агентом, который работал с этой заявкой ранее.
sw: Na 'Funga tiketi baada ya ufwatiliaji', unaweza kufafanua kama tiketi isetiwe kuwa 'imefungwa' kwa mtumiaji wa zamani kama tiketi imefungwa na baadaye kufunguliwa upya. Hii inahakikisha ufwatiliaji wa tiketi unachakatishwa na wakala ambaye alishughulikia tiketi mwanzoni.

source: The parameter for the system address specifies the email address that will be used for the outgoing tickets of this queue. There is also the possibility to associate a queue with a salutation and a signature, for the email answers. For more detailed information, please refer to the sections <link linkend="adminarea-emailaddresses">email addresses</link>, <link linkend="adminarea-salutations">salutations</link> and <link linkend="adminarea-signatures"> signatures</link>.
ja: システム・アドレス用のパラメタは、このキューの送信チケットに使用されるメール・アドレスを特定します。Eメール返信のために、挨拶文と署名にキューを関連させることもできます。より多くの詳細情報に関しては、<link linkend="adminarea-emailaddresses">Eメール・アドレス</link>、<link linkend="adminarea-salutations">挨拶文</link>および<link linkend="adminarea-signatures"> 署名</link>のセクションを参照してください。
ru: Параметром системный адрес определяется адресс электронной почты, который будет использоваться для исходящих заявок этой очереди. Также, для ответов по электронной почте, есть возможность ассоциировать/связать очереди с приветствиями и подписями. За более подробной информацией перейдите по ссылке <link linkend="adminarea-emailaddresses"> адреса электронной почты </link> , <link linkend="adminarea-salutations"> приветствия </link> и <link linkend="adminarea-signatures"> подписи </link>.
sw: Parameta ya anwani za mfumo inabainisha anwani za barua pepe ambazo zitatumika kwa ajili ya tiketi zinazotoka za foleni hii. Hakuna uwezekano wa kuhusisha foleni na salamu na saini, kwa majibu ya barua pepe. Kwa taarifa za undani zaidi, tafadhali tembelea vifungu <link linkend="adminarea-emailaddresses">anwani za barua pepe</link>, <link linkend="adminarea-salutations">salamu</link> na <link linkend="adminarea-signatures"> saini</link>.

source: As with agents, groups and customers, queues cannot be deleted, only deactivated, by setting the Valid option to <emphasis>invalid</emphasis> or <emphasis>invalid-temporarily</emphasis>.
ja: 担当者でそうであるように、グループ、顧客、キューは削除できません。単に有効オプションを<emphasis>無効</emphasis>にあるいは<emphasis>無効-暫定</emphasis>にする設定によって非活性化するだけです。
ru: Как в случае с агентами, группами и клиентами, очереди не могут быть удалены, а только отключены, путем установки опции "Действительная" в значение <emphasis>недействительная</emphasis> или <emphasis>недействительная-временно</emphasis>.
sw: Kama ilivyo kwa mawakala, makundi na wateja, foleni haziwezi kufutwa, zinalemazwa tu, kwa kuseti chaguo Halali kuwa <emphasis>batili</emphasis> au <emphasis>batili-kwa muda</emphasis>.

source: Salutations, signatures, attachments and templates
ja: 挨拶文、署名、添付およびテンプレート
ru: Приветствия, подписи, вложения и шаблоны
sw: Salamu, saini, viambatanisho na violezo

source: Salutations
ja: 挨拶文
ru: Приветсвтия
sw: Salamu

source: A salutation is a text module for a template. Salutations can be linked to one or more queues, as described in the section about <link linkend="adminarea-queue">queues</link>. A salutation is used only if a ticket from a queue the salutation is linked to, is answered. To manage the different salutations of your system, use the "Salutations" link of the admin area (see Figure below).
ja: 挨拶文はテンプレート用のテキスト・モジュールです。<link linkend="adminarea-queue">キュー</link>に関するセクションに述べられているように、挨拶文は1つ以上のキューにリンクすることができます。挨拶文は、挨拶文がリンクされて、返信されているキューからのチケットのみに使用されます。システムの異なる挨拶文を管理するためにには、管理者エリアの「挨拶文」リンクを使用してください(下記の図を参照)。
ru: Приветствие это текстовый шаблон для ответа. Приветствия могут быть связаны с одной или многими очередями, как это описано в в разделе <link linkend="adminarea-queue"> очереди</link>. Приветствия используются только в том случае, если на заявку из очереди, связанной с этим приветствием создается ответ. Для управления различными приветствиями в системе воспользуйтесь ссылкой "Приветствия" в панели администрирования (см. нижеприведенный Рисунок).
sw: Salamu ni moduli ya nakala ya kiolezo. Salamu inaweza kuunganishwa na foleni moja au zaidi, kama inavyoelezewa katika kifungu kuhusu <link linkend="adminarea-queue">foleni</link>. Salamu inatumika pale tu tiketi kutoka kwenye foleni ambayo salamu imeunganishwa, imejibiwa. Kusimamia salamu tofauti za mfumo wako, tumia kiungo cha "Salamu" cha eneo la msimamizi (ona Kielelezo chini).

source: Salutation management
ja: 挨拶文管理
ru: Управления приветствиями
sw: Usimamizi wa Salamu

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="Adminarea salutation - screenshot" scale="40" fileref="screenshots/admin-salutation.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="管理者エリア 挨拶文 - スクリーンショット" scale="40" fileref="screenshots/admin-salutation.png"></graphic>

source: <emphasis>Figure: Salutation management.</emphasis>
ja: <emphasis>図:挨拶文管理</emphasis>
ru: <emphasis>Рисунок: Управление приветсвиями.</emphasis>
sw: <emphasis>Kielelezo: Usimamizi wa Salamu.</emphasis>

source: After a default installation there is already one salutation available, "system standard salutation (en)".
ja: デフォルト・インストレーションの後、利用可能な1つの挨拶文が既にあります、「システム標準挨拶文(en)」
ru: После установки в системе есть одно предопределенное приветствие: "system standard salutation (en)".
sw: Baada ya usanikishaji wa kawaida tayari kuna salamu inapatikana, "salamu ya kawaida ya mfumo (en)".

source: To create a new salutation, press the button "Add salutation", provide the required data and submit it (see Figure below).
ja: 新規挨拶文を作成するには「挨拶文の追加」ボタンを押して、必要なデータを提供し、送信して(下記の図を参照)下さい
ru: Чтобы создать новое приветствие, нажмите на кнопку "Добавить приветствие", введите необходимые данные и нажмите кнопку "Отправить" (см. Рисунок ниже)
sw: Kutengeneza salamu mpya bofya kitufe "Ongeza salamu", weka data inayotakiwa kisha wasilisha (ona kielelezo chini).

source: Add a salutation
ja: 新規挨拶文の追加
ru: Добавление приветствия
sw: Ongeza salamu

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="Adminarea salutation - screenshot" scale="40" fileref="screenshots/add-salutation.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="管理者エリア 挨拶文 - スクリーンショット" scale="40" fileref="screenshots/add-salutation.png"></graphic>

source: <emphasis>Figure: Adding a new salutation.</emphasis>
ja: <emphasis>図:新規挨拶文の追加</emphasis>
ru: <emphasis>Рисунок: Добавление нового приветствия.</emphasis>
sw: <emphasis>Kielelezo: Kuongeza salamu mpya.</emphasis>

source: It is possible to use variables in salutations. When you respond to a ticket, the variable names will be replaced by their values.
ja: 挨拶文の中で変数を使用することは可能です。チケットに応答する時、変数名はそれらの値と取り替えられるでしょう。
ru: В приветствиях можно использовать переменные. Когда вы отвечаете на заявку, имена переменных будут заменены на их значения.
sw: Inawezekana kutumia vishika nafasi katika salamu. Ukitoa majibu kwenye tiketi, majina ya vishika nafasi yatabadilishwa na thamani zake.

source: The different variables you can use in templates are listed in the lower part of the salutation screen. If you use, for example, the variable &lt;OTRS_LAST_NAME&gt; the last name of the ticket's sender will be included in your reply.
ja: テンプレートの中で使用することができる異なる変数は、挨拶文画面の下方部分にリストされます。例えばこれを使えば、チケット送信者の姓が変数&lt;OTRS_LAST_NAME&gt; が返信に含まれるでしょう。
ru: Различные переменные, которые можно использовать в ответах приведены в нижней части экрана приветствия. Если вы используете, например, переменную &lt;OTRS_LAST_NAME&gt; то в ответ будет включена фамилия отправителя заявки.
sw: Vishika nafasi tofauti unavyoweza kutumia kwenye violezo vimeorodheshwa kwenye upande wa chini wa skrini ya salamu. Kama ukitumia kwa mfano, kishika nafasi &lt;OTRS_LAST_NAME&gt; jina la mwisho la mtumaji wa tiketi litajumuishwa kwenye majibu yako.

source: As with other OTRS entities, salutations cannot be deleted, only deactivated by setting the Valid option to <emphasis>invalid</emphasis> or <emphasis>invalid-temporarily</emphasis>.
ja: 他のOTRSの実体のように、挨拶文は削除できません。有効オプションを<emphasis>無効</emphasis>または<emphasis>無効-暫定</emphasis>にすることで不活性化されるだけです。
ru: Как и в случае с другими сущностями системы OTRS, приветствия не можно удалять, только деактивировать их, установив параметр Действительный в значение <emphasis>не действительный</emphasis> или <emphasis>не действительный-временно</emphasis>.
sw: Kama ilivyo kwa vyombo vingine vya OTRS, salamu haziwezi kufutwa, zinalemazwa tu kwa kuseti chaguo Halali kuwa <emphasis>batili</emphasis> au <emphasis>batili-kwa muda</emphasis>.

source: Signatures
ja: 署名
ru: Подписи
sw: Saini
