Repository: DSigmund/doc-admin
Catalog: i18n/doc-admin.*.po
Languages: ja, ru, sw

source: <command>-a write -n &lt;webservice_name&gt; -f /path/to/yaml/file</command> - To create a new web service.
ja: <command>-a write -n &lt;webservice_name&gt; -f /path/to/yaml/file</command> - 新規ウェブサービスを作ること。
ru: <command>-a write -n &lt;webservice_name&gt; -f /path/to/yaml/file</command> - Для создания нового веб-сервиса.
sw: <command>-a write -n &lt;webservice_name&gt; -f /path/to/yaml/file</command> - Kutengeneza huduma mpya ya tovuti.

source: <command>-a write -i &lt;webservice_id&gt; -f /path/to/yaml/file</command> - To update a web service.
ja: <command>-a write -i &lt;webservice_id&gt; -f /path/to/yaml/file</command> - ウェブサービスを更新すること。
ru: <command>-a write -i &lt;webservice_id&gt; -f /path/to/yaml/file</command> - Для обновления веб-сервиса.
sw: <command>-a write -i &lt;webservice_id&gt; -f /path/to/yaml/file</command> - Kusasisha huduma ya tovuti.

source: <command>-a list</command> - To list available web services.
ja: <command>-a list</command> - 利用可能なウェブサービスをリストすること。
ru: <command>-a list</command> - Для просмотра списка доступных веб-сервисов.
sw: <command>-a list</command> - Kuorodhesha huduma za tovuti zinazopatikana.

source: <command>-a delete -i &lt;webservice_id&gt;</command> - To delete a web service.
ja: <command>-a delete -i &lt;webservice_id&gt;</command> - ウェブサービスを削除すること。
ru: <command>-a delete -i &lt;webservice_id&gt;</command> - Для удаления веб-сервиса.
sw: <command>-a delete -i &lt;webservice_id&gt;</command> - Kufuta huduma ya tovuti.

source: Another available tool via the command line interface is the "otrs.GenericInterfaceDebugRead.pl" script, which is an interface to search for web service debugger log entries.
ja: コマンドライン・インタフェースによる別の利用可能なツールは"otrs.GenericInterfaceDebugRead.pl" スクリプトです。それはウェブサービス・デバッガ・ログエントリを検索するインターフェイスです。
ru: Еще одним доступным инструментом командной строки является скрипт "otrs.GenericInterfaceDebugRead.pl", который предоставляет интерфейс для для поиска записей в журнале отладчика веб-сервиса.
sw: Kifaa kingine kinachopatikana kupitia kiolesura cha tungo amri ni hati ya "otrs.GenericInterfaceDebugRead.pl", ambacho ni kiolesura cha kutafuta mweuaji wa maingizo ya batli ya huduma ya tovuti.

source: Example: Searching for debugger log entries:
ja: サンプル: デバッガ・ログエントリの検索:
ru: Пример: Поиск записей в журнале отладчика:
sw: Mfano: Kutafuta maingizo ya batli za anaye eua:

source: Optional parameters can be used for the "otrs.GenericInterfaceDebugRead.pl" script:
ja: オプションのパラメタは"otrs.GenericInterfaceDebugRead.pl"のために使用されます。
ru: Дополнительные параметры могут быть использованы для сценария "otrs.GenericInterfaceDebugRead.pl":
sw: Parameta za hiari zinaweza kutumika kwa ajili ya hati ya "otrs.GenericInterfaceDebugRead.pl":

source: <command>-c</command> - to filter by Communication ID (md5sum format).
ja: <command>-c</command> - コミュニケーションID(md5sumフォーマット)によってフィルタします。
ru: <command>-c</command> - для фильтрации по Communication ID (md5sum формат).
sw: <command>-c</command> - kuchuja Mawasiliano kwa Kitambulisho (muundo wa md5sum).

source: <command>-t</command> - to filter by CommunicationType ('Provider' or 'Requester').
ja: <command>-t</command> - CommunicationType(「プロバイダー」あるいは「依頼者」)によってフィルタします。
ru: <command>-t</command> - для фильтрации по CommunicationType ('Provider' или 'Requester').
sw: <command>-t</command> - kuchuja kwa MawasilianoAina ('Mtoaji' or 'Muombaji').

source: <command>-a</command> - to filter by date (At or After a date).
ja: <command>-a</command> - 日付(その日、またはある日の後)によってフィルタします。
ru: <command>-a</command> - для фильтрации по дате (На текущую дату или После нее).
sw: <command>-a</command> - kuchuja kwa tarehe (Katika au Baada ya tarehe).

source: <command>-b</command> - to filter by date (At or Before a date).
ja: <command>-b</command> - 日付(その日、またはある日の後)によってフィルタします。
ru: <command>-b</command> - для фильтрации по дате (на текущую дату или До нее).
sw: <command>-b</command> - kuchuja kwa tarehe (Katika au Kabla ya tarehe).

source: <command>-i</command> - to filter by IP Address (must be valid IPv4 or IPv6 address).
ja: <command>-i</command> - IPアドレス(有効なIPv4かIPv6アドレス)によってフィルタします。
ru: <command>-i</command> - для фильтрации по IP-адресу (должен быть правильный IPv4 или IPv6 адрес).
sw: <command>-i</command> - kuchuja kwa anwani ya IP (lazima iwe anwani halisi ya IPV4 au IPV6).

source: <command>-w</command> - to filter by Web Service ID.
ja: <command>-w</command> - ウェブサービスIDによってフィルタします。
ru: <command>-w</command> - для фильтрации по ID веб-сервиса.
sw: <command>-w</command> - kuchuja kwa Kitambulisho cha Huduma ya Tovuti.

source: <command>-d</command> - to include detailed communication data.
ja: <command>-d</command> - 詳細なコミュニケーション・データを含みます。
ru: <command>-d</command> - включить подробные передаваемые данные.
sw: <command>-d</command> - kujumuisha data za mawasiliano kwa undani.

source: Example: Searching for debugger log entries with all parameters:
ja: サンプル: すべてのパラメタを備えたデバッガ・ログエントリを検索:
ru: Пример: Поиск записей журнала отладчика со всеми параметрами:
sw: Mfano: Kutafuta maingizo ya anaye eua kwa kutumia parameta zote:

source: It is highly recommended to include at least one of the filter options listed above, and even more if the "-d" option is selected, because <emphasis>a lot of </emphasis> information can be retrieved from the data base and displayed on the screen, this could result in slow response times and much more information than what you really needed.
ja: 上記にリストされたフィルタ・オプションの少なくともひとつを含んでいること強くお薦めします、"-d"オプションが選択されていればさらに良いです。 なぜならば<emphasis>多くの</emphasis>情報はデータベースから引き出され画面に表示され、さらに実際より必要以上の多くの情報が遅いレスポンス時間の原因となりえます。
ru: Настоятельно рекомендуем включать, как минимум один из параметров фильтрации, перечисленных выше, или даже больше, еслы выбран ключ "-d", т.к. <emphasis>большое </emphasis> количество информации может быть получено и отображаться на экране, что приведет в большому времени ожидания и получению избыточной информации.
sw: Inashauriwa sana kujumuisha japo moja ya machaguo ya kuchuja yaliyoorodheshwa juu, na zaidi kama chaguo "-d" limechaguliwa, kwa sababu taarifa <emphasis>nyingi </emphasis> zinaweza kupatikana kutoka kwenye hifadhidata na kuonyeshwa kwenye skrini, hii inaweza kupelekea muda wa majibu kuongezeka na taarifa zaidi ya zile unazohitaji.

source: Stats module
ja: 統計モジュール（Stats module）
ru: Stats-модуль
sw: Moduli ya takwimu

source: The OTRS stats module holds features to track operational statistics and generates custom reports associated with OTRS usage. The OTRS system uses the term "stat" generically to refer to a report presenting various indicators.
ja: OTRS統計モジュールは、運用上の統計を追跡するための機能を保持し、OTRS使用量に関連したカスタムレポートを生成します。OTRSシステムは、様々な指標を示すレポートに言及するために用語「stat」を属に関して使用します。
ru: Модуль отчетов OTRS дает возможность оперативно отслеживать статистику и создавать пользовательские отчеты, связанные с использованием OTRS. OTRS использует общеупотребляемый термин "stat" для обозначения отчетов с различными показателями.
sw: Moduli ya takwimu ya OTRS inashikilia sifa za kufuatilia takwimu za operesheni na inazalisha ripoti zake yenyewe zinazohusiana na matumizi ya OTRS. Mfumo wa OTRS unatumia msemo "stat" kwa ujumla kumaanisha ripoti inayowakilisha viashiria mbali mbali.

source: Proper configuration of the OTRS stats module is associated with a multitude of requirements and considerations. These include the various OTRS modules to be evaluated, user permission settings, indicators to be calculated and their complexity levels, ease of configuration of the stats module, speed and efficiency of calculations, and support of a rich set of output variants.
ja: OTRS統計モジュールの適切な構成は多くの必要条件および考察に関連しています。これらは以下を含んでいます。様々な評価すべきOTRSモジュール、ユーザ許可設定、計算指標とそれらの複雑さのレベル、統計モジュールの構成の簡易化・軽減、計算の高速化・効率化、豊富な出力セットのサポート。
ru: Правильная настройка модуля статистики OTRS связана с множеством различных условий. К ним относятся различные модули системы OTRS, подлежащие оценке, настройки прав доступа пользователей, признаки, которые должны быть рассчитаны и уровень их сложности, легкость настройки модуля статистики, скорость и эффективность вычислений, поддержка множества вариантов вывода информации.
sw: Usanidi sahihi wa moduli ya takwimu ya OTRS unahusika na wingi wa mahitaji na mapendeleo. Hii inajumuisha moduli mbali mbali za kutathminiwa, mipangilio ya ruhusa za mtumiaji, viashirio kupigiwa hesabu na ngazi za ugumu, urahisi wa usanidi wa moduli za takwimu, kasi na ufanisi wa mahesabu, na msaada kwa seti tajiri za lahaja zinazotoka.

source: Statistical elements, i.e. files which supplement the functionality of the stats module for specific requirements, can be integrated for calculating complex statistics.
ja: 統計要素(つまり特定の必要条件用の統計モジュールの機能性を補足するファイル)は、複雑な統計の計算のために統合することができます。
ru: Статистические элементы, такие как например файлы, которые дополняют функциональные возможности модуля статистики для конкретых требований, могут быть интегрированы для подсчета сложной статистики.
sw: Elementi za takwimu, mafaili yanayoongeza kazi za moduli ya takwimu kwa mahitaji fulani, yanaweza kuunganishwa kutafuta thamani ya takwimu changamano.

source: Handling of the module by the agent
ja: 担当者によるモジュールの取り扱い
ru: Обработка модуля агентом
sw: Kushughulikia moduli kwa kutumia wakala

source: When signed on as an agent, the navigation bar displays the link "Statistics", with various submenu options, as shown in Figure.
ja: 担当者として署名すると、図中のように、ナビゲーション・バーは、様々なサブメニュー・オプションと共に、リンク「統計」を表示します。
ru: Когда вы вошли в систему как агент, в меню интерфейса будет отображатся пункт "Отчеты". Этот раздел имеет множество различных подменю, как это показано на Рисунке.
sw: Ukiingia kama wakala, mwambaa wa uabiri otaonyesha kiungo "Takwimu", na machaguo ya menyu ndogo tofauti tofauti, kama ilivyoonyeshwa kwenye Kielelezo.

source: The stats module
ja: 統計モジュール
ru: Модуль статистики
sw: Moduli ya takwimu

source: <placeholder type="screeninfo" id="0"/> <graphic fileref="screenshots/stats-menu.png" scale="40" srccredit="stats-menu - Screenshot" />
ja: <placeholder type="screeninfo" id="0"/> <graphic fileref="screenshots/stats-menu.png" scale="40" srccredit="統計 - メニュー - スクリーンショット" />

source: <emphasis>Figure: Statistics menu options.</emphasis>
ja: <emphasis>図:統計メニュー・オプション</emphasis>
ru: <emphasis>Рисунок: Опции меню Статистика.</emphasis>
sw: <emphasis>Kielelezo: Machaguo ya menyu ya takwimu.</emphasis>

source: The different options provided in the statistics menu are:
ja: 統計メニューの中で提供される異なるオプションは次のとおりである:
ru: Различные варианты представленные в меню статистики:
sw: Machaguo tofauti yanayotolewa katika menyu ya takwimu ni:

source: <emphasis>Overview</emphasis>. Presents a list of different pre-configured reports.
ja: <emphasis>概要</emphasis>。異なる事前構成されたレポートのリストを示します。
ru: <emphasis>Overview</emphasis>. Предоставляет список различных предварительно сконфигурированных отчетов.
sw: <emphasis>Mapitio</emphasis>. Inawasilisha orodha ya ripoti tofauti zilizosanidiwa kabla.

source: <emphasis>New</emphasis>. Requires rw rights.
ja: <emphasis>新規</emphasis>。rw権限を必要とします。
ru: <emphasis>Новая</emphasis>. Требуются права rw.
sw: <emphasis>Mpya</emphasis>. Inahitaji haki za kusoma na kuandika.

source: <emphasis>Import</emphasis>. Requires rw rights.
ja: <emphasis>インポート</emphasis>。rw権限を必要とします。
ru: <emphasis>Импорт</emphasis>. Требуются rw-права.
sw: <emphasis>Agiza</emphasis>. Inahitaji haki za kusoma na kuandika.

source: Overview
ja: 概要
ru: Обзор
sw: Mapitio

source: Selecting the "Statistics" link in the navigation bar, and then the submenu link "Overview", calls up the Overview screen. The Overview screen presents a list of all pre-configured reports the agent can use (see Figure below).
ja: ナビゲーション・バー中の「統計」リンクと、サブメニュー・リンクの「概要」を選択することで、概要画面を呼び出します。概要画面は、全ての事前定義された担当者が利用可能なレポートをのリストを表します(下記の図を参照)。
ru: Выберите ссылку "Отчеты" в меню, а затем подменю "Обзор". На открывшейся странице будет представлен список всех предварительно настроеных отчетов, которые агент уже может использовать (см. Рисунок ниже).
sw: Kwa kuchagua kiungo cha "Takwimu" kwenye mwambaa wa uabiri, na kisha kiungo cha menyu ndogo "Mapitio", inaita skrini ya Mapitio. Skrini ya mapitio inaonyesha orodha ya ripoti zote ambazo zimesanidiwa kabla na wakala anaweza kutumia (ona Kielelezo chini).

source: Overview of the standard reports
ja: 標準レポートの概要
ru: Обзор стандартных отчетов
sw: Mapitio ya ripoti za kawaida

source: <placeholder type="screeninfo" id="0"/> <graphic fileref="screenshots/stats-overview.png" scale="40" srccredit="stats-overview - Screenshot" />
ja: <placeholder type="screeninfo" id="0"/> <graphic fileref="screenshots/stats-overview.png" scale="40" srccredit="統計 - 概要 - スクリーンショット" />

source: <emphasis>Figure: Overview of the standard reports.</emphasis>
ja: <emphasis>図:標準レポートの概要</emphasis>
ru: <emphasis>Рисунок: Просмотр стандартных запросов.</emphasis>
sw: <emphasis>Kielelezo: Mapitio ya ripoti za kawaida.</emphasis>

source: The following information is provided for each of the standard reports listed in the Overview:
ja: 次の情報が概要にリストされたそれぞれの標準レポートのために提供される:
ru: Для каждого из отчетов, перечисленных в Обзоре предоставлена следующая информация:
sw: Taarifa ifuatayo inatolewa kwa kila ripoti ya kawaida iliyoorodheshwa kwenye Mapitio:

source: <emphasis>Stat#</emphasis>. Unique report number.
ja: <emphasis>Stat#</emphasis>。ユニークなレポート番号。
ru: <emphasis>Stat#</emphasis>. Уникальный номер отчета.
sw: <emphasis>Takwimu#</emphasis>. Namba ya ripoti ya kipekee.

source: <emphasis>Title</emphasis>. Title of the report.
ja: <emphasis>Title</emphasis>。レポートのタイトル。
ru: <emphasis>Заголовок</emphasis>. Заголовок отчета.
sw: <emphasis>Kichwa</emphasis>. Kichwa cha ripoti.

source: <emphasis>Object</emphasis>. Object used for generating the statistic. In the case of a static statistic, no object is displayed as no dynamic object is used for its generation.
ja: <emphasis>オブジェクト</emphasis>。オブジェクトは統計生成するために使用します。静的統計の場合には、動的オブジェクトがその生成に使用されないとともに、オブジェクトは表示されません。
ru: <emphasis>Объект</emphasis>. Объект, который используется для генерации статистики. В случае статической статистики не отображается ни один объект, поскольку в ее генерации динамические объекты не участвуют.
sw: <emphasis>Kitu</emphasis>. Kitu kinachotumika kuzalisha takwimu. Katika kesi ya takwimu tuli, hakuna kitu kinachoonyeshwa kwa kuwa hakuna kitu kinachobadilika kinachotumika kwa uzalishaji wake.

source: <emphasis>Description</emphasis>. A brief description of the report.
ja: <emphasis>摘要：</emphasis>レポートの簡潔な記述。
ru: <emphasis>Описание</emphasis>. Краткое описание отчета.
sw: <emphasis>Maelezo</emphasis>. Maelezo mafupi ya ripoti.

source: When the stats module is installed, it comes preloaded with a few sample reports imported into the system. These are shown as a list on the Overview page. If the Overview list extends to more than a single page, the agent can browse through the different pages. The list of reports can be sorted as desired, by clicking the desired column header in the list. To generate a particular report, click on the stat number associated with the report in the Overiew list. This brings up the "View" interface for the report.
ja: 統計モジュールがインストールされている場合、それはシステムへインポートされた少数のサンプルのレポートでプレインストールされたようになる。これらは概要ページのリストとして示されます。概要リストが単一のページを越えるものまで及ぶ場合、担当者は異なるページをブラウズすることができます。レポートのリストは、リスト中の希望のカラム・ヘッダーのクリックすることで、好みに応じてソートすることができます。特別のレポートを生成するためには、概要リスト中でレポートに関連したstat番号をクリックしてください。これによりレポート用の「ビュー」インターフェイスが表示されます。
ru: Когда модуль статистики установлен, он поставлятся с несколькими предустановленными отчетами, выборочно встроенными в систему. Они приведены в виде списка на странице "Обзор". Если список слишком большой и не помещается на одну страницу, у агента есть возможность просматривать другие страницы. Список отчетов может быть отсортирован по своему вкусу, путем нажатия на желаемый заголовок столбца в списке. Чтобы создать конкретный отчет, нажмите на соответствующие stat-номер, связанный с отчетом. В результате откроется интерфейс просмотра отчета.
sw: Wakati moduli ya takwimu imesakinishwa, inakuja na ripoti chache za mfano zilizoagizwa kwenye mfumo. Hizi zinaonyeshwa kama orodha kwenye kurasa ya Mapitio. Kama kurasa ya mapitio ikipanuliwa kuwa zaidi ya kurasa moja, wakala anaweza kuvinjari kwenye kurasa tofauti. Orodha ya ripoti inaweza kupangwa unavyotaka, kwa kubofya kichwa cha safuwima unayotaka katika orodha. Kuzalisha ripoti maalumu, bofya kwenye nambari ya takwimu inayohusika na ripoti katika orodha ya Mapitio. Hii inaleta kiolesura "Muonekano" cha ripoti.

source: Generate and view reports
ja: レポートの生成と閲覧
ru: Создание и просмотр отчетов
sw: Tengeneza na ona ripoti

source: The view user interface provides the stat's configuration settings (see Figure below).
ja: ビュー・ユーザ・インターフェースはstatの構成設定を提供します(下記の図を参照)。
ru: Пользовательский интерфейс предоставляет параметры настройки отчетов (см. Рисунок ниже).
sw: Kiolesura cha muonekano wa mtumiaji inatoa mipangilio ya usanidi wa takwimu. (ona Kielelezo chini).

source: Stat view
ja: 統計ビュー（Stat view）
ru: Просмотр статистики
sw: Ona takwimu

source: <placeholder type="screeninfo" id="0"/> <graphic fileref="screenshots/stats-view.png" scale="40" srccredit="stats-view - Screenshot" />
ja: <placeholder type="screeninfo" id="0"/> <graphic fileref="screenshots/stats-view.png" scale="40" srccredit="統計 - ビュー - スクリーンショット" />

source: <emphasis>Figure: Viewing a specific report.</emphasis>
ja: <emphasis>図:特定のレポートのビュー</emphasis>
ru: <emphasis>Рисунок: Просмотр определенного отчета.</emphasis>
sw: <emphasis>Kielelezo: Kuona ripoti maalumu.</emphasis>

source: Configuration settings for a particular report can be set within the range of options in the View screen. Either the report creator or any others with the appropriate permissions can make the settings.
ja: 特定のレポート用構成設定は ビュー画面の中のオプションの範囲の中で設定できます。レポート製作者あるいは適切な許可を持つ他の誰でも、設定を作ることができます。
ru: Параметры конфигурации для конкретного отчета могут быть установлены путем выбора ряда возможных опций. Как автор отчета так и другие пользователи с соответсвтующими правами доступа могут создавать настройки.
sw: Mipangilio ya usanidi wa ripoti fulani inaweza kusetiwa ndani ya machaguo mbali mbali kwenye skrini ya kuona. Aidha mtengenezaji wa ripoti au mtu mwingine yoyote mwenye ruhusa zinazotakiwa anaweza kuweka mipangilio.

source: The page shows the following:
ja: 下記参照:
ru: На странице отображается следующее:
sw: Kurasa inaonyesha vifuatavyo:

source: Possible actions:
ja: 可能なアクション:
ru: Возможные действия:
sw: Vitendo viwezekanavyo:

source: <emphasis>Go to overview</emphasis>. Link back to the Overview list of reports.
ja: <emphasis>概要に行ってください</emphasis>。レポートの概要リストにリンクしてください。
ru: <emphasis>Перейти к обзору</emphasis>. Ссылка, ведущая обратно к Просмотру списка отчетов.
sw: <emphasis>Nenda kwenye mapitio</emphasis>. Kiungo kinakurudisha kwenye orodha ya mapitio ya ripoti.

source: <emphasis>Edit</emphasis>. Edit the current report structure (rw rights required).
ja: <emphasis>編集</emphasis>。現在のレポート構造(必要なrw権)を編集してください。)。
ru: <emphasis>Редактировать</emphasis>. Редактировать имеющуюся структуру отчета (требуются права для чтения и записи, rw).
sw: <emphasis>Hariri</emphasis>. Hariri muundo wa ripoti ya sasa (haki za kusoma na kuandika zinahitajika).

source: <emphasis>Delete</emphasis>. Delete the current report (rw rights required).
ja: <emphasis>削除</emphasis>。現在のレポート(要求されるrw権)を削除してください。
ru: <emphasis>Удалить</emphasis>. Удалить текущий отчет (требуются права для чтения и записи, rw).
sw: <emphasis>Futa</emphasis>. Futa ripoti ya sasa (haki za kusoma na kuandika zinahitajika).

source: <emphasis>Export config</emphasis>. Export a report configuration, via file download (rw rights required).
ja: <emphasis>構成のエクスポート</emphasis>。ファイル・ダウンロード(必要なrw権)によって、レポート構成をエクスポートしてください。
ru: <emphasis>Экспортировать настройки</emphasis>. Экспортировать настройки отчета с помощью загрузки файла (требуются права для чтения и записи, rw).
sw: <emphasis>Hamisha usanidi</emphasis>. Hamisha ripoti ya usanidi, kupitia upakuaji wa faili (haki za kusoma na kuandika zinahitajika)

source: Usage: Export and Import functions allow for the convenient creation and testing of reports on test systems and subsequent easy integration into the production system.
ja: 使用法:エクスポート・インポート機能で、テストシステム上でのレポートのテストと作成が便利になります。そしてそれに続く生産システムへの統合を容易にします。
ru: Традиционно: функции Экспорт и Импорт позволяют создавать и тестировать отчеты та тестовых системах с их легкой дальнейшей интеграцией в производственную систему.
sw: Matumizi: Fomula saidizi za Agiza na Hamisha zinaruhusu kwa urahisi wa kutengeneza na kujaribu ripoti katika mifumo ya majaribio na urahisi wa kuingiza kwenye mfumo wa uzalishaji.

source: Report details:
ja: レポート詳細:
ru: Подробности отчета:
sw: Undani wa ripoti:

source: <emphasis>Stat#</emphasis>. Number of the report.
ja: <emphasis>Stat#</emphasis>。レポートの数。
ru: <emphasis>Отчет#</emphasis>. Номер отчета.
sw: <emphasis>Takwimu#</emphasis>. Nambari ya ripoti.

source: <emphasis>Object</emphasis>. Object used for generating the report.
ja: <emphasis>オブジェクト</emphasis>。レポートの生成のために使用されたオブジェクト。
ru: <emphasis>Объект</emphasis>. Объект, который используется для создания отчета.
sw: <emphasis>Kitu</emphasis>. Kitu kinachotumika kutengeneza ripoti.

source: <emphasis>Description</emphasis>. Description on the report's purpose.
ja: <emphasis>摘要</emphasis>。レポートの目的を記載するための摘要。
ru: <emphasis>Описание</emphasis>. Описание цели отчета.
sw: <emphasis>Maelezo</emphasis>. Maelezo ya dhumuni la ripoti.

source: <emphasis>Format</emphasis>. Report output format which, depending on the configuration, can be any of the following output formats:
ja: <emphasis>フォーマット</emphasis>。構成に依存しますが、次いずれかの出力フォーマットによるレポート出力フォーマット:
ru: <emphasis>Формат</emphasis>. Выходной формат отчета. В зависимости от конфигурации, можно выбрать один из следующих форматов вывода:
sw: <emphasis>Umbizo</emphasis>. Umbizo la ripoti itakayotoka, inategemea na usanidi, inaweza kuwa mojawapo ya maumbizo yafuatayo:

source: Print.
ja: 印刷。
ru: Печать.
sw: Chapisha

source: Graph-lines.
ja: グラフ・線。
ru: Графические линии.
sw: Grafu-mistari

source: Graph-bars.
ja: グラフ・棒。
ru: Столбцовая диаграмма.
sw: Grafu-miambaa.

source: Graph-hbars.
ja: グラフ・横棒。
ru: Диаграмма.
sw: Grafu-miambaa h.

source: Graph-points.
ja: グラフ・点。
ru: Точечная диаграмма.
sw: Grafu-pointi.

source: Graph-lines-points.
ja: グラフ・点ー線。
ru: Точечно-линейная диаграмма.
sw: Grafu-mistari-pointi.

source: Graph-area.
ja: グラフ・エリア。
ru: Диаграмма
sw: Grafu-eneo.

source: Graph-pie.
ja: グラフ・パイ。
ru: Круговая "пирожок"-диаграмма.
sw: Grafu-duara.

source: <emphasis>Graphsize</emphasis>. Size in pixels for the graphic / chart. This option is only given when the report configuration allows a chart. All generally usable graphic sizes are configured by the OTRS administrator in SysConfig. The agent can then pre-select all relevant formats, while configuring the report.
ja: <emphasis>グラフ化</emphasis>。グラフィック/図表用ピクセルでのサイズ。レポート構成が図表を許可する場合のみ、このオプションが与えられます。一般に使用可能なグラフィックのサイズはすべて SysConfigの中のOTRS管理者によって構成されます。レポートを構成する一方で、担当者はあらかじめ適切なフォーマットをすべて選択することができます。
ru: <emphasis>Размер в пикселях</emphasis>. Размер графиков/диаграмм в пикселях. Эта опция доступна только в том случае, если в настройках отчета разрешены графики. Все часто используемые графические размеры настраиваются OTRS-администратором в SysConfig. Затем, во время настройки отчета, агент может выбрать необходимый формат из всех доступных.
sw: <emphasis>Ukubwawagrafu</emphasis>. Ukubwa katika pikseli kwa ajili ya mchoro / chati. Hili chaguo linatolewa pale tu usanidi wa ripoti unaruhusu chati. Ukubwa wowowte unaoweza kutumika kwa ujumla unasaniwa na msimamizi wa OTRS kwenye SysConfig. Wakala kisha anaweza kuchagua kabla umbizo husika, wakati anasanidi ripoti.
