Repository: DSigmund/doc-admin
Catalog: i18n/doc-admin.*.po
Languages: ja, ru, sw

source: It is now possible to specify templates (previously "standard responses") also for creation of new tickets and for ticket forwarding.
ja: テンプレート(以前は「標準レスポンス」)を指定することができます。新しいチケットの生成および転送のためにも使えます。
ru: Теперь есть возможность задания шаблонов (ранее, "стандартных ответов") также при создании новых заявок и их пересылке.
sw: Sasa inawezekana kubainisha violezo (awali "majibu ya kawaida") pia kwa utengenezaji wa tiketi mpya na upelekaji mbele tiketi.

source: The list of available processes can now be filtered by ACLs.
ja: 利用可能なプロセスのリストは、ACLによってフィルターすることができるようになりました。
ru: Список доступных процессов теперь можно фильтровать с помощью ACL.
sw: Orodha ya michakato inayopatikana sasa inaweza kuchujwa na ACLs.

source: Added support to initiate processes from Customer Interface.
ja: カスタマー・インターフェースからのプロセスを始める追加サポート。
ru: Добавлен возможность инициировать процесс/процессную заявку из интерфейса клиента.
sw: Usaidizi umeongezwa kuanzisha mchakato kutoka kwa kiolesura cha mteja.

source: In many places text is not shortened any more by a fixed number of characters ("Queue1..."), but instead by available screen estate. This makes it possible to see more information at once.
ja: 多くの場合テキストは文字の定数(「Queue1...」...)によって短くはできませんが、利用可能な画面（解像度）によって可能になります。それによって一覧でより多くの情報を見ることができます。
ru: Во многих местах теперь, значение текстового поля более не обрезается на определенном количестве символов ("Queue1..."). Вместо этого экран расширяется и можно воспользоваться прокруткой по горизонтали. Это позволяет увидеть больше информации сразу.
sw: Katika sehemu nyingi nakala hazifupishwi tena kwa idadi maalumu ya herufi ("Foleni1..."), lakini badala yake kwa hali za skrini zilizopo. Hii inawezesha kuona taarifa nyingi zaidi kwa mkupuo.

source: OTRS is now Retina-ready. Images have been adapted to match the higher resolutions and most of the image icons have been replaced by font characters from the FontAwesome webfont.
ja: OTRSがレティナ・ディスプレイ対応となりました。イメージはより高い解像度に適応されています。また、ほとんどのイメージ・アイコンは FontAwesome webfont からのフォント文字と取り替えられました。
ru: OTRS теперь поддерживает Retina-дисплеи. Изображения были адаптированы под высокое разрешение и большинство иконок были заменены символами из веб-шрифта FontAwesome
sw: OTRS sasa iko tayari kwa Retina. Taswira sasa zinaweza kukabiliana na muonekano wa juu na ikoni za taswira zimebadilishwa na fonti za herufi kutoka webfont ya FontAwesome .

source: Added new feature "management dashboard". This makes it possible to display statistic charts in the dashboard. Please note that IE8 does not support this feature.
ja: 新機能「管理ダッシュボード」が追加され、ダッシュボード中で統計の図表を表示できるようになりました。ただし、IE8はこの機能をサポートしておりませんのでご留意下さい。
ru: Добавлена новая возможность "управляемый дайжест". Она дает возможность отображать статистические диаграммы в Дайджесте. Обращаем внимание, что IE8 не поддерживает эту возможность.
sw: Kipengele kipya "usimamizi wa dashibodi" kimeongezwa. Hii inawezesha kuonyesha chati za takwimu kwenye dashibodi. Tafadhali tambua IE8 haina msaada kwa kipengele hiki.

source: Working With External Systems
ja: 外部システムとの作業
ru: Работа с внешними системами
sw: Kufanya kazi na mifumo ya nje

source: OTRS can now use multiple customer company databases, thanks to Cyrille @ belnet-ict.
ja: OTRSは、複数の顧客会社データベースを使用することができるようになりました。（Cyrille@belnet-ictに感謝！）
ru: OTRS ныне может использовать несколько баз данных для компаний клиентов, благодаря Cyrille @ belnet-ict.
sw: OTRS sasa inaweza kutumia hifadhidata nyingi za kampuni za wateja, shukrani kwa Cyrille @ belnet-ict.

source: OTRS can now automatically store customer user data in ticket dynamic fields for permanent storage in the ticket. This can be useful for reporting.
ja: OTRSは、顧客ユーザーデータをチケットの動的フィールドに（チケットに永久保存するため）格納するようになりました。これはレポーティングに役立つ場合があります。
ru: OTRS теперь может автоматически сохранять данные клиента в динамических полях заявки для постоянного хранения в заявке. Это может быть полезно в отчетах, если, например, в отчетном периоде, клиент сменил компанию.
sw: OTRS sasa inaweza kutunza data za mtumiaji katika maeneo yanayobadilika ya tiketi kwa hifadhi ya kudumu katika tiketi. Hii itakuwa na faida katika uarifu.

source: OTRS is now able correctly assign incoming emails to existing tickets based on ticket numbers from external systems.
ja: OTRSは、外部システムから受信したEメールを、チケット番号に基づいて既存のチケットへ、正しく割り当てることができるようになりました。
ru: OTRS теперь способен корректно присоединять входящие почтовые сообщения к существующим заявкам, основанным на номерах из внешних систем.
sw: OTRS sasa inaweza kuweka barua pepe zinazoingia kwa usahihi chini ya tiketi zilizopo kulingana na nambari ya tiketi kutoka mifumo ya nje.

source: OTRS can now fetch email also over POP3/TLS connections.
ja: OTRSは、POP3/TLS接続経由でEメールを取得(fetch)することができるようになりました。
ru: OTRS способен теперь забирать почту также и через POP3/TLS соединения.
sw: OTRS sasa inaweza kutafuta barua pepe kupitia miunganiko ya POP3/TLS.

source: Installation &amp; Administration
ja: インストールとアドミニストレーション（管理）
ru: Установка и Администрирование
sw: Usanikishaji &amp; Usimamizi

source: Web Installer now can setup OTRS on PostgreSQL, Oracle and SQL Server databases in addition to MySQL.
ja: ウェブインストーラーは、MySQLに加えてのPostgreSQL、オラクルおよびSQLサーバー・データベースの上でOTRSをセットアップできるようになりました。
ru: Теперь Веб-Установщик может устанавливать OTRS с такими базами данных как PostgreSQL, Oracle и SQL Server, а также MySQL.
sw: Kisakinishi cha wavuti sasa kinaweza kuanzisha OTRS katika hifadhidata za Seva za PostgreSQL, Oracle na SQL mbali na MySQL.

source: OTRS now has full support for MySQL 5.6.
ja: OTRSは、MySQL 5.6をフルサポートするようになりました。
ru: Теперь OTRS имеет полную поддержку MySQL 5.6.
sw: OTRS sasa ina usaidizi kamili wa MySQL 5.6

source: Generic agent jobs can now be executed for configured ticket events.
ja: 一般の担当者ジョブが、設定されたチケット・イベントのために実行することができるようになりました。
ru: Задания Планировщика теперь могут выполняться на основе заданных событиях по заявке.
sw: Kazi za wakala wa kawaida sasa zinaweza kutekelezwa kwa matukio ya tiketi zilizosanidiwa.

source: The new graphical ACL editor makes ACL editing easier.
ja: 新しいグラフィカルなACLエディターはACL編集をより簡単にします。
ru: Новый графический редактор ACL значительно упрощает редактирование списков ACL.
sw: Kihariri kipya cha michoro cha ACL kinafanya uhariri wa ACL kuwa rahisi.

source: Postmaster filters can now use negated filter conditions, thanks to Renée Bäcker.
ja: ポストマスター・フィルターによっては、無効にされたフィルター条件を使用することができるようになりました。（Renee Backerに感謝！）
ru: Фильтры Postmaster теперь могут иcпользовать условия с отрицанием, спасибо Renée Bäcker.
sw: Vichujio vya mkuu wa posta sasa vinaweza kutumia masharti hasi ya kuchuja, shukrani kwa Renée Bäcker.

source: Postmaster filters can now specify relative pending dates and Owner / Responsible for new tickets based on incoming email data.
ja: ポストマスター・フィルターは、関連した滞留日と所有者あるいは、受信するEメールデータに基づく新しいチケットに対する責任者を特定するようになりました。
ru: Фильтры Postmaster теперь могут определять относительную дату ожидания и Владельца / Ответственного для новых заявок, основанных на данных из входящих email.
sw: Vichujio vya mkuu wa posta sasa vinaweka bayana tarehe za kusubiri na Mmiliki / Mhusika wa tiketi mpya kwa kutegemea data za barua pepe zinazoingia.

source: Customer and Agent passwords now can be encrypted using the strong bcrypt algorithm, which is better than SHA.
ja: 顧客と担当者のパスワードは強力なbcryptアルゴリズムを使って暗号化することができるようになりました。bcryptはSHAより良質です。
ru: Пароли для Клиента и Агента теперь могут быть зашифрованы с помощью стойкого алгоритма bcrypt, который лучше SHA.
sw: Nywila za Wateja na Mawakala sasa zinaweza kufanyiwa usimbaji fiche kwa kutumia kanuni imara ya bcrypt, ambayo ni nzuri zaidi ya SHA.

source: Many icons now use an icon font which makes it much easier to create custom skins with different base colors. This also improves overall performance through smaller amount of (image) files to load.
ja: 多くのアイコンはアイコン・フォントを使うことができるようになりました。それによりさまざまな基調色でカスタム・スキンを作成することが容易になりました。
ru: Сейчас многие значки теперь используют иконочный шрифт, который позволяет проще создавать различные обложки с различными основными цветами. Это также улучшает общую производительность за счет малого количества загружаемых файлов (картинок).
sw: Icons nyingi sasa kutumia font icon ambayo inafanya rahisi kujenga ngozi desturi na rangi tofauti ya msingi. Hii pia inaboresha utendaji kwa ujumla kupitia ndogo kiasi cha (picha) mafaili kupakia.

source: New features of OTRS 3.2
ja: OTRS 3.2の新機能
ru: Новые возможности OTRS 3.2
sw: Vipengele vipya vya OTRS 3.2

source: More customer focused
ja: 顧客をより重視すること
ru: Больше ориентирован на клиента
sw: Inalenga zaidi mteja

source: The new "Customer Information Center" provides a great dashboard-like view on a customer (company). You can see
ja: 新しい ”顧客情報センター" は、顧客（会社）に大きなダッシュボードのような概要を提供します。
ru: Новый Центр Информации о Клиентах предоставляет превосходный "дайджестоподобный" обзор клиентов (компаний). Вы можете видеть
sw: Kituo kipya cha habari kwa wateja kinatoa muonekano mzuri wa dashibodi kwa mteja (kamouni). Unaweza kuona

source: Escalated, reminder, new, and open tickets of the customer company.
ja: 顧客の会社のチケットを、エスカレーション、リマインダー、新規作成、そして対応中にします。
ru: Эскалированные, ожидающие напоминания, новые и открытые заявки компании клиента.
sw: Kupandishwa, kikumbusho, mpya na tiketi zilizo wazi za kampuni ya mteja.

source: Customer users (contacts) belonging to this customer company, with their individual ticket count and shortcuts for creating new tickets for them.
ja: 顧客ユーザ（連絡先）は、この顧客会社に所属しており、それら個別のチケットカウントと新規チケットを作成するためのショートカットを持っています。
ru: Клиенты (контакты) принадлежащие этой компании, с их индивидуальными счетчиками заявок и их обозначениями для создания новых заявок для них.
sw: Watumiaji wa mteja (mawasiliano) wanao milikiwa na kampuni ya huyu mteja, na hesabu za tiketi zao binafsi na njia za mkato za kutengeneza tiketi zao mpya.

source: An overall ticket status view of the customer company.
ja: 顧客会社の総合的なチケット状態のビュー
ru: Общий обзор статусов заявок компании клиента.
sw: Muonekano wa jumla wa hali ya tiketi za kampuni ya mteja.

source: New "switch to customer" feature makes it possible for an agent with the required permissions to look into the customers's panel with their rights.
ja: 新しい「顧客へのスイッチ」の機能によって、担当者は、必要な許可さえあればその権限に応じて、顧客のパネルを見ることができるようになりました。
ru: Новая возможность "Переключиться на клиента" дает возможность агенту, с определенными правами, зайти на портал клиента с его/клиента правами.
sw: Kipengele kipya cha "swichi ya mteja" kinawezesha wakala mwenye ruhusa zinazo takiwa kuangalia kwenye jopo la mteja pamoja na haki zake.

source: More customizable
ja: さらなるカスタマイズが可能
ru: Более настраиваемый
sw: Inaweza kugeuzwa kukufaa zaidi

source: Process Management
ja: 工程管理
ru: Управление Процессами
sw: Usimamizi wa mchakato

source: The new <link linkend="process-management">process management</link> makes it possible to represent processes within OTRS.
ja: 新しい工程管理 <link linkend="process-management">process management</link> は、OTRSの内のプロセスを表わすことを可能にします。
ru: Новый функционал <link linkend="process-management">управление процессами</link> дает возможность использования процессов в OTRS.
sw: <link linkend="process-management">usimamizi wa mchakato </link> mpya unawezesha kuwakilisha michakato ndani ya OTRS.

source: Customer Interface Improvements
ja: 顧客インターフェースの改良
ru: Улучшен пользовательский веб-интерфейс
sw: Uboreshaji wa kiolesura cha mteja

source: The customer web interface now fully supports AJAX and ACLs.
ja: 顧客ウェブインターフェースは全面的にAJAXとACLをサポートするようになりました。
ru: Веб - интерфейс клиента теперь полностью поддерживает использование AJAX и ACL.
sw: Kiolesura cha wavuti wa mteja sasa kina endana na AJAX na ACLs.

source: It now requires JavaScript and is not compatible with Internet Explorer 6 or earlier versions.
ja: 顧客ウェブインターフェースは、JavaScriptを必要とし、IE6以前バージョンと互換性がなくなりました。
ru: Он теперь требует наличия поддержки JavaScript и несовместим с Internet Explorer 6 и более ранними версиями.
sw: Sasa inahitaji JavaScript na sio tangamanifu na Internet Explorer 6 au matoleo la nyuma.

source: In the Customer Interface, you can now set the default ticket type for new tickets. Additionally, you can now also hide the ticket type and use a default value for all tickets created via the customer interface.
ja: 顧客インターフェースでは、新しいチケット用にデフォルト・チケット・タイプをセットすることができるようになりました。さらにチケット・タイプを非表示とし、デフォルト値を顧客インターフェース経由で作成されたすべてのチケットに使用することができるようになりました。
ru: Для интерфейса клиента вы теперь можете задать тип заявки по умолчанию для новых заявок. Дополнительно, вы также имеете возможность отключить ввод типа заявки и использовать значение его по умолчанию для всех заявок создаваемых через интерфейс клиента.
sw: Katika kiolesura cha mteja, sasa unaweza ku seti chaguo-msingi la aina ya tiketi kwa tiketi mpya. Pia, sasa unaweza kuficha aina ya tiketi na kutumia chaguo-msingi kwa tiketi zote zinazotengenzwa kwa kutumia kiolesura cha mteja.

source: Agent Interface Improvements
ja: 担当者インターフェースの改良
ru: Улучшен веб-интерфейс Агента
sw: Maboresho ya kiolesura cha wakala

source: Agents can now search for tickets based on escalation time.
ja: 担当者は、エスカレーション時間に基づいてチケットを検索することができるようになりました。
ru: Агенты теперь могут осуществлять поиск заявок на основании времени эскалации.
sw: Wakala sasa wanaweza kutafuta tiketi kwa muda wa kupanda.

source: New option to show DynamicFields by default in ticket search.
ja: チケット検索のデフォルトで DynamicFields を表示する新しいオプション。
ru: Новая возможность показывать динамические поля по умолчанию при поиске заявок.
sw: Chaguo jipya la kuonyesha SehemuZinazobadilika kama chaguo-msingi katika kutafuta tiketi.

source: Screen usage optimizations in the ticket screens to avoid scrolling in popup windows. For each ticket screen, the size of the richtext editor can now be configured separately.
ja: ポップアップ・ウィンドウ中でスクロールしないようにするためのチケット画面中の画面利用最適化。各チケット画面については、リッチ・テキスト・エディタのサイズは個別に設定できるようになりました。
ru: Оптимизация использования площади экрана при работе с заявками во всплывающих окнах во избежание использования прокрутки. Для каждого экрана заявки, размер окна текстового редактора теперь может быть настроен отдельно.
sw: Usadifishaji wa matumizi ya skrini katika skrini za tiketi kuzuia kubiringiza katika madirisha ibukizi. Kwa kila skrini ya tiketi, ukubwa wa kihariri cha nakalatajiri sasa unaweza kusanidiwa kipekee.

source: It is now possible to move tickets to another queue from within the TicketAction dialogs (TicketNote, TicketClose etc.) after activating a configuration option. This is turned off by default.
ja: 構成オプションを活性化した後に、TicketAction ダイアログ（TicketNote、TicketCloseなど）の内部からの別のキューへの移動が可能になりました。この機能はデフォルトではオフです。
ru: Теперь появилась возможность перемещать заявки в другую очередь в окнах действий с заявкой (TicketNote, TicketClose и т.д.) после включения этой опции в SysConfig. По умолчанию, она выключена.
sw: Sasa inawezakana kupeleka tiketi kwenye foleni nyingine ndani ya maongezi ya VitendoVyaTiketi (DokezoLaTiketi, FungaTiketi na kadh.) baad aya ku amilisha sanidi za chaguo. Hii huwa inazimwa.

source: Ticket search will now directly jump to the ticket zoom screen if only one ticket is found.
ja: チケットが１枚しかない場合、チケット検索からチケット・ズーム画面に直接ジャンプするようになりました。
ru: Если результатом поиска является единственная заявка, теперь вы сразу попадете на экран просмотра заявки, минуя список найденных.
sw: Utafutaji wa tiketi utaenda moja kwa moja kwenye skrini ya ku kuza tiketi endapo tiketi moja itapatikana.

source: New ability to hide the Article Type from TicketActionCommon-based screens which can be helpful to fit more data in the browser window.
ja: ブラウザ・ウィンドウに、より多くのデータを調整表示するために役立つ TicketActionCommon ベースの画面から記事のタイプを非表示にする新しい機能。
ru: Новая возможность скрывать заданные типы сообщений/заметок на экранах просмотра заявок, что может быть полезным для более удобного обзора экрана.
sw: Uwezo mpya wa kuficha Aina ya Makala kutoka kwenye skrini za TiketiKitendoKawaida ambazo zinaweza kuwa na manufaa kuweka data zaidi kwenye dirisha la kivinjari.

source: There is a new out-of-office dashboard widget that lists all currently unavailable agent colleagues.
ja: 現在利用不可能な担当者をすべてリストする、新しいオフィス不在・ダッシュボード・ウィジェットがあります。
ru: Новый виджет для Дайджеста отображающий список агентов "вне офиса".
sw: Kuna kifaa kipya cha nje ya ofisi cha ndashibodi ambacho kina orodhesha wakala wote washirika wasiopatikana kwa muda huo.

source: New CKEditor 4 makes working with rich text content (such as HTML emails) easier and more stable.
ja: 新しい CKEditor 4は、リッチ・テキスト内容(HTML Eメールのような)での作業をより簡単で安定させます。
ru: Новый CKEditor 4 делает работу с форматированным текстом (письма в HTML) проще и стабильнее.
sw: CKEditor 4 mpya inarahisisha na kuimarisha ufanyaji kazi na maudhui zenye nakala tajiri (kama barua pepe za HTML).

source: Administration improvements
ja: 管理の改善
ru: Улучшения в Администрировании
sw: Maboresho ya utawala

source: Event Based notifications can now be sent out only for specific Article Sender Types.
ja: イベント・ベースの通知は、特定の記事送信者タイプのためにのみ送信することができます。
ru: Уведомления о событиях теперь можно отправлять только для определенных типов отправителей сообщений/заметок.
sw: Taarifa zinazoendeshwa na matukio sasa zinaweza kutumwa kwa Aina za Mtumaji Nakala maalumu.

source: The Statistics engine in OTRS now understands 'Weeks' in addition to days, months and years. This grants the ability to, for instance, create a report for tickets 'created last week', or generate a report that shows tickets created per queue per week.
ja: OTRSの中の統計エンジンは、日次、月次、年次にに加えて「週次」を理解するようになりました。これにより、例えば、「先週作成されたチケットのための報告書を作成します。」あるいは1週当たりの1つのキュー当たり作成されたチケットを表示する報告書を生成する、といったことが可能になりました。
ru: Модуль отчетов OTRS теперь понимает термин "Неделя" в дополнение к дням, месяцам и годам. Это дает возможность создавать отчеты, например, по заявкам "созданным за последнюю неделю" или "заявки созданные в очередях за неделю".
sw: Injini ya takwimu ya OTRS sasa inaelewa 'wiki' kuacha siku, miezi na miaka. Hii inaipa uwezo wa, kwa mfano tengeneza ripoti za tiketi 'zilizotengenezwa wiki iliyopita', au tengeneza ripoti inayo onyesha tiketi zilizotengenezwa kwa foleni kwa wiki.

source: It is possible to place customized DTL (template) files in <code>Custom/Kernel/Output/HTML</code>, so that they override the system's default DTL files just as how this already works for Perl files.
ja: <code>Custom/Kernel/Output/HTML</code> にカスタマイズしたDTL(テンプレート)ファイルを置くことは可能です。そのため、それらはすでにPerlファイルでは稼働しているように、システムのデフォルトのDTLファイルを無効化(override)します。
ru: Теперь можно помещать кастомизированные DTL (шаблоны) файлы в <code>Custom/Kernel/Output/HTML</code>, и они будут перекрывать системные DTL файлы как это уже работает для Perl файлов.
sw: Inawezekana kuweka mafaili yaliyogeuzwa kukufaa ya DTL (kiolezo) katika <code>Custom/Kernel/Output/HTML</code>, ili kuchukua nafasi ya mafaili chaguo-msingi ya mfumo ya DTL kama inavyofanya kazi kwa mafaili ya Perl.

source: In AdminSMIME it is now possible to display human readable certificate contents.
ja: AdminSMIME では、人が読める証明書コンテンツを表示することができます。
ru: В AdminSMIME теперь можно отображать содержимое сертификата в человекочитаемом виде.
sw: Katika MsimamiziSMIME sasa inawezekana kuonyesha maudhui ya vyeti vinavyosomeka na binadamu.

source: SysConfig now supports config setting types Date and DateTime.
ja: SysConfig は、Types Date と DateTime を設定をサポートするようになりました。
ru: SysConfig теперь поддержиает настройку типов Date и DateTime.
sw: SysConfig sasa ina uwezo wa ku sanidi mipangilio ya aina za Tarehe na Tarehe Muda.

source: Better scalability
ja: 拡張性の向上
ru: Улучшена масштабируемость
sw: Ukuaji bora

source: Ticket Archiving Improved
ja: 改善されたチケットのアーカイブ
ru: Улучшенная функция Архивирование Заявок
sw: Uwekaji nyaraka za tiketi umeboreshwa

source: When tickets are archived, the information which agent read the ticket and articles can be removed, as well as the ticket subscriptions of agents. This is active by default and helps reduce the amount of data in the database on large systems with many tickets and agents.
ja: チケットがアーカイブに保管される際、担当者のチケット購読と同様に、担当者が読んだチケットや記事の情報は、削除されます。これはデフォルトで有効で、それにより、多数のチケットや担当者を伴う大規模システムのデータベースのデータ量を減らすことに役立ちます。
ru: При архивации заявок, информация, прочтанная агентом и сообщения могут быть удалены, также как и информация о подписке агентов на заявки. Эта опция включена по умолчанию и позволяет уменьшить количество информации в базе данных в больших системах с множеством заявок и агентов.
sw: Wakati tiketi zinawekwa kwenye nyaraka, taarifa za tiketi au makala ambazo zinasomwa na wakala zinaweza kutolewa, pia kujiunga kwa wakala kwenye tiketi kunafutwa. Hii ipo hai kwa kawaida na inasaidia kupunguza idadi ya data katika hifadhidata kwenye mifumo mikubwa yenye tiketi na wakala wengi.

source: There is also a new script to remove this data from existing archived tickets.
ja: さらに既存のアーカイブに保管されたチケットからこのデータを取り除く、新しいスクリプトがあります。
ru: Добавлен новый скрипт для удаления этих данных из существующих архивных заявок.
sw: Hii pia ni hati mpya ya kuondoa hii data kutoka kwenye nyaraka za tiketi zilizopo.

source: Archived tickets are now always shown as 'read' by the agent.
ja: アーカイブに保管されたチケットは、担当者には「read」として常に表示されます。
ru: Архивные заявки теперь всегда отображается как "прочтенные" агентом.
sw: Tiketi za kwenye nyaraka sasa zinaonekana kama 'soma' kwa wakala

source: Performance Improvements
ja: パフォーマンスの改善
ru: Улучшена производительность
sw: Maboresho ya utendaji

source: Session management is up to 10 times faster, especially with many active users.
ja: セッション管理は特に多くの活動的なユーザにおいて、10倍近くまで高速化されました。
ru: Управление сеансами стало в 10 раз быстрее, особенно это касается работы с активными пользователями.
sw: Usimamizi wa kipindi sasa ni mara 10 zaidi haraka, sana sana kukiwa na watumiaji hai wengi.

source: It is now possible to limit the number of concurrent agents and/or users to avoid server capacity overload.
ja: サーバー能力過負荷を回避するために担当者および(または)ユーザの数を制限することができるようになりました。
ru: Теперь можно задать лимит количества одновременно работающих агентов и/или клиентов во избежания перегрузки серверов.
sw: Sasa inawezekana kuweka ukomo wa idadi ya wakala au watumiaji ambao wanatumia kwa pamoja/sambamba ili kuzuia kuzidiwa kwa uwezo wa seva.

source: Significant reduction in the number of executed database statements in ticket overviews and ticket masks in agent and customer frontend.
ja: 担当者および顧客フロント・エンドの中のチケット概要およびチケット・マスク中の実行されたデータベース命令文数の著しい減少。
ru: Значительное снижение количества выполненных инструкций базы данных в обзорах заявок и шаблонов поиска заявок в и интерфейсах агента и клиента.
sw: Punguzo kubwa katika nambari ya kauli za hifadhidata zilizotekelezwa katika mapitio ya tiketi na barakoa za tiketi katika mazingira ya mbele ya mteja na wakala.

source: This will reduce the load on database servers, especially on large systems. In some cases OTRS will become visibly more responsive (if the system was slowed down by the DB load or latency).
ja: これは、特に大規模システム上で、データベース・サーバ上のロードを軽減するでしょう。ある場合には、OTRSが、明白に、もっと反応が良くなるでしょう(システムがDBロードか遅延によって遅くなった場合)。
ru: Это позволит снизить загрузку сервера баз данных, особенно в больших системах. В ряде случаев OTRS стал заметно более "отзывчивым" (если система тормозила из-за загрузки сервера БД или задержек).
sw: Hii itapunguza mzigo kwenye seva za hifadhidata, sana sana kwenye mifumo mikubwa. Katika baadhi ya kesi OTRS itakuwa inaonekana kuwa na majibu zaidi (kama mfumo ulipunguzwa kasi na mzigo wa DB au ukawivu).

source: Improved performance of LDAP user synchronization.
ja: LDAP ユーザ同期のパフォーマンスの改善。
ru: Улучшена производительность для LDAP синхронизации пользователей.
sw: Utendaji wa LDAP ulioboreshwa wa ulandanishi wa mtumiaji.

source: Improved cache performance with many cache files.
ja: 多くのキャッシュ・ファイルでキャッシュ・パフォーマンスの改善。
ru: Увеличена скорость кэширования для многих кэш-файлов.
sw: Utendaji ulioboreshwa wa hifadhi muda wenye ma faili mengi ya hifadhi muda.

source: More Interoperable
ja: 相互運用可能性の改善
ru: Улучшена совместимость
sw: Ina upatanifu zaidi
