Repository: DSigmund/doc-admin
Catalog: i18n/doc-admin.*.po
Languages: ja, ru, sw

source: Pressing the new value map "+" button will display a new row for a value map. Here it is also possible to define rules for each value to be mapped with the same options as for the key map (Exact value and Regular expression). You can add as many values to map as needed, and if you want to delete one of them, just click on the "-" button for each mapping value row.
ja: 新規値マップ「+」ボタンを押すと、値マップのための新規列を表示します。ここではキーマップに関して同じオプションでマップすべき各値(正確な値および正規表現)に関するルールを定義することも可能も可能です。必要なだけ多くのマップする値を追加できます。そしてもしそれらのひとつを削除したければ、単に各マッピング値の列の「-」ボタンをクリックします。
sw: Kubonyeza kitufe cha thamani mpya ya kuunganisha "+" itaonyesha safu mlalo mpya kwa ajili ya thamani ya kuunganisha. Hapa inawezekana pia kufafanua sheria kwa kila thamani ya kuunganishwa ikiwa na machaguo yale yale kama ya ramani ya ufunguo (Thamani halisi na Usemi wa kawaida). Unaweza kuongeza thamani nyingi kwenye muunganiko kama inavyohitajika, na kama unataka kufuta moja wapo, bonyeza tu kwenye kitufe "-" kwa kila safu mlalo ya muunganiko.

source: Deleting the complete key mapping section (box) is possible, just push on the "-" button located on the up right corner of each box that you want to delete.
ja: 完全なキーマッピングセクション（ボックス）を削除可能ならば、単に削除したいボックスの右上端にある「-」ボタンを押します。
ru: Удаление целого раздела ключей отображения возможно, просто нажмите на кнопку "-", расположеную в верхнем правом углу каждого окна, для которого вы хотите удалить.
sw: Kufuta kifungu (boksi) muunganiko kamili wa ufunguo inawezekana, bonyeza tu katika kitufe "-" kilicho kwenye upande wa juu kulia wa kila boksi unalotaka kufuta.

source: If you need to delete a complete mapping configuration: go back to the corresponding operation or invoker screen, look for the mapping direction that you select before and set its value to "-", and save the configuration to apply changes.
ja: 完全なマッピング構成を削除する必要がある場合: 対応するオペレーションか依頼アクション(Invokers)画面に戻って、以前に選択し、その値を「-」にセットするというマッピング指示を捜して、変更を適用するために構成を保存してください。
sw: Kama unahitaji kufuta kikamilifu usanidi wa muunganiko: rudi nyuma katika operesheni husika au skrini ya mchochezi, angalia mwelekeo wa muunganiko unaouchagua kabla na seti thamani yake kuwa "-", na hifadhi usanidi kufanya mabadiliko.

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="Adminarea web service mapping - screenshot" scale="40" fileref="screenshots/genericinterface-webservice-mapping.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="管理エリア ウェブサービス マッピング - スクリーンショット" scale="40" fileref="screenshots/genericinterface-webservice-mapping.png"></graphic>

source: <emphasis>Figure: Web service mapping.</emphasis>
ja: <emphasis>図:ウェブサービスマッピング</emphasis>
ru: <emphasis>Рисунок: Web service mapping.</emphasis>
sw: <emphasis>Kielelezo: Muunganiko wa huduma za wavuti.</emphasis>

source: Generic Interface Communication Flow
ja: ウェブサービス・コマンドライン・インタフェース
ru: Поток связи Generic Interface
sw: Mtiririko wa Mawasiliano ya Kiolesura cha Ujumla

source: The Generic Interface has a defined flow to perform actions as a provider and as a requester.
ja: 一般インターフェイスは、供給者としてそして同様に要求者としてアクションを実施するために定義済フローをも待っています。
sw: Kiolesura cha Ujumla kina mtiririko uliofafanuliwa kutekeleza vitendo kama mtoaji na muombaji.

source: These flows are described below:
ja: これらのフローは以下に記述されます。
ru: Эти потоки описаны ниже:
sw: Mtiririko huu unaelezewa hapa chini:

source: OTRS as Provider
ja: 供給者としてのOTRS
ru: OTRS как Поставщик
sw: OTRS kama mtoaji

source: Remote Request:
ja: リモートリクエスト：
ru: Удаленный Запрос:
sw: Maombi ya Mbali:

source: HTTP request
ja: HTTPリクエスト
ru: HTTP-запрос
sw: Maombi ya HTTP

source: OTRS receives HTTP request and passes it through the layers.
ja: OTRSは、HTTPリクエストを受け取りそれをレイヤーに渡します。
sw: OTRS inapokea maombi ya HTTP na kuzipitisha kwenye matabaka.

source: The provider module is in charge to execute and control these actions.
ja: 供給者モジュールはこれらのアクションを実行しコントロールすることを担当しています。
ru: Модуль провайдера отвечает за выполнение и управление этими действиями.
sw: Moduli ya mtoaji ndiyo ina mamlaka ya kutekeleza na kusimamia vitendo hivi.

source: Network Transport
ja: ネットワーク・トランスポート
ru: Транспортная Сеть
sw: Usafirishaji wa Mtandao

source: The network transport module decodes the data payload and separates the operation name from the rest of the data.
ja: ネットワーク・トランスポート・モジュールは、データ・ペイロードをデコードし、オペレーション名とデータのそれ以外の部分とを区別します。
ru: Сетевой транспортный модуль декодирует данные запроса и отделяет Имя операции от остальных данных.
sw: Moduli ya usafirishaji wa mtandao inasimbua fiche mzigo wa data na kutofautisha jina la operesheni kutoka kwenye data nyingine.

source: The operation name and the operation data are returned to the provider.
ja: オペレーション名およびオペレーションデータは供給者に返されます。
ru: Название операции и данные операции будут возвращены поставщику.
sw: Jina laoperesheni na data za operesheni zinarudishwa kwa mtumaji.

source: <remark>Data External</remark>
ja: <remark>データ外部</remark>
ru: <remark>Внешние данные</remark>
sw: <remark>Data za Nje</remark>

source: Data as sent from the remote system (This is not a module-based layer).
ja: リモートシステムから送信されたデータ（これはモジュールベースのレイヤーではありません）。
ru: Данные отправленные из удаленной системы (Это не слой базирующийся на модуле).
sw: Data kama zilivyotumwa kutoka kwenye mfumo wa mbali (hili siyo tabaka linalotegemea moduli).

source: Mapping
ja: マッピング
sw: Kuunganisha

source: The data is transformed from the External System format to the OTRS internal format as specified in the mapping configuration for this operation (Mapping for incoming request data).
ja: データは、このオペレーション(入信する依頼データ用マッピング)のためのマッピング構成で指定されるように、外部システム・フォーマットからOTRS内部形式へ変換されます。
ru: Данные преобразуются из формата Внешней Системы во внутренний формат данных OTRS так, как это указано в конфигурации отображения для этой операции (Mapping для входящих данных запроса).
sw: Data inabadilishwa kutoka muundo wa Mfumo wa Nje na kuwa muundo wa mfumo wa ndani wa OTRS kama ilivyobainishwa katika usanidi wa muunganiko wa operesheni hii (Muunganiko wa maombi ya data zinazoingia).

source: The already transformed data is returned to the provider.
ja: 既に変換されたデータは、供給者に返されます。
ru: Преобразованные данные возвращаются обратно поставщику.
sw: Data ambazo tayari zimebadilishwa zinarudishwa kwa mtoaji.

source: <remark>Data Internal</remark>
ja: <remark>データ内部</remark>
ru: <remark>Внутренние Данные</remark>
sw: <remark>Data za Ndani</remark>

source: Data as transformed and prepared to be passed to the operation (This is not a module based layer).
ja: 変換され、そしてオペレーション(これはモジュールベースのレイヤではありませんん)に渡される準備が整ったデータ。
sw: Data kama zilivyobadilishwa na kuandaliwa kupelekwa kwenye operesheni (Hili siyo tabaka la moduli).

source: Operation
ja: オペレーション
ru: Операция
sw: Operesheni

source: Receives and validates data.
ja: データを受取り、有効化します。
ru: Принимает и проверяет данные.
sw: Inapokea na kuthidbitisha data.

source: Performs user access control.
ja: ユーザ・アクセス・コントロールを行います。
ru: Осуществляет контроль доступа пользователей.
sw: Inafanya udhibiti ufikivu wa mtumiaji.

source: Executes the action.
ja: アクションを実行します。
ru: Выполняет действие.
sw: Inatekeleza vitendo.

source: OTRS Response:
ja: OTRSレスポンス:
ru: OTRS Ответ:
sw: Majibu ya OTRS:

source: Returns result data to the provider.
ja: 供給者に結果データを返します。
ru: Возвращает результирующие данные поставщику.
sw: Inarudisha matokeo ya data kwa mtoaji.

source: Data as returned from operation.
ja: オペレーションから返されるデータ。
ru: Данные возвращаемые из операции.
sw: Data kama zilivyorudishwa kutoka kwenye operesheni.

source: The data is transformed back to the Remote system format as specified in the mapping configuration (Mapping for outgoing response data).
ja: データは、マッピング構成(発信の応答データ用マッピング)で指定されるリモート・システム・フォーマットに変換されます。
sw: Data inabadilishwa kurudi kuwa ya Mfumo wa nje kama ilivyobainishwa katika usanidi wa muunganiko (Muunganiko wa majibu ya data zinazotoka).

source: <remark>Data external</remark>
ja: <remark>データ外部</remark>
ru: <remark>Внешние данные</remark>
sw: <remark>Data za nje</remark>

source: Data as transformed and prepared to be passed to Network Transport as response.
ja: 返答としてネットワーク・トランスポートに渡されるために変換され、準備されるようなデータ。
sw: Data kama ilivyobadilishwa na kuandaliwa kupitishwa kwenye Usafirishaji wa Mtandao kama majibu.

source: Receives the data already in the Remote System format.
ja: 既にリモート・システム・フォーマット済みのデータを受け取ります。
ru: Получает данные уже в формате Удаленной Системы.
sw: Inapokea data tayari katika umbizo la mfumo wa mbali.

source: Constructs a valid response for this network transport type.
ja: このネットワーク・トランスポートタイプのための有効なレスポンスを構成します。
ru: Создает правильный ответ для этого типа транспортной сети.
sw: Inatengeneza majibu halali kwa hii aina ya usafirishaji wa mtandao.

source: HTTP response
ja: HTTPレスポンス
ru: HTTP ответ
sw: Majibu ya HTTP

source: The response is sent back to the web service client.
ja: 応答はウェブサービス・クライアントに返送されます。
ru: Ответ отправляется обратно клиенту веб-сервиса.
sw: Majibu yanatumwa kwa mteja wa huduma ya tovuti.

source: In the case of an error, an error response is sent to the remote system (e.g. SOAP fault, HTTP error, etc).
ja: エラーの場合には、エラー・レスポンスが、遠隔のシステム(例えばSOAPエラー、HTTPエラーなど)に送られます。
ru: В случае ошибки, сообщение об ошибке отправляется удаденной системе (например SOAP-ошибка, HTTP-ошибка и т.д.).
sw: Kama kukiwa na kosa, kosa linatumwa kwa mfumo wa mbali (mf. kosa la SOAP, kosa la HTTP, na kadhalika).

source: OTRS as Requester
ja: 依頼者としてのOTRS
ru: OTRS как запрашиваемая сторона
sw: OTRS kama Muombaji

source: OTRS Request:
ja: OTRS依頼:
ru: OTRS Запрос:
sw: Maombi ya OTRS:

source: Event Trigger Handler
ja: イベント・トリガー・ハンドラ
ru: Обработчки Event Trigger
sw: Kishiko Tukio Kichochezi

source: Based on the web service configuration determines if the request will be synchronous or asynchronous.
ja: ウェブサービス構成に基づいて、依頼が同期か非同期かを決定します。
ru: В зависимости от настройки веб-сервис определяет будет ли запрос синхронным или асинхронным.
sw: Kwa kutegemea usanidi wa huduma za mtandao itaamua kama maombi yatakuwa landanifu au solandanifu.

source: Synchronous
ja: 同期
ru: Синхронный
sw: Landanifu

source: A direct call to the Requester is made in order to create a new request and to pass it through the layers.
ja: 依頼者への直通電話は、新規依頼を作成し、それをレイヤーを通して渡すためにされます。
sw: Simu ya moja kwa moja inapigwa kwa Muombaji ili kutengeneza ombi jipya na kulipitisha kwenye matabaka.

source: Asynchronous
ja: 非同期
ru: Асинхронный
sw: Solandanifu

source: Create a new Generic Interface (Requester) task for the OTRS Scheduler (by delegating the request execution to the Scheduler, the user experience could be highly improved, otherwise all the time needed to prepare the request and the remote execution will be added to the OTRS Events that trigger those requests).
ja: OTRSスケジューラのための新規一般インターフェース(依頼者)タスクを作成します。（スケジューラーに依頼の実行を委任することによって、ユーザー体験は非常に改善されるかもしれません。そうでなければ、常に依頼を準備する必要になってしまいます。またリモート実行はそれらの依頼のきっかけとなるOTRSエベントに追加されます。）
sw: Tengeneza kazi mpya ya Kiolesura cha Ujumla (Muombaji) kwa ajili ya Mratibu wa OTRS (kwa kugawia kazi ya utekelezaji kwa Mratibu, uzoefu wa mtumiaji unaweza kuboreshwa mara dufu, la sivyo muda wote unaohitajika kuandaa maombi na utekelezaji wa mbali utaongezwa kwenye Matukio ya OTRS ambayo yanasababisha maombi hayo).

source: In its next cycle the Scheduler process reads the new task and creates a call to the Requester that will create a new request and then passes it through the layers.
ja: その次のサイクルでは、スケジューラ・プロセスは新規タスクを読んで、新規依頼を作成し、それをレイヤーへ渡す依頼者への呼び出しを作成します。
sw: Katika mzunguko unaofuata mchakato wa Mratibu unasoma kazi mpya na kupiga simu kwa Muombaji ambaye atatengeneza ombi jipya na kulipitisha kwenye matabaka.

source: Invoker
ja: 依頼アクション(Invokers)
ru: Запрашивающая сторона
sw: Mchochezi

source: Receives data from the event.
ja: イベントからデータを受け取ります。
ru: Получает данные от событий.
sw: Inapokea data kutoka kwenye kitendo.

source: Validates received data (if needed).
ja: 受信データ(もし必要ならば)を有効にします。
ru: Проверяет полученные данные (при необходимости).
sw: Inathibitisha data zilizopokelewa (kama itahitajika).

source: Call core modules to complement the data (if needed).
ja: データを補足する(もし必要ならば)呼び出しコア・モジュール。
ru: Вызвать модули ядра для дополнения данных (при необходимости).
sw: Inaita moduli ili kusaidia data (kama itahutajika).

source: Return the request data structure or send a Stop Communication signal to the requester, to gracefully cancel the request.
ja: 依頼データ構造を返すか、あるいは卒なく依頼を取り消すために依頼者にStop Communication信号を送ってください。
ru: Возвращает структуру данных запроса или отправляет сигнал "Остановка связи" для Запрашивающей Стороны (requester), чтобы корректно отменить запрос.
sw: Rudisha maombi ya muundo wa data au tuma ishara ya kusitisha mawasiliano kwa muombaji, kusitisha mawasiliano kwa nia njema.

source: Data as passed from the invoker (This is not a module based layer).
ja: 依頼アクション(Invokers)(これはモジュールベースのレイヤではありません)から渡されるようなデータ。
ru: Данные передаются от запрашивающей стороны (Это не слой, основанный на модуле).
sw: Data kama ilivyopitishwa kwa mchochezi (Hii siyo tabaka linalotegemea moduli).

source: The data is transformed to the Remote system format as specified in the mapping configuration (Mapping for outgoing response data).
ja: データは、マッピング構成(発信の応答データ用マッピング)で指定されるリモート・システム・フォーマットに変換されます。
sw: Data zinabadilishwa kuwa muundo wa Mfumo wa nje kama ilivyobainishwa katika usanidi wa muunganiko. (Muunganiko wa majibu ya data zinazotoka) .

source: The already transformed data is returned to the requester.
ja: 既に変換されたデータは、依頼者に返されます。
ru: Уже преобразованные данные возвращаются Запрашивающей Стороне.
sw: Data ambayo imekwisha badilishwa inarudishwa kwa muombaji.

source: Data as transformed and prepared for sending to the remote system.
ja: 変換され、遠隔のシステムに送るために準備できたデータ。
ru: Данные преобразованы и подготовлены для отправки удаленной системе.
sw: Data kama ilivyobadilishwa na kuandaliwa kwa kutuma kwa mfumo wa mbali.

source: Receives the remote operation name and the data already transformed to the Remote System format from the requester.
ja: 依頼者からリモート・システム表示形式に既に変換されたリモート・オペレーション・フォーマットおよびデータを受け取ります。
sw: Inapokea jina la operesheni ya mbali na data ambazo tayari zimekwisha badilishwa umbizo kuwa lile la mfumo wa mbali kutoka kwa muombaji.

source: Constructs a valid request for the network transport.
ja: ネットワーク・トランスポートの有効な依頼を構成します。
ru: Создает действительный запрос для транспортной сети.
sw: Inatengeneneza maombi halali ya usafirishaji wa mtandao.

source: Sends the request to the remote system and waits for the response
ja: 遠隔のシステムにリクエストを送り、応答を待ちます。
ru: Отправляет запрос удаленной системе и ожидает ответ от нее
sw: Inatuma maombi kwa mfumo wa mbali na kusubiri majibu.

source: Remote Response:
ja: リモート応答:
ru: Удаленный Ответ
sw: Majibu ya Mbali:

source: Network transport
ja: ネットワーク・トランスポート
ru: Транспортная сеть
sw: Usafirishaji wa mtandao

source: Receives the response and decodes the data payload.
ja: レスポンスを受け取り、データ・ペイロードをでコードします。
ru: Получает ответ и декодирует данные запроса.
sw: Inapokea majibu na kusimbua fiche mzigo wa data.

source: Returns the data to the requester.
ja: 依頼者にデータを返します。
ru: Возвращает данные запрашивающей стороне.
sw: Inarudisha data kwa muombaji.

source: Data as received from the Remote System
ja: リモート・システムから受け取るデータ。
ru: Данные полученные от Удаленной Системы
sw: Data kama zilivyopokelewa kutoka kwenye Mfumo wa Mbali

source: The data is transformed from the External System format to the OTRS internal format as specified in the mapping configuration for this operation (Mapping for incoming response data).
ja: データは、このオペレーション(入信応答データ用マッピング)のためのマッピング構成の中で指定される外部システム・フォーマットからOTRS内部形式へと変換されます。
ru: Данные преобразуются из формата внешней системы во внутренний формат данных OTRS так, как это указано в конфигурации отображения для этой операции (Mapping для входящих данных отклика).
sw: Data inabadilishwa kutoka kwenye muunda wa Mfumo wa Nje kuwa muundo wa ndani wa OTRS kama ilivyobainishwa kwenye usanidi wa muunganiko wa operesheni hii (Muunganiko wa majibu ya data zinazotoka).

source: Data as transformed and ready to be passed back to the requester.
ja: 既に変形済データは、依頼者に返されます。
sw: Data kama ilivyobadilishwa na tayari kupitishwa kurudi kwa muombaji.

source: Receives return data.
ja: 返信データを受け取る
ru: Получает возвращаемые данные.
sw: Inapokea data zilizorudishwa

source: Handles the data as needed specifically by each Invoker (included error handling if any).
ja: 特に各依頼アクション(Invokers)(もしあればエラーハンドリングを含む)に必要とされていたデータを処理します。
sw: Inashughulikia data inayohitajika na mchochezi maalumu (inajumuisha ushughulikiaji wa makosa kama yapo).

source: Return the Invoker result and data to the Requester.
ja: 依頼者に依頼アクション(Invokers)結果およびデータを返します。
sw: Rudisha matokeo ya Mchochezi na data kwa Muombaji.

source: Event Handler or Scheduler
ja: イベント・ハンドラあるいはスケジューラ
ru: Обработчик или Планировщик Действий
sw: Mratibu au Anayeshughulika na Matukio

source: Receives the data from the Requester, in the case of the Scheduler this data might contain information to Re-Schedule the task immediately or in the future.
ja: 依頼者からのデータを受け取ります。スケジューラの場合、このデータは、タスクを直ぐにまたは将来に再スケジュールするような情報を含んでいるかもしれません。
sw: Inapokea data kutoka kwa Muombaji, kwa kesi ya Mratibu hii data inaweza kuwa na taarifa za kurekebisha ratiba hapo hapo au baadaye.

source: Generic Interface Layers
ja: 一般インターフェース・レイヤー
ru: Слои интерфейса Generic Interface
sw: Matabaka ya Kiolesura cha Ujumla

source: Generic Interface is build based on a layer model, to be flexible and easy to customize.
ja: 一般インターフェースは柔軟で、かつカスタマイズするのが簡単になるようにレイヤー・モデルに基づいた構造である。
sw: Kiolesura cha Ujumla kimetengenezwa katika moduli ya tabaka, kuwa rahisi kubadilika na kugeuza kukufaa.

source: A layer is a set of files, which control how the Generic Interface performs different parts of a web service. Using the right configuration, one can build different web services for different External Systems without creating new modules.
ja: レイヤーは1セットのファイルである。それは、一般インターフェースがウェブサービスの異なる部分をどのように行なうかコントロールします。正しい構成を使用すると、一つは新規モジュールを作成せずに、異なる外部システムのために異なるウェブサービスを構成することができます。
sw: Tabaka ni seti ya mafaili, ambayo inadhibiti jinsi Kiolesura cha Ujumla kinavyotekeleza sehemu tofauti za huduma ya tovuti. Kwa kutumia usanidi sahihi, mtu anaweza kujenga huduma tofauti za tovuti kwa Mifumo tofauti ya Nje bila kutengeneza moduli mpya.

source: If the Remote System does not support the current bundled modules of the Generic Interface, special modules need to be developed for that specific web service.
ja: 遠隔のシステムが一般インターフェースの現在の束ねられたモジュールを支援しない場合、その特定のウェブサービスのために特別のモジュールを開発している必要がある。
sw: Kama Mfumo wa Nje hauna usaidizi kwa furushi la moduli za sasa za Kiolesura cha Ujumla, moduli maalumu zinahitaji kutengenezwa kwa ajili ya hiyo huduma maalumu ya tovuti.

source: The list of provided Generic Interface modules shipped with OTRS will be updated and increased over time.
ja: OTRS出荷時に提供される一般インタフェース・モジュールのリストは今後更新され増加していくでしょう。
ru: Перечень модулей предоставляемых Generic Interface поставляется вместе с OTRS и будет обновлен или увеличен с течением времени.
sw: Orodha ya moduli zilizotolewa za Kiolesura cha Ujumla zilizosafirishwa na OTRS zita sasishwa na kuongezwa.

source: The Generic Interface Layers
ja: グラフィカル・インターフェース・レイヤー
ru: Слои Интерфейса Generic Interface
sw: Matabaka ya Kiolesura cha Ujumla

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="genericinterface layers - screenshot" scale="50" fileref="screenshots/genericinterface-layers.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="一般インターフェイス レイヤー - スクリーンショット" scale="50" fileref="screenshots/genericinterface-layers.png"></graphic>

source: <emphasis>Figure: The graphical interface layers.</emphasis>
ja: <emphasis>図:グラフィカル・インターフェース・レイヤー</emphasis>
ru: <emphasis>Рисунок: Слои графического интерфейса</emphasis>
sw: <emphasis>Kielelezo: Matabaka ya kiolesura michoro.</emphasis>

source: This layer is responsible for the correct communication with the Remote System. It receives requests and generates responses when acting as provider, and generates requests and receives responses when acting as requester.
ja: このレイヤーは遠隔のシステムとの正確なコミュニケーションに責任を持ちます。依頼を受け取り、供給者として働く場合、レスポンスを生成し、依頼者として働く場合、依頼および受信応答を生成します。
sw: Hili tabaka lina jukumu la mawasiliano sahihi na Mfumo wa Mbali. Inapokea maombi na kutengeneza majibu ikiwa kama mtoaji, na kutengeneza maombi na kupokea majibu ikiwa kama muombaji.

source: Provider communication is handled by a new web server handle called "nph-genericinterface.pl".
ja: 供給者コミュニケーションは「nphgenericinterface.pl」と呼ばれる新規ウェブサーバによって取り扱われます。
sw: Mawasiliano ya mtoaji yanashughulikiwa na kishiko kipya cha seva ya wavuti kiitwacho "nph-genericinterface.pl".

source: Requester communication could be initiated during an event triggered by a Generic Interface module or any other OTRS module. This event is catched by the event handler and depending on the configuration the event will be processed directly by the requester object or delegated to the Scheduler (a separated deamon designed to process tasks asynchronously).
ja: 依頼者コミュニケーションは、一般インタフェース・モジュールあるいは他のOTRSモジュールが引き金となって起きたイベント中に、コミュニケーションを開始することができるかもしれません。このイベントははイベント・ハンドラーによって捕捉されます。構成上、イベントは依頼者オブジェクトまたはスケジューラ専用によって直接処理されます（別々のデーモンが非同期的にタスクを処理しようとします）。

source: Data Mapping
ja: データマッピング
ru: Отображение Данных
sw: Kuunganisha data

source: This layer is responsible for translating data structures between OTRS and the Remote System (data internal and data external layers). Usually Remote Systems have different data structures than OTRS (including different values and names for those values), and here resides the importance of the layer to change the received information into something that OTRS can understand and on the opposite way send the information to each Remote System using their data dictionaries.
ja: このレイヤーは、データ構造とOTRSそしてリモートシステムの間の翻訳について責任を持ちます(データ内部およびデータ外部層)。通常遠隔のシステムはOTRS(異なる値およびそれらの値の名前を含む)とは異なっているデータ構造を持っています。そしてここに受信情報を「OTRSが理解する何かへと変更するレイヤーの重要性が存在します。また、逆にデータ辞書を使うリモートシステムへの送信情報についてもです。
sw: Tabaka hili lina jukumu la kutafsiri muundo wa data kati ya OTRS na Mfumo wa Mbali (tabaka la data za ndani na data za nje). Kwa kawaida Mifumo ya Mbali ina muundo tofauti wa data kufananisha na OTRS (ikijumuisha thamani tofauti na majina tofauti ya hizo thamani), na hapa umuhimu wa hili tabaka unaonekana kubadilisha taarifa inayopokelewa kuwa kitu ambacho OTRS inaweza kuelewa na kwa upande mwingine kutuma taarifa kwa kila Mfumo wa Mbali kwa kutumia kamusi zao za data.

source: <remark>Example: </remark> "Priority" (OTRS) might be called "Prio" in a remote system and it could be that value "1 Low" (OTRS) should be mapped to "Information" on the remote system.
ja: <remark>例:</remark>「優先度」(OTRS)は遠隔のシステムでの「Prio」と呼ばれるかもしれません。また、それは、値「1 低」(OTRS)が遠隔のシステムについての「情報」にマッピングされるべきです。
sw: <remark>Example: </remark> "Kipaumbele" (OTRS) kinaweza kuitwa "Prio" katika mfumo wa mbali na inaweza kuwa thamani "1 Chini" (OTRS) inatakiwa kuunganishwa na "Taarifa" kwenye mfumo wa mbali.

source: Controller
ja: コントローラー
ru: Контроллер
sw: Mdhibiti
