Repository: DSigmund/doc-admin
Catalog: i18n/doc-admin.*.po
Languages: ja, ru, sw

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="Adminarea web service provider network transport - screenshot" scale="40" fileref="screenshots/genericinterface-webservice-provider-transport.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="管理エリア ウェブサービス プロバイダ・トランスポート・ネットワーク - スクリーンショット" scale="40" fileref="screenshots/genericinterface-webservice-provider-transport.png"></graphic>

source: <emphasis>Figure: Web service provider network transport.</emphasis>
ja: <emphasis>図:ウェブサービス供給者ネットワーク・トランスポート</emphasis>

source: Web Service Operation
ja: ウェブサービス・オペレーション
ru: Операции веб-сервиса
sw: Operesheni ya Huduma ya Tovuti

source: The actions that can be performed when you are using OTRS as a provider are called "Operations". Each operation belongs to a controller. Controllers are collections of operations or invokers, normally operations from the same controller need similar settings and share the same configuration dialog. But each operation can have independent configuration dialogues if needed.
ja: あなたが供給者としてOTRSを使用している場合、行なうことができるアクションは「オペレーション」と呼ばれます。各オペレーションはコントローラーに所属しています。コントローラーは、オペレーションまたは依頼アクション(Invokers)の蓄積です。通常、同じコントローラーからのオペレーションは、同様の設定を必要で、同じ構成ダイアログを共有します。しかし各オペレーションは必要なら独立した構成ダイアログを持ちます。

source: Name, Description, Backend, and Mappings are fields that normally appear on every operation, other special fields can appear in non default configuration dialogues to fulfill specific needs of the operation.
ja: 名前、記述、バックエンドおよびマッピングは、通常すべてのオペレーションに現われるフィールドです。オペレーションの特定の要求を満たすために、他の特別のフィールドがデフォルトではない構成ダイアログに現われる場合があります。

source: Normally there are two mapping configuration sections on each operation, one for the incoming data and another one for the outgoing data. You can choose different mapping types (backends) for each mapping direction, since their configuration is independent from each other and also independent from the operation backend. The normal and most common practice is that the operation uses the same mapping type in both cases (with inverted configuration). The complete mapping configuration is done in a separate screen which depends on the mapping type.
ja: 通常は、各オペレーションに2つのマッピングする構成セクションがあります。一つは入信データ、もう一つは発信データです。各マッピング指示のために異なるマッピングするタイプ(バックエンド)を選ぶことができます。なぜなら、それらの構成が互いから独立して、さらにオペレーション・バックエンドから独立しているからです。正常で、最も一般的な実行は、両方のケースに（逆の構成を持つ）同じマッピングタイプを使うオペレーションです。完全なマッピング構成は、マッピングタイプに依存して個別の画面の中で行われます。
sw: Kawaida kuna sehemu mbili za usanidi wa miunganiko katika kila operesheni, moja kwa data zinazoingia nyingine kwa data zinazotoka. Unaweza kuchagua aina nyingi za miunganiko (mazingira ya nyuma) kwa kila mwelekeo wa muunganiko, kwa kuwa usanidi wake ni huru kutoka kwa mwingine na pia kutoka kwa mazingira ya nyuma ya operesheni. Zoezi la kwaida na linalofaamika ni operesheni kutumia aina sawa ya miunganiko katika kesi zote mbili (na usanidi uliogeuzwa). Usanidi kamili wa muunganiko unafanyika katika skrini tofauti ambayo inategemea na aina ya muunganiko.

source: The operation backend is pre-populated and is not editable. You will see this parameter when you choose the operation on the web service edit screen. The field is only informative.
ja: オペレーション・バックエンドは事前に投入されており編集可能ではありません。ウェブサービス編集画面に対するオペレーションを選択する時、このパラメタを見るでしょう。フィールドは参考に過ぎません。
sw: Mazingira ya nyuma ya operesheni yamejazwa tayari na haiwezekani kuhariri. Utaona parameta hii ukichagua operesheni katika skrini ya kuhariri huduma ya wavuti. Sehemu hiyo inatoa taarifa.

source: In the left part of the screen on the action column you have the options: "Go back to web service" (discarding all changes since the last save) and "Delete". If you click on the last one, a dialog will open and ask you if you like to remove the operation. Click on "Delete" button to confirm the removal of the operation and it configuration or "Cancel" to close the delete dialog.
ja: アクション・カラム上の画面の左部でに、オプションがあります:「ウェブサービスに戻る」(最後の保存以来変更をすべて廃棄して)と「デリート」。最後のものをクリックしたら、ダイアログが開き、オペレーションを削除したいかどうか尋ねます。オペレーションとその構成の削除を確認するために「削除」ボタンをクリックします。あるいは、削除ダイアログを閉じるために「キャンセル」をクリックします。

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="Adminarea web service operation - screenshot" scale="40" fileref="screenshots/genericinterface-webservice-operation.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="管理エリア ウェブサービス オペレーション - スクリーンショット" scale="40" fileref="screenshots/genericinterface-webservice-operation.png"></graphic>

source: <emphasis>Figure: Web service operation.</emphasis>
ja: <emphasis>図:ウェブサービス・オペレーション</emphasis>
ru: <emphasis>Рисунок: Операции веб-сервиса</emphasis>
sw: <emphasis>Kielelezo: Operesheni ya huduma ya tovuti.</emphasis>

source: Web Service Requester Network Transport
ja: ウェブサービス依頼者ネットワーク・トランスポート
sw: Usafirishaji Mtandao wa Muombaji wa Huduma ya Tovuti

source: The network transport configuration for the requester is similar to the configuration for the provider. For the Requester "HTTP::SOAP" network transport there are more fields to be set.
ja: 依頼者用ネットワークトランスポート構成は供給者用の構成に似ています。依頼者の「HTTP::SOAP」ネットワーク・トランスポートのために、セットすることができるフィールドがさらにもっとあります。
sw: Usanidi wa usafirishaji mtandao wa muombaji ni sawa na usanidi wa mtoaji. Kwa Muombaji usafirishaji mtandao wa "HTTP::SOAP" kuna sehemu nyingi zaidi kusetiwa.

source: Apart from the "Endpoint" (URI of the Remote System web service interface to accept requests) and "Namespace" which are required fields, you can also specify:
ja: 必須フィールドの「エンドポイント」および「ネームスペース」とは別に、(エンドポイントとは、リクエストを受け入れるリモート・システム・ウェブサービス・インターフェースのURIのこと)さらに次のように明示することができます:
sw: Kuachana na "Pointiyamwisho" (URI ya kiolesura cha huduma ya tovuti ya Mfumo wa Mbali kukubali maombi) na "Jinanafasi" ambazo ndiyo sehemu zinazotakiwa, unaweza pia kubainisha:

source: Encoding (such as utf-8, latin1, iso-8859-1, cp1250, etc) for the SOAP message.
ja: SOAPメッセージのための符号化(utf-8, latin1, iso-8859-1, cp1250など)
ru: Кодировка (такая как utf-8, latin1, iso-8859-1, cp1250, и т.д.) для SOAP-сообщений.
sw: Usimbaji (kama utf-8, latin1, iso-8859-1, cp1250, na kdhalika) kwa ajili ya ujumbe wa SOAP.

source: SOAPAction Header: you can use this to send an empty or filled SOAPAction header. Set to "No" and the SOAPAction header on the SOAP message will be an empty string, or set to "Yes" to send the soap action in Namespace#Action format and define the separator (typically "/" for .Net web services and "#" for the rest).
ja: SOAPアクション・ヘッダー:空か埋められたSOAPActionヘッダーを送信するためにこれを使用することができます。「いいえ」をセットすると、SOAPメッセージ上のSOAPアクション・ヘッダは空の文字になります。あるいは Namespace#Action フォーマットでSOAPアクションに「はい」をセットし、セパレータを定義します。(典型的なセパレータは .Netウェブサービスには「/」その他には「#」です。)

source: Authentication: to set the authentication mechanism, set to "-" to not use any authentication or select one from the list and the detail fields will appear.
ja: 認証: 認証機構をセットするためには、いかなる認証も使わないか、またはリストからひとつを選択するために、「-」をセットします。そうすればフィールド詳細が現れるでしょう。
ru: Аутентификация: установить механизм аутентификации, установлено в "-" чтобы не использовать любую проверку подлинности или выбрать ее из списка, после чего появится поле с подробной информацией.
sw: Uthibitisho: kuseti utaratibu wa uthibitisho, seti kuwa "-" ili kutokutumia uthibitisho wowote au chagua moja kutoka kwenye orodha na sehemu za undani zitatokea.

source: Currently only the "BasicAuth" (HTTP) authentication mechanism is implemented. You can decide whether or not to use it depending on the Remote System configuration. If used, you must provide the User Name and the Password to access the remote system.
ja: 現在、「BasicAuth」(HTTP)認証機構だけが実行(impletented)されます。リモート・システム構成に依存して、それを使用するべきかどうか決定することができます。もし使用されれば、リモートシステムにアクセスするためにユーザー・ネームとパスワードを提供しなければなりません。

source: If you supply a password for authentication and after you export the web service to a YAML file this password will be revealed and will be written into a plain text string inside the YAML file. Be aware of it and take precautions if needed.
ja: 認証用パスワードを供給しそのあとでYAMLファイルをウェブサービスへエクスポートするならば、このパスワードは暴露され、TYAMLファイルの内部のプレインテキスト文字列に書き込まれるでしょう。必要に応じて予防措置を講じてください。
ru: Если вы используете пароль для аутентификации, то при экспорте настроек веб-сервиса в YAML-файл этот пароль будет раскрыт и записан в виде простой текстовой строки внутри файла YAML. Знайте об этом и примите меры предосторожности в случае необходимости.
sw: Ukitoa nywila kwa ajili ya uthibitisho na baada ya kutuma huduma ya mtandao kwenda kwenye faili la YAML hii nywila itaonyeshwa na kuandikwa kwenye tungo ya nakala wazi ndani ya faili la YAML. Kuwa makini nayo na chukua tahadhari kama ikihitajika.

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="Adminarea web service requester network transport - screenshot" scale="40" fileref="screenshots/genericinterface-webservice-requester-transport.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="管理エリア ウェブサービス リクエスター ネットワーク・トランスポート - スクリーンショット" scale="40" fileref="screenshots/genericinterface-webservice-requester-transport.png"></graphic>

source: <emphasis>Figure: Web service requester network transport.</emphasis>
ja: <emphasis>図: ウェブサービス依頼者ネットワーク・トランスポート</emphasis>

source: Web Service Invoker
ja: ウェブサービス依頼アクション(Invokers)
ru: Вызов веб-сервиса:
sw: Mchochezi wa Huduma ya Wavuti

source: The actions that can be performed when you are using OTRS as a requester are called "Invokers". Each invoker belongs to a controller (controllers are collections of operations or invokers). Usually invokers from the same controller need similar settings and share the same configuration dialogues. Each invoker can have independent configuration dialogues if needed.
ja: あなたが依頼者としてOTRSを使用している場合、行なうことができるアクションは「依頼アクション(Invokers)」と呼ばれます。依頼アクション(Invokers)はそれぞれコントローラーに所属しています。(コントローラーはオペレーションまたは依頼アクション(Invokers)の蓄積である)通常、同じコントローラーからの依頼アクション(Invokers)は、同様のセッティングを必要とし、同じ構成ダイアログを共有します。必要ならば、依頼アクション(Invokers)はそれぞれ独立した構成ダイアログを持つことができます。

source: Name, Description, Backend, and Mappings are fields that normally appear on every invoker. Additionally the list of event triggers and other special fields can appear on non default configuration dialogues to fulfill special needs of the invoker.
ja: 名前、記述、バックエンドおよびマッピングはすべての依頼アクション(Invokers)に通常現われるフィールドである。さらにイベントのきっかけと他の特別なフィールドのリストは、依頼アクション(Invokers)の特別な要求を満たすために、デフォルトでない構成ダイアログを現わすことができます。

source: Normally there are two mapping configuration sections for each invoker, one for the incoming data and another one for the outgoing data. You can choose different mapping types (backends) for each mapping direction, since their configuration is independent from each other and also independent from the invoker backend. The normal and most common practice is that the invoker uses the same mapping type in both cases, with inverted configuration. The complete mapping configuration is done in a separate screen, which depends on the mapping type.
ja: 通常は、各依頼アクション(Invokers)につき2つのマッピング構成セクションがあります。ひとつは入信データでもう一方は発信データです。それらの構成が相互に独立して、さらに依頼アクション(Invokers)バックエンドから独立しているので、各マッピング指示のために異なるマッピングするタイプ(バックエンド)を選ぶことができます。正常で、最も一般的な実行は、依頼アクション(Invokers)が逆の構成で、両方の場合の中で同じマッピングタイプを使用するということです。完全なマッピング構成は個別の画面の中で行われます。それはマッピングタイプに依存します。
sw: Kwa kawaida kuna sehemu mbili za usanidi wa muunganiko kwa kila mchochezi, moja kwa data zinazoingia na nyingine kwa data zinazotoka. Unaweza kuchagua aina tofauti za miunganiko (mazingira ya nyuma) kwa kila mwelekeo, kwa kuwa usanidi wake ni huru kutoka kwa nyenzake na huru kutoka mazingira ya nyuma ya mchochezi. Zoezi la kawaida na linalofahamika ni mchochezi kutumia aina moja ya muunganiko kwa kesi zote mbili, na usanidi uliogeuzwa. Usanidi kamili wa miunganiko unafanywa kwenye skrini tofauti, ambayo inategemea aina ya muunganiko.

source: The invoker backend is pre-populated and can not be edited. You will see this parameter when you choose the invoker on the web service edit screen. The field is only informative.
ja: 依頼アクション(Invokers)バックエンドは事前に投入されており編集可能ではありません。ウェブサービス編集画面に対する依頼アクション(Invokers)を選択する時、このパラメタを見るでしょう。フィールドは参考に過ぎません。
sw: Mazingira ya nyuma ya mchochezi yamejazwa tayari na haiwezekani kuhariri. Utaona parameta hii ukichagua mchochezi katika skrini ya kuhariri huduma ya wavuti. Sehemu hiyo inatoa taarifa.

source: Event triggers are events within OTRS such as "TicketCreate", "ArticleSend", etc. These can act as triggers to execute the invoker. Each invoker needs to have at least one event trigger registered, or the invoker will be useless, because it will never be called. The asynchronous property of the event triggers define if the OTRS process will handle the invoker or if it will be delegated to the Scheduler.
ja: イベント・トリガーは、「TicketCreate」のようなOTRS、「ArticleSend」などの内のイベントです。これらは依頼アクション(Invokers)を実行するためにトリガーとして働くことができます。依頼アクション(Invokers)はそれぞれ少なくとも1つのイベント・トリガーを登録する必要があり、そうでなければ依頼アクション(Invokers)は役立たないでしょう。なぜならそれが呼び出されることがないからです。イベント・トリガーの非同期特性は、OTRSプロセスが依頼アクション(Invokers)を扱うか、あるいはそれがスケジューラに委任されるかどうかを定義します。

source: The OTRS Scheduler is a separate process that executes tasks in the background. Using this the OTRS process itself will not be affected if the Remote System takes a long time to respond, if it is not available or if there are network problems. If you don't use the scheduler using web services can make OTRS slow or non-responsive. Therefore it is highly recommend to use asynchronous event triggers as often as possible.
ja: OTRSスケジューラは背景のタスクを実行する個別のプロセスである。OTRSプロセスの使用自体はリモートシステムの反応に時間がかかる（利用不能かネットワーク問題がある場合）かどうかには影響されません。ウェブサービスを使用するスケジューラを使用しなければ、OTRSは遅くなりあるいは反応しなくなります。したがって、非同期イベント・トリガーをできるだけしばしば使用することを強く推薦します。

source: To add an Event trigger, first select the event family from the first list, then the event name from the second list, then set the asynchronous property (if unchecked means that the event trigger will not be asynchronous) and finally click on the plus button. A new event trigger will be created and it will be listed on the invoker "Event Triggers" list.
ja: イベント・トリガーを追加するためには、最初に最初のリストからイベント・ファミリーをつぎに第二のリストからイベント名を選択し、それから非同期プロパティをセットします。（イベントのきっかけが非同期ではないという意味で未検証ならば）プラスのボタンを最後にクリックします。新規イベント・トリガーが作成され、それは依頼アクション(Invokers)「イベント・トリガー」リスト上でリストされます。
sw: Kuongeza kichochezi cha tukio, kwanza chagua familia ya tukio kutoka kwenye orodha ya kwanza, kisha jina la tukio katika orodha ya pili, kisha seti sifa solandanifu (kama haijatikiwa ina maanisha kichochezi cha tukio kitakuwa sio solandanifu) na mwisho bofya kitufe cha kujumlisha. Kichochezi kipya cha matukio kitakuwa kimetengenezwa na kiawekwa kwenye orodha ya wachochezi "Vichochezi vya Matukio".

source: To delete an Event trigger, simply locate the event trigger to be deleted in the "Event Triggers" list and click on the trash icon at the end of the row. This will open a dialog that asks you if you are sure to delete the event trigger. Click "Delete" to remove the event trigger from the list, or "Cancel" to close the dialog.
ja: イベント・トリガーを削除するためには、単に「イベント・トリガー」リスト内で削除したいイベント・トリガーを選択します。そして列末にあるゴミ箱アイコンをクリックします。これによりダイアログが開き、あなたが本当にイベント・トリガーを削除するかを確認します。リストからイベント・トリガーを削除するために「削除」をクリックするか、あるいはダイアログを閉じるために「キャンセル」をクリックして下さい。

source: In the left part of the screen on the action column you have the options: "Go back to web service" (discarding all changes since the last save) and "Delete". If you click on the last one, a dialog will emerge and ask you if you like to remove the invoker. Click on the "Delete" button to confirm the removal of the invoker and its configuration or "Cancel" to close the delete dialog.
ja: アクション・カラム画面の左部には、以下のオプションがあります:「ウェブサービスに戻る」（最後の保存以来変更をすべて廃棄して）と「削除」です。あなたが最後のものをクリックすれば、ダイアログは出現し、あなたが依頼アクション(Invokers)を削除したいかを尋ねます。確認するために「削除」をクリックすると、依頼アクション(Invokers)とその構成の削除する、あるいは「キャンセル」して削除ダイアログを閉じるかを確認されます。
sw: Kwenye upande wa kushoto wa skrini katika safuwima ya vitendo una machaguo: "Rudi nyuma kwenye huduma za wavuti" (puuza maadiliko yote kuanzia uhifadhi wa mwisho) na "Futa". Kama ukibofya kitufe cha mwisho maongezi yatatokea na kukuuliza kama ungependa kuondoa mchochezi. Bofya kitufe cha "Futa" kuthibitisha uondoaji wa mchochezi na usanidi wake au "Sitisha" kufunga maongezi.

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="Adminarea web service invoker - screenshot" scale="40" fileref="screenshots/genericinterface-webservice-invoker.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="管理エリア ウェブサービス インボーカ - スクリーンショット" scale="40" fileref="screenshots/genericinterface-webservice-invoker.png"></graphic>

source: <emphasis>Figure: Web service invoker.</emphasis>
ja: <emphasis>図:ウェブサービス依頼アクション(Invokers)</emphasis>
ru: <emphasis>Рисунок: Web service invoker.</emphasis>
sw: <emphasis>Kielelezo: Mchochezi wa huduma ya wavuti.</emphasis>

source: Web Service Mapping
ja: ウェブサービスマッピング
ru: Веб Сервис
sw: Kuunganisha Huduma za Wavuti

source: There are cases where you need to transform the data from one format to another (map or change data structure), because normally a web service is used to interact with a Remote System, that is highly probable that is not another OTRS system and / or could not understand the OTRS data structures and values. In these cases some or all values have to be changed, and sometimes even the names of the values (keys) or even the complete structure, in order to match with the expected data on the other end. To accomplish this task the Generic Interface Mapping Layer exists.
ja: 通常は、ウェブサービスはリモート・システムと相互に作用するために、あるフォーマットから別の(マッピングあるいはデータ構造の変更)フォーマットへデータを変換する必要のある場合があります。別のOTRSシステムでなく、かつ、または、OTRSデータ構造および値を理解できない、といった可能性は非常に高いといえます。これらの場合では、いくらかあるいはすべての値を(そして時々、値(キー)どころか完全な構造の名前さえ)もう1つの端の予期されたデータと一致するために、変更しなければなりません。このタスクを遂行するために、一般インターフェースのマップする層は存在します。

source: Each Remote System has it own data structures and it is possible to create new mapping modules for each case (e.g. there is a customized mapping module for SAP Solution Manager shipped with OTRS), but it is not always necessary. The module Mapping::Simple should cover most of the mapping needs.
ja: リモート・システムは自身のデータ構造を持ちます。それは新規マッピングモジュールをおのおののケースに対して作成することができます。（例えば、OTRS出荷時で、SAPソリューションマネージャに用にカスタマイズされたマッピング・モジュールがあります。）しかし、それは必ずしも必要だとは限りません。モジュールMapping::Simpleは、ほとんどのマッピング要求をカバーすべきです。
sw: Kila Mfumo wa Mbali una muundo wake wa data na inawezekana kutengeneza moduli mpya za muunganiko kwa kila kesi (mf. kuna moduli ya muunganiko maalumu kwa SAP Meneja Usuluhishi inayosafirishwa na OTRS), lakini sio ya lazima. Muunganiko wa moduli::Rahisi inatakiwa kukidhi mahitaji mengi ya muunganiko.

source: When Mapping::Simple does not cover all mapping needs for a web service, a new mapping module should be created. To learn more about how to create new mapping modules please consult the OTRS Development Manual.
ja: Mapping::Simpleがウェブサービスのすべてのマッピングする必要をカバーするとは限らない場合、新規マッピングモジュールが作成されるべきです。新規マッピングするモジュールを作成する方法に関してもっと学習するために、OTRS開発マニュアルを調べてください。
sw: Wakati Muunganiko::Rahisi haukidhi mahitaji yote ya muunganiko kwa huduma ya wavuti, moduli mpya ya muunganiko inatakiwa itengenezwe. Kujifunza zaidi kuhusu kutengeneza moduli mpya ya muunganiko tafadhali pitia Mwongozo wa Maendeleo wa OTRS.

source: This module gives you the opportunity to set default values to map for each key or value for the whole communication data.
ja: このモジュールは、デフォルト値をマッピングさせる機会を与えます。各キーあるいは全体のコミュニケーション・データに見合う値のために。
ru: Этот модуль дает возможность установить значение для отображения по умолчанию для каждого ключа или значения для всех передаваемых данных.
sw: Hii moduli inakupa nafasi ya kuseti thamani chaguo-msingi za kuunganisha kwa kila ufunguo au thamani kwa mawasiliano yote ya data.

source: At the beginning of the screen you will see a general section where you can set the default rules that will apply for all the unmapped keys and values. There are three options available, these options are listed below:
ja: 画面の初めに、あなたがデフォルトルールをセットできる一般的なセクションを見ます。そのルールは全てのマップされていないキーや値に適用します。利用可能な3つのオプションがあり、これらのオプションは下のようにリストされます:
sw: Mwanzo wa skrini utaona kifungu cha kawaida ambapo unaweza kuseti sheria chaguo-msingi ambazo zitafanya kazi kwa funguo na thamani zote ambazo hazijaunganishwa. Kuna machaguo matatu yanayopatikana, haya machaguo yameorodheshwa chini:

source: Keep (leave unchanged): doesn't touch the keys or values in any way.
ja: 保持（変更しないままにして）：キーや値をとにかく触りません。
ru: Не изменять: не касается ключей и значений в любом случае.
sw: Weka (acha bila kubadilisha): haigusi funguo au thamani kwa njia yoyote.

source: Ignore (drop key/value pair): when this is applied to the key it deletes the key and value, because when a key is deleted then in consequence its associated value is deleted too. When this is applied to the value, only the value is deleted, keeping the key, that now will be associated to an empty value.
ja: 無視（キー/値ペアを捨てます):これがキーに適用されれば、それはキーと値を削除します。なぜならキーが削除されると続いてその関連値も削除されるからです。これが値に適用されれば、値だけが削除され、キーは保持されます。この時それは空の値に関連付けられます。
sw: Puuza (dondosha jozi ya ufunguo/thamani): hii ikitumika katika ufunguo inafuta ufunguo na thamani, kwa sababu ufunguo ukifutwa pia na thamani yake husika inafutwa pia. Hii ikitumika kwa hii thamani, thamani tu ndiyo inafutwa, kuacha ufunguo, hiyo sasa itahusishwa na ufunguo ulio tupu.

source: MapTo (use provided key or value as default): all keys and / or values without a defined map rule, will use this as default, when you select this option a new text field will appear to set this default.
ja: MapTo（デフォルトとして供給されたキーまたは値の使用）：定義されたマップルールのない全てのキーとまたは値は、デフォルトとしてこれを使います。このオプションを選択するとき、新規のテキストフィールドがこのデフォルトをセットするために現れます。
sw: UnganishaKwenda (tumia ufunguo uliotolewa au thamani kama chaguo-msingi): funguo zote na / au thamani bila sheria ya miunganiko, zitatumia hii kama chaguo-msingi, ukichagua hili chaguo sehemu mpya ya nakala itatokea kuweka hii kama chaguo-msingi.

source: Clicking on the "+" button for new key map, will display a new box for a single mapping configuration. You can add as many key mappings as needed. Just click on the "+" button again and a new mapping box will appear below the existing one. From this mapping boxes you can define a map for a single key, with the next options:
ja: 新規キーマップのために「+」ボタンをクリックすると、単一のマッピング構成用の新規ボックスを表示します。必要なだけ多くのキーマッピングを追加することができます。再度「＋」をクリックするだけで新規マッピングボックスが既存のものの下に現れます。このマッピングボックスから、次のようなオプションを持つ単一のキーのためにマップを定義することができます。
sw: Kubofya kwenye kitufe "+" kwa ufunguo mpya wa muunganiko, itaonyesha boksi jipya kwa usanidi wa muunganiko mmoja. Unaweza kuongeza funguo nyingi za muunganiko kadri ya mahitaji yako. Bonyeza tena kwenye kitufe "+" na boksi jipya la muunganiko litaonekana chini ya lililokuwepo. Kutoka kwenye haya maboksi ya muunganiko unaweza kufafanua muunganiko wa ufunguo mmoja, na machaguo yanayofwata:

source: Exact value(s): the old key string will be changed to a new one if the old key matches exactly.
ja: 正確な値(s):古いキーが正確に一致すれば、古い重要な文字列は新規ものに変更されます。
ru: Точное значение(я): строка со старым значением будет заменена новой в случае полного совпадения "старого" ключа.
sw: Thamni halisi(moja au nyingi): tungo ya ufunguo wa zamani itabadilishwa kuwa mpya kama ufunguo wa zamani utafanania kabisa.

source: Regular expression: The key string will be replaced following a regular expression rule.
ja: 正規表現: 重要なストリングは正規表現規則に従って代替されます。
ru: Регулярное выражение: строки будут изменены с помощью правила преобразования.
sw: Usemi wa kawaida: Tungo ya ufunguo itawekwa upya baada ya sheria ya usemi wa kawaida.
