Repository: DSigmund/doc-admin
Catalog: i18n/doc-admin.*.po
Languages: ja, ru, sw

source: Create New Process button
ja: 新しいプロセス・ボタンの作成
ru: Создать Новую кнопку Процесса
sw: Kitufe cha kutengeneza mchakato mpya

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="process-management - screenshot" scale='40' fileref="screenshots/pm-newprocess-button.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="プロセス管理 - スクリーンショット" scale='40' fileref="screenshots/pm-newprocess-button.png"></graphic>

source: <emphasis>Figure: Create New Process button.</emphasis>
ja: <emphasis>図:新しいプロセスの追加</emphasis>
ru: <emphasis>Figure: Создать кнопку Новый Процесс.</emphasis>
sw: <emphasis>Kielelezo: Tengeneza Kitufe Kipya cha Mchakato.</emphasis>

source: Fill the process information,set Process Name and the Description, we will leave the process State as "inactive", until we finish all the tasks. Save the process.
ja: プロセス情報を記入し、プロセス名と摘要を設定し、全てのタスクが終了するまでプロセスの状態を「不活性」のままにしておきます。プロセスを保存します。
ru: Заполняем информацию о процессе, указываем Название Процесса и его Описание, а статус оставим со значением "inactive", пока не закончим все задачи. Сохраняем процесс.
sw: Jaza taarifa za mchakato, seti Jina la Mchakato na Undani wake, tutaacha Hali ya mchakato kuwa iliyo "Lemazwa", mpaka tumalize kazi zote. Hifadhi mchakato.

source: Add new process
ja: 新しいプロセスの追加
ru: Добавить новый процесс
sw: Ongeza mchakato mpya

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="process-management - screenshot" scale='40' fileref="screenshots/pm-newprocess-info.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="プロセス管理 - スクリーンショット" scale='40' fileref="screenshots/pm-newprocess-info.png"></graphic>

source: <emphasis>Figure: Add new process.</emphasis>
ja: <emphasis>図:新しいプロセスの追加</emphasis>
ru: <emphasis>Рисунок Добавить новый процесс.</emphasis>
sw: <emphasis>Kielelezo: Ongeza mchakato mpya.</emphasis>

source: Activity Dialogs
ja: アクティビティ・ダイアログ
ru: Диалоги Действий
sw: Maongezi ya Shughuli

source: Click on the new process name in the Process Management Overview Screen, then in the "Available Process Elements" click in "Activity Dialogs" (this action will expand the activity dialog options and will collapse all others doing and accordion like effect), then click on "Create New Activity Dialog".
ja: プロセス・マネジメント概要画面にあるの新しいプロセス名をクリックします。それから「利用可能なプロセス構成要素」の中で「アクティビティ・ダイアログ」をクリックします。（このアクションはアクティビティ・ダイアログ・オプションを拡張し、他の全てを壊し押しつぶすでしょう。）次に「新しいアクティビティ・ダイアログを作成」をクリックします。
ru: Кликните по имени процесса в окне Обзора процессов, затем в списке "Доступные элементы процесса" нажмите на "Диалоги Активности" (это действие распахнет список опций для диалогов активности и сожмет другие списки, к нему не относящиеся, напоминает эффект гармошки), затем нажмите на "Создать новый Диалог Активности".
sw: Bofya katika jina jipya la mchakato kwenye Skrini ya Mapitio ya Usimamizi wa Mchakato, kisha katika "Elemnti za Mchakato Zinazopatikana" bofya katika "Maongezi ya Shughuli" (hiki kitendo kitapanua machaguo ya maongezi ya shughuli na kukunja nyingine zote na athari za kodiani), kisha bofya "Tengeneza Maongezi Mapya ya Shughuli".

source: Create New Activity Dialog button
ja: 新しいアクティビティ・ダイアログ・ボタンの作成
ru: Кнопка создания нового Диалога Активности
sw: Tengeneza Kitufe cha Maongezi ya Shughuli kipya

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="process-management - scale='40'screenshot" scale='40' fileref="screenshots/pm-accordion-new-activitydialog.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="プロセス管理」- スクリーンショット" scale='40' fileref="screenshots/pm-accordion-new-activitydialog.png"></graphic>

source: <emphasis>Figure: Create New Activity Dialog button.</emphasis>
ja: <emphasis>図:新しいアクティビティ・ダイアログ・ボタンの作成</emphasis>
ru: <emphasis>Рисунок: Создать кнопку Новый Диалог Деятельности.</emphasis>
sw: <emphasis>Kielelezo: Tengeneza Kitufe cha Maongezi ya Shughuli kipya.</emphasis>

source: In the opened popup screen fill the "Activity dialog Name" as well as the "Description (short)" fields, for this example we will leave all other fields as the default, to assign fields to the Activity Dialog simple drag the required field from the "Available Fields" pool and drop into the "Assigned Fields" pool. The order in the "Assigned Fields" pool is the order as the fields will have in the screen, to modify the order simply drag and drop the filed within the pool to rearrange it in the correct place.
ja: 「摘要（短）」フィールドと同様に、開いたポップ・アップ・画面に「アクティビティ・ダイアログ名」を 記入します。この例では全ての他のフィールドをデフォルトのままにしておきます。アクティビティ・ダイアログにフィールドを指定するために、必要なフィールドを「利用可能なフィールド」プールから「指定されたフィールド」へドラッグします。「指定されたフィールド」プールの順序は フィールドが画面にあるような順序です。プール内のフィールドをドラッグ＆ドロップして順序を変更し、正しい位置に再配置します。
ru: Во вновь открывшемся окне, заполните поле "Имя Диалога Активности", а также "Описание (краткое)", для этого примера мы оставим остальные поля со значениями по умолчанию. Для назначения полей Диалогу Активности просто захватите мышкой нужное поле из списка "Доступные поля" и перенесите в список "Назначенные поля". Их порядок в списка "Назначенные поля" будет соответствовать их порядку на экране. Для изменения порядка просто захватите мышкой нужное поле и переместите его в нужное место.
sw: Katika skrini ibukizi iliyofunguliwa jaza "Jina la maongezi ya Shughuli" na pia "sehemu za Maelezo (mafupi)", kwa huu mfano tutaacha sehemu nyingine zote kama zilivyo kawaida,ili kugawia sehemu kwa Maongezi ya Shuguli kokota sehemu inayotakiwa kutoka kwenye bwawa la "Sehemu Zilizopo" na dondosha katika bwawa la "Sehemu Zilizogawiwa". Oda katika bwawa la "Sehemu Zilizogawiwa" ndiyo oda sehemu zitakuwa nazo katika skrini, kubadilisha oda kokota na kudondosha hiyo sehemu kwenye bwawa kupanga katika sehemu sawia.

source: Add new Activity Dialog
ja: 新規アクティビティ・ダイアログの追加
ru: Добавить новый Диалог Активности
sw: Ongeza Maongezi ya Shughuli mapya

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="process-management - screenshot" scale='40' fileref="screenshots/pm-edit-activitydialog.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="プロセス管理」- スクリーンショット" scale='40' fileref="screenshots/pm-edit-activitydialog.png"></graphic>

source: <emphasis>Figure: Add new Activity Dialog.</emphasis>
ja: <emphasis>図:新規アクティビティ・ダイアログの追加</emphasis>
ru: <emphasis>Figure: Добавить новый Диалог Деятельности.</emphasis>
sw: <emphasis>Kielelezo: Ongeza Maongezi ya Shughuli mapya.</emphasis>

source: As soon as the fields are dropped into the "Assigned Fields" pool another popup screen is shown with some details about the field, we will leave the default options and only for Article fields we should make sure that the ArticleType field is set to "note-internal".
ja: フィールドが「指定されたフィールド」プールにドロップされるとすぐに、別のポップ・アップ・画面が開き、フィールドに関するいくつかの詳細が表示されます。デフォルト・オプションはそのままとして、また記事フィールドのみに関しては、記事タイプ・フィールドが「ノート内部：（note-internal）」にセットされることを確かめねばなりません。
ru: После того как помещены в список "Назначенные поля", другое всплывющее окно покажет некоторые данные о поле. Мы оставим им всем умалчиваемые значения и только для полей типа Сообщение/Заметка мы долны проверить, что они имеют тип "note-internal".
sw: Baada tu ya sehemu kudondoshwa katika bwawa la "Sehemu Zilizogawiwa" skrini ibukizi nyingine inaonyeshwa yenye undani kuhusu sehemu hiyo, tutaacha machaguo ya kawaida na kwa sehemu za Makala tu ndiyo tuhakikishe kwamba sehemu ya Aina ya Makala imesetiwa kuwa "notisi-ndani".

source: Edit field details (Article)
ja: フィールド詳細(記事)の編集
ru: Редактировать элементы поля (Article)
sw: Hariri undani wa uga (Makala)

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="process-management - screenshot" scale='40' fileref="screenshots/pm-edit-field-article.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="プロセス - 管理 - スクリーンショット" scale='40' fileref="screenshots/pm-edit-field-article.png"></graphic>

source: <emphasis>Figure: Edit field details (Article).</emphasis>
ja: <emphasis>図:フィールド詳細(記事)の編集</emphasis>
sw: <emphasis>Kielelezo: Hariri undani wa uga (Makala).</emphasis>

source: After all fields are assigned click on the submit button in the main popup screen to save the changes.
ja: 全てのフィールドが指定された後で、変更を保存するためにメインのポップアップ画面にて、送信ボタンをクリックします。
ru: Если все поля привязаны, нажмите на кнопку отправить в главном всплывающем окне чтобы изменения вступили в силу.
sw: Baada ya sehemu zote kupewa thamani bofya kitufe cha kuwasilisha katika skrini kuu ibukizi kuhifadhi mabadiliko.

source: In this example we will use Article field for comments, but another option could be to create a TextArea type Dynamic Field, the rest of the mentioned fields in the lines below are the Dynamic Fields that we define before.
ja: この例では、私たちは記事フィールドをコメントに使用します。しかし、別のオプションはTextAreaタイプ動的フィールドを作成できます。下記のラインの言及されたフィールドの残りは、私たちが事前に定義する動的フィールドです。
ru: В этом примере мы будем использовать поля типа Article для комментариев, другой способ состоит в том, чтобы создать динамическое поле типа TextArea. Оставшиеся из упомянутых полей в строках ниже это динамические поля которые мы задали ранее.
sw: Katika mfano huu tutatumia sehemu ya Makala kwa ajili ya maoni, lakini chaguo lngine linaweza kuwa kutengeneza EneoLaNakala la aina Sehemu Inayobadilika, sehemu zilizobaki ambazo zimetajwa katika mistari chini ni Sehemu Zinazobadilika ambazo tumefafanua kabla.

source: Please be aware that in this screen all the Dynamic Fields has the prefix "DynamicField_" as in "DynamicField_Title", Do not confuse with the field "Title" that is the Ticket Title.
ja: この画面では動的フィールドは、「DynamicField_Title」の中に接頭辞「DynamicField_」を持つことにご留意願います。タイトルフィールドとチケット・タイトルとを混同しないようにして下さい。
ru: Обратите вниманиче что на этой странице все Динамические Поля имеют префикс "DynamicField_" как в "DynamicField_Title", не путайте с полем "Название", которое является Названием Заявки.
sw: Tafadhali tambua kwamba katika skrini hii Sehemu Zinazobadilika zote zina kiambishi awali "SehemuInayobadilika_" kama kwenye "SehemuInayobadilika_Kichwa", Usichanganye na sehemu "Kichwa" ambacho ni Kichwa cha Tiketi.

source: Create the following Activity Dialogs:
ja: 次のアクティビティ・ダイアログを作成してください:
ru: Создать следующие Диалоги Активности:
sw: Tengeneza Maongezi ya Shughuli yafwatayo:

source: "Recoding the demand" (AD1)
ja: 「依頼の記録」(AD1)
ru: "Запись спроса" (AD1)
sw: "Kurekodi mahitaji" (AD1)

source: An Activity Dialog that contains all the required fields for the data to be collected for the order (Title, Author and ISBN), and a Status field with the possibility to choose "Approval".
ja: 注文のために収集されるデータ用の全ての必須フィールドを含むアクティビティ・ダイアログ（タイトル、著者、ISBN）と、「承認」を選択する可能性を持つ状態フィールド。
ru: Диалог Активности, который содержит все требуемые поля для хранения данных о заказе (Название, Автор и ISBN) и поле Состояние/Status с возможностью выбора "Утверждение".
sw: Maongezi ya Shughuli yenye sehemu zote zinazoitajika ili data ikusanywe kwa oda (Kichwa cha habari, Mwandishi na ISBN), na sehemu ya Haliyenye uwezekano wa kuchagua "Kibali".

source: "Approval denied" (AD2)
ja: 「承認拒否」(AD2)
ru: "Отказать" (AD2)
sw: "Kibali kimekataliwa" (AD2)

source: An Activity Dialog with a comment field (Article) and a Status field with the option "Approval denied".
ja: コメント・フィールド（記事）を持つアクティビティー・フィールドとオプション「承認拒否」を備えた状態フィールド
ru: Диалог Активности с полем комментария и полем статуса с опцией "Отказать".
sw: Maongezi ya Shughuli yenye sehemu ya kuweka maoni (Makala) na sehemu ya Hali yenye chaguo "Kibali kimekataliwa".

source: "Approved" (AD3)
ja: 「承認済」(AD3)
ru: "Утвержден" (AD3)
sw: "Kubaliwa" (AD3)

source: Here we just need the Status field with the option "Approved".
ja: ここでは「承認済」オプションを持つ状態フィールドが必要となります。
ru: Здесь нам просто нужно поле статуса с опцией "Approved/Утверждено".
sw: Hapa tunahitaji hali ya uga wenye chaguo "Kubaliwa"

source: "Order denied" (AD4)
ja: 「注文拒否」 (AD4)
ru: "Заказ отменен" (AD4)
sw: "Oda imekataliwa" (AD4)

source: An activity dialog which makes it possible for purchasing to reject an impossible order (book out of stock). Here we also need a comment field and the Status field with the option "Order denied".
ja: 購入時不可能な注文（在庫切れの本）を拒否することを可能可能にするアクティビティ・ダイアログ。ここでは「注文拒否」オプションを持つ状態フィールドが必要となります。
ru: Диалог Активности который позволяет отказаться от покупки (книги нет на складе). Здесь нам также потребуется поле с комментарием и поле статус со значением "Заказ отменен".
sw: Maongezi ya shughuli yanayowezesha kununua ili kukataa oda isiyowezekana (kulipia mzigo kabla ikiwa hisa zimeisha). Hapa pia tunahitaji sehemu ya maoni na sehemu ya Hali yenye chaguo "Oda imekataliwa"

source: "Order placed" (AD5)
ja: 「発注」(AD5)
ru: "Заказ размещен" (AD5)
sw: "Oda imewekwa" (AD5)

source: An activity dialog with the fields Supplier, Price and Delivery date for purchasing and the Status field with the option "Order placed".
ja: 購入時のフィールド・サプライヤー、価格、配達日、及び「注文拒否」オプションを持つ状態フィールドを、持つアクティビティ・ダイアログ。
ru: Диалог Активности с полями Поставщик, Цена и Дата доставки для покупки и поле статуса со значением "Заказ размещен".
sw: Maongezi ya Shughuli yenye sehemu Msambazaji, Bei na tarehe ya Uwasilishaji kwa manunuzi na sehemu ya Hali yenye chaguo "Oda imewekwa".

source: "Shipment received" (AD6)
ja: 「貨物受取」(AD6)
ru: "Поставка получена" (AD6)
sw: "Vilivyosafirishwa vimepokelewa" (AD6)

source: An activity for the mail room with a field for the Date of receipt and the Status field with the option "Shipment received".
ja: 「受取日のフィールドを備えた郵便室」および「貨物受取」オプションを備えた状態・フィールド用のアクティビティ。
ru: Диалог Активности для почтового отделения с полем для Даты получения и полем статуса со значением "Поставка получена".
sw: Shughuli ya kwenye chumba cha barua yenye sehemu ya Tarehe ya upokeaji na sehemu ya Hali yenye chaguo "Vilivyosafirishwa vimepokelewa".

source: To restrict the Status field for each activity dialog we need to add some ACLs in the Kernel/Config.pm or to a new perl file located in Kernel/Config/Files.
ja: 各々のアクティビティ・ダイアログ用の状態フィールドを制限するために、いくつかのACLの追加を必要とします。ACLを追加する場所はKernel/Config.pmの中またはKernel/Config/Filesの中にある新しいperlファイルです。
ru: Чтобы ограничить поле состояние для каждого из диалогов активности нам необходимо добавить некоторые ACL-права в файл Kernel/Config.pm или в новый perl-файл в Kernel/Config/Files.
sw: Kuzuia sehemu ya hali ya kila maongezi ya shughuli tunahitaji kuongeza baadhi ya ACL katika Kernel/Config.pm au kwenye faili jipya la perl lililo kwenye Kernel/Config/Files.

source: Transitions
ja: 推移
ru: Переходы
sw: Mapito

source: In the "Available Process Elements" click in "Transitions", then click on "Create New Transition".
ja: 「推移」で「利用可能なプロセス要素」をクリックして、その後、「新しい推移の作成」をクリックしてください。
ru: В "Доступные Элементы Процесса" щелкните "Переходы", а затем кликните на "Создать новый переход".
sw: Kwenye "Elementi Zinazopatikana za Mchakato" bofya kwenye "Mapito", kisha bofya "Tengeneza Mpito Mpya"

source: Create New Transition button
ja: 新規推移ボタンの作成
ru: Создать Новую кнопку Перехода
sw: Tengeneza kitufe kipya cha mpito

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="process-management - screenshot" scale='40' fileref="screenshots/pm-accordion-new-transition.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="プロセス - 管理 - スクリーンショット" scale='40' fileref="screenshots/pm-accordion-new-transition.png"></graphic>

source: <emphasis>Figure: Create New Transition button.</emphasis>
ja: <emphasis>図：新規推移ボタンの作成</emphasis>
ru: <emphasis>Figure: Создать кнопку Новый Переход.</emphasis>
sw: <emphasis>Kielelezo: Tengeneza kitufe kipya cha mpito.</emphasis>

source: In the opened popup screen fill the "Transition Name", then in the conditions, for this examples we will use just one condition and just one field, for both we can leave the Type of Linking as "and" and we will use the filed match type value as "String".
ja: 開いたポップ・アップ・画面中に「推移名」を記入します。それからこの条件では、この例に対してひとつの条件とひとつのフィールドを使います。その両方に対してリンクのタイプを「and」のままにします。そしてフィールド一致タイプ値として「String」を使います。
ru: В открывшемся всплывающем окне заполните "Transition Name/Имя Перехода", затем, в условиях, для этого примера мы будем использовать только одно условие и только одно поле, для обоих мы оставим Type of Linking/Тип связывания "and/И", а также будем использовать тип значения поля для сравнения - "String".
sw: Katika skrini ibukizi iliyofunguliwa jaza "Jina la Mpito", kisha kwenye masharti, kwa mfano huu tumia sharti moja tu na sehemu moja, kwa zote tunaweza kuacha Aina ya muunganiko kama "na" na tutatumia thamani ya aina ya kufanana kama "Tungo".

source: Add new Transition
ja: 新規推移の追加
ru: Добавить новый Переход
sw: Ongeza mpito mpya

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="process-management - screenshot" scale='40' fileref="screenshots/pm-edit-transition.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="プロセス - 管理 - スクリーンショット" scale='40' fileref="screenshots/pm-edit-transition.png"></graphic>

source: <emphasis>Figure: Add new Transition.</emphasis>
ja: <emphasis>図: 新規推移の追加</emphasis>
ru: <emphasis>Рисунок: Добавить новый ПереходAdd new Transition.</emphasis>
sw: <emphasis>Kielelezo: Ongeza mpito mpya.</emphasis>

source: After all conditions are set click on the submit button to save the changes.
ja: 全ての条件を設定後、変更を保存するために送信ボタンをクリックします。
ru: Когда все условия установлены, нажмите кнопку Отправить, чтобы сохнанить изменения.
sw: Baada ya masharti yote kusetiwa bofya kwenye kitufe cha kuhifadhi kuhifadhi mabadiliko.

source: Create the following Transitions:
ja: 次の推移を作成してください:
ru: Создать следующие Переходы:
sw: Tengeneza Mapito yafuatayo:

source: "Approval" (T1)
ja: 「承認」(T1)
ru: "Утверждение" (T1)
sw: "Kibali" (T1)

source: A transition which checks if the Status field is set to "Approval".
ja: 状態フィールドが「承認」にセットされるかどうかをチェックする推移。
ru: Переход, который проверяет, установлен ли статус поля в "Approval".
sw: Mpito unaokagua kama Sehemu ya Hali imesetiwa kuwa "Kibali".

source: "Approval denied" (T2)
ja: 「承認拒否」(T2)
ru: "Отказано в утверждении" (T2)
sw: "Kibali kimekataliwa" (T2)

source: A transition which checks if the Status field is set to "Approval denied".
ja: 状態フィールドが「「承認拒否」にセットされるかどうかをチェックする推移。
ru: Переход проверяющий установку статуса поля в значение "Approval denied".
sw: Mpito unaokagua kama Sehemu ya Hali imesetiwa kuwa "Kibali kimekataliwa".

source: "Approved" (T3)
ja: 「承認済」(T3)
ru: "Утвержден" (T3)
sw: "Kubaliwa" (T3)

source: A transition which checks if the Status field is set to "Approved".
ja: 状態フィールドが着手されるかどうかをチェックする推移は「承認済」
ru: Переход, проверяющий установку статуса поля в значение "Approved".
sw: Mpito unaokagua kama Sehemu ya Hali imesetiwa kuwa "Kubaliwa".

source: "Order denied" (T4)
ja: 「注文拒否」 (T4)
ru: "Заказ отменен" (T4)
sw: "Oda imekataliwa" (T4)

source: A transition which checks if the Status field is set to "Order denied".
ja: 状態フィールドが「注文拒否」にセットされるかどうかをチェックする推移。
ru: Переход проверяющий установку статуса поля в значение "Order denied".
sw: Mpito unaokagua kama sehemu ya Hali imesetiwa kuwa "Oda imekataliwa".

source: "Order placed" (T5)
ja: 「発注」 (T5)
ru: "Заказ размещен" (T5)
sw: "Oda imewekwa" (T5)

source: A transition which checks if the Status field is set to "Order placed".
ja: 状態フィールドが「発注」にセットされるかどうかをチェックする推移。
ru: Переход проверяющий установку статуса поля в значение "Order denied".
sw: Mpito unaokagua kama sehemu ya Hali imesetiwa kuwa "Oda imewekwa".

source: "Shipment received" (T6)
ja: 「貨物受取」 (T6)
ru: "Поставка получена" (T6)
sw: "Vilivyosafirishwa vimepokelewa" (T6)

source: A transition which checks if the Status field is set to "Shipment received".
ja: 状態フィールドが「貨物受取」にセットされるかどうかをチェックする推移。
ru: Переход, который проверяет установлено ли поле статуса в значение "Shipment received".
sw: Mpito unaokagua kama sehemu ya Hali imesetiwa kuwa "Vilivyosafirishwa vimepokelewa".

source: Transition Actions
ja: 推移アクション
ru: Действия Перехода
sw: Vitendo vya mpito

source: Click on "Transition Actions" in the "Available Process Elements", then click on "Create New Transition Action".
ja: 「利用可能なプロセス要素」中の「推移アクション」をクリックして、次に、「新規推移アクションの作成」をクリックしてください。
ru: Кликните на "Действия Переходов " в меню "Доступные элементы процесса", а затем кликните "Создать Новое Действие Перехода".
sw: Bofya kwenye "Vitendo vya Mpito" katika "Elementi za Michakato Zilizopo", kisha bofya "Tengeneza Kitendo Kipya cha Mpito".

source: Create New Transition Action button
ja: 新規推移アクションボタンの作成
ru: Кнопка создания нового Действие Перехода
sw: Tengeneza kitufe kipya cha vitendo vya mpito

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="process-management - screenshot" scale='40' fileref="screenshots/pm-accordion-new-transitionaction.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="プロセス - 管理 - スクリーンショット" scale='40' fileref="screenshots/pm-accordion-new-transitionaction.png"></graphic>

source: <emphasis>Figure: Create New Transition Action button.</emphasis>
ja: <emphasis>図:新規推移アクションボタンの作成</emphasis>
ru: <emphasis>Рисунок: Кнопка создания нового перехода .</emphasis>
sw: <emphasis>Kielelezo: Tengeneza kitufe kipya cha vitendo vya mpito.</emphasis>

source: In the opened popup screen fill the "Transition Name", and the "Transition Action module" then add the required and optional parameter names and values.
ja: 開かれたポップ・アップ・画面の中で「推移名」および「推移アクション・モジュール」を記入して下さい。それから、必須及び任意のパラメタと値を追加して下さい。
ru: В открывшемся всплывающем окне заполните поле "Название Перехода" и "Модуль Деятельности Перехода", а затем добавьте требуемые и опциональные параметры, названия и значения.
sw: Katika skrini ibukizi iliyofunguliwa jaza "Jina la Mpito", na "Moduli ya Vitendo vya Mpito" kisha ongeza majina na thamani za parameta za hiari na zinazohitajika

source: All the Transition Action Modules are located in Kernel/System/ProcessManagement/TransitionAction and the following is the list of bundled Transition Actions included in this release
ja: 全ての推移アクション・モジュールは、Kernel/System/ProcessManagement/TransitionActionに存在します。また、推移アクションと以下は下記は、バンドルされた推移アクションのリストで、このリリースに含まれます。
ru: Все Модули Переходов Действий находятся в Kernel/System/ProcessManagement/TransitionAction и ниже приводится список Переходов Действий включенных в этот релиз
sw: Moduli zote za mpito zinapatikana kwenye Kiini/Mfumo/UsimamiziwaMchakato/VitendovyaMpito na ifuatayo ni orodha ya kifungu cha Vitendo vya Mpito vilivyojumuishwa kwenye hili toleo

source: DynamicFieldSet
ja: DynamicFieldSet (動的フィールドのセット)
sw: SetiSehemuInayobadilika

source: TicketArticleCreate
ja: TicketArticleCreate（チケット記事の作成）
sw: TengenezaTiketiMakala

source: TicketCustomerSet
ja: TicketCustomerSet（チケット・顧客・セット）
sw: SetiTiketiMteja

source: TicketLockSet
ja: TicketLockSet（チケット・ロック・セット）
sw: SetiKitasaTiketi

source: TicketOwnerSet
ja: TicketOwnerSet（チケット・所有者・セット）
sw: SetiMwenyeTiketi

source: TicketQueueSet
ja: TicketQueueSet（チケット・キュー・セット）
sw: SetiFoleniTiketi

source: TicketResponsibleSet
ja: TicketResponsibleSet（チケット・責任者・セット）
sw: SetKuwajibikaTiketi

source: TicketServiceSet
ja: TicketServiceSet（チケット・サービス・セット）
sw: SetiHudumaTiketi

source: TicketSLASet
ja: TicketSLASet（チケット・SLA・セット）
sw: SetiSLATiketi

source: TicketStateSet
ja: TicketStateSet（チケット・状態・セット）
sw: SetiHaliTiketi

source: TicketTitleSet
ja: TicketTitleSet（チケット・タイトル・セット）
sw: SetiMadaTiketi

source: TicketTypeSet
ja: TicketTypeSet（チケット・タイプ・セット）
sw: SetiAinaTiketi
