Repository: DSigmund/doc-admin
Catalog: i18n/doc-admin.*.po
Languages: ja, ru, sw

source: <emphasis>Sum rows</emphasis>. Indicates whether the report is amended by a column, whose cells state the sums of the respective rows.
ja: <emphasis>行の合計</emphasis>。レポートが、列(複数のセルが各行の合計を表している)によって修正されるかどうかを示します。
ru: <emphasis>Количество строк</emphasis>. Указывает когда отчет заменяется колонкой, чьи ячейки содержат сумму соответствующих строк.
sw: <emphasis>Jumla safumlalo</emphasis>. Inaonyesha kama ripoti imerekebishwa kwa safuwima, ambamo seli zake zinatoa jumla ya safumlalo husika.

source: <emphasis>Sum columns</emphasis>. Indicates whether the report is amended by a row, whose cells state the sum of the respective columns.
ja: <emphasis>列の合計</emphasis>。レポートが、行(複数のセルが各列の合計を表している)によって修正されるかどうかを示します。
ru: <emphasis>Количество колонок</emphasis>. Указывает когда отчет заменяется строкой, чьи ячейки содержат сумму соответствующих колонок.
sw: <emphasis>Jumla safuwima</emphasis>. Inaonyesha kama ripoti imerekebishwa kwa safumlalo, ambamo seli zake zinatoa jumla ya safuwima husika.

source: <emphasis>Cache</emphasis>. Indicates whether the generated report is cached in the filesystem.
ja: <emphasis>キャッシュ</emphasis>。生成されたレポートがファイルシステムにキャッシュされるかどうかを示します。
ru: <emphasis>Кэш</emphasis>. Указывает когда сгенерированный отчет кэшируется в файловой системе.
sw: <emphasis>Hifadhi muda</emphasis>. Inaonyesha kama ripoti iliyozalishwa inawekwa kwenye hifadhi muda ya mfumo.

source: <emphasis>Valid</emphasis>. This can be set to "invalid" if a report must not be run temporarily for any reason. The "Start" button in the bottom of the right panel is then no longer displayed. The report can no longer be generated.
ja: <emphasis>有効</emphasis>。どんな理由でもレポートを一時的に実行してはならない場合これは「無効」にセットすることができます。そうすると、パネルの右側底部にある「スタート」ボタンは、もはや表示されません。そのレポートはもはや生成することができません。
ru: <emphasis>Действительный</emphasis>. Может быть установлен в значение "недействительный" если по какой то причине отчет временно не должен запускаться. Кнопка "Старт" в нижней части правой панели больше не отображается. Таким образом отчет не может быть создан.
sw: <emphasis>Halali</emphasis>. Hii inaweza kusetiwa kuwa "batili" kama ripoti itatakiwa kuanzishwa kwa muda kwa sababu yoyote. Kitufe "Anza" upande wa chini wa paneli ya kulia haionyeshwi tena. Ripoti haiwezi kuzalishwa tena.

source: <emphasis>Created</emphasis>. Creation time of the report.
ja: <emphasis>作成済</emphasis>。レポートの生成時間。
ru: <emphasis>Создан</emphasis>. Время создания отчета.
sw: <emphasis>Tengenezwa</emphasis>. Muda wa utengenezaji wa ripoti.

source: <emphasis>Created by</emphasis>. Name of the agent who created the report.
ja: <emphasis>作成済</emphasis>。レポートを作成した担当者の名前。
ru: <emphasis>Создан (кем)</emphasis>. Имя агента, который создал отчет.
sw: <emphasis>Imetengenezwa na</emphasis>. Jina la wakala aliyetengeneza ripoti.

source: <emphasis>Changed</emphasis>. Time when the report was last modified.
ja: <emphasis>変更済</emphasis>。レポートが最後に修正された時刻による。
ru: <emphasis>Изменен</emphasis>. Время последней модификации отчета.
sw: <emphasis>Badilishwa</emphasis>. Muda ripoti ilibadilishwa kwa mara ya mwisho.

source: <emphasis>Changed by</emphasis>. Name of the agent who altered the report last.
ja: <emphasis>変更済</emphasis>。レポートを最後に変更した担当者の名前による。
ru: <emphasis>Изменен кем</emphasis>. Имя агента, который последним внес изменения в отчет.
sw: <emphasis>Imabadilishwa na</emphasis>. Jina la wakala aliyebadilisha ripoti mara ya mwisho.

source: <emphasis>X-axis</emphasis>. Using this function, the agent can switch the x and y axes (only when activated by the OTRS administrator).
ja: <emphasis>X軸</emphasis>。この機能を使用すると、担当者はxとyの軸(OTRS管理者によって活性化された時だけ)を切り替えることができます。
ru: <emphasis>X-axis</emphasis>. Используя эту функцию, агент может переключать x и y axes (только в том случае, если эта опция активирована OTRS-администратором).
sw: <emphasis>jira-X</emphasis>. Kutumia programu-tumizi hii, wakala anaweza kubadilisha majira x na y (ikiwa tu imeamilishwa na msimamizi wa OTRS).

source: The general information is followed by information about the report itself. There are two different report (or stat) views:
ja: レポート自体に関する情報は一般情報に続きます。2つの異なるレポート(あるいはstat)ビューがあります:
ru: Общая информация сопровождается информацией о самом отчете. Есть два различных шаблона просмотра отчета (или статистики):
sw: Taarifa ya ujumla inafwatiwa na taarifa kuhusu ripoti yenyewe. Kuna muonekano wa ripoti (au takwimu) wa aina mbili :

source: <emphasis>Static stat view</emphasis>. Static report generators can be integrated into the stats module (see Figure below).
ja: <emphasis>静的stat・ビュー</emphasis>。静的レポート生成者は、統計モジュールへ統合することができます(下記の図を参照)。
ru: <emphasis>Обзор статических отчетов</emphasis>. Генераторы статических отчетов могут быть интегрированы в модуль отчетов (смотри рисунок ниже).
sw: <emphasis>Muonekano tuli wa takwimu</emphasis>. Vizalishaji vya ripoti tuli vinaweza kuunganishwa katika moduli ya takwimu (ona Kielelezo chini).

source: Static stat view
ja: 静的統計(stat)ビュー
ru: Статические шаблоны для просмотра статистики
sw: Muonekano tuli wa takwimu

source: <placeholder type="screeninfo" id="0"/> <graphic fileref="screenshots/stats-view-static.png" scale="40" srccredit="stats-view-static - Screenshot" />
ja: <placeholder type="screeninfo" id="0"/> <graphic fileref="screenshots/stats-view-static.png" scale="40" srccredit="静的統計ビュー - スクリーンショット" />

source: <emphasis>Figure: Viewing a static report.</emphasis>
ja: <emphasis>図:静的レポートのビュー</emphasis>
ru: <emphasis>Рисунок: Просмотр статического отчета.</emphasis>
sw: <emphasis>Kielelezo: Kuona ripoti tuli.</emphasis>

source: <emphasis>Dynamic stat view</emphasis> (see Figure above). They can be displayed in two different ways:
ja: <emphasis>動的統計(stat)ビュー</emphasis>(上記の図を参照)。それらは2つの異なる方法で表示することができる:
ru: <emphasis>Просмотр динамического отчета</emphasis> (смотри рисунок выше). Они могут отображаться двумя различными способами:
sw: <emphasis>Muonekano wa takwimu unaobadilika</emphasis> (ona Kielelezo juu). Zinaweza kuonyeshwa katika njia mbili:

source: <emphasis>Unchangeable settings</emphasis>. The originator of the report has no permission for modifying this fields.
ja: <emphasis>不変の設定</emphasis>。レポートの作成者は、このフィールドを変更する許可を持っていません。
ru: <emphasis>Неизменяемые настройки</emphasis>. Создатель отчета не имеет прав для изменения этих полей.
sw: <emphasis>Mipangilio isiyobadilika</emphasis>. Chanzo cha ripoti hakina ruhusa ya kubadilisha hizi sehemu.

source: <emphasis>Changeable settings</emphasis>. The configuration settings of such reports can be changed by the agent.
ja: <emphasis>可変の設定</emphasis>。そのようなレポートの構成設定は担当者によって変更することができます。
ru: <emphasis>Изменяемые настройки</emphasis>. Параметры конфигурации таких отчетов могут быть изменены агентом.
sw: <emphasis>Mipangilio inayobadilika</emphasis>. Mipangilio ya usanidi wa ripoti kama hizi inaweza kubadilishwa na wakala.

source: Pressing the "Start" button (at the bottom of the screen) is the last step to generate the report. There are two possible reasons for this button to not be displayed:
ja: 「スタート」ボタン(画面の底の)を押すことは、レポートを生成する最後のステップです。これら二つのボタンが表示されない理由の可能性は二つあります。:
ru: Нажатие кнопки "Пуск" (в нижней части экрана) является последним шагом при создании отчета. Есть две возможные причины, когда эта кнопка не будет отображаться:
sw: Kubonyeza kitufe "Anza" (upande wa chini wa skrini) ni hatua ya mwisho ya kuzalisha ripoti. Kuna njia mbili ziwezekanazo kwa hiki kitufe kuto kuonyeshwa:

source: The report was set to invalid and thus, deactivated.
ja: そのレポートは無効にセットされ、それゆえ非活性化されます。
ru: Отчет был установлен недействительным и, таким образом отключен.
sw: Ripoti imesetiwa kuwa batili na hivyo imelemazwa.

source: The report was not configured cleanly and is, therefore, not yet executable. In this case, the necessary information can be found in the OTRS notification section (below the navigation bar).
ja: そのレポートはクリーンに構成されなかったため、まだ実行可能ではありません。この場合、必要な情報はOTRS通知セクション(ナビゲーション・バーより下の)で見つけることができます。
ru: Отчет был настроен не аккуратно и, следовательно, не может выполнятся. В этом случае необходимую информацию можно найти в разделе уведомлений OTRS (внизу, под навигационной панелью).
sw: Ripoti haikufanyiwa usanidi vizuri, hivyo haiwezi kutekelezeka. Kwa kesi hii taarifa zinazotakiwa zinapatikana katika sehemu ya taarifa za OTRS (chini kuna mwambaa wa uabiri).

source: If the settings on the View page are incorrect, this page is shown again after the "Start" button was pushed, and information about which input was incorrect is provided in the notification section.
ja: ビューページのセッティングが正しくない場合、「スタート」ボタンが押された後、このページは再び示されます。また、どの入力が正しくなかったかに関する情報は通知セクションの中で提供されます。
ru: Если настройки на странице Просмотр неверны, эта страница отображается опять, после нажатия кнопки "Пуск" и информация о введеных неверных данных будет выведена в разделе уведомлений.
sw: Kama mpangilio kwenye Ona kurasa hauko sawa, hii kurasa itaonyeshwa tena baada ya kubonyeza kitufe "Anza", na taarifa kuhusu ingizo lipi limekosewa zitatolewa kwenye sehemu ya taarifa.

source: Edit / New
ja: 編集/新規
ru: Редактировать / Создать новый
sw: Hariri / Mpya

source: Agents with write rights can edit an existing report configuration by calling up the edit user interface of the stats module. Alternately, they may create a new report. The associated screens can be reached in the following manner:
ja: 書き込み権を持った担当者は、統計モジュールの編集ユーザ・インターフェースを呼び出すことにより、既存のレポート構成を編集することができます。一方、彼らは新規レポート作成できます。関連する画面に、次の方法で到達することができます:
ru: Агенты, которые имеют права на запись, могут редактировать настройки существующего отчета, запустив пользовательский веб-интерфейс модуля статистики. В качестве альтернативы они могут создать новый отчет. Соответствующие страницы могут быть запущены следующим образом:
sw: Mawakala wenye haki za kuandika wanaweza kuhariri usanidi wa ripoti kwa kuita kiolesura cha hariri mtumiaji cha moduli ya takwimu. Au, wanaweza kutengeneza ripoti mpya. Skrini zinazohusika zinaweza kufikiwa kwa njia zifuatazo:

source: Edit: Via the "Edit" button in the stat view.
ja: 編集:統計ビュー中の「編集」ボタン経由
ru: Редактировать: Используя кнопку "Редактировать" в шаблоне просмотра статистики.
sw: Hariri: Kupitia kitufe cha "Hariri" kwenye muonekano wa takwimu.

source: New: Via the "New" link in the Statistics menu from the navigation bar, or the "Add" button from the Overview page.
ja: 新規:ナビゲーション・バーからの統計メニュー中の「新規」リンク、あるいは概要ページからの「追加」ボタン経由。
ru: Новый: Используя ссылку "Новый" в меню Статистика навигационной панели, или кнопку "Добавить" на странице Просмотр.
sw: Mpya: Kupitia kiungo "Mpya" kwenye menyu sa takwimu kutoka kwenye mwambaa wa uabiri, au kitufe cha "Ongeza" kutoka kwenye kurasa ya Mapitio.

source: The stats are edited with a wizard in four steps:
ja: 統計は4ステップのウイザードで編集されます:
ru: Статистика редактируется с помощью мастера в четыре этапа:
sw: Takwimu zina haririwa na sogora katika hatua nne:

source: General specifications.
ja: 一般的な仕様
ru: Общие технические условия.
sw: Ubainishaji wa jumla.

source: Definition of the element for the X-axis.
ja: X軸のための要素の定義
ru: Определение элементов для X-axis.
sw: Fasili ya elementi kwa ajili ya jira-X.

source: Specification of the value series.
ja: 値系列の仕様
ru: Спецификация значений ряда.
sw: Ubainishaji wa thamani za mfuatano.

source: Selecting the restrictions to limit the report.
ja: レポートを制限する(limit)ために制限(Restrictions)を選択
ru: Выбор ограничений для отчета.
sw: Kuchagua vizuizi kuweka kikomo kwenye ripoti.

source: Steps 2 through 4 are only needed for the generation of reports with dynamic stats. For a static stat, only the general information (point 1) is required.
ja: ステップ2から4は、動的統計を備えたレポートの生成にのみ必要とされます。静的統計のために単に一般情報(point 1)が必要です。
ru: Шаги с 2-4 необходимы только для создания отчетов с динамической статистикой. Для статической статистики требуется только общая информация (пункт 1).
sw: Hatua 2 kupitia 4 zinahitajika tu kwa uzalishaji wa ripoti zenye takwimu zinazobadilika. Kwa takwimu tuli, taarifa za ujumla tu (pointi 1) ndio zinahitajika.

source: Information about how to handle the page is provided on each of these screens, below the Actions panel in a Hints panel.
ja: ページを扱う方法に関する情報はヒント・パネル中のアクション・パネル以下にこれらの画面の各々の上で提供されます。
ru: Информация о том, как обрабатывать страницу приводится на каждом из этих экранов, ниже панели "Действия" панели Подсказок.
sw: Taarifa kuhusu jinsi ya kushughulikia ukurasa inatolewa katika kila skrini, chini ya paneli ya Vitendo katika paneli ya madokezo.

source: If incorrect inputs are entered, the previously processed user interface is displayed again and with information about the incorrect input. This information can be found in the OTRS notification section. The next input user interface is only displayed after the current form has been filled out correctly.
ja: 正しくない入力が入力される場合、以前に処理されたユーザ・インターフェースは再び表示れ、それから正しくない入力に関する情報が表示されます。この情報はOTRS通知セクションで見つけることができます。現在の形式が正確に記入された後のみ、次の入力ユーザ・インターフェースが表示されます。
ru: Если введены неправильные данные, предыдущий пользовательский интерфейс отображатеся заново, на этот раз уже с информацией о неправильных входных данных. Эта информация отображается в OTRS в разделе уведомлений. Следующий пользовательский веб-интерфейс для ввода отображатеся только в том случае, если все поля формы заполнены правильно.
sw: Kama maingizo yasiyo sahihi yameingizwa, kiolesura kilichopita kilichochakatishwa kitaonyeshwa tena na kitakuwa na taarifa kuhusu maingizo yasiyosahihi. Hii taarifa inaweza kupatikana katika kifungu cha taarifa cha OTRS. Kiolesura cha maingizo cha mtumiaji kinachofwata kinaonyeshwa tu baada ya fomu ya sasa kujazwa kwa usahihi.

source: <emphasis>General specifications</emphasis>. It is the first page of the Edit wizard (see Figure below).
ja: <emphasis>一般的な仕様</emphasis>。それは編集ウイザードの最初のページです(下記の図を参照)。
ru: <emphasis>Общие спецификации</emphasis>. Это первая страница мастера Редактирования (см. Рисунок ниже).
sw: <emphasis>Ubainishaji wa jumla</emphasis>. Ni kurasa ya kwanza ya Hariri sogora (ona Kielelezo chini).

source: General specifications
ja: 一般的な仕様
ru: Общие технические условия
sw: Ubainishaji wa jumla

source: <placeholder type="screeninfo" id="0"/> <graphic fileref="screenshots/stats-edit-general.png" scale="40" srccredit="stats-edit-general - Screenshot" />
ja: <placeholder type="screeninfo" id="0"/> <graphic fileref="screenshots/stats-edit-general.png" scale="40" srccredit="統計 - 編集 - 一般 - スクリーンショット" />

source: <emphasis>Figure: Editing the general specifications of a report.</emphasis>
ja: <emphasis>図:レポートの一般的な仕様の編集</emphasis>
ru: <emphasis>Рисунок: Редактирование общих спецификаций отчета.</emphasis>
sw: <emphasis>Kielelezo: Kuhariri ubainishaji wa jumla wa ripoti.</emphasis>

source: In the screen showed in Figure, there are a great number of common specifications and settings that can be edited:
ja: 図示した画面中で、編集することができる多くの共通の仕様および設定があります:
ru: На странице приведенной на Рисунке доступно большое количество общих спецификаций и настроек, которые можно редактировать:
sw: Kwenye skrini iliyoonyeshwa kwenye Kielelezo, kuna idadi kubwa ya vipimo na mipangilio ambayo inaweza kuhaririwa:

source: <emphasis>Title</emphasis>. Should reflect the stat's purpose in a concise manner.
ja: <emphasis>タイトル</emphasis>。簡潔なやり方でstatの目的を反映するべきです。
ru: <emphasis>Заголовок</emphasis>. Должны в сжатой форме отражать назначение (цель).
sw: <emphasis>Mada</emphasis>. Inatakiwa iakisi lengo la takwimu kwa ufupi..

source: <emphasis>Description</emphasis>. More descriptive information about the report definition, type of configuration parameters, etc.
ja: <emphasis>摘要</emphasis>。レポート定義、構成パラメータのタイプ等より多くの説明を含む情報。
ru: <emphasis>Описание</emphasis>. Более подробная информация об отчете, типах конфигурационных параметров и т.д.
sw: <emphasis>Maelezo</emphasis>. Maelezo zaidi ya taarifa kuhusu ufafanuzi wa ripoti, aina ya parameta za usanidi, na kadhalika.

source: <emphasis>Dynamic object</emphasis>. If the OTRS installation provides various dynamic objects, one of them can be chosen. The objects meet the requirements of the particular modules.
ja: <emphasis>動的オブジェクト</emphasis>。OTRSインストレーションが様々な動的オブジェクトを提供する場合、それらのうちの1つを選ぶことができます。オブジェクトは、特定のモジュールの必要条件を満たします。
ru: <emphasis>Динамический объект</emphasis>. Если установленная система OTRS предоставляет различные динамические объекты, один из них может быть выбран. Объекты отвечают требованиям отдельных модулей.
sw: <emphasis>KItu kinachobadilika</emphasis>. Kama usanikishaji wa OTRS utatoa vitu vinavyobadilika vingi, mojawapo inaweza kuchaguliwa. Hivi vitu vinafikia mahitaji ya moduli fulani.

source: <emphasis>Static file</emphasis>. Usually this selection is not shown, as only static files which are not yet assigned to any reports are displayed. If "Static file" is displayed, however, it is important to tick the option field and select a generation mode (dynamic with a dynamic object or static with a file). If a static file is selected, the input user interfaces 2 through 4 are not shown as the static file contains all required configuration settings.
ja: <emphasis>静的ファイル</emphasis>。通常はこの選択は表示されません。なぜならどのレポートにもまだ割り当てられていない単なる静的ファイルは まだ表示されないからです。しかしながら、「静的ファイル」が表示される場合、オプション・フィールドにチェックマークを付けるて、生成モード（動的オブジェクトまたはファイル付の静的オブジェクトで動的）を選択することは重要です。静的ファイルが選択されている場合、入力ユーザ・インターフェイス２から４は表示されません。静的ファイルはすべての必須の構成設定を含んでいないためです。
ru: <emphasis>Static file</emphasis>. Обычно эта возможность не отображается до тех пор, пока отображаются статические файлы, назначеные отчету. Если "Статический файл" отображается, позже, очень важно поставить галочку в поле и выбрать режим генерации (динамический с динамический объектом или статический с файлом). Если выбран статический файл, пользовательский веб-интерфейс 2-4 не отображается как статический файл содержащий все необходимые настройки.
sw: <emphasis>Faili tuli</emphasis>. Kwa kawaida chaguo hili halionyeshwi, kwakuwa mafaili tuli ambayo bado hayaja gawiwa kwa ripoti yoyote ndiyo yanayoonyeshwa tu. Hata hivyo kama "Faili tuli" limeonyeshwa, ni muhimu kuweka alama ya pata kwenye sehemu ya chaguo na kuchagua njia ya uzalishaji (inayobadilika na kitu kinachobadilika au tuli na faili). Kama faili tuli limechaguliwa, violesura vya maingizo 2 mpaka 4 havionyeshwi kwa kuwa faili tuli lina mipangilio yote inayotakiwa.

source: <emphasis>Permission settings</emphasis>. Facilitate a restriction of the groups (and therefore, agents) who can later view and generate the preconfigured reports. Thus the various reports can be allocated to the different departments and work groups who need them. It is possible to allocate one report to various groups.
ja: <emphasis>許可設定</emphasis>。グループ（担当者も）の制限を緩和して下さい。その担当者が事前定義のレポートを後で閲覧し生成できるように。このように様々なレポートを、それらを必要とする異なる部署やワークグループに割り付けることができます。
ru: <emphasis>Настройки прав доступа</emphasis>. Содействие ограничению групп (и, следовательно, агентов), которые позже могут просматривать и генерировать предварительные отчеты. Таким образом, различные отчеты могут быть выделена для различных отделов и рабочих групп, которые в них нуждаются. Можно выделить одину статистику для различных групп.
sw: <emphasis>Mipangilio ya ruhusa</emphasis>. Kuwezesha vizuizi vya makundi (na hivyo mawakala) ambao baadaye wanaweza kuona na kuzalisha ripoti zilizosanidiwa. Hivyo ripoti mbali mbali zinaweza kutengewa idara tofauti na makundi ya kazi yanazozihitaji. Inawezekana kutengea ripoti moja kwa makundi tofauti.

source: Example 1: The "stats" group was selected. The report is viewable for all users having at least ro rights for the "stats" group. This access is available by default.
ja: 例1:「統計」グループが選択されました。少なくとも「統計」グループのためのro権を持っているすべてのユーザは、そのレポートを見ることができます。この権限はデフォルトで利用可能です。
ru: Пример 1: Выбрана "stats" группа. Отчет доступен для просмотра для всех пользователей имеющих по крайней мере права на группу "stats . Этот доступ доступен по умолчанию.
sw: Mfano 1: Kundi la "takwimu" lilichaguliwa. Ripoti inaonekana kwa watumiaji wote wenye japo haki za kusoma tu kwenye kundi la "takwimu". Huu ufikivu upo kwa chaguo-msingi.

source: Example 2: A group named "sales" was selected. All users with ro rights for the "sales" group can see the stat in the view mode and generate it. However, the report will not be available for viewing by other users.
ja: 例2:「販売」という名のグループが選択されました。 「販売」グループのためのro権を持ったユーザは、みなビュー・モードでstatを見て、それを生成することができます。しかしながら、そのレポートは他のユーザよっとビューできません。
ru: Пример 2: Была выбрана группа под названием "продажи". Все пользователи, имеющие права ro (read only) к этой группе могут выдеть статистику в режиме просмотра э генерировать ее. Однако отчет не будет доступен для просмотра другим пользователям.
sw: Mfano 2: Kundi liitwalo "mauzo" lilichaguliwa. Watumiaji wenye haki ya kusoma tu ya kundi "mauzo" wanaweza kuona takwimu katika hali-tumizi ya muonekano na kuizalisha. Hata hivyo, ripoti haitakuwepo kwa ajili ya kuangaliwa na watumiaji wengine.

source: <emphasis>Format</emphasis>. Output format of the stat: Depending on the configuration, one or more of the following formats can be chosen:
ja: <emphasis>フォーマット</emphasis>。statの出力フォーマット:構成に依存しますが、ひとつのまたは複数の次のフォーマットを選択可能です。
ru: <emphasis>Формат</emphasis>. Формат отображения статистики. В зависимости от конфигурации, могут быть выбраны следующие один или несколько форматов:
sw: <emphasis>Umbizo</emphasis>. Umbizo la matokeo ya takwimu: Kutegemeana na usanidi, kati ya maumbizo yafuatayo yanaweza kuchaguliwa:

source: graph-lines.
ja: グラフ・線
sw: grafu-mistari.

source: graph-bars.
ja: グラフ・棒
sw: grafu-miambaa.

source: graph-hbars.
ja: グラフ・横棒
sw: grafu-miambaa h

source: graph-points.
ja: グラフ・点
sw: grafu-pointi.

source: graph-lines-points.
ja: グラフ・点。線
sw: grafu-mistari-pointi.

source: graph-area.
ja: グラフ・エリア
sw: grafu-eneo.

source: graph-pie.
ja: グラフ・パイ
sw: grafu-duara.

source: <emphasis>Graphsize</emphasis>. Select the chart size in pixels. This selection is only necessary if a graphical output format has been chosen under "Format". All graphic sizes that can generally be used are defined by the OTRS administrator in SysConfig. When configuring the report, the agent can pre-select all relevant formats.
ja: <emphasis>グラフ化</emphasis>。ピクセル中の図表サイズを選択します。グラフ式の出力フォーマットが「フォーマット」の下で選ばれている場合のみ、この選択は必要です。一般に使用することができるグラフィックのサイズはすべてSysConfigにOTRS管理者によって定義されています。レポートを構成する場合、担当者はあらかじめ適切なフォーマットをすべて選択することができます。
ru: <emphasis>Размер графика</emphasis>. Выберите размер диаграммы в пикселях. Этот выбор необходим только в том случае, если графический формат вывода был выбран в "Формат". Все графические размеры, которые можно использовать определяются в OTRS в SysConfig. При настройке отчета, агент может предварительно выбрать все соответствующие форматы.
sw: <emphasis>Ukubwawagrafu</emphasis>. Chagua ukubwa wa chati katika pikseli. Huu uchaguzi ni muhimu kama umbizo la matokeo ya mchoro limechaguliwa chini ya "Umbizo". Ukubwa wa aina zote wa grafu ambao unaweza kutumiwa kwa ujumla unafafanuliwa na msimamizi wa OTRS katika SysConfig. Wakati wa kusanidi ripoti, wakala anaweza kuchagua kabla ma umbizo yote yanayo husika.

source: <emphasis>Sum rows</emphasis>. Indicates whether the report is amended by a column, whose cells contain the sum of the respective row.
ja: <emphasis>行の合計</emphasis>。レポートが列(複数のセルが各行の合計を含んでいる)によって修正されるかどうかを示します。
ru: <emphasis>Количество строк</emphasis>. Указывает когда отчет заменяется колонкой, чьи ячейки содержат сумму соответствующих строк.
sw: <emphasis>Jumla safumlalo</emphasis>. Inaonyesha kama ripoti imerekebishwa kwa safuwima, ambamo seli zake zinatoa jumla ya safumlalo husika.

source: <emphasis>Sum columns</emphasis>. Indicates whether the report is amended by a row, whose cells contain the sum of the respective column.
ja: <emphasis>列の合計</emphasis>。レポートが行(複数のセルが各列の合計を含んでいる)によって修正されるかどうかを示します。
ru: <emphasis>Сумма столбцов</emphasis>. Указывает когда отчет заменяется строкой, чье ячейки содержат сумму соответствующих строк.
sw: <emphasis>Jumla safuwima</emphasis>. Inaonyesha kama ripoti imerekebishwa kwa safumlalo, ambamo seli zake zinatoa jumla ya safuwima husika.
