Repository: DSigmund/doc-admin
Catalog: i18n/doc-admin.*.po
Languages: ja, ru, sw

source: While matching ACLs if CustomerUserID parameter sent, the ACL mechanism will compare the defined ACLs using the supplied CustomerUserID to gather the CustomerUser details to fill the CustomerUser hash and it also overrides the Customer information in the Ticket hash for the Properties match. On the other hand this calculations are also made for the PropertiesDatabase part, but using the Ticket Customer as the basis to gather the data.
ja: ACLとマッチしている間に、CustomerUserIDパラメーターが送られると、ACLメカニズムは、CustomerUserハッシュを満たすCustomerUser詳細を集めるために、供給されたCustomerUserIDを使用して、定義されたACLを比較します。またそれは、プロパティ（特性）・マッチ用のチケット・ハッシュ中の顧客情報を無効に(override)します。この計算もPropertiesDatabase部分のためになされるが、その一方で、データを集めるために基礎としてチケット・顧客(the Ticket Customer)を使用しています。
ru: При проверке ACLs, если CustomerUserID параметр отправлен, механизм ACL сравнивает заданный ACL используя представленный CustomerUserID для сбора данных CustomerUser для заполнения CustomerUser hash, а также перекрывает информацию о клиенте в hash заявки для проверки в Properties. С другой стороны эти вычисления также используются в PropertiesDatabase разделе, но с использованием клиента заявки как основу для сбора данных.
sw: Wakati wa kufananisha ACL ikiwa parameta ya KitambulishoChaMtejaMtumiaji imetumwa, utaratibu wa ACL utafanananisha ACL zilizofafanuliwa kwa kutumia KitambulishoChaMtumiajiMteja kukusanya undani wa MtejaMtumiaji ili kujaza hash ya MtejaMtumiaji na pia inabadilisha taarifa za Mteja katika hash ya Tiketikwa ajili ya sifa kufanana. Kwa upande mwingine haya mahesabu pia yanafanywa kwa ajili ya upande wa SifaZaHifadhidata, lakini kwa kutumia Mteja wa Tiketi kama msingi wa kukusanya data.

source: Notice that in Customer Interface, the CustomerUserID is always sent with the current logged Customer User.
ja: 顧客・インターフェースでは、CustomerUserIDが現在の記録された顧客ユーザとともに常に送信されることに注目してください。
ru: Обратите внимание, что в Пользовательском Интерфейсе, CustomerUserID всегда отправляется с залогиненым Клиентом.
sw: Tambua kwamba katika Kiolesura cha Mteja, Kitambulisho cha MtejaMtumiaji kinatumwa mara zote na Mtumiaji Mteja aliye kwenye mfumo.

source: Be aware that in ticket search screens (AgentTicketSearch and CustomerTicketSearch) the only affected attributes by ACLs are the Dynamic Fields. This means that this screens you can not restrict any other attribute like ticket type, state, queue, etc.
ja: チケット検索画面(AgentTicketSearchとCustomerTicketSearch)では、ACLによって影響を受ける属性のみが動的フィールドであることにご留意下さい。チケット検索画面(AgentTicketSearchとCustomerTicketSearch)では、ACLによる影響を受けた数少ない属性が動的フィールドであることにご留意下さい。すなわち、この(検索)画面は、あなたがその他の属性を制限できないことを意味します。（例えばチケットタイプ、状態、キュー等）

source: Performance Tuning
ja: パフォーマンス・チューニング
ru: Настройка Производительности
sw: Kuboresha Utendaji

source: Presented below is a list of performance enhancing techniques for your OTRS installation, including configuration, coding, memory use, and more.
ja: 以下はOTRS導入のための強化テクニックのパフォーマンスのリストです。構成、コーディング、メモリー使用、その他を含みます。
ru: Ниже представлен перечень различных техник, которые можно использовать для получения максимально возможной производительности системы OTRS: настройка, кодирование, использование памяти и многое другое.
sw: Inayoonyeshwa chini ni orodha ya mbinu za kuboresha utendaji wa usakinishaji wako wa OTRS, ikijumuisha usanidi, uandikaji kanuni, matumizi ya kumbukumbu, na mengine.

source: There are several options for improving OTRS performance.
ja: OTRSのパフォーマンスを改善するいくつかのオプションがあります。
ru: Есть несколько возможных вариантов улучшения производительности OTRS.
sw: Kuna njia tofauti za kuboresha utendaji wa OTRS.

source: There are two backend modules for the ticket index:
ja: チケット・インデックス用の2つのバックエンド・モジュールがあります:
ru: Есть два типа хранилища информации для хранения индексов заявок:
sw: Kuna moduli mbili za mazingira ya nyuma ya kielelezo cha tiketi:

source: Using Kernel::System::Ticket::IndexAccelerator::RuntimeDB (default), generate each queue view on the fly from the ticket table. You will not have performance trouble until you have about 60,000 open tickets in your system.
ja: Kernel::System::Ticket::IndexAccelerator::RuntimeDB (default)を使うことで、チケット・テーブルから取り急ぎ見えるいくつかのキューを生成します。システム内で約60,000の対応中チケットを持つまではパフォーマンスに関するトラブルを抱えないでしょう。
ru: Kernel::System::Ticket::IndexAccelerator::RuntimeDB (по умолчанию), "на лету" генерирует из таблицы заявок шаблон просмотра для каждой очереди. Пока в системе не больше 60, 000 открытых заявок, проблем с производительностью не будет.
sw: Kwa kutumia Kernel::System::Ticket::IndexAccelerator::RuntimeDB (chaguo-msingi), zalisha kila muonekano moja kwa moja kutoka kwenye jedwali la tiketi. Hautakuwa na matatizo ya kiutendaji mpaka labda ukiwa na tiketi 60,000 zilizofunguliwa kwenye mfumo wako.

source: Kernel::System::Ticket::IndexAccelerator::StaticDB, the most powerful module, should be used when you have above 80,000 open tickets. It uses an extra ticket_index table, which works like a view. Use <filename>bin/otrs.RebuildTicketIndex.pl</filename> for generating an initial index build after switching backends.
ja: あなたが80,000以上の対応中チケットを持っている場合、Kernel::System::Ticket::IndexAccelerator::StaticDB(最も強力なモジュール)が使用されるべきです。それは余分なticket_indexテーブルを使用します。それはビューのように働きます。バックエンドを切り替えた後に最初のインデック作成を生成するために<filename>bin/otrs.RebuildTicketIndex.pl</filename>を使用してください。
ru: Kernel::System::Ticket::IndexAccelerator::StaticDB - один из самых мощных модулей, его следует использовать, когда у вас еть больше 80.000 открытых заявок. Он использует дополнительную таблицу ticket_index, которая работает как обычный шаблон. Используйте <filename>bin/otrs.RebuildTicketIndex.pl</filename> для получения начального индекса после создания хранилища информации.
sw: Kiini::Mfumo::Tiketi::KielezoKiharakishi::DBTuli, moduli yenye nguvu kushinda zote, inatakiwa kutumika wakati una tiketi zilizo wazi zaidi ya 80,000. Inatumia jedwali la ziada la tiketi_kielezo., ambayo inafanyakazi kama muonekano. Tumia <filename>bin/otrs.RebuildTicketIndex.pl</filename> kuzalisha kielezo kijenzi cha mwanzo baada ya kubadilisha mazingira ya nyuma.

source: You can change the IndexAccelerator via SysConfig.
ja: SysConfig経由でIndexAcceleratorを変更することができます。
ru: Вы можете изменить IndexAccelerator через SysConfig.
sw: Unaweza kubadilisha IndexAccelerator kupitia SysConfig.

source: TicketStorageModule
ja: TicketStorageModule（チケット・格納・モジュール）
sw: ModuliHifadhiTiketi

source: There are two different backend modules for the ticket/article storage:
ja: チケット・記事記憶装置用の2つの異なるバックエンド・モジュールがあります:
ru: Существует два различных хранилица для хранения заявок/статей:
sw: Kuna moduli mbili tofauti za mazingira ya nyuma ya uhifadhi wa tiketi/makala:

source: Configure Kernel::System::Ticket::ArticleStorageDB (default) to store attachments, etc., in the database. Note: Don't use it with large set ups.
ja: 付属などを格納するためにデータベースの中でKernel::System::Ticket::ArticleStorageDB(デフォルト)を形成してください。ノート:大きな組織でそれを使用しないでください。
ru: Задайте Kernel::System::Ticket::ArticleStorageDB (по умолчанию) для хранения вложений, и т.д. в базе данных. Примечание: Не используйте его для систем с большим объемом данных.
sw: Sanidi Kernel::System::Ticket::ArticleStorageDB (chaguo-msingi) kuhifadhi viambatanishi, na kadh., katika hifadhidata. Tambua: Usitumie na mipangilio mkubwa.

source: Pro: If your webserver user isn't the 'otrs' user, use this module to avoid file permission problems.
ja: 賛成意見:ウェブサーバー・ユーザが「otrs」ユーザでない場合は、ファイル許可問題を回避するためにこのモジュールを使用してください。
ru: Pro: Если пользователь вашего веб-сервера не является пользователем 'otrs', используйте этот модуль, чтобы избежать проблем с правами доступа.
sw: Faida: Kama mtumiaji wako wa seva ya tovuti siyo mtumiaji wa 'otrs', tumia hii moduli kuzuia matatizo ya ruhusa za faili.

source: Con: It is not advisable to store attachments in your database. Take care that your database is able to store large objects. E.g. Configure MySQL with "set-variable = max_allowed_packet=8M" to store 8 MB objects (the default is 2M).
ja: 反対意見:あなたのデータベースに添付ファイルをを格納することは望ましくありません。あなたのデータベースは大きなオブジェクトを格納できることに気を配って下さい。例えば8MBのオブジェクト(デフォルトは2MBです)を格納するために「set-variable = max_allowed_packet=8M」でMySQLを設定します。
ru: Противопоказания: Не совсем целесообразно хранить вложения в базе данных. Будьте осторожны, при храненении больших объектов. Настройте конфигурационный параметр MySQL "set-variable=max_allowed_packet=8M" для хранения объектов размером 8 MB (по умолчанию это 2M).
sw: Hasara: Haishauriwi kuhifadhi viambatanisho kwenye hifadhidata yako. Chukua tahadhari kwamba hifadhidata yako inaweza kuhifadhi vitu vikubwa. Mf. Sanidi MySQL na "set-variable = max_allowed_packet=8M" kuhifadhi vitu vyenye 8 MB (chaguo msingi ni 2M).

source: Configure Kernel::System::Ticket::ArticleStorageFS to store attachments etc. on the local file system. Note: Recommended for large setups.
ja: ローカルのファイルシステム上に添付ファイルなどを格納するためにKernel::System::Ticket::ArticleStorageFSを設定してください。
ru: Configure Kernel::System::Ticket::ArticleStorageFS для хранения вложений и т.д. в локальной файловой системе. Примечание: Рекомендовано при больших установках.
sw: Sanidi Kernel::System::Ticket::ArticleStorageFS kuhifadhi viambatanishi na kadh. katika mfumo wa faili wa ndani. Tambua: Inashauriwa kwa mipangilio mikubwa

source: Pro: It is fast!
ja: 賛成意見: 速いですね!
ru: Pro: Это быстро!
sw: Faida: Ni ya kasi!

source: Con: Your web server user should be the 'otrs' user. Also, if you have multiple front-end servers, you should make sure the filesystem is shared between the servers. Place it on an NFS share or preferably a SAN or similar solution.
ja: 反対意見:ウェブサーバ・ユーザは「otrs」ユーザであるべきです。さらに、多数のフロントエンドのサーバーを持つなら、、ファイルシステムがサーバー間で共有されることを確かめるべきです。NFS共有か可能ならSANかそれに類似のソリューションに置いて下さい。
ru: Противопоказания: Пользователь веб-сервера должен быть пользователем 'otrs'. Кроме того, если у вас есть несколько серверов, нужно убедиться в том, что файловая система разделяется между этими серверами. Так что разместите его на общедоступный NFS-ресурс или предпочтительнее SAN, или аналогичные решения.
sw: Hasara: Mtumiaji wako wa seva ya tovuti anatakiwa kuwa mtumiaji wa 'otrs'. Pia, kama una seva za mazingira ya mbele zaidi ya moja, unatakiwa kuhakikisha mfumo wa faili unatumiwa kwa pamoja kati ya seva. Iweke kwenye ushirika wa NFS au kwa mapendeleo zaidi SAN au inayofanania.

source: Note: you can switch from one back-end to the other on the fly. You can switch the backend in the SysConfig, and then run the command line utility <filename>otrs.ArticleStorageSwitch.pl</filename> to put the articles from the database onto the filesystem or the other way around. You can use the <emphasis>-s</emphasis> and <emphasis>-d</emphasis> options to specify the source and destination back-ends. Please note that the entire process can take considerable time to run, depending on the number of articles you have and the available CPU power and/or network capacity.
ja: 取り急ぎ1つのバックエンドから別のバックエンドまで切り替えることができます。SysConfigの中のバックエンドを切り替えて、次に、コマンドライン・ユーティリティ<filename>otrs.ArticleStorageSwitch.pl</filename>を実行することができます。データベースからファイルシステムに記事をputするためです。ソースとバックエンドの目的地を指定するために「<emphasis>-s</emphasis>」と「<emphasis>-d</emphasis>」オプションを使うことができます。全プロセスを実行するには相当な時間がかかることにご注意ください。それは保持している記事数と可能なCPUパワー及びあるいはネットワーク能力に依存します。
ru: Примечание: можно переключаться с одного бэк-енда на другой "на лету". Бэк-энды можно переключить в SysConfig и затем запустить в командной строке утилиту <filename>otrs.ArticleStorageSwitch.pl</filename>, чтобы внести статьи из базы данных в файловую систему и наоборот. Можно использовать опциии <emphasis>-s</emphasis> и <emphasis>-d</emphasis> для указания источника и конечного бэк-эенда. Обратите внимание, что весь процесс может занять много времени, в зависимости от количества статей/сообщений/заметок, которые у вас есть и доступной мощности процессора и/или пропускной способности сети.
sw: Kumbuka: unaweza kubadilisha kutoka aina moja ya mazingira ya nyuma kwenda mengine kwa haraka, Unaweza kubadilisha mazingira ya nyuma katika SysConfig, baada ya hapo anzisha zana ya tungo amri <filename>otrs.ArticleStorageSwitch.pl</filename> ili kuweka makala kutoka kwenye hifadhidata kwenda kwenye mfumo wa mafaili na kinyume chake. Unaweza kutumia machaguo <emphasis>-s</emphasis> na <emphasis>-d</emphasis> kuweka bayana chanzo na kifikio cha mazingira ya nyuma. Tafadhali tambua mchakato mzima unaweza kutumia muda mwingi kufanyika, kutegemeana na idadi ya makala ulizonazo na uwezo wa kitengo kikuu cha uchakataji na/au uwezo wa mtandao.

source: shell> bin/otrs.ArticleStorageSwitch.pl -s ArticleStorageDB -d ArticleStorageFS
ja: shell&gt; bin/otrs.ArticleStorageSwitch.pl -s ArticleStorageDB -d ArticleStorageFS

source: <emphasis>Script: Switching storage back-ends from database to filesystem.</emphasis>
ja: <emphasis>スクリプト:記憶バックエンドをデータベースからファイルシステムまで切り替えること。</emphasis>
ru: <emphasis>Сценарий Переключение хранилища данных с базы данных на файловую систему.</emphasis>
sw: <emphasis>Hati: Kubadilisha mazingira ya nyuma ya hifadhi kutoka hifadhidata kuwa mfumo wa mafaili</emphasis>

source: Archiving Tickets
ja: チケットのアーカイブに保管
ru: Архивирование Заявок
sw: Kuhifadhi Tiketi

source: As OTRS can be used as an audit-proof system, deleting closed tickets may not be a good idea. Therefore we implemented a feature that allows you to archive tickets.
ja: 監査に耐えうるシステムとしてOTRSを使うならば、完了したチケットを削除することはよい考えとはいえません。そのため我々はチケットをアーカイブすることができる機能を実装しました。
ru: Поскольку OTRS может использоваться в качестве системы аудита доказательств, то удаление закрытых заявко не очень хорошая идея. Именно по этому мы реализовали функцию архивирования заявок.
sw: Kwa kuwa OTRS inaweza kutumika kama mfumo wa kuzuia ukaguzi, kufuta tiketi zilizofungwa inaweza kuwa sio wazo zuri. Kwa hiyo tumetengeneza kipengele kinachokuruhusu kuhifadhi tiketi kwenye nyaraka.

source: Tickets that match certain criteria can be marked as "archived" These tickets are not accessed if you do a regular ticket search or run a Generic Agent job. The system itself does not have to deal with a huge amount of tickets any longer as only the "latest" tickets are taken into consideration when using OTRS. This can result in a huge performance gain on large systems.
ja: 監査に耐えうるシステムとしてOTRSを使うならば、完了したチケットを削除することはよい考えとはいえません。そのため我々はチケットをアーカイブすることができる機能を実装しました。ある基準とマッチするチケットは「アーカイブ済」としてマークすることができます。これらのチケットは、通常チケット検索、あるいは一般担当者ジョブを実行してもアクセスできません。OTRSを使う時は、「最新の」チケットのみを考慮に入れればよいのでシステムそれ自身は、もはや巨大な量のチケットを取り扱う必要はありません。これにより巨大なシステムでの巨大なパフォーマンスの利得が生まれることとなります。
ru: Заявки, которые удовлетворяют определенным критериям, могут быть отмечены как "архивированные". При обычном поиске заявок или при поиске заявок с помощью задания Generic Agent, они будут недоступны. Сама собой система не будет иметь дела с огромным количеством заявок, до тех пор, пока не понадобится обратиться к "очень старой" заявке. Это приводит к огромному приросту производительности на больших системах.
sw: Tiketi zinazofanana na vigezo fulani zinaweza kuwekewa alama kama "zilizo kwenye nyaraka". Hizi tiketi haziwezi kupatikana kama ukifanya utafutaji tiketi wa kawaida au kuanzisha kazi ya Wakala wa Ujumla. Mfumo wenyewe hautahangaika na idadi kubwa yatiketi tena kwa sababu tiketi za hivi karibuni tu ndio zinatiliwa maanani na OTRS. Hii inaweza kuleta ufanisi mkubwa katika mifumo mikubwa.

source: To use the archive feature simply follow these steps:
ja: アーカイブ機能を使用するには次のステップに従います:
ru: Для использования функции архивации выполните следующие действия:
sw: Kutumia kipengele cha nyaraka fuata hatua zifuatazo kirahisi:

source: Activate the archive system in SysConfig
ja: SysConfigのアーカイブシステムを活性化します。
ru: Включение архивирование системы в SysConfig
sw: Amilisha mfumo wa nyaraka katika SysConfig

source: In the Admin page, go to SysConfig and select the group <literal>Ticket</literal>. In <literal>Core::Ticket</literal> you find the option <literal>Ticket::ArchiveSystem</literal> which is set to "no" by default. Change this setting to "yes" and save this change.
ja: 管理者ページで、SysConfigに行って、グループ・<literal>チケット</literal>を選択してください。<literal>Core::Ticket</literal>では、デフォルトで「no」にセットされるオプション<literal>Ticket::ArchiveSystem</literal>を見つけます。この設定を「yes」に変更し変更を保存します。
ru: В Панели Администрирования перейдите в SysConfig и выберите группу <literal>Заявка</literal>. В <literal>Core::Ticket</literal> найдите опцию <literal>Ticket::ArchiveSystem</literal>, по умолчанию установленную в значение "нет". Измените значение этой настройки на "да" и сохраните изменения.
sw: Katika kurasa ya msimamizi, nenda kwenye AysConfig na chagua <literal>Tiketi</literal> ya kundi hilo. Katika <literal>Kiini::Tiketi</literal> unakuta chaguo <literal>Tiketi::MfumoNyaraka</literal> ambao umesetiwa kuwa "hapana" kwa chaguo-msingi. Badilisha mpangilio huu kuwa "ndiyo" na hifadhi mabadiliko.

source: Define a GenericAgent job
ja: GenericAgentジョブを定義する
ru: Определение работы GenericAgent
sw: Fafanua kazi ya WakalaWaJumla

source: Job Settings
ja: ジョブ設定
ru: Настройки Задания
sw: Mpangilio wa kazi

source: Provide a name for the archiving job, and select proper options to schedule this job.
ja: アーカイブに保管するジョブの名前を与え、この仕事を予定する適切なオプションを選択してください。
ru: Введите имя для работы архивирования, и выберите надлежащие опции для планирования этой работы.
sw: Toa jina kwa

source: Ticket Filter
ja: チケット・フィルタ
sw: Chujio la Tiketi

source: The ticket filter is searches for tickets that match the selected criteria. It might be a good idea to only archive those tickets in a closed state that have been closed a few months before.
ja: チケット・フィルタは選択された基準と一致するチケット検索です。完了した状態（数か月前に完了したた）のチケットのみをアーカイブするのは良い考えです。
ru: Фильтр заявок производит поиск заявок, которые отвечают выбраным критериям. Хорошей идеей будет заархивировать закрытые заявки, которые были закрыты за несколько месяцев до этого.
sw: Vichujio vya tiketi vinatafuta tiketi ambazo zinafanana na kigezo kilichochaguliwa. Inaweza kuwa wazo zuri kuweka kwenye nyaraka zile tiketi zilizo kwenye hali iliyofungwa na zimefungwa miezi michache nyuma.

source: Ticket Action
ja: チケット・アクション
ru: Действия над заявками
sw: Kitendo cha Tiketi

source: In this section, set the field labeled "Archive selected tickets" to "archive tickets".
ja: このセクションでは、「選択したチケットをアーカイブ」「チケットをアーカイブ」とラベルしたフィールドをセットしてください。
ru: В этой части установите поле "Архивировать выбранные заявки" в "архив заявок".
sw: Katika kifungu hiki, seti sehemu yenye lebo"Hifadhi kwenye Nyaraka tiketi zilizochaguliwa" kuwa "hifadhi tiketi kwenye nyaraka".

source: Save the job
ja: 仕事を保存する
ru: Сохранить работу
sw: Hifadhi kazi

source: At the end of the page you will find an option to save the job.
ja: ページの終わりに、仕事を保存するオプションを見つけるでしょう。
ru: В конце страницы у вас будет возможность сохранить работу (задание).
sw: Mwisho wa kurasa utapata chaguo la kuhifadhi kazi.

source: Affected tickets
ja: 影響を受けたチケット
ru: Обработанные заявки
sw: Tiketi zilizoathirika.

source: The system will display all tickets which will be archived when executing the Generic Agent job.
ja: システムは、一般担当者のジョブを実行する時にアーカイブされる全てのチケットを表示します。
ru: Система отобразит все заявки, которые будут заархивированы при выполнении задания Generic Agent-ом.
sw: Mfumo utaonyesha tiketi zote zitakazohifadhiwa kwenye nyaraka wakati wa kutekeleza kazi ya Wakala wa Ujumla.

source: On the Admin page, select GenericAgent and add a new job there. <placeholder type="orderedlist" id="0"/>
ja: 管理者ページでGenericAgentを選択し新規ジョブをそこへ追加します。<placeholder type="orderedlist" id="0"/>
ru: В Панели Администратора выберите GenericAgent и добавьте новое задание (работу). <placeholder type="orderedlist" id="0"/>
sw: Kwenye kurasa ya Msimamizi, chagua WakalaUjumla na ongeza kazi mpya hapo. <placeholder type="orderedlist" id="0"/>

source: Ticket Search
ja: チケット検索
ru: Поиск Заявок
sw: Tafuta Tiketi

source: When you search for tickets, the system default is to search tickets which are not archived. If you want to search through archived tickets also, simply add "archive search" while defining search criteria.
ja: チケットを検索する場合、システムはデフォルトでアーカイブに保管されないチケットを探索します。さらにアーカイブに保管されたチケットを捜したい場合は、検索基準を定義する時に単に「archive search」を加えてください。
ru: При поиске заявок, система по умолчанию производит поиск среди не архивированных заявок. Установите критерий поиска "поиск в архивах", если нужно чтобы поиск происходил также и в архивированых заявках.
sw: Ukitafuta tiketi, mfumo kwa kawaida unatafuta tiketi zisizo kwenye nyaraka. Kama ukitaka kutafuta tiketi za kwenye nyaraka pia, ongeza kirahisi "tafuta nyaraka" wakati wa kufafanua vigezo vya kutafuta.

source: Database
ja: データベース
ru: База данных
sw: Hifadhidata

source: DB issues vary by the database being used. Study the documentation for your database or check with your database administrator.
ja: DB発行は使用されているデータベースによって変わります。データベース管理者とデータベースかチェックのためのドキュメンテーションを研究してください。
ru: Решения зависят от используемой базы данных. Изучайте документацию к используемой базе данных или же обратитесь за помощью к администратору.
sw: Masula ya DB yanategemeanan na hifadhidata inayotumika. Jifunze kupitia nyaraka za hifadhidata yako au onana na msimamizi wa hifadhidata yako.

source: If you use the MySQL table type MyISAM (which is the default), and have deleted a large part of a table or if you have made many changes to a table with variable-length rows (tables that have VARCHAR, BLOB or TEXT columns), you must defragment the datafile (tables) with the "optimize" command.
ja: MySQLテーブル・タイプMyISAM(デフォルトです)を使用し、テーブルの大部分を削除したならば、あるいは可変長列(VARCHAR、BLOBあるいはTEXTカラムがあるテーブル)でテーブルに多くの変更を加えていれば、「optimize（最適化）」コマンドでデータ・ファイル(テーブル)をフラグメンテーション解消しなければいけません。
ru: Если для MySQL-таблиц используется MyISAM (а по умолчанию так и есть) и из таблицы была удалена большая часть данных, или же производилось множество действий над таблицей, которая содержит строки переменной длины (таблицы, которые содержат поля типов VARCHAR, BLOB или TEXT), то нужно дефрагментировать файл (таблицу), или другими словами выполнить команду "оптимизировать".
sw: Kama ukitumia jedwali la MySQL la aina MyISAM (ambalo ni chaguo-msingi), na ukafuta sehemu kubwa ya jedwali au kama umefanya mabadiliko mengi kwenye jedwali yenye safu mlalo zenye urefu unaobadilika (majedwali yenye safuwima VARCHAR, BLOB na NAKALA), lazima uunganishe vipande vya faili la data (majedwali) kwa kutumia amri "sadifisha"

source: You should try this if the mysqld daemon needs a lot of your CPU time. Optimize the tables - ticket, ticket_history and article (see Script below).
ja: mysqldデーモンがCPU時間の多くを必要とする場合、テーブルの最適化を試みるべきです。- チケット、ticket_historyおよび記事(下記のスクリプトを参照)。
ru: Нужно попытаться сделать это, если сервер mysqld использует много процессорного времени. Оптимизация таблиц ticket_history и article (см Сценарий ниже).
sw: Unatakiwa kujaribu hili kama mysqld daemon inahitaji sana kutoka kwenye muda wako wa CPU. Sadifisha majedwali - tiketi, tiketi_historia na makala (ona Hati chini).

source: <emphasis>Script: Optimizing data base tables.</emphasis>
ja: <emphasis>スクリプト:データ・ベース・テーブルの最適化。</emphasis>
ru: <emphasis>Сценарий: Оптимизация таблиц базы данных.</emphasis>
sw: <emphasis>Hati: Kuongeza ufanisi wa majedwali msingi ya data.</emphasis>

source: PostgreSQL is best tuned by modifying the postgresql.conf file in your PostgreSQL data directory. For advice on how to do this, reference the following articles:
ja: PostgreSQLは、PostgreSQLデータディレクトリのpostgresql.confファイルの修正により最適化されます。これをする方法についてのアドバイスについては、次の記事を参考文献としてください:
ru: PostgreSQL лучше настраивается путем изменений в файле postgresql.conf который находится в директории с установленным PostgreSQL. За советом, как это сделать, обратитесь к следующим статьям:
sw: PostgreSQL inaboreshwa vizuri kwa kubadilisha faili postgresql.conf katika mpangilio orodha wako wa data wa PostgreSQL . Kwa ushauri wa jinsi ya kufanya hii, rejea kwenye makala zifuatazo:
