Repository: DSigmund/doc-admin
Catalog: i18n/doc-admin.*.po
Languages: ja, ru, sw

source: Tickets in My Queues
ja: 自身のキューにあるチケット
ru: Заявки в моих очередях
sw: Tiketi kwenye Foleni Yangu

source: The tickets that are on queues where the agent define as "My Queues".
ja: このチケットは担当者が「マイ・キュー」として定義するキューにあります。
ru: Заявки в очередях, которые для агента заданы как "Мои очереди".
sw: Tiketi ambazo zipo kwenye foleni ambazo wakala amefafanua kama "Foleni Zangu".

source: All Tickets
ja: 全てのチケット
ru: Все Заявки
sw: Tiketi zote

source: All the tickets where the agent has access.
ja: 担当者がアクセス権を持つ全てのチケット
ru: Все заявки доступные агенту.
sw: Tiketi zote ambazo wakala ana ufikivu.

source: This widgets are:
ja: このウィジェットは：
ru: Эти виджеты:
sw: Vifaa hivi ni:

source: Reminder Tickets
ja: リマインダ・チケット
ru: Заявки с напоминанием
sw: Tiketi za kumbukumbu

source: Tickets that are set as pending and the reminder date has been reach.
ja: 保留として設定され、かつ、リマインダ日を経過したチケット。
ru: Отложенные заявки, у которых назначенная дата напоминания наступила.
sw: Tiketi zilizosetiwa kama zinazosubiri na tarehe ya kikumbusho imefikiwa.

source: Escalated Tickets
ja: エスカレーションされたチケット
ru: Эскалированные заявки
sw: Tiketi zilizopandishwa

source: Tickets that are escalated.
ja: エスカレーション済のチケット
ru: Эскалированные заявки
sw: Tiketi zilizopandishwa

source: New Tickets
ja: 新規チケット
ru: Новые Заявки
sw: Tiketi Mpya

source: Tickets that have state "New".
ja: 状態「新規」を持つチケット
ru: Заявки имеющие состояние "Новая/New".
sw: Tiketi zenye hali "Mpya".

source: Open Tickets / Need to be answered
ja: 対応中チケット / 返答必要
ru: Открытые Заявки / Ожидают ответа
sw: Tiketi Wazi / Zinahitaji kujibiwa

source: Tickets that have state "Open" and are ready for work with them.
ja: 状態「対応中」を持つチケットとそれらを対応する準備
ru: Заявки в состоянии "Открыта" и готовы для работы с ними.
sw: Tiketi zenye hali "Wazi" na ziko tayari kufanya nazo kazi.

source: Events Ticket Calendar
ja: イベント・チケット・カレンダー
ru: Календарь событий по заявкам
sw: Matukio Tiketi Kalenda

source: A calendar event (for this widget) is defined when a new ticket is created, the Events Ticket Calendar feature has to be enabled, and it requires two new fields to be displayed in ticket creation screens, one for the event start time and the other one for the end time, this times determine the duration of the event.
ja: カレンダ・イベントは新規チケットが作成された時、イベント・チケット・カレンダ機能が有効になります。それはチケット作成画面に表示する２つの新規フィールドを必要とし、ひとつはイベント開始時刻、他方は終了時刻用です。この２つの時刻がイベント期間を決定します。定義されます。
ru: Событие календаря (для этого виджета)задается при создании новой заявки. Функция Календарь событий для заявок должна быть включена и требуется наличие двух новых полей на экране создания заявки, одно для времени начала и второе для времени окончания события. Эти значения определяют длительность события.
sw: Tukio la kalenda (kwa kifaa hiki) linafafanuliwa pale tiketi mpya inatengenezwa, kipengele cha Matukio Tiketi Kalenda inabidi kiwezeshwe, na kinahitaji sehemu mpya mbili kuonyeshwa kwenye skrini za kutengeneza tiketi, moja kwa ajili ya muda wa kuanza tukio la tiketi na nyingine kwa ajili ya muda wa kumaliza, hii mida inaelezea muda unaotumiwa na tukio.

source: This widget includes the following views: month, week and day, agents can scroll thru the pages by using the right and left arrows.
ja: このウィジェットは次のビューを含みます：月、週、日、及び左右の矢印を使用することでページからスクロールできる担当者です。
ru: Виджет может отображаться в следующих представлениях: месяц, неделя и день, и агент может может передвигаться по шкале времени, используя стрелки вправо и влево.
sw: Hiki kifaa kina muonekanao ufwatao: mwezi, wiki na siku, mawakala wanaweza kubiringiza kwenye kurasa kwa kutumia vishale vya kushoto na kulia.

source: As mentioned before just enabling the widget is not enough, a couple of "Date/Time" dynamic fields for tickets should be added into the system (via Dynamic Fields link in "Admin" panel) and set them up in the SysConfig for this widget, both Dynamic Fields should be configured to be displayed on the ticket creation screens, they should be filled during ticket creation or any other ticket action screen (e.g. Free Fields) to describe the time frame for the calendar event (start and end time), the ticket zoom screen might be configured to show this dynamic fields also, in case you consider it necessary.
ja: 直前にウィジェットは十分に有効になっていないと述べたようにチケット用の「Date/Time」の動的フィールドのいくつかはシステムに追加し、（管理者パネルにある動的フィールドリンク経由で）それらをこのウィジェットのためにSysConfigで設定すべきです。両方の動的フィールドはチケット生成画面に表示されるように構成されるべきです。それらは、カレンダのイベント（開始及び終了時間）用の時間枠について記述するために、チケット生成あるいは他のチケット・アクション画面(例えば自由フィールド)中に満たされるべきです。チケット・ズーム画面は、それが必要であると考えた場合、動的フィールドも示すように構成されるかもしれません。
ru: Как было отмечено ранее, только включения виджета - недостаточно. В систему должна быть добавлена пара динамических полей "Дата/Время" (используйте для этого панель настройки динамических полей в Панели Администратора) и указать их в настройках виджета в SysConfig. Оба поля должны быть указаны для отображения на зкранах создания заявок, заполнены при создании заявки или при другом действии, позволяющем обновить эти значения (например, в пункте меню заявки - Свободные/Дополнительные поля) для описания временного интервала для события календаря (время начала и окончания). Можно задать отображение этих полей на экране просмотра заявки/TicketZoom для контроля, если сочтете это необходимым.
sw: Kama ilivyosemwa kabla kulemaza tuu vifaa haitoshi, baadhi ya sehemu zinazobadilika za "Tarehe/Muda" kwa ajili ya tiketi inabidi ziongezwe kwenye mfumo (kupitia kiungo cha Sehemu Zinazobadilika katika paneli ya "Msimamizi") na kuziseti katika SysConfig kwa ajili ya hiki kifaa, Sehemu Zinazobadilika zote mbili lazima zisanidiwe ili zionyeshwe katika skrini za kutengeneza tiketi, zinatakiwa zijazwe wakati wa kutengeneza tiketi au katika skrini ya vitendo nyingine yoyote (mf. Sehemu Huru) kuelezea itakaochukua muda wa tukio la kalenda (muda wa kuanza na kumaliza), skrini ya kuza tiketi inaweza kusanidiwa kuonyesha hii sehemu inayobadilika pia, kama ukiifikiria kama muhimu.

source: Events Ticket Calendar widget
ja: イベント・チケット・カレンダー・ウィジェット
ru: Виджет "Календарь событий по заявкам"
sw: Kifaa cha Matukio ya Kalenda ya Tiketi

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="Footer" scale="40" fileref="screenshots/events-ticket-calendar.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="フッター" scale="40" fileref="screenshots/events-ticket-calendar.png"></graphic>

source: Further configurations for this widget could be found under the "Frontend::Agent::Dashboard::EventsTicketCalendar" SubGroup in the SysConfig:
ja: このウィジェットのためのさらなる構成は、SysConfig中の"Frontend::Agent::Dashboard::EventsTicketCalendar" サブグループの下で見つけられるかもしれません。
ru: Дальнейшие настройки для этого виджета можно найти в подгруппе "Frontend::Agent::Dashboard::EventsTicketCalendar" в SysConfig:
sw: Zaidi usanidi wa hiki kifaa unaweza kupatikana chini ya "Mazingirayambele::Wakala::Dashibodi::MatukioTiketiKalenda" KundiDogo katika SysConfig:

source: CalendarWidth
ja: カレンダー幅
ru: Ширина Календаря
sw: UpanaWaKalenda

source: Defines the calendar width in percent. Default is 95%.
ja: カレンダの幅をパーセントで定義します。デフォルトは95%です。
ru: Задает ширину фрейма для Календаря в процентах. Стандартно - 95%.
sw: Inafafanua upana wa kalenda kwa asilimia. Chaguo-msingi ni 95%.

source: Defines dynamic field name for start time.
ja: 開始時間の動的フィールド名を定義します。
ru: Задает динамическое поля для времени начала.
sw: Inafafanua jina la sehemu inayobadilika kwa ajili ya muda wa kuanza.

source: Defines dynamic field name for end time.
ja: 終了時間の動的フィールド名を定義します。
ru: Задает динамическое поля для времени окончания.
sw: Inafafanua jina la sehemu inayobadilika kwa ajili ya muda wa kumaliza.

source: Only the tickets on the queues specified in this setting will be considered in the calendar view.
ja: この設定で明記されたキュー上のチケットのみが、カレンダ・ビューで検討されます。
ru: Заявки только заданных в этом параметре очередей будут показаны в календаре.
sw: Tiketi za kwenye foleni zilizobainishwa kwenye huu mpangilio tu ndiyo zitawekwa maanani kwenye muonekano wa kalenda.

source: Defines the dynamic fields that will be displayed in the calendar event overlay windows.
ja: カレンダ・イベント・オーバーレイ画面に表示する動的フィールドを定義します。
ru: Задает динамические поля, отображаемые во всплывающем окне календаря. При наведении мыши на заявку.
sw: Inafafanua sehemu zinazobadilika ambazo zitaonyeshwa katika madirisha ya kufunika ya kalenda ya matukio.

source: Defines the ticket attributes that will be displayed in the calendar event overlay windows.
ja: カレンダ・イベント・オーバーレイ画面に表示するチケット属性を定義します。
ru: Задает атрибуты заявки, отображаемые во всплывающем окне календаря. При наведении мыши на заявку.
sw: Inafafanua sifa za tiketi ambazo zitaonyeshwa katika jalada la windows la tukio la kalenda.

source: Ticket Queue Overview
ja: チケット・キュー・外観
ru: Итоги по очередям
sw: Mapitio ya Foleni ya Tiketi

source: This widget shows in a ticket count matrix where the rows represents queues and the columns represents the ticket states, then on each cell the number of tickets on a defined state that belongs on a particular queue is displayed.
ja: このウィジェットは行がキューを表し列がチケット状態を表しているチケット・カウント・マトリックスの中で表示します。各セルには、特定のキュー上に属する定義された状態上のチケット数が表示されます。
ru: Этот виджет отображает итоги по очередям в виде матрицы, в которой строки показывают итоги в очереди, а столбцы состояние заявок, т.е каждая ячейка таблицы содержит количество заявок определенного состояния, принадлежащих конкретной очереди.
sw: Hiki kifaa kinaonyesha katika matriki ya idadi ya tiketi wapi safu mlalo zinawakilisha foleni na safuwima zinawakilisha hali za tiketi, kisha katika kila seli idadi ya tiketi katika hali iliyofafanuliwa ambayo ni ya foleni fulani imeonyeshwa.

source: The widget also shows a Totals row and a Totals column, the Totals row shows the sum of the tickets for each state on all presented queues, while the Totals column represent the sum of the tickets for each queue on all presented states.
ja: ウィジェットは、集計行および集計列も表示します。集計行は、すべての示されたキュー上の各状態のチケットの合計を表します。一方、集計列はすべての示された状態上で各キューのチケットの合計を表します。
ru: Виджет также показывает итоги по строкам и столбцам, где итоги по колонке это сумма заявок каждого состояния во всех очередях, тогда как итог по строке показывает сумму всех заявок в каждой очереди всех представленных в таблице состояний.
sw: Kifaa pia kinaonyesha Jumla ya safumlalo na Jumla ya safuwima, Jumla ya safumlalo inaonyesha jumla ya tiketi kwa kila hali kwenye foleni zote zilizoonyeshwa, wakati Jumla ya safuwima inawakilisha jumla ya tiketi kwa kila foleni kwenye foleni zote zilizoonyeshwa.

source: The queues and states that are presented can be changed via Sysconfig.
ja: 表示されるキューと状態はSysConfigで変更することができます
ru: Перечень отображаемых в таблице состояний и очередей может быть изменен в Sysconfig.
sw: Foleni na hali ambazo zimeonyeshwa zinaweza kubadilishwa kupitia Sysconfig.

source: By clicking any of the ticket count numbers a ticket search results page will opened letting agents to have a more detailed overview of them.
ja: チケット・カウント数のどれかをクリックすると検索結果ページが開き、担当者にそれらのより詳細な概要を得させます。
ru: Нажимая мышко по конкретному значению в ячейке таблицы можно быстро перейти к списку заявок, составивших это значение для более детального просмотра агентом.
sw: Kwa kubofya kwenye yoyote kati ya nambari ya idadi ya tiketi ukurasa wa matokeo ya utafutaji watiketi yatafunguliwa kuwezesha mawakala kuwa kuona undani wake zaidi .

source: In the right column is located an special widget that allow you to control the widgets you want to show or hide, This is the Settings widget. Click on it's header to expand the section and see all available widgets, as shown in Figure. Each widget name has a checkbox, Use this checkboxes to define the visibility of the widgets in the dashboard (unchecked widgets will not be shown) after you define the visibility options and click on 'Save' for storing your changes. This section is fixed on the screen, this means you can't drag and drop it, or close it.
ja: 右列に特別なウィジェットが位置しており、非表示あるいは表示したいウィジェットをコントロールすることができます。これがウィジェットの設定です。セクションを拡張するヘッダをクリックします。すると下図のように全ての利用可能なウィジェットが見えます。各ウィジェット名にはチェックボックがあり、ダッシュボードでのウィジェットの可視性を定義するためにこのチェックボックスを使用します（チェックが外れているウィジェットは表示されません）。可視性オプションを定義したら、変更を格納するために「保存」をクリックします。このセクションはスクリーンに固定されるので、それをドラッグ＆ドロップができないし閉じることもできないということです。
ru: С правой стороны расположен специальный виджет, позволяющий управлять отображением виджетов на экране Дайджеста. Это виджет "Параметры". Кликните по заголовку для его открытия и вы увидите список доступных виджетов, как показано на рисунке. Каждый виджет имеет область для пометки/checkbox, используйте их для пометки нужных для отображения виджетов (не помеченные виджеты не отображаются), после чего нажмите кнопку "Сохранить настройки" для сохранения изменений. Этот виджет навсегда зафиксированина экране и его нельзя закрыть.
sw: Kwenye safuwima ya kulia kuna kifaa maalumu kinachokuruhusu kudhibiti vifaa unavyotaka kuonyesha au kuficha, Hiki ni kifaa cha Mipangilio. Bofya kwenye kichwa chake kupanua kifungu na kuona vifaa vyote vinavyopatikana, kama ilivyoonyeshwa kwenye Kielelezo. Kila jina la kifaa lina kisanduku tiki, Tumia hiki kisanduku tiki kufafanua muonekano wa vifaa katika dashibodi (vifaa visivyotikiwa havitaonyeshwa) baada ya kufafanua machaguo ya muonekano na kubofya "Hifadhi" kuhifadhi mabadiliko. Hiki kifungu kimefungwa sehemu moja katika skrini, hii inamaanisha huwezi kukikokota na kukiweka sehemu nyingine, au kukifunga.

source: Edit the Dashboard settings
ja: ダッシュボード設定の編集
ru: Изменение настроек Панели Управления
sw: Hariri mipangilio ya dashibodi

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="Dashboard settings" scale="40" fileref="screenshots/edit-settings.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="ダッシュボード設定" scale="40" fileref="screenshots/edit-settings.png"></graphic>

source: <emphasis>Figure: Dashboard Settings.</emphasis>
ja: <emphasis>図：ダッシュボード設定の編集</emphasis>
ru: <emphasis>Рисунок: Настройки Панели Управления.</emphasis>
sw: <emphasis>Kielelezo: Mipangilio ya Dashibodi.</emphasis>

source: Right column dashboard widgets.
ja: 右列ダッシュボード・ウィジェット
ru: Виджеты правой стороны Дайджеста.
sw: Vifaa vya dashibodi ya safuwima ya kulia.

source: 7 Day Stats
ja: 7日統計
ru: Статистика за неделю (7 дней)
sw: Takwimu za siku 7

source: It shows a graph of ticket activity over the past 7 days that includes 2 lines. One that is usually blue color, represents the amount of created tickets per day and the second one, usually orange and represents the closed tickets per day.
ja: それは、2行のラインを含んでいる過去7日にわたるチケット活動のグラフを示します。通常青い色である第１行は、日次作成チケット数を表示し、通常オレンジ色の第２行は日次完了チケットを表示します。
ru: Он показывает график активности по заявкам за прошедшие 7 дней и отображает 2 линии. Одна, синего цвета показывает количество вновь созданных заявок в день и вторя, обычно оранжевая, количество закрытых заявок в день.
sw: Inaonyesha grafu ya shughuli za tiketi kwa siku 7 zilizopita ambayo inajumuisha mistari 2. Mmoja ambao kwa kawaida ni rangi ya bluu, unawakilisha idadi ya tiketi zilizotengenezwa kwa siku na ya pili, kwa kawaida rangi ya machungwa na unawakilisha tiketi zilizofungwa kwa siku.

source: Upcoming Events
ja: 次回のイベント
ru: Предстоящие события
sw: Matukio Yajayo

source: Tickets on short for escalating or already escalated are listed here, info from this widget is very helpful since you have the chance to know about tickets needs your attention and you can decide in which ones you want to focus your effort on, set priorities or simply check what's coming on.
ja: エスカレーションするためあるいは既にエスカレーションされた至急のチケットはここにリストされます。このウィジェットからの情報は大変役立ちます。なぜなら、注意喚起する必要のあるチケットを知る機会を持つからです。そうしてどのチケットに労力を傾注したいのか、優先度を置きたいのか、単に次の予定をチェックするのか、を決定することができます。
ru: Здесь перечисляются заявки подлежащие эскалации или уже эскалированные. Информация этого виджета очень полезна, чтобы решить, какие заявки требуют вашего внимания или просто контроллировать что должно произойти.
sw: Tiketi kwa ajili ya kupandishwa au tayari zilizopandishwa zinaorodheshwa hapa, taarifa kutoka kwenye hiki kifaa ni ya muhimu sana kwa kuwa una nafasi ya kujua kuhusu tiketi inahitaji umakini wako na unaweza kuamua ni zipi unataka kuweka bidii yako, seti vipaumbele au angalia kirahisi kinachokuja.

source: OTRS News
ja: OTRSニュース
ru: Новости OTRS
sw: OTRS Habari

source: A complete list about OTRS activities and so important information about new product releases or patches.
ja: OTRSアクティビティの完全なリストと新製品のリリースやパッチに関する大変重要な情報
ru: Полный список событий в компании OTRS, а также информация о новых релизах продуктов или заплатках.
sw: Orodha kamili ya shughuli za OTRS na taarifa muhimu kuhusu matoleo mapya ya bidhaa au viraka.

source: Online
ja: オンライン
ru: Онлайн
sw: Mtandaoni

source: Here is showed a summary about the current agents logged the system, it also includes a section for customers on-line, please notice this widget is normally hidden, it can be shown using Settings widget described before.
ja: ここで、現在システムにログインしている担当者に関する要約が示されます。さらにそれは、オンラインの顧客用セクションを含んでいます。このウィジェットは通常非表示であることに注目してください。それは前述の設定ウィジェットを使用して表示することができます。
ru: Здесь отображается сводка об агентах вошедших в систему, он также включает и секцию о клиентах on-line, обычно, эти виджеты скрыты, их можно включить используя виджет "Параметры" описанный выше.
sw: Hapa ni ufupisho ulioonyeshwa kuhusu mawakala walioingia kwenye mfumo kwa sasa, pia inajumuisha kifungu cha wateja walio mtandaoni, tafadhali tambua hiki kifaa kinafichwa kwa kawaida, kinaweza kuonyeshwa kwa kutumia kifaa cha Mipangilio kilichoelezewa hapo juu.

source: What is a queue?
ja: キューとは何か？
ru: Что такое очередь?
sw: Nini maana ya foleni?

source: On many mail systems, it is common for all messages to flow into an Inbox file, where they remain stored. New messages are appended at the end of the Inbox file. The mail client program used to read and write mails reads this Inbox file and presents the content to the user.
ja: 多くのメールシステムでは、全てのメッセージが格納される受信ファイルに流し込むのが普通です。新しいメッセージはその受信ファイルの最後に追加されます。メール・クライアント・プログラムはメールの読み書きに使用され、この受信ファイルを読み、ユーザにコンテンツを表示します。
ru: На физическом уровне для почтового ящика создается специальный файл (иногда его еще называют почтовый спул), в который помещаются и хранятся все сообщения. Новые сообщения электронной почты просто добавляются в конец этого файла. Почтовая программа, которая используется для чтения и написания писем (такие программы еще называются пользовательскими почтовыми агентами - MUA (Mail User Agent) читает этот файл и отображает его содержимое.
sw: Katika mifumo mingi ya barua, ni kawaida kwa ujumbe wowote kuingia kwenye faili la kisanduku pokezi, ambapo zinabaki zimehifadhiwa. Ujumbe mpya unaongezwa mwishoni mwa faili la Kisanduku pokezi. Programu ya barua ya mteja inayotumika kusoma na kuandika barua inasoma hili faili la Kisanduku pokezi na kupeleka maudhui kwa mtumiaji.

source: A queue in OTRS is somewhat comparable to an Inbox file, since it too can store many messages. A queue also has features beyond those of an Inbox mail file. As an OTRS agent or user, one needs to remember which queue a ticket is stored in. Agents can open and edit tickets in a queue, and also move tickets from one queue to another. But why would they move tickets?
ja: 多くのメッセージを格納することもできるので、OTRSでのキューは多少受信ボックスと比較できます。キューにはさらに受信ボックスのメール・ファイル以上の特徴があります。OTRS担当者あるいはユーザとして、チケットがどのキューに格納されているかを記憶しておく必要があります。担当者は、キューにあるチケットを開き編集することができ、あるキューから別のキューに移動することもできます。しかし、なぜチケットを移動させるのでしょうか。
ru: Очереди OTRS можно сравнить с Inbox-файлом, в котором хранятся входящие сообщения электронной почты, так как в них тоже может хранится множество сообщений. Очереди имеют много функций, схожих с теми, которые присущи Inbox-файлу. Как агенты так и пользователи, все должны помнить о том, в какой очереди содержится заявка. Агенты могут открывать, редактировать заявки, размещенные в очереди, а также, перемещать их из одной очереди в другую. Но зачем перемещать заявки?
sw: Foleni katika OTRS ni karibu inafanana na faili la kisanduku pokezi, kwa kuwa yenyewe nayo inahifadhi ujumbe wa aina nyingi. Foleni pia ina vipengele kuzidi vile vya faili la kisanduku pokezi cha barua. Kama mtumiaji au wakala wa OTRS, mtu inabidi akumbuke foleni gani tiketi imehifadhiwa. Mawakala wanaweza kufungua na kuhariri tiketi katika foleni, na pia kuhamisha tiketi kutoka foleni moja kwenda nyingine. Lakini kwanini zihamishe tiketi?

source: To explain it more practically, remember the example of Max's company described in an <link linkend="basic-tts-example">example of a ticket system</link>. Max installed OTRS in order to allow his team to better manage support for company customers buying video recorders.
ja: それについてより実践的な説明するために、<link linkend="basic-tts-example">example of a ticket system</link>で述べたマックスの会社の例を思い出しましょう。マックスは彼のチームがビデオテープレコーダーを買う会社取引先のサポートをよりよく管理することを可能にするためにOTRSをインストールしました。
ru: Чтобы обьяснить это с более практической точки зрения давайте вспомним пример с компанией Максима, которая была описана в разделе <link linkend="basic-tts-example">пример системы обработки заявок</link>. Максим установил OTRS чтобы избавится от существующего хаоса в системе поддержки и предоставить возможность своей команде лучше управлять службой поддержки клиентов, покупающих видеомагнитофоны.
sw: Kuelezea kwa vitendo zaidi, kumbuka mfano wa Kampuni ya Max iliyoelezewa katika <link linkend="basic-tts-example">mfano wa mfumo wa tiketi</link>. Max alisakinisha OTRS ili kuruhusu timu yake kusimamia vizuri usaidizi wa wateja wa kampuni wanaonunua rekoda za video.

source: One queue holding all requests is enough for this situation. However, after some time Max decides to also sell DVD recorders. Now, the customers have questions not only about the video recorder, but also about the new product. More and more emails get into the single queue of Max's OTRS and it's difficult to have a clear picture of what's happening.
ja: 全てのリクエストを持つ1つのキューは、この状況にとって十分です。しかし、マックスがさらにいつかDVDレコーダーを売ることを決定後は、顧客は、ビデオテープレコーダーだけでなく新製品に関する質問をします。より多くのEメールがマックスのOTRSの単一のキューに入り、起こっていることの明瞭な事態を把握することは難しくなります。
ru: На данный момент достаточно одной очереди, чтобы хранить в ней все запросы клиетов. Но через некоторое время Максим решает начать продажи DVD-магнитофонов. Теперь у клиентов есть вопросы касающиеся не только видеомагнитофонов, но и вопросы относительно нового продукта. С течением времени в очередь, ранее созданую Максимом, начинает приходить все больше и больше писем и управлятся с ними становится все труднее и труднее.
sw: Foleni moja inayoshikilia maombi yote inatosha kwa hii hali. Hata hivyo, baada ya muda Max anaamua pia kuuza rekoda za DVD. Sasa, wateja wana maswali sio tu kuhusu rekoda za video, lakini pia kuhusu bidhaa mpya. Barua pepe zaidi na zaidi zinaingia kwenye foleni moja ya OTRS ya Max na ni ngumu kupata picha kamili ya kinachoendelea.
