Repository: DSigmund/doc-admin
Catalog: i18n/doc-admin.*.po
Languages: ja, ru, sw

source: Some functions in OTRS, like escalations and <link linkend="unlock-tickets">automatic unlocking of tickets</link>, depend on a proper configuration of business hours, time zones and holidays. You can define these via the <link linkend="sysconfig">SysConfig interface</link>, in <link linkend="ConfigReference_Framework:Core::Time">Framework &gt; Core::Time</link>. You can also specify different sets of business hours, holidays and time zones as separate 'Calendars' in <link linkend="ConfigReference_Framework:Core::Time::Calendar1">Framework &gt; Core::Time::Calendar1</link> through <link linkend="ConfigReference_Framework:Core::Time::Calendar9">Framework &gt; Core::Time::Calendar9</link>. Calendars can be defined by <link linkend="adminarea-queue">queue settings</link>, or on SLA levels. This means that, for example, you can specify a calendar with 5 x 8 business hours for your 'standard' SLA, but create a separate calendar with 7 x 24 support for your 'gold' SLA; as well as set a calendar for your 'Support-USA' queue with a different time window than your 'Support-Japan' queue. OTRS can handle up to 99 different calendars.
ru: Некоторые функции в OTRS, например, как эскалация и <link linkend="unlock-tickets">автоматическая разблокировка заявок</link> зависят от правильной настройки параметра "рабочее время", часовых поясов и праздников. Все эти настройки можно определить перейдя по ссылке <link linkend="sysconfig">интерфейс SysConfig</link> в <link linkend="ConfigReference_Framework:Core::Time">Framework > Core::Time</link>. Перейдя по ссылке<link linkend="ConfigReference_Framework:Core::Time::Calendar1">Framework > Core::Time::Calendar1</link> через <link linkend="ConfigReference_Framework:Core::Time::Calendar9">Framework > Core::Time::Calendar9</link> можно также указать различные, заранее установленные "наборы рабочего времени", празников и часовых поясов. Перейдя по ссылке <link linkend="adminarea-queue">настройки очереди</link> можно определить Календари. Для этого также можно использовать SLA. Например можно создать различные SLA-схемы: 5 x 8 рабочих часов для стандартного SLA, но и вместе с тем создать другой календарь: 7 x 24 - "Золотой SLA"; также можно иметь отдельный календарь для очереди 'Support-USA', с часовыми поясами, различающимися с очередью 'Support-Japan'. В OTRS можно создавать до 99 различных календарей.
sw: Baadhi ya kazi katika OTRS, kama upandishaji na <link linkend="unlock-tickets">kufungua kiotomatiki tiketi</link>, inategemea kwenye usanidi sahihi wa masaa ya biashara, majira ya saa na sikukuu. Unaweza kufafanua hii kupitia <link linkend="sysconfig">Kiolesura cha SysConfig</link>, katika <link linkend="ConfigReference_Framework:Core::Time">Kiunzi &gt; Kiini::Muda</link>. Unaweza kuweka bayana seti tofauti za masaa ya kazi, sikukuu na majira ya saa kama 'Kalenda' tofauti katika <link linkend="ConfigReference_Framework:Core::Time::Calendar1">Kiunzi &gt; Kiini::Muda::Kalenda1</link> kupitia <link linkend="ConfigReference_Framework:Core::Time::Calendar9">Kiunzi &gt; Kiini::Muda::Kalenda9</link>. Kalenda zinaweza kufafanuliwa na <link linkend="adminarea-queue">mipangilio ya foleni</link>, au ngazi za SLA. Hii ina maanisha, kwa mfano, unaweza kuweka bayana kalenda yenye masaa ya biashara 5 x 8 kwa SLA yako ya 'Kawaida', lakini ukatengeneza kalenda tofauti ya msaada wa 7 x 24 kwa SLA zako za 'dhahabu'; na pia kuseti kalenda kwa ajili ya foleni yako ya 'Msaada-USA' yenye dirisha tofauti la muda tofauti na lile la foleni yako ya 'Msaada-Japan'. OTRS inaweza kushughulikia mpaka kalenda tofauti 99.

source: Set up the working hours for your system in SysConfig <link linkend="ConfigReference_Framework:Core::Time:TimeWorkingHours">Framework &gt; Core::Time::TimeWorkingHours</link>, or for your specific calendar in the calendar's configuration. OTRS can handle a granularity of one hour. Checking the marks in the boxes 8, 9, 10 ... 17 corresponds with business hours of 8 AM - 6 PM.
ru: Задает рабочие часы в вашей системе в SysConfig <link linkend="ConfigReference_Framework:Core::Time:TimeWorkingHours">Framework > Core::Time::TimeWorkingHours</link>, или ваши специальные календари в настройке календарей. OTRS манипулирует отрезками времени в один час. Пометка рабочих часов 8, 9, 10 ... 17 соответствует диапазону времени с 8 AM - 6 PM.
sw: Seti masaa ya kazi kwa ajili ya mfumo wako katika SysConfig <link linkend="ConfigReference_Framework:Core::Time:TimeWorkingHours">kiunzi&gt; Kiini::Muda::MudaMasaaYaKazi</link>, au kwa kalenda zako maalumu katika usanidi wa kalenda. OTRS inaweza kushughulikia muda wa saa moja. Kuweka alama katika visanduku 8, 9, 10 ... 17 inaendana na masaa ya kazi ya 8 asubuhi - 6 alasiri.

source: Holidays that are on a fixed date every year, such as New Year's Day or the Fourth of July, can be specified in <link linkend="ConfigReference_Framework:Core::Time:TimeVacationDays">TimeVacationDays</link>, or in the corresponding section for the calendars 1-9.
ru: Празники, которые с каждым годом не приходятся на фиксированный день, такие как Новый год или четвертое Июля могут быть указаны в <link linkend="ConfigReference_Framework:Core::Time:TimeVacationDays">Отпускные дни</link>, или в соответсвтующем разделе календаря 1-9.
sw: Sikukuu ambazo ziko kwenye tarehe funge kila mwaka, kama Mwaka mpya au tarehe nne ya Julai, zinaweza kubainishwa katika <link linkend="ConfigReference_Framework:Core::Time:TimeVacationDays">MudaSikukuuSiku</link>, au katika sehemu husika kwa ajili ya kalenda 1-9

source: TimeVacationDaysOneTime
sw: MudaSikuZaSikukuuMaraMoja

source: Holidays such as Easter that do not have a yearly fixed date but instead vary each year, can be specified in <link linkend="ConfigReference_Framework:Core::Time:TimeVacationDaysOneTime">TimeVacationDaysOneTime</link>.
ru: Празники, такие как Пасха, которые ежегодно не имеют фиксированной даты могут быть указаны в <link linkend="ConfigReference_Framework:Core::Time:TimeVacationDaysOneTime">Отпускные дни/One-Time</link> .
sw: Sikuku kama Pasaka ambazo hazima tarehe maalumu ya mwaka lakini badala yake zinabadilika kila mwaka, zinaweza kubainishwa kwenye <link linkend="ConfigReference_Framework:Core::Time:TimeVacationDaysOneTime">MudaSikuZaSikukuuMaraMoja</link>.

source: If you use the Print action from anywhere within the OTRS interface, it will generate a formatted PDF file. You can deactivate this by modifying the configuration parameter <link linkend="ConfigReference_Framework:Core::PDF:PDF">PDF</link> to create HTML output instead.
ru: При использовании функции Печать в любом месте интерфейса OTRS будет создаваться файл в формате PDF. Вы можете отключить это изменением параметра <link linkend="ConfigReference_Framework:Core::PDF:PDF">PDF</link> для вывода в HTML формате.
sw: Kama ukitumia kitendo cha Kuchapisha kutoka kokote ndani ya kiolesura cha OTRS, itazalisha faili lililoumbuizwa la PDF. Unaweza kulemaza hii kwa kubadilisha usanidi wa parameta <link linkend="ConfigReference_Framework:Core::PDF:PDF">PDF</link> kutengeneza HTML badala yake.

source: You can adjust the look of the files generated by OTRS by creating your own logo and adding it to <link linkend="ConfigReference_Framework:Core::PDF:PDF::LogoFile">PDF::LogoFile</link>. You can use <link linkend="ConfigReference_Framework:Core::PDF:PDF::PageSize">PDF::PageSize</link> to define the standard page size of the generated pdf file (DIN-A4 or Letter), and also <link linkend="ConfigReference_Framework:Core::PDF:PDF::MaxPages">PDF::MaxPage</link> to specify the maximum number of pages for a pdf file, which is useful if a user generates a huge output file by mistake.
ru: Чтобы изменить внешний вид файлов, сгенерированных системой OTRS, можно создать свой собственный логотип и добавить его перейдя по ссылке <link linkend="ConfigReference_Framework:Core::PDF:PDF::LogoFile">PDF::LogoFile</link>. Чтобы определить стандартный размер страниц генерируемых pdf-файлов (DIN-A4 или Letter) воспользуйтесь ссылкой <link linkend="ConfigReference_Framework:Core::PDF:PDF::PageSize">PDF::PageSize</link>. Чтобы указать максимальное количество страниц pdf-файла используйте ссылку <link linkend="ConfigReference_Framework:Core::PDF:PDF::MaxPages">PDF::MaxPage</link>. Эта настройка может быть полезна когда пользователь ошибочно генерирует файл большого размера.
sw: Unaweza kurekebisha muonekano wa mafaili yanayozalishwa na OTRS kwa kutengeneza nembo yako na kuiongeza kwenye <link linkend="ConfigReference_Framework:Core::PDF:PDF::LogoFile">PDF::FailiLaNembo</link>. Unaweza kutumia <link linkend="ConfigReference_Framework:Core::PDF:PDF::PageSize">PDF::UkubwaWaKurasa</link> kufafanua ukubwa wa kawaida wa faili la pdf linalozalishwa (DIN-A4 au barua), na pia <link linkend="ConfigReference_Framework:Core::PDF:PDF::MaxPages">PDF::KikomoKurasa</link> kuweka bayana idadi ya kikomo cha juu cha kurasa kwa faili la pdf, ambayo ni muhimu kama mtumiaji akizalisha faili kubwa kwa makosa.

source: <link linkend="ConfigReference_Ticket:Core::PostMaster:PostmasterDefaultPriority"> Ticket:Core::Postmaster::PostmasterDefaultPriority</link> - defines the default priority for all incoming emails.
ru: <link linkend="ConfigReference_Ticket:Core::PostMaster:PostmasterDefaultPriority"> Ticket:Core::Postmaster::PostmasterDefaultPriority</link> - задает предустановленный приоритет для всех входящих сообщений электронной почты.
sw: <link linkend="ConfigReference_Ticket:Core::PostMaster:PostmasterDefaultPriority"> Tiketi:Kiini::Mkuu wa posta::MkuuwapostaKipaumbeleChaguo-msingi</link> - inafafanua kipaumbele chaguo-msingi kwa barua pepe zote zinazoingia.

source: <link linkend="ConfigReference_Ticket:Frontend::Agent::Ticket::ViewPhoneNew:Ticket::Frontend::AgentTicketPhone_Priority"> Ticket:Frontend::Agent:Ticket::ViewPhoneNew:Priority</link> - defines the default priority in the New Phone Ticket screen for agents.
ru: <link linkend="ConfigReference_Ticket:Frontend::Agent::Ticket::ViewPhoneNew:Ticket::Frontend::AgentTicketPhone_Priority"> Ticket:Frontend::Agent:Ticket::ViewPhoneNew:Priority</link> - задает приоритет по умолчанию для новых Заявок созданных на основе Телефонных Звонков.
sw: <link linkend="ConfigReference_Ticket:Frontend::Agent::Ticket::ViewPhoneNew:Ticket::Frontend::AgentTicketPhone_Priority"> Tiketi:Mazingira ya mbele::Wakala:Tiketi::OnaSimuMpya:Kipaumbele</link> - inafafanua chaguo-msingi la kipaumbele kwenye skrini ya Tiketi Mpya Simu ya mawakala.

source: <link linkend="ConfigReference_Ticket:Frontend::Agent::Ticket::ViewEmailNew:Ticket::Frontend::AgentTicketEmail_Priority"> Ticket:Frontend::Agent:Ticket::ViewEmailNew:Priority</link> - defines the default priority in the New Email Ticket screen for agents.
ru: <link linkend="ConfigReference_Ticket:Frontend::Agent::Ticket::ViewEmailNew:Ticket::Frontend::AgentTicketEmail_Priority"> Ticket:Frontend::Agent:Ticket::ViewEmailNew:Priority</link> - задает приоритет по умолчанию на странице создания новой Email-Заявки в интерфейсе агента.
sw: <link linkend="ConfigReference_Ticket:Frontend::Agent::Ticket::ViewEmailNew:Ticket::Frontend::AgentTicketEmail_Priority"> Tiketi:Mazingira ya mbele::Wakala:Tiketi::OnaBaruapepeMpya:Kipaumbele</link> - inafafanua chaguo-msingi la kipaumbele katika skrini ya Tiketi Mpya Baruapepe ya mawakala.

source: <link linkend="ConfigReference_Ticket:Frontend::Customer::Ticket::ViewNew:Ticket::Frontend::CustomerTicketMessage_PriorityDefault"> Ticket:Frontend::Customer:Ticket::ViewNew:PriorityDefault</link> - defines the default priority in the New Ticket screen in the Customer frontend.
ru: <link linkend="ConfigReference_Ticket:Frontend::Customer::Ticket::ViewNew:Ticket::Frontend::CustomerTicketMessage_PriorityDefault"> Ticket:Frontend::Customer:Ticket::ViewNew:PriorityDefault</link> - задает приоритет по умолчанию при создании заявки клиентом в интерфейсе клиента.
sw: <link linkend="ConfigReference_Ticket:Frontend::Customer::Ticket::ViewNew:Ticket::Frontend::CustomerTicketMessage_PriorityDefault"> Tiketi:Mandhari ya mbele::Mteja:Tiketi::OnaMpya:KipaumbeleChaguo-msingi</link> - inafafanua chaguo-msingi la kipaumbele katika skrini Mpya ya Tiketi katika mazingira yambele ya Mteja.

source: <link linkend="ConfigReference_Ticket:Frontend::Agent::Ticket::ViewPhoneNew:Ticket::Frontend::AgentTicketPhone_StateDefault"> Ticket -&gt; Frontend::Agent::Ticket::ViewPhoneNew &gt; AgentTicketPhone###StateDefault </link> - to define the default next state for new phone tickets.
ru: <link linkend="ConfigReference_Ticket:Frontend::Agent::Ticket::ViewPhoneNew:Ticket::Frontend::AgentTicketPhone_StateDefault"> Ticket -> Frontend::Agent::Ticket::ViewPhoneNew > AgentTicketPhone###StateDefault </link> - задает следующее состояние по умолчанию для новых заявок созданных на основе телефонного звонка.
sw: <link linkend="ConfigReference_Ticket:Frontend::Agent::Ticket::ViewPhoneNew:Ticket::Frontend::AgentTicketPhone_StateDefault"> Tiketi-&gt; Mazingira ya mbele::Wakala::Tiketi::OnaSimuMpya &gt; WakalaTiketiSimu###HaliChaguo-msingi</link> - kufafanua chaguo-msingi la hali inayofuata ya tiketi mpya za simu.

source: <link linkend="ConfigReference_Ticket:Frontend::Agent::Ticket::ViewPhoneNew:Ticket::Frontend::AgentTicketPhone_StateType"> Ticket -&gt; Frontend::Agent::Ticket::ViewPhoneNew &gt; AgentTicketPhone###StateType </link> - to define the available next states for new phone tickets.
ru: <link linkend="ConfigReference_Ticket:Frontend::Agent::Ticket::ViewPhoneNew:Ticket::Frontend::AgentTicketPhone_StateType"> Ticket -> Frontend::Agent::Ticket::ViewPhoneNew > AgentTicketPhone###StateType </link> - задает список последующих доступных состояний для новых заявок, созданных на основе телефонного звонка.
sw: <link linkend="ConfigReference_Ticket:Frontend::Agent::Ticket::ViewPhoneNew:Ticket::Frontend::AgentTicketPhone_StateType"> Tiketi -&gt; Mazingira ya mbele::Wakala::Tiketi::OnaSimuMpya &gt; WakalaTiketiSimu###AinaHali</link> - kufafanua hali zitakazopatikana kwa tiketi mpya za simu.

source: <link linkend="ConfigReference_Ticket:Frontend::Agent::Ticket::ViewEmailNew:Ticket::Frontend::AgentTicketEmail_StateDefault"> Ticket -&gt; Frontend::Agent::Ticket::ViewEmailNew &gt; AgentTicketEmail###StateDefault </link> - to define the default next state for new email tickets.
ru: <link linkend="ConfigReference_Ticket:Frontend::Agent::Ticket::ViewEmailNew:Ticket::Frontend::AgentTicketEmail_StateDefault"> Ticket -> Frontend::Agent::Ticket::ViewEmailNew > AgentTicketEmail###StateDefault </link> - задает следующее состояние по умолчанию для новых заявок созданных на основе сообщений электронной почты.
sw: <link linkend="ConfigReference_Ticket:Frontend::Agent::Ticket::ViewEmailNew:Ticket::Frontend::AgentTicketEmail_StateDefault"> Tiketi -&gt; Mazingira ya mbele::Wakala::Tiketi::OnaBaruapepeMpya &gt; TiketiBaruapepe###HaliChaguo-msingi</link> - kufafanua chaguo-msingi la hali inayofuata ya tiketi mpya za barua pepe.

source: <link linkend="ConfigReference_Ticket:Frontend::Agent::Ticket::ViewEmailNew:Ticket::Frontend::AgentTicketEmail_StateType"> Ticket -&gt; Frontend::Agent::Ticket::ViewEmailNew &gt; AgentTicketEmail###StateType </link> - to define the available next states for new email tickets.
ru: <link linkend="ConfigReference_Ticket:Frontend::Agent::Ticket::ViewEmailNew:Ticket::Frontend::AgentTicketEmail_StateType"> Ticket -> Frontend::Agent::Ticket::ViewEmailNew > AgentTicketEmail###StateType </link> - задает список последующих доступных состояний для новых заявок созданных на базе сообщений электронной почты.
sw: <link linkend="ConfigReference_Ticket:Frontend::Agent::Ticket::ViewEmailNew:Ticket::Frontend::AgentTicketEmail_StateType"> Tiketi -&gt; Mazingira ya mbele::Wakala::Tiketi::OnaBaruapepeMpya &gt; WakalaTiketiBaruapepe###AinaHali</link> - kufafanua hali zinazofuata zitakazopatikana kwa tiketi mpya za barua pepe.

source: <link linkend="ConfigReference_Ticket:Frontend::Agent::Ticket::ViewPhoneOutbound:Ticket::Frontend::AgentTicketPhoneOutbound_State"> Ticket -&gt; Frontend::Agent::Ticket::ViewPhoneOutbound &gt; AgentTicketPhoneOutbound###State </link> - to define the default next state for new phone articles.
ru: <link linkend="ConfigReference_Ticket:Frontend::Agent::Ticket::ViewPhoneOutbound:Ticket::Frontend::AgentTicketPhoneOutbound_State"> Ticket -&gt; Frontend::Agent::Ticket::ViewPhoneOutbound &gt; AgentTicketPhoneOutbound###State </link> - задает значение по умолчанию следующего состояния заявки при регистрации новых сообщений в заявке, полученных от клиента по телефону.
sw: <link linkend="ConfigReference_Ticket:Frontend::Agent::Ticket::ViewPhoneOutbound:Ticket::Frontend::AgentTicketPhoneOutbound_State"> Tiketi -&gt; Mazingira ya mbele::Wakala::Tiketi::OnaSimuZinazotoka &gt; WakalaTiketiSimuZinazotoka###Hali</link> - kufafanua chaguo-msingi la hali inayofuata kwa makala mpya za simu.

source: <link linkend="ConfigReference_Ticket:Frontend::Agent::Ticket::ViewPhoneOutbound:Ticket::Frontend::AgentTicketPhoneOutbound_StateType"> Ticket -&gt; Frontend::Agent::Ticket::ViewPhoneOutbound &gt; AgentTicketPhoneOutbound###StateType </link> - to define the available next states for new phone articles.
ru: <link linkend="ConfigReference_Ticket:Frontend::Agent::Ticket::ViewPhoneOutbound:Ticket::Frontend::AgentTicketPhoneOutbound_StateType"> Ticket -&gt; Frontend::Agent::Ticket::ViewPhoneOutbound &gt; AgentTicketPhoneOutbound###StateType </link> - задает доступные значения следующего состояния заявки при регистрации новых сообщений в заявке, полученных от клиента по телефону.
sw: <link linkend="ConfigReference_Ticket:Frontend::Agent::Ticket::ViewPhoneOutbound:Ticket::Frontend::AgentTicketPhoneOutbound_StateType"> Tiketi -&gt; Mazingira ya mbele::Wakala::Tiketi::OnaSimuZinazotoka &gt; WakalaTiketiSimuZInazotoka###HaliAina</link> - kufafanua hali zinazofuata zitakazopatikana kwa makala mpya za simu.

source: <link linkend="ConfigReference_Ticket:Frontend::Agent::Ticket::ViewMove:Ticket::Frontend::AgentTicketMove_State"> Ticket -&gt; Frontend::Agent::Ticket::ViewMove &gt; AgentTicketMove###State </link> - to define the default next state for moving a ticket.
ru: <link linkend="ConfigReference_Ticket:Frontend::Agent::Ticket::ViewMove:Ticket::Frontend::AgentTicketMove_State"> Ticket -> Frontend::Agent::Ticket::ViewMove > AgentTicketMove###State </link> - Задает следующее состояние по умолчанию при перемещении заявки в другую очередь.
sw: <link linkend="ConfigReference_Ticket:Frontend::Agent::Ticket::ViewMove:Ticket::Frontend::AgentTicketMove_State"> Tiketi -&gt; Mazingira ya mbele::Wakala::Tiketi::OnaHamisha &gt; WakalaTiketiHamisha###Hali</link> - kufafanua chaguo-msingi la hali inayofuata ya kuhamisha tiketi.

source: <link linkend="ConfigReference_Ticket:Frontend::Agent::Ticket::ViewMove:Ticket::Frontend::AgentTicketMove_StateType"> Ticket -&gt; Frontend::Agent::Ticket::ViewMove &gt; AgentTicketMove###StateType </link> - to define the available next states for moving a ticket.
ru: <link linkend="ConfigReference_Ticket:Frontend::Agent::Ticket::ViewMove:Ticket::Frontend::AgentTicketMove_StateType"> Ticket -> Frontend::Agent::Ticket::ViewMove > AgentTicketMove###StateType </link> - задает список последующих доступных состояний при перемещении заявки в другую очередь.
sw: <link linkend="ConfigReference_Ticket:Frontend::Agent::Ticket::ViewMove:Ticket::Frontend::AgentTicketMove_StateType"> Tiketi -&gt; Mazingira ya mbele::Wakala::Tiketi::OnaHamisha &gt; WakalaTiketiHamisha###HaliAina</link> - kufafanua hali zinazofuata zinazopatikana za kuhamisha tiketi.

source: <link linkend="ConfigReference_Ticket:Frontend::Agent::Ticket::ViewBounce:Ticket::Frontend::AgentTicketBounce_StateDefault"> Ticket -&gt; Frontend::Agent::Ticket::ViewBounce &gt; StateDefault </link> - to define the default next state after bouncing a ticket.
ru: <link linkend="ConfigReference_Ticket:Frontend::Agent::Ticket::ViewBounce:Ticket::Frontend::AgentTicketBounce_StateDefault"> Ticket -&gt; Frontend::Agent::Ticket::ViewBounce &gt; StateDefault </link> - задает следующее состояние заявки по умолчанию после ее возврата.
sw: <link linkend="ConfigReference_Ticket:Frontend::Agent::Ticket::ViewBounce:Ticket::Frontend::AgentTicketBounce_StateDefault"> Tiketi -&gt; Mazingira ya mbele::Wakala::Tiketi::OnaDunda&gt; HaliChaguo-msingi</link> - kufafanua chaguo-msingi la hali inayofuata baada ya tiketi kudunda.

source: <link linkend="ConfigReference_Ticket:Frontend::Agent::Ticket::ViewBounce:Ticket::Frontend::AgentTicketBounce_StateType"> Ticket -&gt; Frontend::Agent::Ticket::ViewBounce &gt; StateType </link> - to define the available next states in the bounce screen.
ru: <link linkend="ConfigReference_Ticket:Frontend::Agent::Ticket::ViewBounce:Ticket::Frontend::AgentTicketBounce_StateType"> Ticket -&gt; Frontend::Agent::Ticket::ViewBounce &gt; StateType </link> - задает следующие доступные состояния заявки после ее возврата.
sw: <link linkend="ConfigReference_Ticket:Frontend::Agent::Ticket::ViewBounce:Ticket::Frontend::AgentTicketBounce_StateType"> Tiketi -&gt; Mandhari ya mbele::Wakala::Tiketi::OnaDunda &gt; HaliAina</link> - kufafanua inayopatikana itakayofuata katika skrini ya kudunda.

source: <link linkend="ConfigReference_Ticket:Frontend::Agent::Ticket::ViewBulk:Ticket::Frontend::AgentTicketBulk_StateDefault"> Ticket -&gt; Frontend::Agent::Ticket::ViewBulk &gt; StateDefault </link> - to define the default next state in a bulk action.
ru: <link linkend="ConfigReference_Ticket:Frontend::Agent::Ticket::ViewBulk:Ticket::Frontend::AgentTicketBulk_StateDefault"> Ticket -> Frontend::Agent::Ticket::ViewBulk > StateDefault </link> - для указания следующего состояния по умолчанию при массовом действии.
sw: <link linkend="ConfigReference_Ticket:Frontend::Agent::Ticket::ViewBulk:Ticket::Frontend::AgentTicketBulk_StateDefault"> Tiketi -&gt; Mazingira ya mbele::Wakala::Tiketi::OnaNyingi &gt; HaliChaguo-msingi </link> - kufafanua chaguo-msingi la hali inayofuata katika kitendocha mkupuo.

source: <link linkend="ConfigReference_Ticket:Frontend::Agent::Ticket::ViewBulk:Ticket::Frontend::AgentTicketBulk_StateType"> Ticket -&gt; Frontend::Agent::Ticket::ViewBulk &gt; StateType </link> - to define the available next states in the bulk action screen.
ru: <link linkend="ConfigReference_Ticket:Frontend::Agent::Ticket::ViewBulk:Ticket::Frontend::AgentTicketBulk_StateType"> Ticket -> Frontend::Agent::Ticket::ViewBulk > StateType </link> - задает список последующих доступных состояний при массовом действии.
sw: <link linkend="ConfigReference_Ticket:Frontend::Agent::Ticket::ViewBulk:Ticket::Frontend::AgentTicketBulk_StateType"> Tiketi -&gt; Mazingira ya mbele::Wakala::Tiketi::OnaNyingi &gt; HaliAina</link> - kufafanua hali zinazofuata zitakazopatikana katika skrini ya vitendo vya mkupuo.

source: <link linkend="ConfigReference_Ticket:Frontend::Agent::Ticket::ViewClose:Ticket::Frontend::AgentTicketClose_StateDefault"> Ticket -&gt; Frontend::Agent::Ticket::ViewClose &gt; StateDefault </link> - to define the default next state after closing a ticket.
ru: <link linkend="ConfigReference_Ticket:Frontend::Agent::Ticket::ViewClose:Ticket::Frontend::AgentTicketClose_StateDefault"> Ticket -> Frontend::Agent::Ticket::ViewClose > StateDefault </link> - для указания следующего состояния по умолчанию после закрытия заявки.
sw: <link linkend="ConfigReference_Ticket:Frontend::Agent::Ticket::ViewClose:Ticket::Frontend::AgentTicketClose_StateDefault"> Tiketi -&gt; Mazingira ya mbele::Wakala::Tiketi::OnaFunga &gt; HaliChaguo-msingi </link> - kufafanua chaguo-msingi la hali inayofuata baada ya kufunga tiketi.
