Repository: DSigmund/doc-admin
Catalog: i18n/doc-admin.*.po
Languages: ja, ru, sw

source: To activate the new theme, add them in SysConfig under <link linkend="ConfigReference_Framework:Core::Web:Frontend::Themes">Frontend::Themes</link>.
ja: 新規のテーマを有効にするにはSysConfig内の<link linkend="ConfigReference_Framework:Core::Web:Frontend::Themes">Frontend::Themes</link>でテーマを有効にする必要があります
ru: Для активации новой Темы, добавьте ее в SysConfig в параметр <link linkend="ConfigReference_Framework:Core::Web:Frontend::Themes">Frontend::Themes</link>.
sw: Kamilisha mandhari mpya, ziongeze kwenye SysConfig kwenye <link linkend="ConfigReference_Framework:Core::Web:Frontend::Themes">Mazingira ya mbele::Mandhari</link>.

source: Now the new theme should be useable. You can select it via your <link linkend="user-preferences">personal preferences</link> page.
ja: 新しいテーマは使用可能に違いありません。<link linkend="user-preferences">個人選択（選好）</link>ページによってそれを選択することができます。
ru: Теперь новая тема должна быть доступна. Вы можете выбрать эту тему перейдя по ссылке <link linkend="user-preferences"> предпочтения</link>.
sw: Sasa mandhari mpya inatakiwa kuweza kutumika. Unaweza kuichagua kupitia kiungo chako cha kurasa ya <link linkend="user-preferences">mapendeleo binafsi</link>.

source: Do not change the theme files shipped with OTRS, since these changes will be lost after an update. Create your own themes only by performing the steps described above.
ja: アップデート後にこれらの変更は失われるので、OTRSで送られたテーマ・ファイルを変更しないでください。上に記述されたステップを行なうことによりのみ自分のテーマを作成してください。
ru: Не изменяйте файлы темы, поставляемой с OTRS, поскольку эти изменения будут утеряны после обновления. Создавайте свои собственные темы только путем выполнения шагов, описанных выше.
sw: Usibadilishe mafaili ya mandhari yaliyosafirishwa na OTRS, kwani haya mabadiliko yatapotea baada ya usasishaji. Tengeneza mandhari yako mwenyewe kwa kufuata hatua zilizoelezwa hapo juu.

source: From OTRS 2.0 on, Access Control Lists (ACLs) can be used to control access to tickets, modules, queues, etc., or to influence actions on tickets (closing, moving, etc.) in certain situations. ACLs can be used to supplement the existing permission system of <link linkend="adminarea-roles">roles</link> and <link linkend="adminarea-groups">groups</link>. Using ACLs, rudimental workflows within the system can be mapped, based on ticket attributes.
ja: OTRS 2.0から、アクセス・コントロール・リスト(ACL)は、チケット、モジュール、キューなどへの制御アクセスに使用することができます。また、ある状況でチケット(完了する、移動するなど)に対するアクションに影響を及ぼすことができます。ACLは<link linkend="adminarea-roles">役割</link>と<link linkend="adminarea-groups">グループ</link>の既存の許可システムを補足するために使用することができます。ACLを使用すると、システム内の基本的なワークフローは、チケット属性に基づいてマップすることができます。

source: As yet, ACLs cannot be created using the <link linkend="adminarea-sysconfig">SysConfig interface</link>. They must be directly entered into the <filename>Kernel/Config.pm</filename> file. This chapter has some ACL examples which will walk you trough the process of defining ACL definitions, and a reference of all possible important ACL settings.
ja: まだ、ACLは<link linkend="SysConfigインターフェース">SysConfig interface</link>を使用して作成することができません。直接<filename>Kernel/Config.pm</filename>ファイルにそれらを入力しなければなりません。本章にはいくつかのACL例がありますので、それらはあなたをACLの諸定義を定義する過程へ導き、あらゆる可能で重要なACL設定の参考となるでしょう。

source: Examples
ja: サンプル
ru: Примеры
sw: Mifano

source: ACL allowing movement into a queue of only those tickets with ticket priority 5.
ja: ACLはチケット優先度5のチケットのみをキューへの移動を許可します。
ru: Списки прав доступа (ACL) позволяют перемещать в очереди только заявки с приоритетом 5.
sw: ACL inayoruhusu uingizwaji kwenye foleni wa tiketi zenye kipaumbele cha tiketi 5.

source: This example shows you the basic structure of an ACL. First, it needs to have a name. In this case, it is "ACL-Name-2". Note that the ACLs will be numerically sorted before execution, so you should use the names carefully.
ja: この例は、あなたにACLの基本構造を示します。最初に、それは名前を持つ必要があります。ここでは「ACL-Name-2」とします。まず、ACLは実行の前に数値的にソートされることにご留意下さい。それゆえACLの名前を注意深く使用して下さい。

source: Secondly, you have a "Properties" section which is a filter for your tickets. All the criteria defined here will be applied to a ticket to determine if the ACL must be applied or not. In our example, a ticket will match if it is in the queue "Raw" and has priority "5 very high". This is also affected by changes in the form (e.g. if the ticket is the queue "raw" and had a priority "3 normal", but then priority drop-down is selected and the priority is changed now to "5 very high" will also match).
ja: 次に、チケット用のフィルタである「プロパティ」セクションがあります。ここで定義された基準はすべて、ACLが適用されるか否かを判断するチケットに適用されます。例において、チケットが「未対応の」キューかあるいは優先度が「5 非常に高い」にあれば、チケットは一致するでしょう。これはフォーム内での変更により影響を受けます。（「未対応の」キューかあるいは優先度が「3：普通」のチケットが、その後、優先度のドロップダウンが選択され、優先度が「5：非常に高い」へ変更されたような場合）

source: Lastly, a section "Possible" defines modifications to the screens. In this case, from the available queues, only the queue "Alert" can be selected in a ticket screen.
ja: 最後に、「可能」セクションは画面への修正を定義します。この場合、利用可能キューから、「警告」キューだけがチケット・画面の中で選択することができます。
ru: Наконец, раздел "Возможные" определяет изменения экрана. В нашем случае из имеющихся очередей только очередь "Alert" может быть выбрана на странице Заявки.
sw: Mwisho, kifungu "Inawezekana" inafafanua mabadiliko ya skrini. Katika kesi hii, kutoka kwenye foleni zinazopatikana, foleni "Tahadhari" tu inaweza kuchaguliwa katika skrini ya tiketi.

source: # ticket acl $Self->{TicketAcl}->{'100-Example-ACL'} = { # match properties Properties => { # current ticket match properties Ticket => { Queue => ['Raw'], Priority => ['5 very high'], } }, # return possible options (white list) Possible => { # possible ticket options (white list) Ticket => { Queue => ['Alert'], }, }, };
ja: # ticket acl $Self->{TicketAcl}->{'100-Example-ACL'} = { # マッチプロパティ Properties => { # 現在のチケット・マッチ・プロパティ Ticket => { Queue => ['Raw'], Priority => ['5 very high'], } }, # 可能なオプション（ホワイトリスト）を返します Possible => { # 可能なオプション（ホワイトリスト）を返します Ticket => { Queue => ['Alert'], }, }, };

source: ACL allowing movement into a queue of only those tickets with ticket priority 5 stored in the database.
ja: データベースに格納された優先度5のチケットだけのキューへ移動を許可するACL
ru: ACL позволяют перемещать в другие очереди только заявки с приоритетом 5, уже имеющиеся в базе данных.
sw: ACL inaruhusu uingiaji kwenye foleni kwa zile tiketi zenye kipaumbele cha tiketi 5 na zimehifadhiwa kwenye hifahdidata.

source: This example is very similar to the last one, but in this case only tickets in the queue "Raw" and with a priority "5 very high", both stored in the database will match. This kind of ACLs does not consider changes in the form before the ticket is really updated in the database.
ja: この例は先のものに非常に似ています。しかしながら、この例では、「生で」かつ優先度が「５：非常に高い」チケットのみが両者ともにデータベースに保存されて、マッチします。チケットがデータベースの中で実際に更新される前に、この種のACLはフォームの変更を考慮しません。
ru: Этот пример очень похож на предыдущий, но в этом случае только заявки в очереди "Raw" и с приоритетом "5 very high", уже имеющиеся в базе данных будут соответствовать критерию. Такой тип ACL не учитывает изменения в формах изменения заявки, до того как заявка будет действительно обновлена в базе данных.
sw: Huu mfano ni sawa na uliopita, lakini katika kesi hii tiketi za kwenye foleni "Mbichi" na zenye kipaumbele "5 cha juu sana", zote zikiwa kwenye hifadhidata zitafanana. Hii aina ya ACL haiweki maanani mabadiliko katika muundo kabla tiketi haijasasishwa kwenye hifadhidata.

source: # ticket acl $Self->{TicketAcl}->{'100-Example-ACL'} = { # match properties PropertiesDatabase => { # current ticket match properties Ticket => { Queue => ['Raw'], Priority => ['5 very high'], } }, # return possible options (white list) Possible => { # possible ticket options (white list) Ticket => { Queue => ['Alert'], }, }, };
ja: # ticket acl $Self->{TicketAcl}->{'100-Example-ACL'} = { # マッチプライオリティ PropertiesDatabase => { # 現在のチケット・マッチ・プロパティ Ticket => { Queue => ['Raw'], Priority => ['5 very high'], } }, # 可能なオプション（ホワイトリスト）を返します Possible => { # 可能なオプション（ホワイトリスト）を返します Ticket => { Queue => ['Alert'], }, }, };

source: ACL disabling the closing of tickets in the raw queue, and hiding the close button.
ja: 未対応のキュー中のチケットの完了を不能にし、閉じるボタンを隠すACL
ru: Списки прав доступа (ACL) делают невозможным закрытие заявок в очереди raw и скрывают кнопку "закрыть".
sw: ACL ikilemaza ufungaji wa tiketi katika foleni mbichi, na kuficha kitufe cha kufunga.

source: Here you can see how a ticket field (state) can be filtered with more than one possible value to select from. It is also possible to limit the actions that can be executed for a certain ticket. In this case, the ticket cannot be closed.
ja: この例では、どのようにチケット・フィールド（の状態）が、（フォームを選択する１つ以上の可能な値で）フィルターされるかを理解できるでしょう。あるチケット用に実行することができる アクションを制限することも可能です。この場合、チケットは完了できません。
ru: Здесь вы можете увидеть как поле заявки (состояние), может проверяться на более чем возможное для ввода значение. Можно также ограничить возможные действия, выполняемые над конкретной заявкой. В этом случае, заявка не может быть закрыта.
sw: Hapa unaweza kuona jinsi sehemu ya tiketi (hali) inavyoweza kuchujwa na zaidi ya thamani moja ya kuchagua. Pia inawezekana kuweka kikomo cha vitendo vinavyoweza kutekelezeka kutoka kwenye tiketi. Katika kesi hii tiketi haiwezi kufungwa.

source: $Self->{TicketAcl}->{'101-Second-Example-ACL'} = { # match properties Properties => { # current ticket match properties Ticket => { Queue => ['Raw'], } }, # return possible options (white list) Possible => { # possible ticket options (white list) Ticket => { State => ['new', 'open', 'pending reminder'], }, # possible action options Action => { AgentTicketBounce => 1, AgentTicketClose => 0, AgentTicketCompose => 1, AgentTicketCustomer => 1, AgentTicketForward => 1, AgentTicketFreeText => 1, AgentTicketHistory => 1, AgentTicketLink => 1, AgentTicketLock => 1, AgentTicketMerge => 1, AgentTicketMove => 1, AgentTicketNote => 1, AgentTicketOwner => 1, AgentTicketPending => 1, AgentTicketPhone => 1, # only used to hide the Split action AgentTicketPhoneInbound => 1, AgentTicketPhoneOutbound => 1, AgentTicketPrint => 1, AgentTicketPriority => 1, AgentTicketResponsible => 1, AgentTicketWatcher => 1, AgentTicketZoom => 1, AgentLinkObject => 1, # only used to hide the Link action }, }, };
ja: $Self->{TicketAcl}->{'101-Second-Example-ACL'} = { # マッチプロパティ Properties => { # 現在のチケット・マッチ・プロパティ Ticket => { Queue => ['Raw'], } }, # 可能なオプション（ホワイトリスト）を返します Possible => { # 可能なオプション（ホワイトリスト）を返します Ticket => { State => ['new', 'open', 'pending reminder'], }, # 可能なアクション・オプション Action => { AgentTicketBounce => 1, AgentTicketClose => 0, AgentTicketCompose => 1, AgentTicketCustomer => 1, AgentTicketForward => 1, AgentTicketFreeText => 1, AgentTicketHistory => 1, AgentTicketLink => 1, AgentTicketLock => 1, AgentTicketMerge => 1, AgentTicketMove => 1, AgentTicketNote => 1, AgentTicketOwner => 1, AgentTicketPending => 1, AgentTicketPhone => 1, # 分かれているアクションを非表示にするためだけに使用されます AgentTicketPhoneInbound => 1, AgentTicketPhoneOutbound => 1, AgentTicketPrint => 1, AgentTicketPriority => 1, AgentTicketResponsible => 1, AgentTicketWatcher => 1, AgentTicketZoom => 1, AgentLinkObject => 1, # リンク・アクションを非表示にするためだけに使用されます }, }, };

source: ACL removing always state closed successful.
ja: 状態：「閉鎖成功」を常に削除するACL
ru: ACL удаляет навсегда возможность установить состояние "closed successful".
sw: Uondoaji wa ACL una hali imefungwa kikamilifu mara zote.

source: This example shows how it is possible to define negative filters (the state "closed successful" will be removed). You can also see that not defining match properties for a ticket will match any ticket, i. e. the ACL will always be applied. This may be useful if you want to hide certain values by default, and only enable them in special circumstances (e. g. if the agent is in a specific group).
ja: ここの例では、否定フィルタ（状態：「完了（成功）」を取り除く）をどのようにして定義可能か例示します。チケット用のマッチ・プロパティを定義しなければ、どんなチケットでもマッチすることもわかります。例えばACLが常に当てはまります。これは、もしデフォルトで特定の値を非表示にしたくかつ、特殊な環境（例えば担当者が特定のグループにいるならば）だけにそれらを可能にしたいなら活用可能になります。
ru: Этот пример показывает как можно использовать "негативные" фильтры (состояние "closed successful" будет удалено из списков выбора). Вы также можете видеть, что не заданные условия для "properties" для заявки будет означать, что оно верно для всех заявок, т.е. ACL применяется всегда. Это может быть полезно, если вы желаете скрыть определенные значения по умолчанию и допустить ввод других значений только в заданных обстоятельствах (например, если агент принадлежит определенной группе).
sw: Huu mfano unaonyesha jinsi inavyowezekana kufafanua vichujio hasi (hali "imefungwa kwa mafanikio" itaondolewa). Pia unaweza kuona kutofafanua sifa za kufanana za tiketi itafananisha tiketi yoyote, ikimaanisha ACL itatumika mara zote. Hii itakuwa na manufaa kama utataka kuficha baadhi ya thamani kwa chaguo-msingi, na kuziwezesha katika hali maalumu (mf. kama wakala yupo kwenye kundi maalumu).

source: $Self->{TicketAcl}->{'102-Third-ACL-Example'} = { # match properties Properties => { # current ticket match properties (match always) }, # return possible options PossibleNot => { # possible ticket options Ticket => { State => ['closed successful'], }, }, };
ja: $Self->{TicketAcl}->{'102-Third-ACL-Example'} = { # マッチ・プロパティ Properties => { # 現在のチケットのマッチ・プロパティ(常にマッチ) }, # 可能なオプションに戻る PossibleNot => { # 可能なチケット・オプション Ticket => { State => ['closed successful'], }, }, };

source: ACL only showing Hardware services for tickets that are created in queues that start with &quot;HW&quot;.
ja: &quot;HW&quot;で始まるキューが作成されるハードウェア・サービス・チケットのみを表示するACL
ru: ACL только отображает Hardware-сервисы для заявок, которые были созданы в очередях, начинающихся с &quot;HW&quot;.
sw: ACL inaonyesha huduma za Vifaa kwa ajili ya tiketi ambazo zinatengenezwa kwenye foleni zinazoanza na &quot;HW&quot;

source: This example also shows you how you can use regular expressions for matching tickets and for filtering the available options.
ja: ここでは、マッチするチケットと利用可能なオプションのフィルタリングのための正規表現を使用することができるかについても例示します。
ru: Этот пример также показывает как можно использовать регулярные выражения для сопоставления заявок и фильтрации доступных опций.
sw: Huu mfano unaonyesha jinsi unavyoweza kutumia semi za kawaida kufananisha tiketi na kuchuja machaguo yaliyopo.

source: $Self->{TicketAcl}->{'Only-Hardware-Services-for-HW-Queues'} = { # match properties # note we don't have "Ticket => {" because there's no ticket yet Properties => { Queue => { Name => ['[RegExp]HW'], } }, # return possible options Possible => { # possible ticket options Ticket => { Service => ['[RegExp]^(Hardware)'], }, }, };
ja: $Self->{TicketAcl}->{'Only-Hardware-Services-for-HW-Queues'} = { # マッチ・プロパティ # note we don't have "Ticket => {" because there's no ticket yet Properties => { Queue => { Name => ['[RegExp]HW'], } }, # 可能なオプションに戻る Possible => { # 可能なチケット・オプション Ticket => { Service => ['[RegExp]^(Hardware)'], }, }, };

source: Reference
ja: 参照
ru: Сссылка
sw: Marejeo

source: In the example below there is a list of all parameters which can be used for ACLs.
ja: 下記の例において、ACLで使用可能な全パラメーターのリストがあります。
ru: В нижеприведенном Сценарии представлен список всех параметров, которые могут быть использованы для списка прав доступа (ACLs).
sw: Kwenye mfano chini kuna orodha ya parameta zote ambazo zinaweza kutumika na ACLs.

source: Please see the <link linkend="process-management-acl">section on ACLs</link> in the <link linkend="process-management">ProcessManagement</link> documentation for a detailed descripton of how to use ACLs for process tickets.
ja: ACLをプロセス・チケットに使用する方法の詳細な記述については、<link linkend="process-management">ProcessManagement</link>文書で<link linkend="ACLについてのセクション">section on ACLs</link> を参照してください。

source: Reference showing all possible important ACL settings.
ja: 全ての可能かつ重要なACL設定を示すリファレンス（参照）
ru: Ссылка отображает все возможные важные настройки ACL
sw: Rejea inayoonyesha mipangilio yote muhimu ya ACLs.

source: # ticket acl $Self->{TicketAcl}->{'200-ACL-Reference'} = { # match properties (current values from the form) Properties => { # the used frontend module Frontend => { Action => ['AgentTicketPhone', 'AgentTicketEmail'], }, # the logged in agent User => { UserLogin => ['some login'], Group_rw => [ 'hotline', ], Role => [ 'admin', ], # ... }, # the logged in customer CustomerUser => { UserLogin => ['some login'], Group_rw => [ 'hotline', ], Role => [ 'admin', ], # ... }, # process properties Process => { ProcessEntityID => ['P1'], # the Process that the current ticket is part of ActivityEntityID => ['A1'], # the current Activity of the ticket ActivityDialogEntityID => ['AD1'], # the current ActivityDialog that the Agent/Customer is using }, # ticket properties Queue => { Name => ['Raw'], QueueID => ['some id'], GroupID => ['some id'], Email => ['some email'], RealName => ['OTRS System'], # ... }, Service => { ServiceID => ['some id'], Name => ['some name'], ParentID => ['some id'], # ... }, Type => { ID => ['some id'], Name => ['some name'], # ... }, Priority = { ID => ['some id'], Name => ['some name'], # ... }, SLA = { SLAID => ['some id'], Name => ['some name'], Calendar => ['some calendar'], # ... }, State = { ID => ['some id'], Name => ['some name'], TypeName => ['some state type name'],, TypeID => ['some state type id'], # ... }, Owner => { UserLogin => ['some login'], Group_rw => [ 'some group', ], Role => [ 'admin', ], # ... }, Responsible => { UserLogin => ['some login'], Group_rw => [ 'some group', ], Role => [ 'admin', ], # ... }, DynamicField => { # Names must be in DynamicField_&lt;field_name&gt; format. # Values in [ ... ] must always be the untranslated internal data keys # specified in the dynamic field definition and # not the data values shown to the user. DynamicField_Field1 => ['some value'], DynamicField_OtherField => ['some value'], DynamicField_TicketFreeText2 => ['some value'], # ... }, # alternatively, ticket properties can be specified in the ticket hash Ticket => { Queue => ['Raw'], State => ['new', 'open'], Priority => ['some priority'], Lock => ['lock'], CustomerID => ['some id'], CustomerUserID => ['some id'], Owner => ['some owner'], DynamicField_Field1 => ['some value'], DynamicField_MyField => ['some value'], # ... }, }, # match properties (existing values from the database) PropertiesDatabase => { # See section "Properties", the same config can be used here. # ... } # return possible options (white list) Possible => { # possible ticket options (white list) Ticket => { Queue => ['Hotline', 'Coordination'], State => ['some state'], Priority => ['5 very high'], DynamicField_Field1 => ['some value'], DynamicField_MyField => ['some value'], # ... NewOwner => ['some owner'], OldOwner => ['some owner'], # ... }, # Limit the number of possible ActivityDialogs the Agent/Customer # can use in a process ticket. ActivityDialog => ['AD1', 'AD3'], # Limit the number of possible Processes that can be started Process => ['P1', 'P2'], # possible action options (white list) Action => { AgentTicketBounce => 1, AgentTicketClose => 1, AgentTicketCompose => 0, AgentTicketCustomer => 0, AgentTicketForward => 0, AgentTicketFreeText => 1, AgentTicketHistory => 1, AgentTicketLink => 0, AgentTicketLock => 1, AgentTicketMerge => 0, AgentTicketMove => 1, AgentTicketNote => 1, AgentTicketOwner => 1, AgentTicketPending => 1, AgentTicketPhone => 1, # only used to hide the Split action AgentTicketPhoneInbound => 0, AgentTicketPhoneOutbound => 1, AgentTicketPrint => 1, AgentTicketPriority => 0, AgentTicketResponsible => 1, AgentTicketWatcher => 1, AgentTicketZoom => 1, AgentLinkObject => 1, # only used to hide the Link action }, }, # remove options (black list) PossibleNot => { # See section "Possible" # ... }, };
ja: # ticket acl $Self->{TicketAcl}->{‘200-ACL-Reference’} = { # マッチ・プロパティ (フォームからの現在の値) Properties => { # 使用されるフロントエンド・モジュール Frontend => { Action => [‘AgentTicketPhone’, ‘AgentTicketEmail’], }, # ログインした担当者 User => { UserLogin => [‘some login’], Group_rw => [ ‘hotline’, ], Role => [ ‘admin’, ], # … }, # ログインした顧客 CustomerUser => { UserLogin => [‘some login’], Group_rw => [ ‘hotline’, ], Role => [ ‘admin’, ], # … }, # プロセス・プロパティ Process => { ProcessEntityID => [‘P1’], # 現在のチケットがその一部であるプロセス ActivityEntityID => [‘A1’], # 現在のチケットのアクティビティ ActivityDialogEntityID => [‘AD1’], # 担当者/顧客が使用している現在のActivityDialog }, # チケット・プロパティ Queue => { Name => [‘Raw’], QueueID => [‘some id’], GroupID => [‘some id’], Email => [‘some email’], RealName => [‘OTRS System’], # … }, Service => { ServiceID => [‘some id’], Name => [‘some name’], ParentID => [‘some id’], # … }, Type => { ID => [‘some id’], Name => [‘some name’], # … }, Priority = { ID => [‘some id’], Name => [‘some name’], # … }, SLA = { SLAID => [‘some id’], Name => [‘some name’], Calendar => [‘some calendar’], # … }, State = { ID => [‘some id’], Name => [‘some name’], TypeName => [‘some state type name’],, TypeID => [‘some state type id’], # … }, Owner => { UserLogin => [‘some login’], Group_rw => [ ‘some group’, ], Role => [ ‘admin’, ], # … }, Responsible => { UserLogin => [‘some login’], Group_rw => [ ‘some group’, ], Role => [ ‘admin’, ], # … }, DynamicField => { # 名前はDynamicField_&lt;field_name&gt; formatになければなりません。 # [ … ] の値は常に未翻訳の内部データキーでなければなりません。 # 動的フィールド定義で指定され、かつ # ユーザに非表示のデータ値です。 DynamicField_Field1 => [‘some value’], DynamicField_OtherField => [‘some value’], DynamicField_TicketFreeText2 => [‘some value’], # … }, # 別の方法としてはチケット・プロパティはチケット・ハッシュで指定もできます。 Ticket => { Queue => [‘Raw’], State => [‘new’, ‘open’], Priority => [‘some priority’], Lock => [‘lock’], CustomerID => [‘some id’], CustomerUserID => [‘some id’], Owner => [‘some owner’], DynamicField_Field1 => [‘some value’], DynamicField_MyField => [‘some value’], # … }, }, # マッチプロパティ (データベースからの既存値) PropertiesDatabase => { # プロパティのセクションを御覧ください。ここと同じconfigが使用されています。 # … } # 可能なオプションに戻る (ホワイトリスト) Possible => { # 可能なチケットオプション (ホワイトリスト) Ticket => { Queue => [‘Hotline’, ‘Coordination’], State => [‘some state’], Priority => [‘5 very high’], DynamicField_Field1 => [‘some value’], DynamicField_MyField => [‘some value’], # … NewOwner => [‘some owner’], OldOwner => [‘some owner’], # … }, # 担当者/顧客が１つのプロセス・チケットで利用可能な # ActivityDialogs数を制限します。 ActivityDialog => [‘AD1’, ‘AD3’], # 開始可能なプロセス数を制限します。 Process => [‘P1’, ‘P2’], # 可能なアクション・オプション (ホワイトリスト) Action => { AgentTicketBounce => 1, AgentTicketClose => 1, AgentTicketCompose => 0, AgentTicketCustomer => 0, AgentTicketForward => 0, AgentTicketFreeText => 1, AgentTicketHistory => 1, AgentTicketLink => 0, AgentTicketLock => 1, AgentTicketMerge => 0, AgentTicketMove => 1, AgentTicketNote => 1, AgentTicketOwner => 1, AgentTicketPending => 1, AgentTicketPhone => 1, # 分割アクションを非表示にするためだけに使用します。 AgentTicketPhoneInbound => 0, AgentTicketPhoneOutbound => 1, AgentTicketPrint => 1, AgentTicketPriority => 0, AgentTicketResponsible => 1, AgentTicketWatcher => 1, AgentTicketZoom => 1, AgentLinkObject => 1, # リンク・アクションを非表示にするためだけに使用します。 }, }, # オプション（ブラックリスト）を削除します PossibleNot => { # See section "Possible" # … }, };
