Repository: DSigmund/doc-admin
Catalog: i18n/doc-admin.*.po
Languages: ja, ru, sw

source: # 1. Customer user backend: DB # (customer database backend and settings) $Self->{CustomerUser1} = { Name => 'Customer Database', Module => 'Kernel::System::CustomerUser::DB', Params => { # if you want to use an external database, add the # required settings # DSN => 'DBI:odbc:yourdsn', # Type => 'mssql', # only for ODBC connections # DSN => 'DBI:mysql:database=customerdb;host=customerdbhost', # User => '', # Password => '', Table => 'customer_user', }, # customer unique id CustomerKey => 'login', # customer # CustomerID => 'customer_id', CustomerValid => 'valid_id', CustomerUserListFields => ['first_name', 'last_name', 'email'], CustomerUserSearchFields => ['login', 'last_name', 'customer_id'], CustomerUserSearchPrefix => '', CustomerUserSearchSuffix => '*', CustomerUserSearchListLimit => 250, CustomerUserPostMasterSearchFields => ['email'], CustomerUserNameFields => ['title','first_name','last_name'], CustomerUserEmailUniqCheck => 1, # # show not own tickets in customer panel, CompanyTickets # CustomerUserExcludePrimaryCustomerID => 0, # # generate auto logins # AutoLoginCreation => 0, # AutoLoginCreationPrefix => 'auto', # # admin can change customer preferences # AdminSetPreferences => 1, # # cache time to live in sec. - cache any database queries # CacheTTL => 0, # # just a read only source # ReadOnly => 1, Map => [ # note: Login, Email and CustomerID needed! # var, frontend, storage, shown (1=always,2=lite), required, storage-type, http-link, readonly, http-link-target [ 'UserTitle', 'Title', 'title', 1, 0, 'var', '', 0 ], [ 'UserFirstname', 'Firstname', 'first_name', 1, 1, 'var', '', 0 ], [ 'UserLastname', 'Lastname', 'last_name', 1, 1, 'var', '', 0 ], [ 'UserLogin', 'Username', 'login', 1, 1, 'var', '', 0 ], [ 'UserPassword', 'Password', 'pw', 0, 0, 'var', '', 0 ], [ 'UserEmail', 'Email', 'email', 1, 1, 'var', '', 0 ], [ 'UserCustomerID', 'CustomerID', 'customer_id', 0, 1, 'var', '', 0 ], [ 'UserPhone', 'Phone', 'phone', 1, 0, 'var', '', 0 ], [ 'UserFax', 'Fax', 'fax', 1, 0, 'var', '', 0 ], [ 'UserMobile', 'Mobile', 'mobile', 1, 0, 'var', '', 0 ], [ 'UserStreet', 'Street', 'street', 1, 0, 'var', '', 0 ], [ 'UserZip', 'Zip', 'zip', 1, 0, 'var', '', 0 ], [ 'UserCity', 'City', 'city', 1, 0, 'var', '', 0 ], [ 'UserCountry', 'Country', 'country', 1, 0, 'var', '', 0 ], [ 'UserComment', 'Comment', 'comments', 1, 0, 'var', '', 0 ], [ 'ValidID', 'Valid', 'valid_id', 0, 1, 'int', '', 0 ], ], # default selections Selections => { UserTitle => { 'Mr.' => 'Mr.', 'Mrs.' => 'Mrs.', }, }, }; # 2. Customer user backend: LDAP # (customer ldap backend and settings) $Self->{CustomerUser2} = { Name => 'LDAP Datasource', Module => 'Kernel::System::CustomerUser::LDAP', Params => { # ldap host Host => 'bay.csuhayward.edu', # ldap base dn BaseDN => 'ou=seas,o=csuh', # search scope (one|sub) SSCOPE => 'sub', # # The following is valid but would only be necessary if the # # anonymous user does NOT have permission to read from the LDAP tree UserDN => '', UserPw => '', # in case you want to add always one filter to each ldap query, use # this option. e. g. AlwaysFilter => '(mail=*)' or AlwaysFilter => '(objectclass=user)' AlwaysFilter => '', # if both your frontend and your LDAP are unicode, use this: # SourceCharset => 'utf-8', # DestCharset => 'utf-8', # if your frontend is e. g. iso-8859-1 and the character set of your # ldap server is utf-8, use these options: # SourceCharset => 'utf-8', # DestCharset => 'iso-8859-1', # Net::LDAP new params (if needed - for more info see perldoc Net::LDAP) Params => { port => 389, timeout => 120, async => 0, version => 3, }, }, # customer unique id CustomerKey => 'uid', # customer # CustomerID => 'mail', CustomerUserListFields => ['cn', 'mail'], CustomerUserSearchFields => ['uid', 'cn', 'mail'], CustomerUserSearchPrefix => '', CustomerUserSearchSuffix => '*', CustomerUserSearchListLimit => 250, CustomerUserPostMasterSearchFields => ['mail'], CustomerUserNameFields => ['givenname', 'sn'], # show not own tickets in customer panel, CompanyTickets CustomerUserExcludePrimaryCustomerID => 0, # add a ldap filter for valid users (expert setting) # CustomerUserValidFilter => '(!(description=locked))', # admin can't change customer preferences AdminSetPreferences => 0, Map => [ # note: Login, Email and CustomerID needed! # var, frontend, storage, shown (1=always,2=lite), required, storage-type, http-link, readonly [ 'UserTitle', 'Title', 'title', 1, 0, 'var', '', 0 ], [ 'UserFirstname', 'Firstname', 'givenname', 1, 1, 'var', '', 0 ], [ 'UserLastname', 'Lastname', 'sn', 1, 1, 'var', '', 0 ], [ 'UserLogin', 'Username', 'uid', 1, 1, 'var', '', 0 ], [ 'UserEmail', 'Email', 'mail', 1, 1, 'var', '', 0 ], [ 'UserCustomerID', 'CustomerID', 'mail', 0, 1, 'var', '', 0 ], # [ 'UserCustomerIDs', 'CustomerIDs', 'second_customer_ids', 1, 0, 'var', '', 0 ], [ 'UserPhone', 'Phone', 'telephonenumber', 1, 0, 'var', '', 0 ], [ 'UserAddress', 'Address', 'postaladdress', 1, 0, 'var', '', 0 ], [ 'UserComment', 'Comment', 'description', 1, 0, 'var', '', 0 ], ], };
ja: # 1. Customer user backend: DB # (顧客データベース・バックグラウンドと設定) $Self->{CustomerUser1} = { Name => 'Customer Database', Module => 'Kernel::System::CustomerUser::DB', Params => { # 外部データベースを使用したければ # 必要な設定を追加して下さい。 # DSN => 'DBI:odbc:yourdsn', # Type => 'mssql', # only for ODBC connections # DSN => 'DBI:mysql:database=customerdb;host=customerdbhost', # User => '', # Password => '', Table => 'customer_user', }, # customer unique id CustomerKey => 'login', # customer # CustomerID => 'customer_id', CustomerValid => 'valid_id', CustomerUserListFields => ['first_name', 'last_name', 'email'], CustomerUserSearchFields => ['login', 'last_name', 'customer_id'], CustomerUserSearchPrefix => '', CustomerUserSearchSuffix => '*', CustomerUserSearchListLimit => 250, CustomerUserPostMasterSearchFields => ['email'], CustomerUserNameFields => ['title','first_name','last_name'], CustomerUserEmailUniqCheck => 1, # # show not own tickets in customer panel, CompanyTickets # CustomerUserExcludePrimaryCustomerID => 0, # # generate auto logins # AutoLoginCreation => 0, # AutoLoginCreationPrefix => 'auto', # # admin can change customer preferences # AdminSetPreferences => 1, # # cache time to live in sec. - cache any database queries # CacheTTL => 0, # # just a read only source # ReadOnly => 1, Map => [ # note: Login, Email and CustomerID needed! # var, frontend, storage, shown (1=always,2=lite), required, storage-type, http-link, readonly, http-link-target [ 'UserTitle', 'Title', 'title', 1, 0, 'var', '', 0 ], [ 'UserFirstname', 'Firstname', 'first_name', 1, 1, 'var', '', 0 ], [ 'UserLastname', 'Lastname', 'last_name', 1, 1, 'var', '', 0 ], [ 'UserLogin', 'Username', 'login', 1, 1, 'var', '', 0 ], [ 'UserPassword', 'Password', 'pw', 0, 0, 'var', '', 0 ], [ 'UserEmail', 'Email', 'email', 1, 1, 'var', '', 0 ], [ 'UserCustomerID', 'CustomerID', 'customer_id', 0, 1, 'var', '', 0 ], [ 'UserPhone', 'Phone', 'phone', 1, 0, 'var', '', 0 ], [ 'UserFax', 'Fax', 'fax', 1, 0, 'var', '', 0 ], [ 'UserMobile', 'Mobile', 'mobile', 1, 0, 'var', '', 0 ], [ 'UserStreet', 'Street', 'street', 1, 0, 'var', '', 0 ], [ 'UserZip', 'Zip', 'zip', 1, 0, 'var', '', 0 ], [ 'UserCity', 'City', 'city', 1, 0, 'var', '', 0 ], [ 'UserCountry', 'Country', 'country', 1, 0, 'var', '', 0 ], [ 'UserComment', 'Comment', 'comments', 1, 0, 'var', '', 0 ], [ 'ValidID', 'Valid', 'valid_id', 0, 1, 'int', '', 0 ], ], # default selections Selections => { UserTitle => { 'Mr.' => 'Mr.', 'Mrs.' => 'Mrs.', }, }, }; # 2. Customer user backend: LDAP # (customer ldap backend and settings) $Self->{CustomerUser2} = { Name => 'LDAP Datasource', Module => 'Kernel::System::CustomerUser::LDAP', Params => { # ldap host Host => 'bay.csuhayward.edu', # ldap base dn BaseDN => 'ou=seas,o=csuh', # search scope (one|sub) SSCOPE => 'sub', # # The following is valid but would only be necessary if the # # anonymous user does NOT have permission to read from the LDAP tree UserDN => '', UserPw => '', # in case you want to add always one filter to each ldap query, use # this option. e. g. AlwaysFilter => '(mail=*)' or AlwaysFilter => '(objectclass=user)' AlwaysFilter => '', # if both your frontend and your LDAP are unicode, use this: # SourceCharset => 'utf-8', # DestCharset => 'utf-8', # if your frontend is e. g. iso-8859-1 and the character set of your # ldap server is utf-8, use these options: # SourceCharset => 'utf-8', # DestCharset => 'iso-8859-1', # Net::LDAP new params (if needed - for more info see perldoc Net::LDAP) Params => { port => 389, timeout => 120, async => 0, version => 3, }, }, # customer unique id CustomerKey => 'uid', # customer # CustomerID => 'mail', CustomerUserListFields => ['cn', 'mail'], CustomerUserSearchFields => ['uid', 'cn', 'mail'], CustomerUserSearchPrefix => '', CustomerUserSearchSuffix => '*', CustomerUserSearchListLimit => 250, CustomerUserPostMasterSearchFields => ['mail'], CustomerUserNameFields => ['givenname', 'sn'], # show not own tickets in customer panel, CompanyTickets CustomerUserExcludePrimaryCustomerID => 0, # add a ldap filter for valid users (expert setting) # CustomerUserValidFilter => '(!(description=locked))', # admin can't change customer preferences AdminSetPreferences => 0, Map => [ # note: Login, Email and CustomerID needed! # var, frontend, storage, shown (1=always,2=lite), required, storage-type, http-link, readonly [ 'UserTitle', 'Title', 'title', 1, 0, 'var', '', 0 ], [ 'UserFirstname', 'Firstname', 'givenname', 1, 1, 'var', '', 0 ], [ 'UserLastname', 'Lastname', 'sn', 1, 1, 'var', '', 0 ], [ 'UserLogin', 'Username', 'uid', 1, 1, 'var', '', 0 ], [ 'UserEmail', 'Email', 'mail', 1, 1, 'var', '', 0 ], [ 'UserCustomerID', 'CustomerID', 'mail', 0, 1, 'var', '', 0 ], # [ 'UserCustomerIDs', 'CustomerIDs', 'second_customer_ids', 1, 0, 'var', '', 0 ], [ 'UserPhone', 'Phone', 'telephonenumber', 1, 0, 'var', '', 0 ], [ 'UserAddress', 'Address', 'postaladdress', 1, 0, 'var', '', 0 ], [ 'UserComment', 'Comment', 'description', 1, 0, 'var', '', 0 ], ], };

source: It is possible to integrate up to 10 different customer backends. Use the customer management interface in OTRS to view or edit (assuming write access is enabled) all customer data.
ja: 10までの異なる顧客バックエンドを統合することは可能です。全ての顧客情報を見るか編集する(書き込みアクセス権限が可能と仮定して)ためにOTRSの中で顧客管理インターフェースを使用してください。
ru: Есть возможность интегрировать до 10 различных пользовательских бэк-эндов. Используйте интерфейс управления клиентами в OTRS, чтобы просматривать и редактировать данные о них (при условии наличия прав для записи).
sw: Inawezekana kuunganisha mpaka mazingira ya nyuma 10 tofauti ya mteja. Tumia kiolesura cha usimamizi cha mteja katika OTRS kuona au kuhariri (tukiamini utawala data umewezeshwa) data zote za mteja.

source: Storing CustomerUser data in dynamic fields
ja: 動的フィールドにCustomerUserデータを格納すること
ru: Сохранение информации о клиенте в динамических полях
sw: Kuhifadhi data za MtejaMtumiaji katika sehemu zinazobadilika.

source: Sometimes it can be useful to also store CustomerUser data directly in dynamic fields of a ticket, for example to create special statistics on this data.
ja: 顧客データを直接チケットの動的フィールドに格納することも時には役立つかもしれません。（例えばこのデータで特別な統計を作成するような目的で）
ru: Иногда бывает полезным также сохранить данные клиента заявки непосредственно в динамических полях заявки, для создания некоторых отчетов по этим данным. Например, по заявкам компании, когда клиент в течение отчетного периода перешел в другую компанию того же провайдера услуг техподдержки.
sw: Mara nyingine inaweza kuwa na manufaa kuhifadhi data za MtejaMtumiaji katika sehemu zinazobadilika za tiketi, kwa fano kutengeneza takwimu muhimu kwenye data hizi.

source: The dynamic field values are set when a ticket is created or when the customer of a ticket is changed. The values of the dynamic fields are taken from the customer data. This works for all backends, but is especially useful for LDAP-backends.
ja: チケットが作成される場合、あるいはチケットの顧客が変更される場合、動的フィールド値がセットされます。動的フィールドの値は顧客データから得られます。これはすべてのバックエンドのために働きますが、特にLDAPバックエンドに役立ちます。
ru: Динамические поля заполняются при создании заявки или когда клиент заявки изменяется. Значения полей берутся из данных клиента. Это работает для всех бэкендов, но наиболее полезно для LDAP-бэкендов.
sw: Thamani za sehemu zinazobadilika zinasetiwa tiketi inapotengenezwa au pale mteja wa tiketi anapobadilishwa. Thamani za sehemu zinazobadilika zinachukuliwa kutoka kwenye data za mteja. Hii inafanya kazi kwa mazingira yoye ya nyuma, lakini ni ya manufaa zaidi kwa mazingir aya nyuma ya LDAP.

source: To activate this optional feature of OTRS, please activate the settings "Ticket::EventModulePost###930-DynamicFieldFromCustomerUser" and "DynamicFieldFromCustomerUser::Mapping". The latter setting contains the configuration of which CustomerUser field entry should be stored in which ticket dynamic field. The fields must be present in the system and should be enabled for AgentTicketFreeText, so that they can be set manually. They mustn't be enabled for AgentTicketPhone, AgentTicketEmail and AgentTicketCustomer. If they were, they would have precedence over the automatically set values.
ja: OTRSのこのオプション機能を活性化するために、以下の二つの設定を活性化して下さい。「Ticket::EventModulePost###930-DynamicFieldFromCustomerUser」および「DynamicFieldFromCustomerUser::Mapping」。後の設定では、CustomerUserフィールド入力がチケットのどの動的フィールドに格納しなければならないかの構成を含んでいます。フィールドはシステムの中にあるに違いありませんし、AgentTicketFreeTextのために可能になるに違いありません。そのゆえ、それらは手動でセットすることができます。それらはAgentTicketPhone、AgentTicketEmailおよびAgentTicketCustomerのために可能になってはなりません。もしそれらが可能ならば、それらは自動設定値に対して先行するでしょう。
ru: Для включения этой опции OTRS, активируйте параметр "Ticket::EventModulePost###930-DynamicFieldFromCustomerUser" и "DynamicFieldFromCustomerUser::Mapping". Последний параметр содержит настройку, какие поля данных клиента должны сохраняться в каждом из динамических полей. Поля должны быть заранее созданы в системе и включены в AgentTicketFreeText, так чтобы они были доступны для ручного заполнения. Они должны быть недоступны для ввода в AgentTicketPhone, AgentTicketEmail и AgentTicketCustomer, во избежание перекрытия автоматическии установленных значений.
sw: Kuamilisha hiki kipengele cha hiari cha OTRS, tafadhali amilisha mipangilio "Tiketi::ModuliTukioTuma###930-SehemuInayobadilikaKutokaKwaMtejaMtumiaji" na "SehemuInayobadilikaKutokaKwaMtejaMtumiaji::Kuunganisha". Mpangilio wa mwisho una usanidi ambao ingizo la sehemu ya MtumiajiMteja linatakiwa kuhifadhiwa katika sehemu inayobadilika ya tiketi. Sehemu inabidi ziwepo kwenye mfumo na zinatakiwa kuwezeshwa kwa ajili ya WakalaTiketiHuruNakala, ili zisetiwe kwa mikono. Hazitakiwi kuwezeshwa kwa ajili ya WakalaTiketiSimu, WakalaTiketiBaruapepe na WakalaTiketiMteja. Kama zilikuwa, inabidi zitangulie thamani zilizosetiwa kiotomatiki.

source: Backends to authenticate Agents and Customers
ja: 担当者と顧客を認証するバックエンド
ru: Хранилища (бэк-енды) для аутентификации Агентов и Клиентов
sw: Mazingira ya nyuma ya kuthibitisha Mawakala na Wateja

source: OTRS offers the option to authenticate agents and customers against different backends.
ja: OTRSは、異なるバックエンドに対する、担当者および顧客を認証するオプションを提示します。
ru: OTRS предлагает опцию для проверки подлинности агентов и клиентов с использованием различных хранилищ данных (бэкендов).
sw: OTRS inatoa chaguo la kuthibitisha mawakala na wateja katika mazingira tofauti ya nyuma.

source: Authentication backends for Agents
ja: 担当者のための認証バックエンド
ru: Хранилища данных (бэк-енды) для аутентификации Агентов
sw: Mazingira ya nyuma ya kuthibitisha Mawakala

source: DB (Default)
ja: DB(デフォルト)
ru: База Данных (DB, по умаолчанию)
sw: DB (Chaguo-msingi)

source: The backend to authenticate agents which is used by default is the OTRS database. Agents can be added and edited via the <link linkend="adminarea-agents">agent management interface</link> in the <link linkend="adminarea">Admin page</link> (see Example 11-6 below).
ja: デフォルトで使用される担当者を認証するバックエンドは、OTRSデータベースです。担当者は、<link linkend="adminarea">管理者ページ</link>の<link linkend="adminarea-agents">担当者管理インターフェイス</link>経由で 追加・編集されます(下のサンプル11-6参照)。
ru: В качестве бэк-энда для аутентификации агентов в OTRS, по умолчанию, используется база данных. Чтобы добавлять агентов, редактировать данные о них, перейдите на страницу <link linkend="adminarea">Панель Администрирования</link> и нажмите ссылку <link linkend="adminarea-agents">Интерфейс для управления агентами</link> (см. ниже Пример 11.6).
sw: Mazingira ya nyuma yatumikayo kwa kawaida ni hifadhidata ya OTRS. Unaweza kuongeza au kuhariri mawakala kupitia <link linkend="adminarea-agents">kiolesura cha usimamizi wa mteja</link> katika<link linkend="adminarea">Kurasa ya Msimamizi</link>(ona Mfano 11-6 chini).

source: Authenticate agents against a DB backend
ja: DBバックエンドに対する認証エージェント
ru: Проверка подлинности агентов путем использования Базы Данных (DB) в качестве хранилища информации.
sw: Thibitisha mawakala katika mazingira ya nyuma ya DB.

source: If an LDAP directory has all your agent data stored, you can use the LDAP module to authenticate your users in OTRS (see Example 11-7 below). This module has only read access to the LDAP tree, which means that you cannot edit your user data via the <link linkend='adminarea-agents'>agent management interface</link>.
ja: LDAPディレクトリが担当者データをすべて保存する場合、OTRSの中のユーザを認証するためにLDAPモジュールを使用することができます(下記の例11-7を参照)。このモジュールはLDAPツリーに対して単に読み込みアクセスを有しています。それは、<link linkend='adminarea-agents'>担当者管理インターフェース</link>経由で利用者データを編集することができないことを意味します。
ru: Если данные всех ваших агентов хранятся в LDAP-директории, то для аутентификации пользователей в OTRS можно использовать LDAP-модуль (см. ниже Пример 11-7). Этот модуль имеет права только на чтение дерева LDAP-каталогов, что означает что нету возможности редактировать данные пользователей используя ссылку <link linkend='adminarea-agents'> веб-интерфейс для управления пользователями </link> .
sw: Kama mpangilio orodha wa LDAP una data zote zilizohifadhiwa za wakala wako, unaweza kutumia moduli ya LDAP kuthibitisha watumiaji wako katika OTRS (ona Mfano 11-7 chini). Hii moduli ina ufikivu wa kusoma tu kwenye matawi ya LDAP, inamaanisha huwezi kuhariri data zako za mtumiaji kupitia <link linkend='adminarea-agents'>kiolesura cha usimamizi wa mteja</link>.

source: Authenticate agents against an LDAP backend
ja: LDAPバックエンドに対する認証エージェント
ru: Проверка подлинности агентов при использовании LDAP в качестве хранилища данных
sw: Thibitisha mawakala katika mazingira ya nyuma ya LDAP.

source: # This is an example configuration for an LDAP auth. backend. # (Make sure Net::LDAP is installed!) $Self->{'AuthModule'} = 'Kernel::System::Auth::LDAP'; $Self->{'AuthModule::LDAP::Host'} = 'ldap.example.com'; $Self->{'AuthModule::LDAP::BaseDN'} = 'dc=example,dc=com'; $Self->{'AuthModule::LDAP::UID'} = 'uid'; # Check if the user is allowed to auth in a posixGroup # (e. g. user needs to be in a group xyz to use otrs) $Self->{'AuthModule::LDAP::GroupDN'} = 'cn=otrsallow,ou=posixGroups,dc=example,dc=com'; $Self->{'AuthModule::LDAP::AccessAttr'} = 'memberUid'; # for ldap posixGroups objectclass (just uid) # $Self->{'AuthModule::LDAP::UserAttr'} = 'UID'; # for non ldap posixGroups objectclass (with full user dn) # $Self->{'AuthModule::LDAP::UserAttr'} = 'DN'; # The following is valid but would only be necessary if the # anonymous user do NOT have permission to read from the LDAP tree $Self->{'AuthModule::LDAP::SearchUserDN'} = ''; $Self->{'AuthModule::LDAP::SearchUserPw'} = ''; # in case you want to add always one filter to each ldap query, use # this option. e. g. AlwaysFilter => '(mail=*)' or AlwaysFilter => '(objectclass=user)' $Self->{'AuthModule::LDAP::AlwaysFilter'} = ''; # in case you want to add a suffix to each login name, then # you can use this option. e. g. user just want to use user but # in your ldap directory exists user@domain. # $Self->{'AuthModule::LDAP::UserSuffix'} = '@domain.com'; # Net::LDAP new params (if needed - for more info see perldoc Net::LDAP) $Self->{'AuthModule::LDAP::Params'} = { port => 389, timeout => 120, async => 0, version => 3, };
ja: # これはLDAP認証バックエンド用サンプル構成です。 # (Net::LDAPがインストール済であることを確認下さい。) $Self->{'AuthModule'} = 'Kernel::System::Auth::LDAP'; $Self->{'AuthModule::LDAP::Host'} = 'ldap.example.com'; $Self->{'AuthModule::LDAP::BaseDN'} = 'dc=example,dc=com'; $Self->{'AuthModule::LDAP::UID'} = 'uid'; # ユーザがposixGroupで認証を許可されていることを確認します。 # (例えばユーザはOTRSを利用するグループ xyz に属する必要があります。) $Self->{'AuthModule::LDAP::GroupDN'} = 'cn=otrsallow,ou=posixGroups,dc=example,dc=com'; $Self->{'AuthModule::LDAP::AccessAttr'} = 'memberUid'; # for ldap posixGroups objectclass (just uid) # $Self->{'AuthModule::LDAP::UserAttr'} = 'UID'; # for non ldap posixGroups objectclass (with full user dn) # $Self->{'AuthModule::LDAP::UserAttr'} = 'DN'; # 次は有効です。しかし 匿名ユーザがLDAPツリーから # 読み込み許可を持たない場合のみ必要です。 $Self->{'AuthModule::LDAP::SearchUserDN'} = ''; $Self->{'AuthModule::LDAP::SearchUserPw'} = ''; # 常にあるフィルタを各LDAPクエリに追加したい場合このオプションを使います。 # たとえば AlwaysFilter => '(mail=*)' or AlwaysFilter => '(objectclass=user)' $Self->{'AuthModule::LDAP::AlwaysFilter'} = ''; # ログイン名のに接頭辞を追加したければ、このオプションを使います。 # たとえばユーザがuserを使いたいが、LDAPにuser@domainが存在する場合。 # $Self->{'AuthModule::LDAP::UserSuffix'} = '@domain.com'; # Net::LDAP new params (if needed - for more info see perldoc Net::LDAP) $Self->{'AuthModule::LDAP::Params'} = { port => 389, timeout => 120, async => 0, version => 3, };
