Repository: DSigmund/doc-admin
Catalog: i18n/doc-admin.*.po
Languages: ja, ru, sw

source: Trouble ticket systems such as OTRS handle trouble tickets like normal email. The messages are saved in the system. When a customer sends a request, a new ticket is generated by the system which is comparable to a new medical report being created. The response to this new ticket is comparable to a doctor's entry in the medical report. A ticket is closed if an answer is sent back to the customer, or if the ticket is separately closed by the system. If a customer responds again on an already closed ticket, the ticket is reopened with the new information added. Every ticket is stored and archived with complete information. Since tickets are handled like normal emails, attachments and contextual annotations will also be stored with each email. In addition, information on relevant dates, employees involved, working time needed for ticket resolution, etc. are also saved. At any later stage, tickets can be sorted, and it is possible to search through and analyze all information using different filtering mechanisms.
ja: OTRSのようなトラブル・チケット・システムはトラブル・チケットを通常のEメールのように取り扱います。メッセージはシステムに保存されます。顧客が依頼を送信すると、システムは新しいチケットを生成します。そのようなシステムは新しく作成される医療レポートに相当します。新しいチケットへの応答は、医者が医療レポートへの記入することに似ています。チケットは、回答が顧客へ返送された場合あるいは、チケットがシステムによって個別に閉じられた場合に、完了となります。もし顧客がすでに完了したチケットに再度応答すると、そのチケットは、新しい情報を追加された上で、再対応中となります。全てのチケットは格納され、完全な情報でアーカイブされます。チケットは通常のEメールのように取り扱われ、添付ファイルや文脈上の注釈もまた各Eメールに格納されます。さらに、基準日、従業員関係、チケットの解決に要した作業時間などの情報が保存されます。その後いつでも、チケットはソートされ、検索可能であり、さまざまなフィルタリング・メカニズムを使いすべての情報を分析することができます。
ru: Системы обработки заявок, такие как OTRS, обрабатывают заявки как обыкновенные email. Когда клиент посылает запрос, система создает новую заявку, что сравнимо с открытием новой медицинской карточки пациента больницы. Ответ в этой новой заявке можно сравнить с записью лечащего врача в медицинской карточке, свидетельствующей о изменении состояния здоровья пациента. Заявка считается закрытой, когда клиенту отправлен ответ или если заявка закрыта системой автоматически. Если клиент отправляет ответ на уже закрытую заявку, она будет заново открыта системой и в нее будет добавлена новая информация. Чтобы сохранить целосность всех данных, хранящихся в системе, каждая заявка хранится и архивируется вместе со всей информацией. Поскольку заявки обрабатываются как обыкновенные сообщения электронной почты - вместе с ними также будут сохранены все вложения и контекстные аннотации. Конечно же, такая полезная информация как примечания, даты, данные о нанятых работниках, рабочее время необходимое для работы с заявкой и т.д также сохраняется системой. Все заявки могут быть отсортированы в соответствующем порядке, также можно с легкостью производить поиск всей необходимой информации.
sw: Mifumo ya trouble ticket kama OTRS inashughulikia trouble tickets kama barua pepe za kawaida. Ujumbe unahifadhiwa kwenye mfumo. Mteja akituma ombi, tiketi mpya inatengenezwa na mfumo ambayo ni sawa na ripoti ya matibabu inayotengenezwa. Majibu kwa hii tiketi mpya ni sawa na ingizo la daktari kwenye ripoti ya matibabu. Tiketi inafungwa kama majibu yametumwa kwa mteja, au kama tiketi imefungwa na mfumo. Kama mteja akijibu tena tiketi iliyofungwa, tiketi itafunguliwa tena na taarifa mpya zitaongezwa. Kila tiketi inahifadhiwa na taarifa kamili. Kwa kuwa tiketi zinashughulikiwa kama barua pepe za kawaida, viambatanisho na maoni ya muktadha pia yatahifadhiwa na kila barua pepe. Na pia taarifa za tarehe husika, wafanyakazi husika, muda wa kazi unaohitajika kushughulikia tiketi, na kadhalika vinahifadhiwa. Katika ngazi yoyote ya baadaye tiketi zinaweza kupangwa na inawezekana kutafuta na kuchambua taarifa zote kwa kutumia taratibu mbali mbali za uchujaji.

source: OTRS Help Desk
ja: OTRS ヘルプデスク

source: This chapter describes the features of OTRS Help Desk (OTRS). You will find information about the hardware and software requirements for OTRS. Additionally, in this chapter you will learn how to get commercial support for OTRS, should you require it, and how to contact the community.
ja: この章では、OTRS ヘルプデスク (OTRS) の機能について説明します。OTRSのハードウェアとソフトウェアの要件に関する情報を提供します。さらにこの章では、コミュニティとの連絡方法、そしてもし必要ならOTRSに関する商用サポートを取得する方法を知ることができます。
ru: В этой главе описываются характерные особенности и функциональные возможности Открытой Системы Обработки Заявок (OTRS). Здесь вы найдете полезную информацию о том, какое оборудование и програмное обеспечение необходимо для функционирования OTRS. Также, в этой главе рассказывается о том, как получить коммерческую поддержку системы OTRS, на случай, если вы в ней нуждаетесь, а также, каким образом можно связаться с сообществом.
sw: Hii sura inaelezea vipengele vya OTRS Help Desk (OTRS) Utapata taarifa kuhusu mahitaji ya programu na vifaa kwa ajili ya OTRS. Kwa zaidi katika sura hii utajifunza jinsi ya kupata usaidizi wa ki biashara kwa OTRS, ukihitaji, na jinsi ya kuwasiliana na jamii.

source: Basics
ja: 基礎
ru: Основы
sw: Misingi

source: OTRS Help Desk (OTRS) is a web application that is installed on a web server and can be used with a web browser.
ja: OTRS ヘルプデスク (OTRS) は、 ウェブ サーバーにインストールされるウェブアプリケーションです。したがって ウェブ ブラウザーで使用することができます。
ru: OTRS Help Desk (OTRS) веб приложение, которое устанавливается на веб-сервер и используется в веб-браузере.
sw: OTRS Help Desk (OTRS) ni programu tumizi ya wavuti ambayo inasakinishwa katika seva ya wavuti na inaweza kutumika na kivinjari wavuti.

source: OTRS is separated into several components. The main component is the OTRS framework which contains all central functions for the application and the ticket system. It is possible to install additional applications such as OTRS::ITSM modules, integrations with Network Monitoring solutions, a knowledge base (FAQ), et cetera.
ja: OTRS ヘルプデスク (OTRS) は、 ウェブ サーバーにインストールされるウェブアプリケーションです。したがって ウェブ ブラウザーで使用することができます。OTRS はいくつかのコンポーネントに分かれています。主なコンポーネントは、アプリケーションとチケット システムのすべての主要機能を含んでいる OTRS フレームワークです。以下のような追加のアプリケーションをインストールすることが可能です。OTRS::ITSM モジュール、ネットワーク監視ソリューションとの統合、知識ベース（サポート技術情報 ）(FAQ) など。
ru: OTRS разделен на несколько компонентов. Главным компонентом всей системы является OTRS-фреймворк, в котором содержатся все основные функции приложения и система обработки заявок. Веб-интерфейс OTRS позволяет устанавливать дополнительные приложения, такие как, например, OTRS::ITSM, а также инструментальные средства для мониторинга информации о состоянии системы, базу знаний (FAQ) и многие другие.
sw: OTRS imegawanywa katika vijenzi tofauti. Kijenzi kikuu ni kiunzi cha OTRS ambacho kina kazi kuu zote za mfumo wa tiketi na programu-tumizi. Inawezekana kusakinisha programu-tumizi za ziada kama moduli za OTRS::ITSM, ushirikiano na ufumbuzi wa Ufuatiliaji wa Mtandao, msingi wa maarifa (Maswali yanayoulizwa mara kwa mara), na kadhalika.

source: Features
ja: 機能
ru: Особенности и функциональные возможности
sw: Vipengele

source: OTRS has many features. The following list gives an overview of the main features included in the OTRS framework.
ja: OTRSには多くの機能があります。OTRS フレームワークに含まれる主な機能の概要を以下に示します。
ru: OTRS имеет большой набор функций. Следующий список дает обзор основных особенностей, включенных в OTRS фреймворк.
sw: OTRS ina vipengele vingi. Orodha ifwatayo inatoa mapitio ya vipengele muhim vilivyopo katika kiunzi cha OTRS.

source: User interface
ja: ユーザ・インターフェイス
ru: Пользовательский интерфейс
sw: Kiolesura cha mtumiaji

source: OTRS comes with separate, modern web interfaces for agents and customers.
ja: OTRS には、担当者と顧客用に別々の最新のウェブ インターフェイスが付属します。
ru: OTRS поставляется с современным веб-интерфейсом разделенным для агентов и пользователей
sw: OTRS inakuja na wavuti za kiolesura mpya na tofauti kwa ajjili ya wakala na wateja.

source: It can be used on any modern web browser, including mobile platforms and is retina ready.
ja: モバイルプラットフォーム、ラティナディスプレ対応、どのモダンブラウザでも利用可能です
ru: Он прекрасно работает в любом современном браузере, включая мобильные платформы и retina-дисплеи.
sw: Inaweza kutumika katika kivinjari wavuti kipya, ikijumuisha utayari wa retina na jukwaa jongevu.

source: The web interface can be customized with own themes and skins.
ja: ウェブインターフェイスは、独自のテーマとスキンでカスタマイズできます。
ru: Используя темы и скины можно настроить веб-интерфейс по своему вкусу.
sw: Kiolesura cha wavuti kinaweza kugeuzwa kukufaa kwa dhima na dhamira zako

source: Powerful and customizable agent dashboard with personal ticket overviews and graphical statistics support.
ja: 強力でカスタマイズ可能な担当者用ダッシュボードは、個人チケット概要とグラフィカルな統計情報のサポートを実装しています。
ru: Многофункциональная, настраиваемая панель управления для агентов с персональным, отдельным блоком для просмотра заявок и графической статистикой.
sw: Dashibodi ya wakala ina nguvu na uwezo wa kugeuzwa kukufaa pia ina mapitio ya tiketi zako na usaidizi wa takwimu za michoro.

source: An extensible reporting engine provides various statistics and report scheduling options.
ja: 拡張可能なレポート作成エンジンは、様々な統計とレポートのスケジュール・オプションを提供します。
ru: Расширяемый генератор отчетов предоставляет различные статистические данные и настраиваемые параметры планирования отчетов.
sw: Injini panufu ya ripoti inatoa takwimu tofauti tofauti na chaguo la kuratibu ripori.

source: With the ProcessManagement it is possible to define own ticket-based screens and processes (ticket workflows).
ja: プロセス管理でチケット・ベースの独自の画面とプロセス (チケット・ワークフロー) を定義することが可能です。
ru: С помощью ProcessManagement можно создавать собственные, основанные на заявках экраны и процессы (потоки работ по заявке - workflows).
sw: Kwa kutumia MchakatoUsimamizi inawezekana kufafanua skrini za tiketi zako na michakato (tiketi za mtiririko wa kazi)

source: OTRS has a built-in rights management that can be extended with fine-grained access control lists (ACLs).
ja: OTRS は、権限管理システムを内蔵しており、きめ細かいアクセス制御リスト (ACLs) で拡張することができます。
ru: OTRS имеет встроенную систему прав, функциональность которой можно с легкостью расширить с помощью списков контроля доступа (ACL).
sw: OTRS ina usimamizi wa haki za ndani ambayo inaweza kupanuliwa na orodha dhibiti ufikivu (ACLs) zilizo hakikiwa.

source: Support for more than 30 languages and different time zones.
ja: 30 以上の言語と異なるタイムゾーンをサポートします。
ru: Поддержка более 30 языков и разных часовых поясов.
sw: Ina msaada kwa zaidi ya lugha 30 na majira tofauti ya saa.

source: Mail interface
ja: メール・インターフェース
ru: Почтовый интерфейс
sw: Kiolesura cha barua

source: Support for MIME emails with attachments.
ja: MIME メール添付ファイル付きのメールをサポートします。
ru: Поддержка MIME с вложениями.
sw: Ina usaidizi wa barua pepe za MIME pamoja na viambatanishi.

source: Automatic conversion of HTML into plain text messages (increased security for sensitive content and enables faster searching).
ja: HTML形式メールをテキスト形式に自動変換します(機密性の高いコンテンツのセキュリティを強化し検索をより高速にします)。
ru: Автоматическое преобразование HTML в простой текст (повышает безопасность "чувствительного" содержания и значительно ускоряет поиск).
sw: Ina geuza ki otomatiki HTML kwa ujumbe wa matini ghafi (ulinzi ulioongezeka kwa maudhui nyeti na inawezesha utafutaji wa haraka)

source: Incoming mail can be filtered and pre-processed with complex rules, e.g. for spam messages or Queue distribution.
ja: 受信メールはフィルタリングされ、複雑な規則のある、例えばスパムメッセージまたはキュー配布に対するなどの前処理が可能です。
ru: Входящая почта может быть отфильтрована с использованием сложных правил, например для извлечения спам - сообщений или для распределения заявок по очередям.
sw: Barua pepe zinazoingia zinachujwa na kufanyiwa mchakato na sheria ngumu, mfano kwa barua taka au ugawanyaji wa foleni.

source: Support for PGP and S/MIME standards for key/certificate management and email processing.
ja: キー証明書の管理とメールの処理のための PGP鍵 と S/MIME 準拠のサポート。
ru: Поддержка PGP и S/MIME стандартов для управления ключами/сертификатами и обработки электронной почты.
sw: Msaada kwa viwango vya PGP na S/MIME kwa ajili ya usimamizi wa ufunguo/hati na uchakatishaji wa barua pepe.

source: Automatic responses, configurable for every queue.
ja: 全てのキューに設定可能な自動応答。
ru: Автоматические ответы, настраиваемые для каждой очереди.
sw: Majibu otomatiki, yana sanidika kwa kila foleni.

source: Email notifications for agents about new tickets, follow-ups or unlocked tickets.
ja: 新規、フォローアップあるいはロック解除されたチケットに関する担当者へのEメール通知。
ru: Уведомления агентов по электронной почте о новых, последующих или разблокированых заявках.
sw: Taarifa za barua pepe kwa wakala kuhusu tiketi mpya, vinavyofwatia au tiketi zilizofungiwa.

source: It is possible to define an own Ticket identifier to recognize follow-ups, e.g. Call#, Ticket# or Request#. There are different ticket number generators (date-based, random etc.) and you can integrate your own as well. Follow-ups can also be recognized by In-Reference-To headers or external ticket numbers.
ja: フォローアップ（たとえばコール＃、チケット＃、あるいはリクエスト＃など）を認識するために独自のチケットの識別子を定義することが可能です。さまざまなチケット番号生成器（日付ベース、ランダムなど）があり、あなたがあなた自身をもそれに統合することができます。フォローアップもまたIn-Reference-To headers（メール参照ヘッダー）または外部チケット番号で認識できます。
ru: Имеется возможность задать свой собственный идентификатор заявки для распознавания связанных с нею объектов, например, Звонок№, Заявка№ или Запрос№. В системе имеется несколько способов генерации номеров (основанный на дате, на базе случайных чисел и т.д.), также, вы можете включить свой собственный. Связанные объекты также могут распознаваться с использованием In-Reference-To заголовков или внешних номеров заявок.
sw: Inawezekana kufafanua kitambulishi cha tiketi yako ili kutambua vinavyofuata, mfano. Piga#, Tiketi# au Ombi#. Kuna vizalisha tiketi namba vingi (vyenye msingi wa tarehe, nasibu na kadh.) Unaweza kuongeza yakwapo pia. Vinavyofwatia vinaweza kujulikana kwa kurejea kwenye vichwa au tiketi namba za nje.

source: Tickets
ja: チケット
ru: Заявки
sw: Tiketi

source: OTRS uses Tickets to gather all external an internal communication that belongs together. These tickets are organized in Queues.
ja: OTRSは、外部、内部に所属している全てのコミュニケーションを収集するためにチケットを用います。これらのチケットは、キューで整理されます。
ru: OTRS использует понятие заявки для сбора информации из всех внешних и внутренних источников коммуникации. Эти заявки помещаются в очереди.
sw: OTRS inatumia tiketi kukusanya mawasiliano yote ya nje na ndani yanayokaa pamoja. Hizi tiketi zinapangwa kwa foleni.

source: There are many different ways of looking at the tickets in a system (based on Queues, Status, Escalation etc.) in different level of detail (small/medium/preview).
ja: 異なる詳細なレベル(小/中/プレビュー)においてシステム内のチケット（キュー、状態、エスカレーションなど）を閲覧するための多くそして異なる方法が用意されています。
ru: Доступно много различных способов просмотра заявок в системе (на основе Очередей, Статуса, Эскалации...) используя различные уровни детализации (малый/средний/предварительный просмотр).
sw: Kuna njia nyingi za kuangalia tiketi kwenye mfumo (kwa kutegemea Foleni, Hali, Kupanda ma kadh.) katika ngazi tofauti za undani (ndogo/kati/kuhakiki).

source: The Ticket history records all changes to a ticket.
ja: チケットの履歴は、チケットのあらゆる変更を記録します。
ru: Все изменения заявки регистрируются в Истории заявки.
sw: Historia ya tiketi inarekodi mabadiliko yote kwa tiketi.

source: Tickets can be changed in many ways, such as replying, forwarding, bouncing, moving to another Queue, updating attributes (state, priority etc.), locking and accounting working time. It is possible to modify many tickets at once (bulk action).
ja: チケットは、さまざまな方法で変更されます。返信、転送、bouncing、別のキューへの移動、属性（状態、優先度など）の更新、ロック、稼働時間の計算という方法です。チケットの一括変更も可能です。 （bulk action)
ru: Изменения в заявках погут быть выполнены многими разными способами, такими как ответ на заявку, перенаправление, пересылка, перемещение в другую очередь, изменение ее атрибутов (состояние, приоритет и пр...), блокировка и ввод затраченного на нее времени. Можно изменять множество заявок одновременно (массовое действие).
sw: Tiketi zinaweza kubadilishwa kwa njia tofauti, kama kujibu, kutuma mbele, kudunda, kuhamia kwenye foleni nyingine, sasisha sifa (hali, umuhimu na kadh.), kufunga na uhasibu wa muda wa kazi. Inawezekana kubadilisha tiketi nyingi kwa mkupuo (vitendo vya mkupuo).

source: Pending time and escalation time / SLA management allow time-based scheduling and restrictions on tickets.
ja: 保留中時間とエスカレーション時間 /SLA 管理は、チケットに関する時間ベースのスケジュール設定と制限を許可します。
ru: Перевод в ожидание и установка параметров эскалации / Управление SLA - соглашениями об уровне сервиса предоставляют возможность планирования обработки заявок во времени и устанавливать ограничения для них.
sw: Muda wa kusubiri na muda wa kupanda / usimamizi wa SLA unaruhusu ratiba na vizuizi vinavyotegemea muda.

source: Tickets can be linked to other tickets or other objects such as FAQ entries.
ja: チケットは他のチケットまたは FAQ エントリなどの他のオブジェクトにリンクできます。
ru: Заявки могут быть привязаны к другими заявкам или объектам, например, к записям из FAQ.
sw: Tiketi zinaweza ku unganishwa na tiketi nyingine au vitu vingine mfano maswali yanayoulizwa mara kwa mara.

source: Automatic and timed actions on tickets are possible with the "GenericAgent".
ja: 自動およびタイムアクションのチケットが 「GenericAgent」で利用可能です。
ru: "GenericAgent" позволяет совершать автоматические и синхронные действия над заявками.
sw: Vitendo otomatiki na vya muda kwa tiketi vinawezekana na "WakalaWaKawaida"

source: OTRS comes with a powerful search engine that allows complex and fulltext searches on tickets.
ja: OTRSは、チケットに関する複雑でフルテキストの検索が可能な強力なサーチエンジンとなります。
ru: OTRS поставляется с мощной поисковой системой, которая позволяет выполнять сложный и полнотекстовый поиск по заявкам.
sw: OTRS inakuja na injini tafuti yenye nguvu ambayo inaruhusu utafutaji tata na wa nakala kamili kwa tiketi.

source: System
ja: システム
ru: Система
sw: Mfumo

source: OTRS runs on many operating systems (Linux, Solaris, AIX, FreeBSD, OpenBSD, Mac OS 10.x, Microsoft Windows) and supports several database systems for the central OTRS back-end (MySQL, PostgreSQL, Oracle, MSSQL).
ja: OTRSは、多くのオペレーティング・システム(Linux、Solaris、AIX、FreeBSD、OpenBSD、Mac OS 10.x、Microsoft Windows)上で走り、主要なOTRSバックエンド用のいくつかのデータベース・システム(MySQL、PostgreSQL、オラクル、MSSQL)をサポートします。
sw: OTRS inafanya kazi katika mifumo endeshi mingi (Linux, Solaris, AIX, FreeBSD, OpenBSD, Mac OS 10.x, Microsoft Windows) na ina usaidizi kwa mifumo tofauti ya hifadhidata kwa OTRS back-end ya kati (MySQL, PostgreSQL, Oracle, MSSQL).

source: The core system can be extended by installing OTRS packages. There are many free packages (such as FAQ, OTRS::ITSM and others) as well as FeatureAddon packages that are available for service contract customers of the OTRS group.
ja: コア・システムは、OTRSパッケージのインストールにより拡張することができます。OTRSグループのサービス契約顧客が利用可能な機能追加パッケージと同様に、多くの無料のパッケージも(FAQ、OTRS::ITSM他のような)あります。
ru: Ядро системы может быть расширено с помощью установки дополнительных пакетов OTRS. Существует множество свободно распостраняемых пакетов (таких как FAQ, OTRS::ITSM и другие), а также FeatureAddon пакеты для клиентов, заключивших сервисные конракты с OTRS group.
sw: Kiini cha mfumo kinaweza kupanuliwa kwa ku sakinisha vifurushi vya OTRS. Kuna vifurushi vingi vya bure (mfano FAQ, OTRS::ITSM na vingine) na pia vifurushi vya FeatureAddon kwa wateja wenye mkataba wa huduma kutoka kundi la OTRS.

source: Integration of external back-ends for the customer data, e.g. via AD, eDirectory or OpenLDAP. Customers can authenticate via database, LDAP, HTTPAuth or Radius.
ja: 顧客情報用の外部バックエンドの統合（例えば AD、eDirectoryあるいはOpenLDAP経由）。顧客は、データベース、LDAP、HTTPAuth あるいは Radius によって認証されます。
ru: Для хранения данных о клиентах предусмотрена возможность интеграции внешних источников данных, используя AD, eDirectory или OpenLDAP. Клиенты могут аутентифицироваться с помощью внутренней БД, LDAP, HTTPAuth или Radius.
sw: Uunganishaji wa mazingira ya nyuma ya nje kwa ajili ya data za mteja, mf. kupitia AD, eDirectory au OpenLDAP. Wateja wanaweza kujithibitisha kupitia hifadhidata, LDAP, HTTPAuth au Radius.

source: With the GenericInterface it is easy to connect OTRS to other web services. Simple web services can be integrated without programming, complex scenarios with custom extensions. The OTRS Ticket connector allows the creation, updating and searching of tickets, via web services from a third party application.
ja: 一般インターフェイス（GenericInterface）で、他のウェブサービスにOTRSを接続するのは簡単です。シンプルなウェブサービスによって、プログラムやカスタム拡張による複雑なシナリオなど必要とせずに、統合することができます。OTRSチケット・コネクターは、サードパーティー・アプリケーションのウェブサービスによって、チケットの更新、検索および作成を許可します。
ru: Используя GenericInterface, можно легко подключить OTRS к другим веб-сервисам. Простые веб-сервисы могут быть интегрированы без использования программирования, сложных сценариев с различными расширениями. OTRS Ticket Connetctor позволяет создание, обновление и поиск заявок через веб-сервисы через стороннее ПО.
sw: Kwa kiolesura cha ujumla ni rahisi kuunganisha OTRS na huduma nyingine za tovuti. Huduma rahisi za tpvuti zinaweza kuunganishwa bila kuunda programu, mazingira changamano na viendelezi vya kawaida. Kiunganishi cha tiketi cha OTRS kinaruhusu utengenezaji, usasishaji na utafutaji wa tiketi, kupitia huduma za tovuti kutoka kwenye programu tumizi nyingine kuacha mbili zinazohusika.

source: Now let us look at the changes in recent versions of OTRS.
ja: では、次にOTRSの最近のバージョンの変化を見ましょう。
ru: Рассмотрим изменения в последних версиях OTRS.
sw: Sasa tuangalie mabadiliko katika matoleo ya hivi karibuni ya OTRS.

source: New features of OTRS 3.3
ja: OTRS 3.3の新たな機能
ru: Новые возможности OTRS 3.3
sw: Vipengele vipya vya OTRS 3.3

source: Productivity
ja: 生産性
ru: Продуктивность
sw: Uzalishaji

source: Dashboard ticket lists and regular ticket overviews can now be filtered by eligible ticket columns, and the shown coumns are configurable.
ja: ダッシュボード・チケット・リストおよび通常のチケット概要では、適格なチケット列をフィルターし、表示列を構成可能になりました。
ru: Теперь можно использовать фильтры по допустимым атрибутам заявки в виджетах Дайджеста и стандартных обзорах заявок. Можно настраивать перечень и порядок отображения колонок в обзорах.
sw: Orodha ya tiketi za dashibodi na mapitio ya tiketi za kawaida sasa zinaweza kuchujwa na safu za tiketi zinazofaa na safu zilizo onyeshwa zina sanidika.

source: Ticket medium and preview overviews are now sortable.
ja: チケット・ミディアムおよびプレビュー概要が、ソート可能になりました。
ru: В обзорах заявок в среднем формате и формате предпросмотра можно использовать сортировку.
sw: Chombo cha tiketi na mapitio ya kihakiki sasa yanaweza kupangwa.

source: Added a calendar widget for the dashboard that can show tickets as events.
ja: チケットをイベントとして表示することができるダッシュボード用のカレンダー・ウィジェットを追加しました。
ru: В приборной панели добавлен виджет календарь, который может отображать заявки как события.
sw: Imeongeza kifaa cha kalenda kwenye dashibodi ambacho kinaonyesha tiketi kama matukio.

source: Added new dashboard widget that shows in a matrix form the number of tickets per state and per queue.
ja: 状態値およびキュー当たりのチケットの数から、表形式で表示する新しいダッシュボード・ウィジェットの追加。
ru: Добавлен новый виджет в Дайджест для отбражения в табличной форме количества заявок в разрезе состояний и очередей.
sw: Imeongeza kifaa kwenye dashibodi ambacho kinaonyesha nambari ya tiketi kwa hali na kwa foleni katika mfumo wa matriki.

source: Agents can now mark important articles.
ja: 担当者は重要な記事をマークすることができるようになりました。
ru: Агенты могут отмечать важные статьи.
sw: Wakala sasa wanaweza kuweka alama kwa makala muhimu.

source: A new tree selection widget makes working with tree data (queues, services etc.) much faster and easier.
ja: 新しいツリー選択ウィジェットは、ツリーデータ（キュー、サービスなど)）を用いて作業をより速く、より簡単にします。
ru: Новый способ выбора значений (для очередей, сервисов и пр.) с помощью виджета, с отображением списков в виде дерева, делает работу более быстрой и удобной.
sw: Kifaa kipya cha uchaguzi wa mti inafanya ufanyaji kazi na data za mti (foleni, huduma na kadh.) kuwa wa haraka na rahisi.

source: Added support to search relative dates ( e.g. more than 1 month ago ) in Date and Date/Time dynamic fields.
ja: 曜日および日付時刻といった動的なフィールドで、相対日付(例えば1か月以上前に)を検索するサポート機能を追加。
ru: Добавлена поддержка поиска по относительным значениям дат (например, более, чем 1 месяц назад) в динамических полях типа Date и Date/Time.
sw: Imeongeza usadizi wa kutafuta tarehe zinazoendana (mf. zaidi ya mwezi 1 uliopita ) katika sehemu zinazobadilika za Tarehe na Tarehe/Muda.
