Repository: DSigmund/doc-admin
Catalog: i18n/doc-admin.*.po
Languages: ja, ru, sw

source: MapType: the rule for the mapping.
ja: MapType: マッピング用規則。
ru: MapType: правило для отображения.
sw: AinaRamani: sheria kwa ajili ya kuunganisha.

source: Keep: leave unchanged.
ja: Keep（保持）: 変更なく終了。
ru: Keep: оставить без изменений.
sw: Weka: acha bila kubadilisha.

source: Ignore: drop.
ja: Ignore（無視）: やめる
ru: Ignore: понизить.
sw: Puuza: dondosha.

source: MapTo: change to the MapTo value.
ja: MapTo（マップトゥー）: MapTo値を変更
ru: MapTo: заменить на значение MapTo.
sw: UnganishaKwa: badilisha kwenda kwenye thamani UnganishaKwa.

source: ValueMapDefault
ja: ValueMapDefault（値マップ・デフォルト）
sw: ThamaniUnganishaChaguo-msingi

source: Similar to KeyMapDefault.
ja: KeyMapDefault（キーマップ・デフォルト）に似ています。
ru: Тоже что и KeyMapDefault.
sw: Sawa sawa na UfunguoUnganishaChaguo-msingi.

source: KeyMapExact
ja: KeyMapExact（正確なキーマップ）
sw: UfunguoUnganishaHalisi

source: &lt;oldkey&gt;: &lt;newkey&gt; (cardinality 0 .. n but not duplicate).
ja: &lt;oldkey&gt;: &lt;newkey&gt; (基数 0 .. n 但し重複なく)。
ru: &lt;oldkey&gt;: &lt;newkey&gt; (от 0 .. n но без повторений).
sw: &lt;funguoyazamani&gt;: &lt;funguompya&gt; (nambari ya elementi 0 .. n haitakiwi kujirudia).

source: &lt;oldkey(RegEx)&gt;: &lt;newkey&gt; ( cardinality 0 .. n but no duplicates).
ja: &lt;oldkey(RegEx)&gt;: &lt;newkey&gt; (基数 0 .. n 但し重複なく)。
ru: &lt;oldkey(RegEx)&gt;: &lt;newkey&gt; ( от 0 .. n но без повторений).
sw: &lt;ufunguozamani(RegEx)&gt;: &lt;ufunguompya&gt; ( nambari ya elementi 0 .. n lakini hakuna kujirudia).

source: &lt;newkey&gt;: a container for value mappings for this new key (cardinality depends on the new keys from KeyMapExact and KeyMapRegEx).
ja: &lt;newkey&gt;: a container for value mappings for this new key （KeyMapExact and KeyMapRegExからの新規キーに依存する基数）
ru: &lt;newkey&gt;: контейнер для отображаемых значений для этого нового ключа (зависит от новых ключей от KeyMapExact и KeyMapRegEx).
sw: &lt;ufunguompya&gt;: chombo cha miunganiko ya thamani kwa hii funguo mpya (nambari ya elementi inategemeana na funguo mpya kutoka UfunguoUnganishaHalisi na UfunguoUnganishaRegEx).

source: ValueMapExact: a container for all exact value mappings (cardinality 0 .. 1).
ja: ValueMapExact: 全ての性格な値マッピング用コンテナ (基数 0 .. 1)。
ru: ValueMapExact: хранилище для всех точных отображаемых значений (от 0 .. 1).
sw: ThamaniUnganishaHalisi: chombo cha miungamiko yote halisi (nambari ya elementi 0 .. 1).

source: ValueMapRegEx: a container for all regular expression value mappings (cardinality 0 .. 1).
ja: ValueMapRegEx: 全ての正規表現値のマッピング用コンテナ(基数 0 .. 1)。
ru: ValueMapRegEx: хранилище для отображаемых значений всех регулярных выражений (от 0 .. 1).
sw: ThamaniUnganishaRegEx: chombo cha uunganishaji wa thamani zote za semi za kawaida (nambari ya elementi 0 .. 1).

source: &lt;oldvalue&gt;: &lt;newvalue&gt; ( cardinality 0 .. n but not duplicate).
ja: &lt;oldvalue&gt;: &lt;newvalue&gt; (基数 0 .. n 但し重複なく)。
ru: &lt;oldvalue&gt;: &lt;newvalue&gt; ( cardinality 0 .. n без повторений).
sw: &lt;thamaniyazamani&gt;: &lt;thamanimpya&gt; ( nambari ya elementi 0 .. n haitakiwi kujirudia).

source: &lt;oldvalue(RegEx)&gt;: &lt;newvalue&gt; ( cardinality 0 .. n but not duplicate).
ja: &lt;oldvalue(RegEx)&gt;: &lt;newvalue&gt; ( 基数 0 .. n 但し重複なく)。
ru: &lt;oldvalue(RegEx)&gt;: &lt;newvalue&gt; ( от 0 .. n без повторений).
sw: &lt;thamanizamani(RegEx)&gt;: &lt;thamanimpya&gt; ( nambari ya elementi 0 .. n lakini isijirudie).

source: Same as MappingInbound.
ja: MappingInboundと同じ。
ru: Тоже что и MappingInbound.
sw: Sawa na KuunganishaZinazoingia

source: Transport
ja: トランスポート
ru: Передача
sw: Safirisha

source: This section is based on the provider network transport HTTP::SOAP, other transports might contain more or different settings.
ja: このセクションは、供給者ネットワーク・トランスポートHTTP::SOAPに基づきます。他のトランスポートはより多く異なるセッティングを含んでいるかもしれません。
ru: Этот раздел основана на сетевом поставщике HTTP::SOAP, другие поставщики могут содержать больше или другие настройки.
sw: Hiki kifungu kimejikita kwenye usafirishaji mtandao wa HTTP::SOAP wa mtoaji, usafirishaji mwingine unaweza kuwa na mipangilio tofauti au zaidi.

source: Config: a container for the specific network transport configuration settings.
ja: Config（構成）: 特定のネットワークトランスポート構成セッティング用のコンテナー。
ru: Config: хранилище для конкретных параметров конфигурации транспортной сети.
sw: Config: chombo cha mipangilio yote maalumu ya usanidi wa usafirishaji wa mtandao.

source: Type: the provider network transport backend.
ja: Type: 供給者ネットワークトランスポートバックエンド。
sw: Aina: mazingira ya nyuma ya mtoaji wa usafirishaji wa mtandao.

source: MaxLength: the maximum length in bytes to be read in a SOAP message by OTRS.
ja: MaxLength: OTRSによってSOAPメッセージで読まれるバイトで最大の長さ。
ru: MaxLength: максимальная длина в байтах для чтения SOAP-сообщений системой OTRS.
sw: KikomoUrefu: kikomo cha urefu wa kusomwa katika baiti kwenye ujumbe wa SOAP kwa OTRS.

source: NameSpace: an URI that gives a context to all operations that belongs to this web service.
ja: NameSpace: すべてのオペレーションにこのウェブサービスが所有しているコンテキストを与えるURI。
ru: NameSpace: URI , который дает контекст для всех операций, принадлежащих этому веб-сервису.
sw: JinaNafasi: URI ambayo inatoa maudhui kwa operesheni zote zilizo kwenye huduma hii ya tovuti.

source: Requester
ja: 依頼者
ru: Запрашиваемая сторона
sw: Muombaji

source: Invoker: a container for each invokers' settings.
ja: Invoker（依頼アクション）: 各依頼アクション(Invokers)のセッティング用のコンテナ。
ru: Invoker: хранилище для настроек каждой метки.
sw: Mchochezi: chombo cha mipangilio ya kila mchochezi.

source: Transport: a container for requester network transport settings.
ja: Transport(トランスポート): 依頼者ネットワーク・トランスポート設定用コンテナ。
ru: Transport: хранилище для настроек транспортной сети запрашивающей стороны.
sw: Usafirishaji: chombo cha mipangilio ya muombaji wa usafiri wa mtandao.

source: &lt;InvokerName&gt;: Unique name for the invoker, container for its own invoker settings (cardinality 0..n, but not duplicate).
ja: &lt;InvokerName&gt;: 依頼アクション用のユニーク名前。依頼アクションそれ自身の設定用コンテナ。(基数0..n 但し重複なく)
ru: &lt;InvokerName&gt;: Уникальное имя для вызывающей стороны, хранилище для своих собственых настроек (от 0..n, без повторов).
sw: &lt;MchocheziJina&gt;: Jina la kipekee la mchochezi, chombo cha mipangilio yake ya mchochezi (nambari ya elementi 0..n, haitakiwi kujirudia).

source: This section is based on invokers from type "Test::Test" other invokers might contain more or different settings.
ja: このセクションは、タイプ"Test::Test"からの依頼アクションに基づいています。他の依頼アクションはより多く異なる設定を含んでいるかもしれません。
ru: Этот раздел основан на типе "Test::Test", другие invoker-ры могут иметь больше или другие настройки.
sw: Hiki kifungu kinatokana na wachochezi wa aina "Jaribio::Jaribio" wachochezi wengine wanaweza kuwa na mipangilio tofauti.

source: Description: a short text that describes the invoker
ja: Description（摘要）: 依頼アクションを記述する短いテキスト
ru: Описание: короткий текст для описания вызывающей стороны
sw: Maelezo: nakala fupi inayoelezea mchochezi

source: Events: a container for a unnamed list of event trigger settings.
ja: Events（イベント）: イベント・トリガー設定の未命名のリスト用コンテナ
ru: События: хранилище настроек не именованного списка действий.
sw: Matukio: chombo cha mipangilio ya vichochezi vya matukio visivyo na majina.

source: MappingInbound: a container for the mapping settings for the incoming response data.
ja: MappingInbound（マッピング・インバウンド）: 入信応答データ用マッピング設定用コンテナ
ru: MappingInbound: хранилище для настроек отображаемых значений для данных поступающих от ответов.
sw: KuunganishaZinazoingia: chombo cha kuunganisha mipangilio ya majibu ya data zinazoingia.

source: MappingOutbound: a container for the mapping settings for the outgoing request data.
ja: MappingOutbound（マッピング・アウトバウンド）: 発信依頼データ用マッピング設定用コンテナ
ru: MappingOutbound: хранилище для настроек отображаемых значений для исходящих данных запроса.
sw: KuunganishaZinazotoka: chombo cha kuunganisha mipangilio ya data za maombi yanayotoka.

source: Type: the invoker backend, in Controller::Invoker format.
ja: Type（タイプ）: Controller::Invoker フォーマットでの依頼アクションのバックエンド
ru: Тип: invoker backend, в формате Controller::Invoker.
sw: Aina: mazingira ya nyuma ya mchochezi, katika Mdhibiti::Umbizo la mchochezi.

source: Events
ja: イベント
ru: События
sw: Matukio

source: <remark>List Element</remark>: (cardinality 0 .. n)
ja: <remark>リスト要素</remark>: (基数 0 .. n)
ru: <remark>List Element</remark>: (от 0 .. n)
sw: <remark>Orodhesha Elementi</remark>: (nambari ya elementi 0 .. n)

source: Asynchronous: to set if the invoker execution will be delegated to the Scheduler
ja: Asynchronous（非同期）: もし依頼アクションの実行がスケジューラに可能な値を委任するならセットします。
ru: Asynchronous: установить если вызов вызывающей стороны будет возложен на Планировщика
sw: Solandanifu: inaseti kama mchochezi ataachwa kuwa jukumu la Mratibu

source: 0: not handled by the Scheduler.
ja: 0: スケジューラで取扱い不能です。
ru: 0: не обрабатывается Планировщиком (Scheduler).
sw: 0: haijashughulikiwa na Mratibu.

source: 1: handled by the Scheduler.
ja: 1: スケジューラで取扱い可能です。
ru: 1: Обрабатывается Планировщиком (Scheduler).
sw: 1: imeshughulikiwa na Mratibu.

source: Event: the name of the event trigger.
ja: Event（イベント）: イベント・。トリガー名。
ru: Event: имя события триггера.
sw: Tukio: jina la kichochezi cha tukio.

source: Possible Values (for ticket events)
ja: Possible Values (チケットのイベント用の)
ru: Возможные Значения (для событий заявки)
sw: Thamani Ziwezekanazo (kwa matukio ya tiketi)

source: TicketDelete
ja: TicketDelete (チケット削除)
sw: FutaTiketi

source: TicketTitleUpdate
ja: TicketTitleUpdate (チケット・タイトル・更新)
sw: SasishaKichwaTiketi

source: TicketUnlockTimeoutUpdate
ja: TicketUnlockTimeoutUpdate (チケット・アンロック・タイムアウト更新)
sw: TiketiFunguaMudaWaMwishoSasisha

source: TicketQueueUpdate
ja: TicketQueueUpdate (チケットキュー更新)
sw: SasishaFoleniTiketi

source: TicketTypeUpdate
ja: TicketTypeUpdate (チケット・タイプ・更新)
sw: SasishaAinaTiketi

source: TicketServiceUpdate
ja: TicketServiceUpdate (チケットサービス更新)
sw: SasishaHudumaTiketi

source: TicketSLAUpdate
ja: TicketSLAUpdate (チケットSLA更新)
sw: SasishaSLATiketi

source: TicketCustomerUpdate
ja: TicketCustomerUpdate (チケット顧客更新)
sw: SasishaMtejaTiketi

source: TicketFreeTextUpdate
ja: TicketFreeTextUpdate (チケットフリーテキスト更新)
sw: SasishaNakalaHuruTiketi

source: TicketFreeTimeUpdate
ja: TicketFreeTimeUpdate (チケットフリータイム更新)
sw: SasishaMudaHuruTiketi

source: TicketPendingTimeUpdate
ja: TicketPendingTimeUpdate (チケット保留時間更新)
sw: SasishaMudaKusubiriTiketi

source: TicketLockUpdate
ja: TicketLockUpdate (チケットロック更新)
sw: SasishaFungaTiketi

source: TicketArchiveFlagUpdate
ja: TicketArchiveFlagUpdate (チケットアーカイブ更新)
sw: TiketiNyarakaBenderaSasisha

source: TicketStateUpdate
ja: TicketStateUpdate (チケット・状態・更新)
sw: SasishaHaliTiketi

source: TicketOwnerUpdate
ja: TicketOwnerUpdate (チケット所有者更新)
sw: SasishaMmilikiTiketi

source: TicketResponsibleUpdate
ja: TicketResponsibleUpdate (チケット応答可能更新)
sw: TiketiJukumuSasisha

source: TicketPriorityUpdate
ja: TicketPriorityUpdate (チケット優先権更新)
sw: TiketiKipaumbeleSasisha

source: HistoryAdd
ja: HistoryAdd (履歴追加)
sw: OngezaHistoria

source: HistoryDelete
ja: HistoryDelete (履歴削除)
sw: FutaHistoria

source: TicketAccountTime
ja: TicketAccountTime (チケットアカウント時間)
sw: TiketiHesabuMuda

source: TicketMerge
ja: TicketMerge （チケット結合)
sw: MuunganikoTiketi

source: TicketSubscribe
ja: TicketSubscribe (チケット・登録)
sw: TiketiJiunge

source: TicketUnsubscribe
ja: TicketUnsubscribe (チケット・登録解除)
sw: TiketiJiondoe

source: TicketFlagSet
ja: TicketFlagSet (チケットフラグセット)
sw: TiketiBenderaSeti

source: TicketFlagDelete
ja: TicketFlagDelete (チケットフラグ削除)
sw: TiketiBenderaFuta

source: TicketSlaveLinkAdd
ja: TicketSlaveLinkAdd (チケットスレーブリンク追加)
sw: TiketiMtumwaKiungoOngeza

source: TicketSlaveLinkDelete
ja: TicketSlaveLinkDelete (チケットスレーブリンク削除)
sw: TiketiMtumwaKiungoFuta

source: TicketMasterLinkDelete
ja: TicketMasterLinkDelete (チケットマスターリンク削除)
sw: TiketiMkuuKiungoFuta

source: Possible Values (for article events)
ja: Possible Values (for article events) (可能な値（記事イベントに関する）)
ru: Возможные Значения (для действий над статьями)
sw: Thamani Ziwezekanazo (kwa matukio ya makala)

source: Article Events
ja: Article Events (記事イベント)
ru: Действия над статьями
sw: Matukio ya Makala

source: ArticleCreate
ja: ArticleCreate (記事作成)
sw: TengenezaMakala

source: ArticleFreeTextUpdate
ja: ArticleFreeTextUpdate (記事フリーテキスト更新)
sw: SasishaNakalaHuruMakala

source: ArticleUpdate
ja: ArticleUpdate (記事更新)
sw: SasishaMakala

source: ArticleSend
ja: ArticleSend (記事送信)
sw: TumaMakala

source: ArticleBounce
ja: ArticleBounce (記事返答)
sw: MakalaDunda

source: ArticleAgentNotification
ja: ArticleAgentNotification (記事担当者通知)
sw: MakalaWakalaTaarifa

source: ArticleCustomerNotification
ja: ArticleCustomerNotification (記事顧客通知)
sw: MakalaMtejaTaarifa

source: ArticleAutoResponse
ja: ArticleAutoResponse (記事自動返信)
sw: MakalaOtomatikiMajibu

source: ArticleFlagSet
ja: ArticleFlagSet (記事フラグセット)
sw: MakalaBenderaSeti

source: ArticleFlagDelete
ja: ArticleFlagDelete (記事フラグ削除)
sw: MakalaBenderaFuta

source: Same as Operation MappingInbound
ja: オペレーションMappingInboundと同じ
ru: То же что и Действие MappingInbound
sw: Sawa na Operesheni KuunganishaZinazoingia

source: Same as Operation MappingInbound.
ja: オペレーションMappingInboundと同じ。
ru: Тоже что и Действие MappingInbound.
sw: Sawa na Operesheni KuunganishaZinazoingia.

source: This section is based on the requester network transport HTTP::SOAP, other transports might contain more or different settings.
ja: このセクションは、依頼者ネットワーク・トランスポートHTTP::SOAPに基づきます。他のトランスポートはより多く異なる設定を含むかもしれません。
ru: Этот раздел основан на транспортной сети запрашивающей стороны HTTP::SOAP, транспортные сети могут содержать больше или другие настройки.
sw: Hiki kifungu kimejikita kwenye usafirishaji mtandao wa HTTP::SOAP wa muombaji, usafirishaji mwingine unawezakuwa na mipangilio tofauti au zaidi.

source: Type: the requester network transport backend.
ja: Type（タイプ）: 依頼者ネットワークトランスポートバックエンド
ru: Тип: бэкэнд транспортной сети запрашивающей стороны.
sw: Aina: mazingira ya nyuma ya muombaji wa usafirishaji wa mtandao.

source: Authentication: a container for authentication settings.
ja: Authentication(認証): 認証セッティング用のコンテナ
ru: Аутентификация: хранилище для настроек аутентификации.
sw: Uthibitisho: chombo cha mipangilio ya uthibitisho

source: Encoding: the SOAP Message request encoding
ja: Encoding(エンコーディング): SOAPメッセージ・リクエスト符号化
ru: Encoding: кодирование сообщения SOAP-запроса
sw: Usimbaji: ujumbe wa SOAP usimbaji maombi

source: Endpoint: the URI of the Remote Server web service to accept OTRS requests
ja: Endpoint(エンドポイント): OTRSリクエストを受け入れるリモート・サーバ・ウェブサービスのURI
ru: Endpoint: URI Уаделнного Сервера веб-службы для приема запросов OTRS.
sw: Pointiyamwisho: URI ya huduma ya tovuti ya Mfumo wa Mbali kukubali maombi ya OTRS

source: NameSpace: an URI that gives a context to all invokers that belongs to this web service.
ja: NameSpace(名前空間): すべての依頼アクション(Invokers)にこのウェブサービスが所有しているコンテキストを与えるURI.
ru: NameSpace: URI который предоставлят связь для всех invoker-ов, которые принадлежат этому веб-серверу.
sw: JinaNafasi: URI inayowapa maudhui wachochezi wote walio katika huduma hii ya wavuti.

source: SOAPAction: to send an empty or filled SOAPAction header in the SOAP Message (in "&lt;NameSpace&gt; &lt;Separator&gt; &lt;Action&gt;" format).
ja: SOAPAction(SOAPアクション): SOAPメッセージ(in "&lt;NameSpace&gt; &lt;Separator&gt; &lt;Action&gt;" format).の中の空か満たされたSOAPActionヘッダーを送ること。
ru: SOAPAction: для отправки пустого или заполненого SOAPAction-заголовка в формате SOAP сообщения (in "&lt;NameSpace&gt; &lt;Separator&gt; &lt;Action&gt;" format).
sw: SOAPAction: kutuma kichwa cha SOAPAction kilicho tupu au kilichojazwa katika ujumbe wa SOAP (ndani ya "&lt;JinaNafasi&gt; &lt;Kigawanyo&gt; &lt;Kitendo&gt;" umbizo).

source: YES: to send a filled SOAPAction header.
ja: YES(はい): 埋まったSOAPActionヘッダーを送る。
ru: YES: для отправки заполненого заголовка SOAPAction.
sw: NDIYO: kutuma kichwa cha SOAPAction kilichojazwa.

source: No: to send an empty SOAPAction header.
ja: No(いいえ): 空のSOAPActionヘッダーを送る
ru: No: для отправки пустого обработчика SOAP-действия.
sw: Hapana: kutuma kichwa cha SOAPAction tupu.

source: SOAPActionSeparator: to set the &lt;Separator&gt; of a filled SOAPAction header.
ja: SOAPActionSeparator: 記入された SOAPAction ヘッダの &lt;Separator&gt; をセットする。
ru: SOAPActionSeparator: для установки &lt;Separator&gt; из заполненых SOAPAction заголовков.
sw: SOAPActionSeparator: kuseti &lt;Kigawanyo&gt; cha kichwa cha SOAPAction iliyojazwa.

source: '/': used for .net web services.
ja: '/': .netウェブサービスのために使用されます。
ru: '/': используется для .net веб-сервисов.
sw: '/': inatumika kwa na huduma za tovuti za .net.

source: '#': used for all the rest web services.
ja: '#': すべての休息ウェブサービスのために使用されます。
ru: '#': используется для всех веб-сервисов на базе протокола REST.
sw: '#': inatumika na huduma zote za tovuti zilizobaki.

source: Authentication
ja: 認証
sw: Uthibitisho

source: User: the privileged user name that has access to the remote web service.
ja: User（ユーザ）: リモート・ウェブサービスにアクセスする特権ユーザー名
ru: User: имя привилегированого пользователя, который имеет доступ к удаленному веб-сервису.
sw: Mtumiaji: jina la mtumiaji lenye haki ambalo lina ufikivu kwa huduma ya mbali ya tovuti.

source: Password: the password for privileged user in plain text.
ja: Password（パスワード）: プレーンテキスト中の特権ユーザー用のパスワード
ru: Пароль: пароль для привелигированого пользователя в формате обычного текста.
sw: Nywila: nywila ya mtumiaji mwenye haki katika nakala wazi.

source: Type: the type of authentication.
ja: Type（タイプ）: 認証のタイプ
ru: Тип: тип аутентификации.
sw: Aina: aina ya uthibitisho.

source: Web Service Command Line Interface
ja: ウェブサービス・コマンドライン・インターフェイス
ru: Интерфейс командной строки Веб-Сервиса
sw: Kiolesura cha Tungo Amri cha Huduma ya Tovuti.

source: The Command Line Interface (CLI) is a fast way to work with the web services. It consists of a set of tools that can be use to perform basic operations like:
ja: コマンドライン・インタフェース(CLI)はウェブサービスとジョブをする速い方法です。それは、基本操作を行なうために使用できるツールセットから成ります:
ru: Интерфейс командной строки (CLI) это быстрый путь для работы с веб-сервисами. Он состоит из набора инструментов, которые можно использовать для выполнения основных операций, таких как:
sw: Kiolesura cha Tungo Amri (CLI) ni njia ya haraka ya kufanya kazi na huduma za tovuti. Ina seti ya vifaa ambavyo vinaweza kutumika kufanya kazi za msingi kama:

source: Create, Update, Read, List and Delete web services based on YAML files.
ja: YAMLファイルに基づいてウェブサービスを作成、更新、読み込み、リスト、削除します。
ru: Создать, Обновить, Читать, Просматривать и Удалить веб-сервисы основаные основаные на YAML-файлах.
sw: Tengeneza, Sasisha, Soma, Orodhesha na Futa huduma za tovuti zenye msingi wa mafaili ya YAML.

source: Read the Debugger log, with filter options.
ja: フィルタオプションでデバッガログを読み込みます。
ru: Чтение журнала Отладчика с опциями фильтрации.
sw: Soma batli ya anaye eua, na machaguo ya kuchuja.

source: You don't need to use the CLI to work with web services. Integrated into the Admin interface there is a complete set of screens to interact with every part of the web services. Please read the web service GUI section included in this manual.
ja: ウェブサービスと連動するするためにCLIを使用する必要はありません。管理者インターフェースへ統合された、ウェブサービスのすべての部分と相互作用する画面の完全セットがあります。このマニュアルに含まれたウェブサービスGUIセクションを読んでください。
ru: Нет нужды в использовании интерфейса командной строки для работы с веб-сервисами.Интерфейс администратора содержит полный набор экранов/разделов для взаимодействия с каждой из составляющих веб-сервисов. Читайте раздел описания по работе этого интерфейса/GUI, включенный в это руководство.
sw: Huitaji kutumia CLI kufanya kazi na huduma za wavuti. Katika kiolesura cha Msimamizi kuna seti za skrini zilizounganishwa kwa ajili ya kuwasiliana na kila upande wa huduma za tovuti. Tafadhali soma GUI ya huduma za tovuti iliyojumuishwa kwenye mwongozo huu.

source: The "WebserviceConfig.pl" was developed in order to create basic, but fast and powerful tool to work with web service configurations. It gives you the ability to perform the following actions:
ja: 「WebserviceConfig.pl」は基本的だが、速く、強力です、ウェブサービス構成で働くツールとして開発されました。次のアクションを実行できるようになります:
ru: Файл "WebserviceConfig.pl" был разработан для того чтобы создать простой, но в то же время быстрый и мощный инструмент для работы с настройками веб-сервиса. Он предоставляет возможность выполнять следующие действия:
sw: "WebserviceConfig.pl" ilitengenezwa ili kutengeneza kifaa cha msingi, lakini kirahisi na chenye nguvu cha kufanya kazi na usanidi wa huduma za tovuti. Inakupa uwezo wa kufanya vitendo vifuatavyo:

source: Add: to create web services using a YAML file as the configuration source.
ja: 追加：構成ソースとしてYAMLファイルを使うウェブサービスを作成します。
ru: Add: для создания веб-сервисов с использованием YAML-файлов в качестве источника конфигурации.
sw: Ongeza: kutengeneza huduma za tovuti kwa kutumia faili la YAML kama chanzo cha usanidi.

source: Update: to change an existing web service, the configuration can be changed using a different or modified YAML file.
ja: 更新：既存のウェブサービスを変更します。異なるまたは変更されたYAMLファイルを使って構成は変更可能です。
ru: Update: изменить существующий веб-сервис, конфигурация может быть изменена с использованием других или измененных YAML-файлов.
sw: Sasisha: kubadilisha huduma ya tovuti iliyopo, usanidi unaweza kubadilishwa kwa kutumia faili la YAML tofauti au lililoboreshwa.

source: Read: to get the current web service configuration displayed on the screen.
ja: 読み込み：画面に表示されたウェブサービスの構成を入手します。
ru: Read: для вывода на экран текущих настроек веб-сервиса.
sw: Soma: kupata usanidi wa huduma ya tovuti iliyopo kuonyeshwa kwenye skrini.

source: List: to get a complete list of all the web services registered in system.
ja: リスト:システムに登録されたですべてのウェブサービスの完全なリストを入手します。
ru: List: чтобы получить полный список всех веб-сервисов, зарегистрированных в системе.
sw: Orodha: kupata orodha nzima ya huduma za tovuti zilizosajiliwa kwenye mfumo.

source: Delete: to delete a web service from the system. Be careful when you use it, because this action can't be undone.
ja: 削除:システムからウェブサービスを削除すること。このアクションは取消不能なので利用の際はご注意ください。
ru: Delete: для удаления веб-сервиса из системы. Будьте осторожны при выполнении этой операции, ее невозможно отменить.
sw: Futa: kufuta huduma ya tovuti kutoka kwenye mfumo. Kuwa makini ukiitumia, kwa sababu kitendo hiki hakiwezi kubadilishwa.

source: A web service READ operation will display all the configuration as plain text on the screen, including any stored passwords. Please be aware of this and take the needed precautions!
ja: ウェブサービスREADオペレーションは、プレインテキストとして画面にすべての構成を表示します。これには格納されたパスワードを含みます。これに注意して、必要とされる予防措置を講じてください!
ru: Операция веб-сервиса READ будет отображать на экране все настройки в виде простого текста, включаяя сохраненные пароли. Помните об этом и соблюдайте необходимые меры предосторожности!
sw: Operesheni ya huduma ya tovuti ya SOMA itaonyesha usanidi wote kama nakala wazi kwenye skrini, ikijumuisha nywila zilizohifadhiwa. Tafadhali kuwa macho na hili na chukua tahadhari.

source: Example: Creating a new web service configuration:
ja: サンプル : 新規ウェブサービス構成の作成:
ru: Пример: Создание новой конфигурации веб-сервиса:
sw: Mfano: Kutengeneza usanidi mpya wa huduma ya mtandao:

source: Also you can use 'otrs.WebserviceConfig.pl' with following options:
ja: さらに、次のオプションを備えた「otrs.WebserviceConfig.pl」を使用することができます:
ru: Также можно использовать файл 'otrs.WebserviceConfig.pl' со следующими опциями:
sw: Pia unaweza kutumia 'otrs.WebserviceConfig.pl' na machaguo yafuatayo:

source: <command>-a read -i &lt;webservice_id&gt;</command> - To read a stored configuration.
ja: <command>-a read -i &lt;webservice_id&gt;</command> - 格納された構成を読むこと。
ru: <command>-a read -i &lt;webservice_id&gt;</command> - Для чтения сохраненной конфигурации.
sw: <command>-a read -i &lt;webservice_id&gt;</command> - Kusoma usanidi uliohifadhiwa.
