Repository: DSigmund/doc-admin
Catalog: i18n/doc-admin.*.po
Languages: ja, ru, sw

source: Another text module for a template is the signature. Signatures can be linked to a queue, as described in the section about the <link linkend="adminarea-queue">queues</link>. Please note that a signature will only be appended to a template text, if it has previously been linked to a queue. You can manage the signatures in your system by accessing the "Signatures" link of the Admin page, (see Figure below).
ja: テンプレート用の別のテキスト・モジュールは署名です。<link linkend="adminarea-queue">キュー</link>に関するセクションに述べられているように、署名はキューにリンクすることができます。署名が以前にキューにリンクされていれば、署名は単にテンプレート・テキストに追加されるだろうということに注意してください。管理者ページの「署名」リンクへのアクセスにより、システムでの署名を管理することができます(下記の図を参照)。
ru: Другим текстовым модулем для шаблонов являются подписи. Подписи могут быть связаны с очередями, как это описано в разделе <link linkend="adminarea-queue">очереди</link>. Как только подпись связана с очередью она будет включена в текст ответа каждой заявки, находящейся в этой очереди. Перейдя по ссылке "Подписи" в Панели Администрирования, можно упарвлять подписями системы (см. Рисунок ниже).
sw: Moduli nyingine ya nakala kwa kiolezo ni saini. Saini zinaweza kuunganishwa na foleni, kama ilivyoelezwa kwenye kifungu kuhusu <link linkend="adminarea-queue">foleni</link>. Tafadhali tambua saini itaunganishwa kwenye nakala ya kiolezo, kama kabla ya hapo iliunganishwa na foleni. Unaweza kusimamia saini katika mfumo wako kwa kufikia kiungo cha "Saini" cha kurasa ya Msimamizi, (ona Kielelezo chini) .

source: Management of Signatures
ja: 署名管理
ru: Управление Подписями
sw: Usimamizi wa saini

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="Adminarea Signatures - screenshot" scale="40" fileref="screenshots/admin-signatures.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="「管理者エリア 署名 - スクリーンショット」" scale="40" fileref="screenshots/admin-signatures.png"></graphic>

source: <emphasis>Figure: Signatures management.</emphasis>
ja: <emphasis>図: 署名管理</emphasis>
ru: <emphasis>Рисунок: Управление подписями.</emphasis>
sw: <emphasis>Kielelezo: Usimamizi wa saini.</emphasis>

source: After a fresh installation of OTRS, there is one predefined signature stored in your system, "system standard signature (en)".
ja: OTRSの新規インストール後、システムにはあらかじめ定義された署名：「システム標準署名(en)」が存在します。
ru: В новой, только установленной системе OTRS есть одна предустановленная подпись: "system standard signature (en)".
sw: Baada ya usanikishaji mpya wa OTRS, kuna saini iliyofafanuliwa tayari imewekwa kwenye mfumo, "saini ya kawaida ya mfumo (en)".

source: To create a new signature, press the button "Add signature", provide the needed data and submit it (see Figure below).
ja: 新規署名を作成するために、「署名の追加」ボタンを押して下さい。必要とされるデータを提供し、送信します(下記の図を参照)。
ru: Чтобы создать новую подпись, нажмите кнопку "Добавить подпись", введите все необходимы данные и нажмите кнопку "Отправить" (см. нижеприведенный Рисунок).
sw: Kutengeneza saini mpya, bofya kitufe "Ongeza saini", weka data inayohitajika kisha wasilisha (ona kielelezo chini).

source: Add a signature
ja: 新規署名の追加
ru: Добавление подписи
sw: Ongeza saini

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="Adminarea signature - screenshot" scale="40" fileref="screenshots/add-signature.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="管理者エリア 署名 - スクリーンショット" scale="40" fileref="screenshots/add-signature.png"></graphic>

source: <emphasis>Figure: Adding a new signature.</emphasis>
ja: <emphasis>図:新規署名の追加</emphasis>
ru: <emphasis>Рисунок: Добавление новой подписи.</emphasis>
sw: <emphasis>Kielelezo: Kuongeza saini mpya.</emphasis>

source: Like salutations, signatures can also contain dynamic content, such as the first and last name of the agent who answers the ticket. Here too, variables can be used to replace the content of the signature text for every ticket. See the lower part of the signatures screen for the variables which can be used. If you include the variable &lt;OTRS_LAST_NAME&gt; in a signature for example, the last name of the agent who answers the ticket will replace the variable.
ja: 挨拶文のように、署名は、チケットに答える担当者の姓、名のような動的内容を含むことができます。またここで変数は、すべてのチケットに対して署名テキストのコンテンツを代替するために使用することができます。使う変数に関しては署名画面の下部をご覧ください。あなたが署名に例えば可変&lt;OTRS_LAST_NAME&gt;を含めば、チケットに答える担当者の姓は変数を代替します。
ru: Как и приветствия, подписи также могут содержать динамический контент, например, имя и фамилию агента, который отвечает на заявку, а также могут использоваться переменные для замены текста подписи каждой заявки. Переменные, которые можно использовать ищите в нижней части страницы с подписями. Если вы, к примеру, включаете переменную &lt;OTRS_LAST_NAME&gt; то она будет заменена фамилией агента, который отвечает на заявку.
sw: Kama salamu, saini pia zinaweza kuwa na maudhui yanayobadilika, kama jina la kwanza na la mwisho la wakala anayejibu tiketi. Hapa pia vishika nafasi vinaweza kutumika kubadilisha maudhui ya nakala ya saini kwa kila tiketi. Ona sehemu ya chini ya skrini ya saini kwa vishika nafasi vinavyoweza kutumika. Kama ukijumuisha kishika nafasi &lt;OTRS_LAST_NAME&gt; katika saini kwa mfano, jina la mwisho la wakala anayejibu tiketilitabadilisha kishika nafasi

source: As with salutations, signatures too cannot be deleted, only deactivated by setting the Valid option to <emphasis>invalid</emphasis> or <emphasis>invalid-temporarily</emphasis>.
ja: 挨拶文でもそうであるように、署名も削除できません。有効オプションを<emphasis>無効</emphasis>または<emphasis>無効-一時的</emphasis>に設定してのみ非活性化することができます。
ru: Как и в случае с приветствиями, подписи не могут быть удалены, только деактивированы путем установки параметра Действительный в значения <emphasis>не действительный</emphasis> или <emphasis>не действительный-временно</emphasis>.
sw: Kama ilivyo kwa salamu, saini pia haziwezi kufutwa, zinalemazwa tu kwa kuseti chaguo Halali kuwa <emphasis>batili</emphasis> au <emphasis>batili-kwa muda</emphasis>.

source: Attachments
ja: 添付
ru: Вложения
sw: Viambatanisho

source: You can also optionally add one or more attachments to a template. If the template is selected, the attachments will be attached to the message composition window. If necessary, the agent can remove the attachment from an individual template before sending it to the customer.
ja: さらに、任意に1つ以上の添付をテンプレートに加えることができます。テンプレートが選択されていれば、添付はメッセージ作成ウィンドウに付けられるでしょう。必要ならば、担当者は顧客のもとへそれを送る前に個々のテンプレートから添付を取り除くことができます。
ru: При желании к ответу можно добавить одно или несколько вложений. Если ответ выбран, вложения будут прикреплены к сообщению. При необходимости, непосредственно перед отправкой ответа клиенту, агент может удалить вложения.
sw: Unaweza kuongeza kiambatanisho kimoja au zaidi kwa kiolezo kwa hiari. Kama kiolezo kimechaguliwa, viambatanisho vita ambatanishwa kwenye dirisha la uundaji wa ujumbe. Kama kuna ulazima wakala anaweza kuondoa kiambatanisho kutoka kwenye kiolezo kabla ya kutuma kwenda kwa mteja.

source: Through the "Attachment" link of the Admin page, you can load the attachments into the database of the system (see Figure below).
ja: 管理者ページの「添付」リンクによって、システムのデータベースに添付を読み込むすることができます(下記の図を参照)。
ru: Используя ссылку "Вложения" на Панели Администрирования, можно загрузить вложения в базу данных системы (см. нижеприведенный Рисунок).
sw: Kupitia kiungo cha "Kiambatanisho" kwenye ukurasa wa Msimamizi, Unaweza kupakia viambatanisho kwenye hifadhidata ya mfumo (ona kielelezo chini).

source: Managing Attachments for Templates
ja: テンプレート用添付の管理
ru: Управление Вложениями для Шаблонов
sw: Usimamizi wa Viambatanisho vya Violezo

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="Adminarea attachment - screenshot" scale="40" fileref="screenshots/admin-attachment.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="管理者エリア 添付 - スクリーンショット" scale="40" fileref="screenshots/admin-attachment.png"></graphic>

source: <emphasis>Figure: Attachments management.</emphasis>
ja: <emphasis>図:添付管理</emphasis>
ru: <emphasis>Рисунок: Управление вложениями.</emphasis>
sw: <emphasis>Kielelezo: Usimamizi wa Viambatanisho.</emphasis>

source: To create a new attachment, press the button "Add attachment", provide the required data and submit it (see Figure below).
ja: 新規添付を作成するために、「添付追加」ボタンを押し、必要なデータを提供し、送信します(下記の図を参照)。
ru: Чтобы создать новое вложение, нажмите кнопку "Добавить вложение", введите всю необходимую информацию и нажмите кнопку "Отправить" (см. нижеприведенный Рисунок).
sw: Kutengeneza kiambatanisho kipya, bofya kitufe "Ongeza kiambatanisho", weka data inayotakiwa kisha wasilisha (ona kielelezo chini).

source: Add an Attachment
ja: 新規添付の追加
ru: Добавить Вложение
sw: Ongeza Kiambatanisho

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="Adminarea signature - screenshot" scale="40" fileref="screenshots/add-attachment.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="管理者エリア 署名 - スクリーンショット" scale="40" fileref="screenshots/add-attachment.png"></graphic>

source: <emphasis>Figure: Adding a new attachment.</emphasis>
ja: <emphasis>図:新規添付の追加</emphasis>
ru: <emphasis>Рисунок: Добавление нового вложения.</emphasis>
sw: <emphasis>Kielelezo: Kuongeza kiambatanisho kipya.</emphasis>

source: If an attachment is stored it can be linked to one or more templates. Click on the "Attachment &lt;-&gt; Templates" link of the Admin page (see Figure below).
ja: 添付が格納される場合、1つ以上のテンプレートにリンクすることができます。管理者ページ(下記の図を参照)のリンク「添付&lt;-&gt; テンプレート」をクリックして下さい。
ru: Когда вложение уже сохранено, его можно связать с одним или несколькими ответами. Для этого перейдите по ссылке "Вложение &lt;-&gt; Ответы" в Панели Администрирования (см. Рисунок ниже).
sw: Kama kiambatanisho kimehifadhiwa kinaweza kuunganishwa na kiolezo kimoja au zaidi. Bofya kwenye kiungo "Kiambatanisho &lt;-&gt; Kiolezo" katika kurasa ya Msimamizi (ona Kielelezo chini).

source: Linking Attachments to Templates
ja: 添付のテンプレートへのリンク
ru: Связать вложения с шаблонами.
sw: Kuunganisha Viambatanisho kwa Violezo

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="Adminarea attachment template - screenshot" scale="40" fileref="screenshots/admin-attachment-template.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="管理者エリア 添付テンプレート - スクリーンショット" scale="40" fileref="screenshots/admin-attachment-template.png"></graphic>

source: <emphasis>Figure: Linking Attachments to Templates.</emphasis>
ja: <emphasis>図:添付のテンプレートへのリンク</emphasis>
ru: <emphasis>Рисунок: Связать вложения с шаблонами..</emphasis>
sw: <emphasis>Kielelezo: Kuunganisha Viambatanisho kwa Violezo.</emphasis>

source: To associate different attachments with a specific template and vice versa, click on the corresponding template name or attachment (see below the Figures 5.27 and 5.28, respectively).
ja: 特定のテンプレートに、および逆に異なる添付を関連させるためには、対応するテンプレート名あるいは添付をクリックしてください(図5.27および5.28以下にそれぞれ参照)。
ru: Чтобы связать различные вложения с конкретным шаблоном и наоборот, нажмите на название соответствующего шаблона или вложения (см. ниже Рисунки 5.27 и 5.28, соответственно).
sw: Kuhusisha viambatanisho mbali mbali na violezo maalumu na kinyume chake, bofya kwenye jina la kiolezo au kiambatanisho husika (ona vielelezo 5.27 na 5.28 kwa mtiririko).

source: Change Attachment relations for a Template
ja: テンプレート用添付関連の変更
ru: Изменить связь Вложения с Шаблоном
sw: Badilisha mahusiano ya Kiambatanisho kwa Kiolezo

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="Adminarea templates and attachments - screenshot" scale="40" fileref="screenshots/template-attachment-relations.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="管理者エリア テンプレートと添付 - スクリーンショット" scale="40" fileref="screenshots/template-attachment-relations.png"></graphic>

source: <emphasis>Figure: Change Attachment relations for a Template.</emphasis>
ja: <emphasis>図:テンプレート用添付関連の変更</emphasis>
ru: <emphasis>Рисунок: Изменение связей между Вложением и Шаблоном.</emphasis>
sw: <emphasis>Kielelezo: Badilisha mahusiano ya Kiambatanisho kwa Kiolezo.</emphasis>

source: Change Template relations for an Attachment
ja: 添付用テンプレート関連の変更
ru: Изменить связь Шаблона с Вложением
sw: Badilisha mahusiano ya Kiolezo kwa Kiambatanisho

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="Adminarea templates and attachments - screenshot" scale="40" fileref="screenshots/template-attachment-relations2.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="管理者エリア テンプレートと添付 - スクリーンショット" scale="40" fileref="screenshots/template-attachment-relations2.png"></graphic>

source: <emphasis>Figure: Change Template relations for an Attachment.</emphasis>
ja: <emphasis>図:添付用テンプレート関連の変更</emphasis>
ru: <emphasis>Рисунок :Изменить связь Шаблона с Вложением.</emphasis>
sw: <emphasis>Kielelezo: Badilisha mahusiano ya Kiolezo kwa Kiambatanisho.</emphasis>

source: Templates
ja: テンプレート
ru: Шаблоны
sw: Violezo

source: To speed up ticket processing and to standardize the look of answers, you can define templates in OTRS. A template can be linked to one or more queues and vice versa.
ja: チケット処理を促進し、かつ返答の外観を標準化するために、OTRSにテンプレートを定義することができます。テンプレートは1つ以上のキューにリンク、および逆リンクも可能です。
ru: Для ускорения работы в OTRS и стандартизовать вид ответов, можно задать шаблоны. Шаблон может быть связан с одной или несколькими очередями и наоборот.
sw: Kuongeza kasi ya mchakato wa tiketi na kufanya muonekano wa majibu kuwa kawaida, unaweza kufananua violezo katika OTRS. Kiolezo kinaweza kuunganishwa na foleni moja au zaidi.

source: There are different kind of templates that are used in different parts of OTRS and they have its own purpose, the following is the list of possible template types:
ja: OTRSの異なる部分で使用される、異なる種類およびそれらのテンプレートがありますそれらはそれ自身の目的を持っていて、下記は可能なテンプレート・タイプのリストです。:
ru: Существует несколько различных видов шаблонов, которые могут быть использованы в различных местах в OTRS и в различных целях. Ниже приведен список доступных типов шаблонов:
sw: Kuna violezo tofauti vinavyotumika katika pande tofauti za OTRS na zina nia tofauti, ifwatayo ni orodha ya aina za violezo ziwezekanazo:

source: Answer: To be used as a ticket response or reply
ja: 返答：Answer: チケット・応答として使用されるか返答します。
ru: Ответ: Будет использоваться в качестве ответа на заявку
sw: Jibu: Kutumika kama jibu la tiketi

source: Create: To be used in New Phone or Email ticket
ja: 作成：Create: 新規電話かEメール・チケットの中で使用されます。
ru: Создать: Будет использоваться в качестве Телефонной Заявки или Email заявки
sw: Tengeneza: Kutumika katika simu au barua pepe mpya

source: Forward: To be used to forward an article to someone else
ja: 転送：Forward: 誰か他の人へ記事を転送するために使用されます。
ru: Переслать: Используется для пересылки сообщения кому-то другому
sw: Tuma mbele: Kutumika kupeleka makala kwa mtu mwengine

source: PhoneCall: To be used in the Phone Call Inbound and Outbound screens
ja: 電話：PhoneCall: 電話の着信および発信画面で使用されます。
ru: Телефонный звонок: Для регистрации входящих и исходящих звонков агентом
sw: PigaSimu: Kutumika katika skrini ya simu zinazoingia na kutoka

source: Answer templates can be accessed in two ways, from the ticket zoom screen in the article menu, or on a quicker way: from any ticket overview large screen such as Status View or Ticket View. For a fresh OTRS installation, the "empty answer" template (Answer) is set as the default for every queue.
ja: 電話の受発信画面で使うためには、返答テンプレートは二つの方法でアクセス可能です。ひとつは、記事メニューでのチケット・ズーム画面から。もうひとつ、より素早い方法なら、状態ビューやチケット・ビューのようなチケット概要の大画面から。新規のOTRS導入に関しては、テンプレート「空の答え（empty answer）」がすべてのキューに対してデフォルトでセットされます。
ru: Использовать шаблоны ответов можно двумя способами: при подробном просмотре заявки в меню сообщений/заметок, или более быстрым - с экрана Обзора статусов или заявок в формате предпросмотра/Large. Во вновь установленной OTRS, шаблон (ответа) "пустой ответ" задан для всех очередей.
sw: Violezo vya majibu vinapatikana kwa njia mbili, kutoka kwenye skrini ya kukuza tiketi kwenye menyu ya makala, au kwa njia ya haraka: kutoka kwenye skrini kubwa ya mapitio ya tiketi kama Muonekano wa Hali au Muonekano wa Tiketi. Kwa usanikishaji mpya wa OTRS, kiolezo(jibu) "jibu wazi" kina setiwa kama chaguo-msingi kwa kila foleni.

source: As soon as Forward templates are added and assigned to queues, the "Forward" button in ticket zoom (that normally leads to a empty text forward screen) will change into a selection control, the selection is filled with the added Forward templates, by choosing one of the templates, the forward screen will be shown prefilled with the template text and attachments (similar to the reply selection box with the Answer templates).
ja: 転送テンプレートがキューに割り当てられ加えられるとすぐに、チケット・ズーム中の「転送」ボタン（通常は空のテキスト転送画面に導かれます）は選択コントロールに変化します。ひとつのテンプレートを選択することで「選択」は、転送テンプレートに情報を与えます。転送画面は、テンプレートテキストと添付で事前に情報を与えられ表示されます。（返答テンプレートでの「返答選択ボックス」と同様です。）
sw: Mara tu violezo vilivyopelekwa mbele kuongezwa na kuwekwa kwenye foleni, kitufe cha "Peleka mbele" katika kuza tiketi (ambayo mara nyingi inatupeleka kwenye skrini ya kupeleka mbele yanakala tupu) kitabadilika kuwa cha kudhibiti uchaguzi, uchaguzi unajazwa na violezo vilivyopelekwa mbele vilivyoongezwa, kwa kuchagua moja ya violezo, skrini ya kupeleka mbele itaonyeshwa ikiwa imejazwa na nakala ya kiolezo na viambatanisho (sawa na kisanduku majibu cha uchaguzi na violezo vya Majibu).

source: Creating templates of type Create and PhoneCall will make visible the "Text Template" selection box in their respective screens, choosing a template for the list will populate the "Text" and "Attachment" fields (if available in the template). Notice that any previous change in the Text or attachments will be overwritten by selecting a template.
ja: タイプ「作成」と「電話」のテンプレートを作成することは、 それぞれの画面の中の「テキスト・テンプレート」選択ボックス」を見えるようにします。リストにテンプレートを選択することは、「テキスト」と「添付」フィールド（テンプレートで利用可能ならば）にデータを追加することになるでしょう。テキストまたは添付で何からの以前の変更が、テンプレートを選択することで上書きされることに気づいて下さい。
ru: Создание шаблонов типа Create/Новая и PhoneCall/Звонок клиента приводит к отображения поля выбора "Text Template/Текст шаблона" на соответствующих экранах, выбор шаблона из списка приведет к заполнению полей "Текст" и "Вложение" (если они доступны в шаблоне). Отметим, что любые ранее сделанные изменения в поле "Текст" или для вложения, будут перекрыты данными из шаблона.
sw: Kutengeneza violezo vya aina Tengeneza na PigaSimu vitafanya boksi la uchaguzi la "Nakala Kiolezo" kuonekana katika skrini husika, kuchagua kiolezo kwa ajili ya orodha itajaza sehemu za "Nakala" na "Kiambatanisho" (kama zinapatikana kwenye kiolezo). Tambua kwamba mabadiliko yoyote ya kabla kwenye Nakala au kiambatanisho yataandikwa upya kwa kuchagua kiolezo.

source: Clicking the "Templates" link on the Admin page brings you to the Template management screen (see Figure below).
ja: 管理者ページの「テンプレート」をクリックすれば、テンプレート管理画面が開きます。(下記の図を参照)。
ru: Нажатие на ссылку "Шаблоны" на Панели Управления OTRS, приведет к открытию раздела Управление шаблонами (см. Рисунок ниже).
sw: Kubofya kiungo cha "Violezo" kwenye kurasa ya Msimamizi inakuleta kwenye skrini ya usimamizi wa Kiolezo (ona kielelezo chini).

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="Adminarea template - screenshot" scale="40" fileref="screenshots/admin-template.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="管理者エリア・テンプレート - スクリーンショット" scale="40" fileref="screenshots/admin-template.png"></graphic>

source: <emphasis>Figure: Template management.</emphasis>
ja: <emphasis>図:テンプレート管理</emphasis>
ru: <emphasis>Рисунок: Управление шаблонами.</emphasis>
sw: <emphasis>Kielelezo: Usimamizi wa kiolezo.</emphasis>

source: To create a new template, click on the "Add template" button, provide the required data (make sure to select the appropriate template type) and submit it (see Figure below).
ja: 新規テンプレート(「テンプレート追加」ボタン上のクリック)を作成するためには、必要なデータ(確実に適切なテンプレート・タイプを選択すること)を提供して、送信下さい(下記の図を参照)。
ru: Чтобы создать новый шаблон, нажмите кнопку "Добавить шаблон", введите необходимые данные (убедитесь, что выбран правильный тип шаблона) и нажмите кнопку Отправить (см. Рисунок ниже).
sw: Kutengeneza kiolezo kipya, bofya kitufe cha "Ongeza kiolezo", weka data zinazotakiwa (hakikisha unachagua aina sahihi ya kiolezo) na kuiwasilisha (ona kielelezo chini).

source: Template
ja: テンプレート
ru: Шаблон
sw: Kiolezo

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="Adminarea template - screenshot" scale="40" fileref="screenshots/add-template.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="「管理者エリア テンプレート - スクリーンショット」" scale="40" fileref="screenshots/add-template.png"></graphic>

source: <emphasis>Figure: Adding a template.</emphasis>
ja: <emphasis>図:テンプレートの追加</emphasis>
ru: <emphasis>Рисунок: Добавление шаблона.</emphasis>
sw: <emphasis>Kielelezo: Kuongeza kiolezo.</emphasis>

source: To add/remove templates to one or more queues, click on the "Templates &lt;-&gt; Queues" link on the Admin page (see Figure below). You can also use filters to get information regarding a specific entity.
ja: テンプレートを1つ以上のキューに追加/削除するためには、管理者ページの「テンプレート&lt;-&gt; キュー」リンクをクリックしてください(下記の図を参照)。さらに、特定の実体に関する情報を得るためにフィルタを使用することができます。
ru: Чтобы добавить/удалить шаблоны для одной или нескольких очередей, используйте ссылку "Шаблоны &lt;-&gt; Очереди" в Панели Администрирования (см. Рисунок ниже). Также, чтобы получить информацию о той или иной сущности, можно воспользоваться фильтрами.
sw: Kuongeza/kuondoa violezo kwenye foleni moja au zaidi, bofya kwenye kiungo "Violezo &lt;-&gt; Foleni" katika kurasa ya Msimamizi (ona Kielelezo chini). Unaweza pia kutumia vichujio kupata taarifa kuhusu chombo fulani.

source: Manage Template-Queue relations
ja: テンプレート・キュー関係管理
ru: Управление сязями Щаблон - Очередь
sw: Simamia mahusiano ya Kiolezo-Foleni

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="Adminarea template queue - screenshot" scale="40" fileref="screenshots/admin-template-queue.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="「管理者エリア テンプレート キュー - スクリーンショット」" scale="40" fileref="screenshots/admin-template-queue.png"></graphic>

source: <emphasis>Figure: Template-Queue relations management.</emphasis>
ja: <emphasis>図:テンプレート・キュー関係管理</emphasis>
ru: <emphasis>Рисунок: Управление сязями Щаблон - Очередь.</emphasis>
sw: <emphasis>Kielelezo: Usimamizi wa mahusiano ya Kiolezo-Foleni.</emphasis>

source: To define the different templates that will be available for a queue and vice versa, click on the corresponding template or queue (see below the Figures 5.32 and 5.33, respectively).
ja: キューに、および逆に（and vice versa）利用可能になる、異なるテンプレートを定義するためには、対応するテンプレートかキューをクリックしてください(図5.32および5.33以下にそれぞれ参照)。
ru: Чтобы определить различные шаблоны для очереди и наоборот, нажмите на соответствующий шаблон или очередь (см. ниже Рисунки 5.32 и 5.33, соответственно).
sw: Kufafanua violezo mbali mbali vinavyopatikana kwa foleni na kinyume chake, bofya kwenye kiolezo au foleni husika (ona vielelezo 5.32 na 5.33 chini kwa mtiririko).

source: Change Queue relations for a Template
ja: テンプレートのためのキュー関係の変更
ru: Изменить связь Очереди с Шаблоном
sw: Badilisha mahusiano ya Foleni kwa Kiolezo

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="Adminarea template and queue - screenshot" scale="40" fileref="screenshots/template-queue-relations.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="管理者エリア テンプレートとキュー - スクリーンショット" scale="40" fileref="screenshots/template-queue-relations.png"></graphic>

source: <emphasis>Figure: Change Queue relations for a Template.</emphasis>
ja: <emphasis>図:テンプレートのためのキュー関係の変更</emphasis>
ru: <emphasis>Рисунок: Изменение связи между Очередью и Шаблоном.</emphasis>
sw: <emphasis>Kielelezo: Badilisha mahusiano ya Foleni kwa Kiolezo.</emphasis>

source: Change Template relations for a Queue
ja: キューのためのテンプレート関係の変更
ru: Изменить связь Шаблона с Очередью
sw: Badilisha mahusiano ya Kiolezo kwa Foleni
