Repository: DSigmund/doc-admin
Catalog: i18n/doc-admin.*.po
Languages: ja, ru, sw

source: If you use the ticket delete function, all affected tickets and their attachments will be removed from the database and cannot be restored!
ja: チケットを削除する機能を使う場合、すべての影響を受けるチケットやそれらの添付ファイルはデータベースから取り除かれ復元することはできません。
ru: Если вы выбрали функцию удаления, все выбранные заявки и вложения к ним будут удалены из базы данных без возможности восстановления!
sw: Kama ukitumia fomula-saidizi ya kufuta tiketi, tiketi zote zitakazoathirika na viambatanisho vyake vitaondolewa kwenye hifadhidata na haviwezi kurudishwa!

source: After editing a job, OTRS will return to the overview screen. There you have the possibility to run any job manually. If you choose to run a job, you will first see all tickets which will be affected when the job actually is run. This list helps you to verify that the job is working as intended. At this point no changes have been made to these tickets yet. Only if you confirm the screen the job will be executed.
ja: ジョブを編集した後に、OTRSは概要画面に戻ります。そこで、どんなジョブも手動で実行できる可能性があります。ジョブを実行することを選ぶならば、ジョブが実際に走っている時に全てのチケットが影響を受けることをまず最初に見ることでしょう。このリストは、あなたが意図通りにジョブが働いていることを確認するのに役立ちます。このポイントでは、これらのチケットにまだ変更は行なわれていません。あなたが画面を確認する場合のみ、ジョブが実行されます。
ru: После редактирования задания, OTRS вернет вас на экран обзора заданий. Здесь вы можете запустить его вручную. Если вы запустили задание, то вначале вы получите список заявок, которые будут обработаны заданием после старта. Этот список поможет вам проверить, что фильтры были заданы правильно. В этот момент еще никаких действий с заявками не выполнялось. Оно начнет работу только после подтверждения вами продолжения работы.
sw: Baada ya kuhariri kazi, OTRS itarudi kwenye skrini ya mapitio. Huko utakuwa na uwezo wa kuanzisha kazi yoyote kwa mikono. Kama ukichagua kuanzisha kazi, kwanza utaona tiketi zote zitakazoathirika pale kazi itakapoanzishwa. Hii orodha itakusaidia kuthibitisha kwamba kazi inafnywa kama ilivyokusudiwa. Katika pointi hii hakuna mabadiliko yaliyofanywa kwenye tiketi hizi. Kama tu utathibitisha kwenye skrini kazi itafanyika.

source: Admin email
ja: 管理者Eメール
ru: Электронная почта администратора
sw: Barua pepe ya msimamizi

source: OTRS administrators can send messages to specific users or groups. The "Admin Notification" link on the Admin page opens the screen where the agents and groups that should be notified can be selected (see Figure below).
ja: OTRS管理者は特定のユーザあるいはグループへメッセージを送ることができます。管理者ページの「管理者通知」リンクでは、通知されるべき担当者とグループは選択可能な画面を開きます。（下図参照）
ru: OTRS администраторы могут отсылать сообщения определенному пользователю или группе. Переход по ссылке "Уведомления Администратора" в Панели Администрирования открывает страницу, на которой можно указать агентов и группы, которые должны быть оповещены (см. Рисунок ниже).
sw: Wasimamizi wa OTRS wanaweza kutuma ujumbe kwa watumiaji au makundi maalumu. Kiungo cha "Taarifa za Msimamiaji" kwenye kurasa ya msimamiaji inafungua skrini ambayo wakala na makundi ya kutumiwa taarifa yanachaguliwa (ona kielelezo chini).

source: Admin notification
ja: 管理者通知
ru: Оповещения Администратором
sw: Taarifa za Msimamiaji

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="Adminarea email - screenshot" scale="40" fileref="screenshots/send-admin-notification.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="管理者エリア Eメール - スクリーンショット" scale="40" fileref="screenshots/send-admin-notification.png"></graphic>

source: <emphasis>Figure: Admin notification.</emphasis>
ja: <emphasis>図:管理者通知</emphasis>
ru: <emphasis>Рисунок:. Оповещения Администратором.</emphasis>
sw: <emphasis>Kielelezo: Taarifa za msimamizi.</emphasis>

source: It is possible to specify the sender, subject and body text of the notification. You can also select the agents, groups and roles who should receive the message.
ja: 通知文の送信者、件名、本文は指定可能です。担当者、グループ、およびメッセージを受け取るべき役割を選ぶこともできます。
ru: Можно указать отправителя, тему и текст уведомления. Также можно выбрать агентов, группы и роли, которые должны получить сообщение.
sw: Inawezekana kuweka bayana mtumaji, mada na nakala ya kiini cha taarifa. Unaweza pia kuchagua mawakala, makundi na kazi za nani atakayepokea ujumbe.

source: Session management
ja: セッション管理
ru: Управление сеансами
sw: Usimamizi wa kipindi

source: You can see all logged in users and their session details by clicking the "Session Management" link in the admin area (see Figure below).
ja: 管理者エリアの「セッション管理」リンクをクリックすれば、全ログインユーザとそのセッション詳細を見ることができます(下記の図を参照)。
ru: Перейдя по ссылке "Управление Сеансами" в панели управления вы можете увидеть всех зарегистрированных в системе пользователей и детали их сеансов (см. Рисунок ниже).
sw: Unaweza kuona watumiaji wote walioingia kwenye mfumo na undani wa vipindi vyao kwa kubofya kiungo "Usimamizi wa Vipindi" katika eneo la msimamizi (ona Kielelezo chini).

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="Adminarea sessionmanagement - screenshot" scale="40" fileref="screenshots/admin-sessionmanagement.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="管理者エリア セッション管理 - スクリーンショット" scale="40" fileref="screenshots/admin-sessionmanagement.png"></graphic>

source: <emphasis>Figure: Session management.</emphasis>
ja: <emphasis>図:セッション管理</emphasis>
ru: <emphasis>Рисунок: Управление Сеансами.</emphasis>
sw: <emphasis>Kielelezo: Usimamizi wa kipindi.</emphasis>

source: Some statistics about all active sessions are displayed, e.g. how many agents and customer users are logged in and the number of active sessions. Any individual session can be removed by clicking on the <emphasis>Kill this session</emphasis> link on the right-hand side of the list. You also have the option to <emphasis>Kill all sessions</emphasis>, which can be useful if you want to take the system offline. Detailed information for every session is available, too (see Figure below).
ja: すべてのアクティブなセッションに関する統計が表示されます、例えば、ユーザはどれだけの担当者および顧客にログインされ、アクティブなセッションの数。どんな個々のセッションもリストの右側にある<emphasis>このセッションを強制終了します</emphasis>リンクをクリックすることにより削除することができます。さらに、<emphasis>全てのセッションを強制終了します</emphasis>のオプションもあり、それはシステムをオフラインで利用したければ便利です。すべてのセッションの詳細情報も利用可能です(下図参照)。
ru: Выводится статистика о всех активных сессиях, например, сколько агентов и клиентов вошли в систему, количество активных сессий. Кликнув на ссылку "Удалить эту сессию", которая находится в правой части списка, можно удалить ту или инную сессию. Также можно воспользоваться ссылкой <emphasis>Удалить все сессии</emphasis>, что может быть полезно чтобы отключить систему. Также можно просмотреть подробную информацию о каждой сессии (см. Рисунок ниже).
sw: Baadhi ya takwimu kuhusu vipindi vyote vilivyo hai inaonyeshwa, mf. mawakala na wateja watumiaji wangapi wameingia kwenye mfumo na idadi ya vipindi vilivyo hai. Kila kipindi kimoja kinaweza kuondolewa kwa kubofya kiungo <emphasis>Ua kipindi hiki</emphasis> kilicho upande wa kulia wa orodha. Pia una chaguo la <emphasis>Ua vipindi vyote</emphasis>, ambayo inakuwa na manufaa kama utataka kuupeleka mfumo nje ya mtandao. Taarifa za undani wa kila kipindi unapatikana pia (ona Kielelezo chini).

source: Session details
ja: セッション詳細
ru: Подробности сеанса/сессии
sw: Maelezo ya kipindi

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="Adminarea session management - screenshot" scale="40" fileref="screenshots/admin-session-details.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="「管理者エリア セッション管理 - スクリーンショット」" scale="40" fileref="screenshots/admin-session-details.png"></graphic>

source: <emphasis>Figure: Session details.</emphasis>
ja: <emphasis>図: セッション詳細</emphasis>
ru: <emphasis>Рисунок: Подробная информация о сессии.</emphasis>
sw: <emphasis>Kielelezo: Maelezo ya kipindi.</emphasis>

source: System Log
ja: システムログ
ru: Системный журнал
sw: Batli ya mfumo

source: The "System Log" link on the Admin page shows the log entries of the system, reverse chronologically sorted with most recent first (see Figure below).
ja: 管理者ページの「システムログ」リンクは、システムのログ・エントリーを表示します。最新を先頭にして年代を逆順にソートされます(下記の図を参照)。
ru: Перейдя по ссылке "Системный журнал" в Панели Администрирования можно просмотреть записи в системном журнале, отсортированные в обратном хронологическом порядке (см. Рисунок ниже).
sw: Kiungo cha "Batli ya Mfumo" katika ukurasa wa Msimamizi kinaonyesha maingizo ya batli ya mfumo, yaliyopangwa kinyume na muda uliofika ikiwa na za hivi karibuni kwanza (ona Kielelezo chini).

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="Adminarea syslog - screenshot" scale="40" fileref="screenshots/admin-syslog.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="管理者エリア syslog（シスログ） - スクリーンショット" scale="40" fileref="screenshots/admin-syslog.png"></graphic>

source: <emphasis>Figure: System Log.</emphasis>
ja: <emphasis>図: システムログ</emphasis>
ru: <emphasis>Рисунок: Системный журнал.</emphasis>
sw: <emphasis>kielelezo: Batli ya mfumo.</emphasis>

source: Each line in the log contains a time stamp, the log priority, the system component and the log entry itself.
ja: ログの各ラインは、以下を含みます。タイム・スタンプ、ログ優先度、システム・コンポーネント及びログ・エントリー自体です。
ru: Каждая строка в журнале содержит: время, приоритет, компонент системы и непосредственно саму запись.
sw: Kila mstari kwenye batli una mhuri wa muda, kipaumbele cha batli, kijenzi cha mfumo na ingizo la batli yenyewe.

source: System logs are available via the web interface only on Linux / Unix systems. On Windows systems, you can see the logs using a text editor by opening the file <filename>[install_dir]otrs\var\log\otrs.log</filename>.
ja: システムログは、Linux / Unix systems上でのみウェブインターフェース経由で利用可能です。Windows systemsではテキストエディタでファイル：<filename>[install_dir]otrs\var\log\otrs.log</filename>.を開けると、ログを見ることができます。
sw: Batli za mfumo zinapatikana kupitia kiolesura cha mfumo tu katika mifumo ya Linux / Unix. Katika mifumo ya Windows unaweza kuona batli kwa kutumia kihariri cha nakala kwa kufungua faili <filename>[install_dir]otrs\var\log\otrs.log</filename>.

source: SQL queries via the SQL box
ja: SQLボックス経由でのSQLクエリー
ru: SQL запросы
sw: Maulizo ya SQL kupitia boksi la SQL

source: The "SQL Box" link on the Admin page opens a screen that lets you query the content of the tables in the OTRS database (see Figure below). It is not possible to change the content of the tables, only 'select' queries are allowed.
ja: 管理者ページの「SQLボックス」リンクから画面を開きます。画面では、OTRSデータベースでのテーブル・コンテンツをクエリーできます。(下記の図を参照)テーブルの内容を変更することは不可能で、「select」クエリーのみ許可されます。
ru: Ссылка "SQL Box" в Панели Администрирования открывает окно, которое позволяет напрямую делать запросы к таблицам базы данных системы OTRS (см. Рисунок ниже). Разрешается делать только запросы на выборку данных, изменять данные с помощью запросов нельзя.
sw: Kiungo cha "Boksi la SQL" kwenye kurasa ya msimamizi inafungua skrini ambayo inakuruhusu kufanya maulizo kwenye maudhui ya majedwali ya hifadhidata ya OTRS (ona kielelezo chini). Haiwezekani kubadilisha maudhui ya majedwali, chagua maulizo yanayolkubalika tu.

source: SQL Box
ja: SQLボックス
ru: SQL-запросы
sw: Boksi la SQL

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="Adminarea selectbox - screenshot" scale="40" fileref="screenshots/admin-selectbox.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="管理者エリア selectbox（選択ボックス） - スクリーンショット" scale="40" fileref="screenshots/admin-selectbox.png"></graphic>

source: <emphasis>Figure: SQL Box.</emphasis>
ja: <emphasis>図:SQLボックス</emphasis>
ru: <emphasis>Рисунок: SQL-запросы.</emphasis>
sw: <emphasis>Kielelezo: Boksi la SQL.</emphasis>

source: Package Manager
ja: パッケージ・マネージャー
ru: Менеджер пакетов
sw: Msimaizi wa kifurushi

source: Using the "Package Manager" link on the Admin page, you can install and manage packages that extend the functionality of OTRS (see Figure below). See the <link linkend="application">Additional applications</link> section for a discussion on the extensions that are available from the OTRS repositories.
ja: 管理者ページ上で「パッケージ・マネージャー」リンクを使用すると、OTRSの機能性を拡張するパッケージをインストールし管理することができます(下記の図を参照)。OTRSリポジトリから利用可能な拡張に関する議論は<link linkend="application">追加アプリケーション</link>セクションを御覧ください。
ru: Используя ссылку "Менеджер пакетов" в Панели Администрирования, можно устанавливать и управлять пакетами, которые расширяют функциональные возможности OTRS (см. Рисунок ниже). Перейдите по ссылке <link linkend="application">Дополнительные приложения</link> чтобы выбрать раздел где находится список и описание расширений, которые доступны из хранилищ OTRS.
sw: Kwa kutumia kiungo cha "Meneja Kifurushi" katika kurasa ya Msimamizi, unaweza kusakinisha na kusimamia vifurushi ambavyo vina panua kazi za OTRS (ona Kielelezo chini). Ona kifungu <link linkend="application">Programu-tumizi za ziada</link> kupata mjadala kuhusu viendelezi ambavyo vinapatiknana kwenye hifadhi za OTRS.

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="Adminarea packagemanager - screenshot" scale="40" fileref="screenshots/admin-packagemanager.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="管理者エリア パッケージ・マネージャー - スクリーンショット" scale="40" fileref="screenshots/admin-packagemanager.png"></graphic>

source: <emphasis>Figure: Package Manager.</emphasis>
ja: <emphasis>図:パッケージ・マネージャ</emphasis>
ru: <emphasis>Рисунок: Менеджер пакетов.</emphasis>
sw: <emphasis>Kielelezo: Msimamizi wa Kifurushi.</emphasis>

source: The Package Manager shows the OTRS addon packages you currently have installed on your server, together with their version numbers.
ja: パッケージ・マネージャは、それらのバージョン番号と一緒に、サーバに現在インストールした OTRS addonパッケージを示します。
ru: Менеджер Пакетов позволяет просмотреть пакеты расширения OTRS вместе с номерами их версий, установленные на сервере в данный момент.
sw: Meneja kifurushi anaionyesha OTRS vifurushi vya nyongeza ambavyo umesakinisha kwenye seva yako kwa sasa, pamoja na nambari zake za matoleo.

source: You can install packages from a remote host by selecting the repository in the <emphasis>Online Repository</emphasis> section, and clicking the <emphasis>Update repository information</emphasis> button. The available packages are displayed in the corresponding table. The right side of the screen shows the available packages. To install a package, click on <emphasis>Install</emphasis>. After installation, the package is displayed in the <emphasis>Local Repository</emphasis> section.
ja: <emphasis>オンライン・レポジトリ</emphasis>セクションにあるレポジトリを選択し、<emphasis>リポジトリ情報の更新</emphasis>ボタンをクリックすることによって、リモート・ホストからパッケージをインストールすることができます。利用可能なパッケージが対応するテーブルに表示されます。 画面右側には利用可能なパッケージを表示します。パッケージをインストールするために<emphasis>インストール</emphasis>をクリックします。インストレーション後、パッケージは<emphasis>ローカル・レポジトリ</emphasis>セクションを表示します。
ru: Пакеты можно установить из удаленного хоста, для этого, в разделе <emphasis>Онлайн Репозиторий</emphasis> нужно выбрать репозиторий и нажать кнопку <emphasis>Обновить информацию из репозитория</emphasis>. Все доступные пакеты будут отображены в соответствующей таблице. В правой части страницы отображаются доступные пакеты. Чтобы установить пакет, нажмите на ссылку <emphasis>Установить</emphasis>. После установки пакет будет отображаться в разделе <emphasis>Local Repository</emphasis>.
sw: Unaweza kusakinisha vifurushi kutoka kwa mwenyeji wa mbali kwa kuchagua hifadhi kwenye kifungu cha <emphasis>Hifadhi ya Mtandao</emphasis>, na kubofya kitufe cha <emphasis>Sasisha taarifa za hifadhi</emphasis>. Vifurushi vilivyopo vinaonyeshwa kwenye jedwali husika. Upande wa kulia wa skrini unaonyesha vifurushi vilivyopo. Kusakinisha kifurushi, bofya kwenye <emphasis>Sakinisha</emphasis>. Baada ya usakinishaji, kifurushi kinaonyeshwa kwenye kifungu cha <emphasis>Hifadhi ya Ndani</emphasis>.

source: To upgrade an installed package, the list of available packages in the online repository will show <emphasis>Upgrade</emphasis> in the Action column for any package that has a higher version than the one that is installed locally. Just click Upgrade and it will install the new package version on your system.
ja: インストールされたパッケージをアップグレードするために、オンライン・リポジトリにある利用可能なパッケージのリストは、ローカルにインストールされているものより高いバージョンがあるあらゆるパッケージ用のアクション・カラムで<emphasis>アップグレード</emphasis>を表示します。単にアップグレードをクリックしてください。そうすれば、新しいパッケージ・バージョンをシステムにインストールします。
ru: Для обновления установленных пакетов можно воспользоваться списком доступных пакетов из он-лайн репозитория. В колонке "действие" для каждого из пакетов, который имеет более высокую версию, чем установленная сейчас, нажмите кнопку <emphasis>Обновить</emphasis>. Просто нажмите на кнопку "Обновить", и новый пакет будет обновлен.
sw: Kuboresha kifurushi kilichosakinishwa, orodha ya vifurushi vilivyopo kwenye hifadhi ya mtandao itaonyesha <emphasis>Boresha</emphasis> katika safuwima ya Vitendo kwa kifurushi chochote chenye toleo jipya zaidi ya lile lililosakinishwa kwa ndani. Bofya Boresha na itasakinisha toleo jipya la kifurushi kwenye mfumo wako.

source: In some cases, such as when your OTRS system is not connected to the Internet, you can also install those packages that you have downloaded to a local disk. Click the <emphasis>Browse</emphasis> button on the Actions side bar, and select the .opm file of the package on your disk. Click <emphasis>Open</emphasis> and then <emphasis>Install Package</emphasis>. After the installation has been completed, the package is displayed in the <emphasis>Local Repository</emphasis> section. You can use the same steps for updating a package that is already installed.
ja: OTRSシステムがインターネットに接続されないような場合、ローカル・ディスクにダウンロードしたそれらのパッケージもインストールすることもできます。アクション・サイドバー上の<emphasis>ブラウズ</emphasis>をクリックし、あなたのディスク内の.opmファイルを選択します。<emphasis>開く</emphasis>を、それから<emphasis>パッケージをインストール</emphasis>をクリックします。インストレーションの完了後、パッケージは<emphasis>レポジトリ</emphasis>セクションに表示されます。設置が終わった後、パッケージは<emphasis>のローカルのリポジトリ</emphasis>セクションに表示されます。既にインストールされているパッケージの更新のために同じステップを使用することができます。
ru: В некоторых случаях, например, когда ваша OTRS-система не подключена к Интернету, можно установить пакеты, которые были заранее загружены на локальный диск. Нажмите кнопку <emphasis> Обзор</emphasis> на боковой панели и выберите. opm-файл на жестком диске. Нажмите <emphasis> Открыть </emphasis>, а затем <emphasis> Установить пакет</emphasis>. После установки пакет отображается в разделе <emphasis>Локальный Репозиторий</emphasis>. Проделайте те же действия для того чтобы обновить уже установленный пакет.
sw: Katika baadhi ya kesi, mfano mfumo wako wa OTRS haujaunganishwa na mtandao, unaweza kusakinisha vifurushi ambavyo umepakua kwenye diski ya ndani. Bofya kitufe cha <emphasis>Vinjari</emphasis> kwenye mwambaa upande wa vitendo, na chagua faili la .opm la kifurushi kwenye diski yako. Bofya <emphasis>Fungua</emphasis> na kisha <emphasis>Sakinisha Kifurushi</emphasis>. Baada ya usakinishaji kukamilika, kifurushi kinaonyeshwa kwenye kifungu <emphasis>Hifadhi ya Ndani</emphasis>. Unaweza kutumia hatua hizo hizo kusasisha kifurushi ambacho tayari kimesakinishwa.

source: The Web Services link leads to the graphical interface where web services (for the OTRS Generic Interface) are created and maintained (see Figure below).
ja: Webサービスリンクはグラフィカル・インターフェースにつながっています。そこではウェブサービス（for the OTRS Generic Interface）が作成され維持されます。（下図参照）
ru: Ссылка Веб-сервисы вызывает графический интерфейс (для OTRS Generic Interface), с помощью которого можно создавать и и управлять ими (см. Рисунок ниже).
sw: Kiungo cha Huduma za Tovuti kinaelekeza kwenye kiolesura mchoro ambapo huduma za tovuti (kwa ajili ya Kiolesura cha Ujumla cha OTRS) zinatengenezwa na kudumishwa (ona Kielelezo chini).

source: The graphical interface for web services
ja: ウェブサービスのためのグラフィカル・インターフェース
ru: Графический интерфейс для веб-сервисов
sw: Kiolesura mchoro cha huduma za tovuti

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="Adminarea webservices - screenshot" scale="40" fileref="screenshots/genericinterface-webservice-overview.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="管理者エリア ウェブサービス - スクリーンショット" scale="40" fileref="screenshots/genericinterface-webservice-overview.png"></graphic>

source: <emphasis>Figure: The graphical interface for web services.</emphasis>
ja: <emphasis>図: ウェブサービスのためのグラフィカル・インターフェース</emphasis>
ru: <emphasis>Рисунок: Графический интерфейс для веб-сервисов.</emphasis>
sw: <emphasis>Kielelezo: Kiolesura mchoro cha huduma za tovuti.</emphasis>

source: The graphical interface for web services configuration is described in more detail in the section <link linkend="webservice_gui">"Web Service Graphical Interface"</link>.
ja: ウェブサービス構成用のグラフィカル・インターフェースは、セクション<link linkend="webservice_gui">"Webサービス・グラフィカル・インターフェース"</link>に、より詳細に述べられています。
ru: Более подробно графический интерфейс для настройки веб-сервисов рассматривается в главе <link linkend="webservice_gui"> "Настройка веб-сервисов через веб-интерфейс" </link>.
sw: Kiolesura michoro cha huduma za wavuti kinaelezewa kwa undani zaidi katika kifungu <link linkend="webservice_gui">"Kiolesura Michoro cha Huduma ya Tovuti"</link>.

source: Dynamic Fields
ja: 動的フィールド
ru: Динамические Поля
sw: Sehemu zinazobadilika

source: Dynamic Fields is the place where you setup and manage custom fields for tickets and articles (see figure below).
ja: 動的フィールドは、チケットと記事用のカスタムフィールドをセットアップし管理する場所です。（下記参照）
ru: Раздел Динамические поля позволяет создавать, настраивать и управлять пользовательскими полями для заявок и сообщений/заметок (см. рисунок ниже).
sw: Sehemu Zinazobadilika ni sehemu ambayo unaseti n akusimamia sehemu zilizogeuzwa kukufaa kwa ajili ya tiketi n amakala (on akielelezo chini).

source: Dynamic fields overview screen
ja: 動的フィールド概要画面
ru: Обзор Динамических полей
sw: Skrini ya mapitio ya sehemu zinazobadilika

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="Adminarea dynamicfields - screenshot" scale="40" fileref="screenshots/dynamicfields-overview-filled.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="「管理者エリア dynamicfields（動的フィールド） - スクリーンショット」" scale="40" fileref="screenshots/dynamicfields-overview-filled.png"></graphic>

source: <emphasis>Figure: The dynamic fields overview screen with some dynamic fields.</emphasis>
ja: <emphasis>図: いくつかの動的フィールドを備えた動的フィールド概要画面</emphasis>
ru: <emphasis>Рисунок: Страница с некоторыми динамическими полями.</emphasis>
sw: <emphasis>Kielelezo: Skrini ya mapitio ya sehemu zinazobadilika na baadhi ya sehemu zinazobadilika.</emphasis>

source: The dynamic fields configuration is described in more detail in the section <link linkend="dynamicfields-configuration">"Dynamic Fields Configuration"</link>.
ja: 動的フィールド構成は、セクション<link linkend="dynamicfields-configuration">"動的フィールド構成"</link>に、より詳細に述べられています。
ru: Более подробно описание настройки динамических полей содержится в разделе <link linkend="dynamicfields-configuration">"Настройка Динамических полей"</link>.
sw: Usanidi wa sehemu zinazobadilika unaelezewa kwa undani zaidi katika kifungu <link linkend="dynamicfields-configuration">"Usanidi wa Sehemu Zinazobadilika"</link>.

source: Each dynamic field type has its own configuration settings and therefore its own configuration screen.
ja: 動的フィールドタイプにはそれぞれそれ自身の構成セッティングおよびしたがってそれ自身の構成画面があります。
ru: Каждый тип динамического поля имеет свои настройки и соответственно свои собственные экраны настройки.
sw: Kila aina ya sehemu zinazobadilika ina usanidi wa mpangilio wake na hivyo skrini yake pekee ya usanidi.

source: In the OTRS framework, dynamic fields can only be linked to tickets and articles by default, but they can be extended to other objects as well.
ja: OTRSフレームワークでは、動的フィールドはデフォルトでチケットと記事にリンクのみすることができます。しかし、それらは、他のオブジェクトまで同様に延長することができます。
ru: При настройке в Панели Администрирования, динамические поля могут быть привязаны только к заявкам или заметкам/сообщениям по умолчанию, но их использование также может быть распространено и на другие объекты.
sw: Katika kiunzi cha OTRS, sehemu zinazobadilika zinaweza kuunganishwa tu kwenye tiketi na makala kama chaguo-msingi, lakini zinaweza kupanuliwa kwenda kwenye vitu vingine.
