Repository: DSigmund/doc-admin
Catalog: i18n/doc-admin.*.po
Languages: ja, ru, sw

source: <emphasis>Cache</emphasis>. Specifies if the generated report should be cached in the filesystem. This saves computing power and time if the report is called up again, but it should only be used if the report's content is no longer changing.
ja: <emphasis>キャッシュ</emphasis>。生成されたレポートがファイルシステムでキャッシュとして保持されるべきかどうかを特定します。レポートが再び呼び出される場合、これは計算能力と時間を節約します。しかし、レポートの内容に変化がない場合、節約になるわけではありません。
ru: <emphasis>Кэш</emphasis>. Указывает на то, что созданный отчет должен кэшироваться в файловой системе. Это позволяет существенно экономить вычислительные мощности и время, но должно использоваться только в том случае если содержание отчета больше не будет изменятся.
sw: <emphasis>Hifadhi muda</emphasis>. Inabainisha kama ripoti iliyozalishwa inatakiwa kuwekwa kwenye hifadhi muda ndani ya mfumo wa mafaili. Hii inaokoa nguvu na muda wa michakato ya kompyuta kama ripoti ikiitwa tena, lakini inatakiwa itumike tu kama maudhui ya ripoti hayabadiliki tena.

source: Caching is automatically prevented if the report contains no time designation values, or if a time designation value points to the future.
ja: レポートが時間指示値を含んでいない場合、あるいは時間指示値が将来を指す場合、自動的にキャッシングは防止されます。
ru: Кэширование автоматически прекращается, если отчет не содержит временных обозначений, или когда временные обозначения указывают на будущее.
sw: Kuweka kwenye hifadhi muda kunazuiwa kama ripoti haina thamani zinazowajibika za muda, au thamani zinazowajibika za muda zinaashiria mbeleni.

source: If a cached report is edited, all cached data is deleted.
ja: キャッシュされたレポートが編集される場合、キャッシュされたデータはすべて削除されます。
ru: В случае редактирования закэшированного отчета удаляются все закэшированные данные.
sw: Kama ripoti iliyo kwenye hifadhi muda imehaririwa, data zote za kwenye hifadhimuda zinafutwa.

source: <emphasis>Valid</emphasis>. This can be set to "invalid" if a pre-configured report must not be run temporarily for any reason. The "Start" button in the bottom of the right panel is then no longer displayed. The report can no longer be generated.
ja: <emphasis>有効</emphasis>。どんな理由でも事前構成されたレポートを一時的に実行してはならない場合、これは「無効」にセットすることができます。その後、右側パネル最下部の「スタート」ボタンは、もはや表示されません。そのレポートはもはや生成することができません。
ru: <emphasis>Действительный</emphasis>. Устанавливается в значение "недействительный" если ранее сконфигурированный отчет по какой то причине не должен выполнятся. Кнопка "Статистика" также не отображатеся в правом нижнем углу блока. Отчет больше не генерируется.
sw: <emphasis>Halali</emphasis>. Hii inaweza kusetiwa kuwa "batili" kama ripoti iliyosanidiwa kabla haitakiwi kuanzishwa kwa muda kwa sababu yoyote. Kitufe cha "Anza" upande wa chini wa paneli y akulia haionyeshwi tena. Ripoti haiwezi kuzalishwa tena.

source: <emphasis>Definition of the element for the X-axis</emphasis>. It is the configuration of the element used for the depiction of the X-axis or, if tables are used, of the column name applied to the X-axis (see Figure).
ja: <emphasis>X軸のための要素の定義</emphasis>。それは、X軸の描写に使用された要素、あるいはX軸に適用されたカラム名の(テーブルが使用される場合)構成です(図を参照)。
ru: <emphasis>Определение элементов для X-axis</emphasis>. Это конфигурация для элементов, которые используются для описания X-axis или, если используются таблицы, имя столбца применяется для X-axis (см. Рисунок ниже).
sw: <emphasis>Fasili ya elementi kwa ajili ya jira-X</emphasis>. Ni usanidi wa elementi unaotumika kwa ajili ya uwakilishaji wa jira-X au, kama majedwali yametumika, ya jina la safuwima linalotumika kwenye jira-X (ona Kielelezo) .

source: <placeholder type="screeninfo" id="0"/> <graphic fileref="screenshots/stats-edit-xaxis.png" scale="40" srccredit="stats-edit-xaxis - Screenshot" />
ja: <placeholder type="screeninfo" id="0"/> <graphic fileref="screenshots/stats-edit-xaxis.png" scale="40" srccredit="統計-編集-X軸 - スクリーンショット" />

source: <emphasis>Figure: Definition of the element for the X-axis.</emphasis>
ja: <emphasis>図: X軸のための要素の定義</emphasis>
ru: <emphasis>Рисунок: Определение элементов для X-axis.</emphasis>
sw: <emphasis>Kielelezo: Fasili ya elemnti kwa ajili ya jira-X.</emphasis>

source: First of all, an element is selected using the option field. Then two or more attributes of the element must be selected. If no attributes are selected, all attributes are used including those added after the configuration of the report.
ja: 第一に、要素はオプション・フィールドを使用して選択されています。その後、要素の2つ以上の属性が選択されなければいけません。属性が選択されていない場合、属性はすべてレポートの構成の後に加えられたものを含めて使用されます。
ru: Во-первых, элемент выбирается с помощью опционального поля. Потом нужно выбрать два или более атрибутов элемента. Если выбраных атрибутов нету, используются все атрибуты, в том числе и те, которые были добавлены после конфигурации отчета.
sw: Kwanza kabisa, elementi inachaguliwa kwa kutumia sehemu ya chaguo. Kisha sifa mbili au zaidi za elementi lazima zichaguliwe. Kama hakuna sifa zilizochaguliwa, sida zote zinatumika kujumuisha zile zilizoongezwa baada ya usanidi wa ripoti.

source: If the "Fixed" setting is disabled, the agent generating the report can change the attributes of the respective element in the "View" user interface.
ja: 「固定の」セッティングが無効になる場合、レポートを生成する担当者は「ビュー」ユーザ・インターフェース中のそれぞれの要素の属性を変更することができます。
ru: Если отключена настройка "Фиксированный", агент, генерирующий отчет, может изменить атрибуты соответствующего элемента в меню "Вид" пользовательского веб-интерфейса.
sw: Kama mipangilio "Funge" imelemazwa, wakala anayezalisha ripoti anaweza kubadilisha sifa za elementi husika katika kiolesura cha "Muonekano".

source: Time elements are different as time period and scale have to be stated. Type and number of elements result from the used dynamic object and vary depending on it.
ja: 期間と規模を述べなければならないとともに、時間的要因は異なります。要素のタイプおよび数は使用された動的オブジェクトに起因し、それに依存して変わります。
ru: Элементы времени отличаются от периодов времени. Тип и число элементов зависит от использующихся динамических обьектов и сильно зависит от этого.
sw: Elementi za muda ni tofauti kwa kuwa kipindi cha muda na skeli lazima vijaribiwe. Aina na idadi ya matokeo ya elementi kutoka kwenye kitu kinachobadilika kilichotumika na kubadilika kwa kukitegemea.

source: If all input is correct, the "Next" button leads to the "Value series" form. It is also possible to go back to editing earlier sections.
ja: 入力がすべて正確な場合、「次」ボタンは「値系列」フォームに向かいます。さらに、初めのセクションの編集に戻ることも可能です。
ru: Если все входные данные введены правильно, нажатие кнопки "Следующий шаг" открывает форму "Серия значений". Кроме этого, есть возможность заново вернуться к редактированию предыдуших разделов.
sw: Kama ingizo si sahihi, kitufe "Inayofwata" kinaelekeza kwenye mfumo wa "Thamani za mfuatano". Pia inawezekana kurudi nyuma kuhariri vifungu vya mwanzoni.

source: <emphasis>Specification of the value series</emphasis>.
ja: <emphasis> 値系列の仕様</emphasis>
ru: <emphasis>Спецификация серии значений</emphasis>.
sw: <emphasis>Ubainishaji wa mfuatano wa thamani</emphasis>.

source: In the third step of the report configuration, the value series are defined (see Figure below). They will later form the individual graphs or the various series within a tabular view.
ja: レポート構成の3番目のステップで、値系列は定義されます(下記の図を参照)。それらは、後で表のビュー内で個別のグラフあるいは様々なシリーズを形成するでしょう。
ru: На третьем шаге настройки отчета нужно определить серию значений (см. Рисунок ниже). Позже они будут использованы для формирования графиков или различных серий в табличном виде.
sw: Katika hatua ya tatu ya usanidi wa ripoti, thamani za mfuatano zinafafanuliwa (ona Kielelezo chini). Baadaye zitatengeneza grafu binafsi au misururu mbali mbali ndani ya muonekano wa jedwali

source: Definition of the value series
ja: 値系列の定義
ru: Определение значений серии
sw: Ufafanuzi wa thamani za mfuatano

source: <placeholder type="screeninfo" id="0"/> <graphic fileref="screenshots/stats-edit-valueseries.png" scale="40" srccredit="stats-edit-valueseries - Screenshot" />
ja: <placeholder type="screeninfo" id="0"/> <graphic fileref="screenshots/stats-edit-valueseries.png" scale="40" srccredit="統計 - 編集 - 値系列 - スクリーンショット" />

source: <emphasis>Figure: Definition of the value series.</emphasis>
ja: <emphasis>図:値系列の定義</emphasis>
ru: <emphasis>Рисунок: Определение значений серии.</emphasis>
sw: <emphasis>Kielelezo: Ufafanuzi wa thamani za mfuatano.</emphasis>

source: If an element is selected, each chosen attribute will correspond to a value series (see the Example 19-1 below).
ja: 要素が選択されていれば、選ばれた属性はそれぞれ値系列に対応するでしょう(下記の例19-1を参照)。
ru: Если выбран определенный элемент, каждый выбранный атрибут будет соответствовать значеню серии (см. ниже Пример 19-1).
sw: Kama elementi imechaguliwa, kila sifa itakayochaguliwa itahusiana na thamani ya mfuatano (ona Mfano 19-1 chini).

source: Definition of a value series - one element
ja: 値系列の定義 - 1つの要素
ru: Определение значения серии - один из элементов
sw: Ufafanuzi wa thamani ya mfuatano - elementi moja

source: Element Queue:
ja: 要素キュー:
ru: Элемент Очередь:
sw: Elementi Foleni:

source: Value series 1 = Raw
ja: 値系列１＝未対応
ru: Серия значений 1 = Raw
sw: Thamani za mfuatano 1 = Mbichi

source: Value series 2 = Junk
ja: 値系列２＝ジャンク
ru: Значение серии 2 = Junk
sw: Thamani za mfuatano 2 = Taka

source: If two elements are selected, each selected attribute of the first element is combined with an attribute of the second element to form a value series (see Example 19-2 below).
ja: 2つの要素が選択されている場合、最初の要素の選択された属性はそれぞれ、値系列を形成する第2の要素の属性と結合します(下記の例19-2を参照)。
ru: Если для формирования значения ряда, выбрано два элемента, каждый выбраный атрибут первого элемента комбинируется с атрибутом второго элемента (см. ниже Рисунок 19-2).
sw: Kama elementi mbili zimechaguliwa, kila sifa iliyochaguliwa ya elementi ya kwanza inaunganishwa na sifa ya elementi ya pili kutengeneza thamani za mfuatano (ona Mfano 19-2 chini).

source: Definition of a value series - two elements
ja: 値系列の定義 - 2つの要素
ru: Определение значения серии - один из элементов
sw: Ufafanuzi wa thamani za mfuatano - elementi mbili

source: Element 1 queue, Element 2 status:
ja: 要素1 キュー、要素2 ステータス:
ru: Элемент 1 очередь, Элемент 2 статус:
sw: Elementi 1 foleni, Elementi 2 hali:

source: Value chain 1 = Raw - open
ja: Value chain 1 = 未対応 - 未完了
ru: Значение создания 1 = Raw - открыть
sw: Thamani za mnyororo 1 = Mbichi - wazi

source: Value series 2 = Raw - successfully closed
ja: Value series 2 = 未対応 - 完了（成功）
ru: Серия значений 2 = Raw - успешно закрыта
sw: Thamani za mfuatano 2 = Mbichi - imefungwa kwa mafanikio

source: Value series 3 = Junk - open
ja: Value series 3 = ジャンク - 未完了
ru: Серия значений 3 = Junk - открыто
sw: Thamani za mfuatano 3 = Taka - wazi

source: Value series 4 = Junk - successfully closed
ja: Value series 4 = ジャンク - 完了（成功）
ru: Серия значений 4 = Junk - успешно закрыто
sw: Thamani za mfuatano 4 = Taka - imefungwa kwa mafanikio

source: Selection of three or more elements is not allowed.
ja: 3つ以上の要素の選択は許可されません。
ru: Выбор из трех или более элементов не допускается.
sw: Uchaguzi wa elementi tatu au zaidi hauruhusiwi.

source: Additionally the same conditions apply to the selection of the attributes and the "Fixed" checkbox as to the "X-axis" selection:
ja: さらに、同じ条件は、「X軸」選択に関してと同様に、属性および「固定の」チェックボックスの選択に当てはまります:
ru: Кроме этого эти условия распостраняются и на выбор атрибутов и флажок "Основные" как для "X-axis":
sw: Kwa nyongeza masharti hayo hayo yanafanya kazi kwa uchaguzi wa sifa na kisanduku tiki "Funge" na pia kwenye uchaguzi wa "jira-X":

source: If no attributes of the element are selected, all attributes are used, including those added after the configuration of the report.
ja: 要素の属性が選択されていない場合、属性はすべてレポートの構成の後に加えられたものを含めて使用されます。
ru: Если для элемента не выбрано никаких атрибутов, то используются все атрибуты, включая и те, которые были добавлены после настройки отчета.
sw: Kama hakuna sifa za elementi zilizochaguliwa, sifa zote zitatumika, ikijumuisha zile zilizo ongezwa baada ya ripoti ya usanidi.

source: If the "Fixed" setting is disabled, the agent generating the report can change the attributes of the respective element.
ja: 「固定の」セッティングが無効の場合、レポートを生成する担当者はそれぞれの要素の属性を変更することができます。
ru: Если параметр "Фиксированный" отключен, агент, который создает отчет может изменять атрибуты соответствующих элементов.
sw: Kama mpangilio "Funge" umelemazwa, wakala anaezalisha ripoti anaweza kubadilisha sifa za elementi husika.

source: <emphasis>Setting restrictions to the report</emphasis>. This is the fourth and final step of the configuration (see Figure below). The restrictions serve to limit the results to the selected criteria. In many cases, no restrictions at all may be set up.
ja: <emphasis>レポートへの制限の設定</emphasis>。これは構成の4番目と最終ステップです(下記の図を参照)。制限は、その結果を選択された基準に制限する役目をします。多くの場合では、制限は全くセット・アップされないかもしれません。
ru: <emphasis>Установка ограничений отчета</emphasis>. Это четвертый и последний этап конфигурации (см. Рисунок ниже). Ограничения служат для ограничения результатов выбранных критериев. В ряде случаев не должно быть никаких ограничений.
sw: <emphasis>Kuweka vizuizi kwenye ripoti</emphasis>. Hii ni hatua ya nne na ya mwisho ya usanidi (ona Kielelezo chini). Vizuizi vinasaidia kuweka kikomo cha matokeo kwa vigezo vilivyochaguliwa. Katika kesi nyingi, hakuna vizuizi vya kuwekwa kabisa.

source: Definition of restrictions
ja: 制限の定義
ru: Определение ограничений
sw: Fasili ya vizuizi

source: <placeholder type="screeninfo" id="0"/> <graphic fileref="screenshots/stats-edit-restrictions.png" scale="40" srccredit="stats-edit-restrictions - Screenshot" />
ja: <placeholder type="screeninfo" id="0"/> <graphic fileref="screenshots/stats-edit-restrictions.png" scale="40" srccredit="統計 - 編集 - 制約 - スクリーンショット" />
sw: <placeholder type="screeninfo" id="0"/> <graphic fileref="screenshots/stats-edit-valueseries.png" scale="40" srccredit="stats-edit-valueseries - Screenshot" />

source: <emphasis>Figure: Definition of restrictions.</emphasis>
ja: <emphasis>図:制限の定義</emphasis>
ru: <emphasis>Рисунок: Определение ограничений.</emphasis>
sw: <emphasis>Kielelezo: Fasili ya vizuizi.</emphasis>

source: After all the restrictions are set up, the configuration of the report is completed by pressing the "Finish" button.
ja: 制限がすべてセット・アップされた後、レポートの構成は「終了」ボタンを押すことにより完成します。
ru: После установки всех ограничей, конфигурация отчета завершается нажатием кнопки "Готово".
sw: Baada ya vizuizi vyote kusetiwa, usanidi wa ripoti unamalizika kwa kubonyeza kitufe "Maliza".

source: Import
ja: インポート
ru: Импорт
sw: Agiza

source: The Import user interface (see Figure below) can be accessed by choosing from the navigation bar, the link "Statistics", then "Import". Alternately, pressing the Import button on the Overview screen achieves the same result. "rw" rights to the report are required.
ja: インポート・ユーザ・インターフェース(下記の図を参照)はナビゲーション・バー、リンク「統計」から選ぶことによりアクセスすることができ、「インポート。」(その後)一方、概要画面上でインポート・ボタンを押すことは同じ結果となります。レポートへの「rw」権は必須です。
ru: Для доступа к пользовательскому интерфейсу Импорта (см. Рисунок ниже) перейдите по ссылке "Статистика", а затем выберите "Импорт". Альтернативный способ - на странице "Обзор" нажать кнопку Импорт, это приведет к тому же результату, но для этого действия требуются права для чтения и записи "RW".
sw: Kiolesura cha Agiza mtumiaji (ona Kielelezo chini) kinaweza kufikiwa kwa kuchagua kutoka kwenye mwambaa wa uabiri, kiungo "Takwimu", kisha "Agiza". Pia, kubonyeza kitufe cha Agiza katika skrini ya Mapitio inaleta matokeo sawa. Haki za "kusoma na kuandika"kwenye ripoti zinatakiwa.

source: The Import user interface
ja: インポート・ユーザ・インターフェース
ru: Пользовательский веб-интерфейс для Импорта
sw: Agiza kiolesura cha mtumiaji

source: <placeholder type="screeninfo" id="0"/> <graphic fileref="screenshots/stats-import.png" scale="40" srccredit="stats-import - Screenshot" />
ja: <placeholder type="screeninfo" id="0"/> <graphic fileref="screenshots/stats-import.png" scale="40" srccredit="統計 - インポート - スクリーンショット" />

source: <emphasis>Figure: The Import user interface.</emphasis>
ja: <emphasis>図:インポート・ユーザ・インターフェース</emphasis>
ru: <emphasis>Рисунок: Пользовательский веб-интерфейс для Импорта.</emphasis>
sw: <emphasis>Kielelezo: Kiolesura cha Kuagiza mtumiaji.</emphasis>

source: Facilitates the import of reports and is, when combined with the export function of the module, a very handy functionality. Stats can be created and tested conveniently on test systems, then imported into the production system.
ja: 非常で機能的なモジュールのエクスポート機能と結合した時、レポートのインポートはより円滑になります。統計は、テスト・システムに便利なように作成しテストし、次に、プロダクション・システムへインポートすることができます。
ru: Очень удобная функция, значительно облегчает импорт статистики, особенно в сочетании с возможностями модуля экспорта. Статистику можно создать и протестировать на тестовых системах, а затем импортировать в реальную систему.
sw: Inarahisisha uagizaji wa ripoti na ni, pale inapounganishwa na fomula saidizi hamisha ya moduli, fomula saidizi muhimu sana. Takwimu zinaweza kutengenezwa na kujaribiwa kirahisi kwenye mifumo ya majaribio, kisha kuagizwa nakuingia kwenye mfumo wa uzalishaji.

source: The import is effected by an easy file upload. The "View" user interface of the imported report is opened automatically afterwards.
ja: インポートは容易なファイル・アップロードによってもたらされます。インポートレポートの「ビュー」ユーザ・インターフェースは自動的に後で開かれます。
ru: Импорт осуществляется путем простой загрузки файла. После этого, для импорта статистики, автоматически открывается пользовательский интерфейс "Вид".
sw: Uagizaji unaathiriwa na kupakia faili. Kiolesura cha "Ona" cha ripoti iliyoagizwa kinafunguliwa kiotomatiki baada ya hapo.

source: Administration of the stats module by the OTRS administrator
ja: OTRS管理者による統計モジュールの管理
ru: Администрирование модуля статистики OTRS администратором.
sw: Usimamizi wa moduli ya takwimu na msimamizi wa OTRS

source: This section provides information about the tasks and responsibilities of the OTRS administrator dealing with the statistics module.
ja: このセクションでは、統計モジュールを取り扱うOTRS管理者のタスクおよび責任に関する情報を提供します。
ru: Этот раздел предоставляет информацию о задачах и функциях администратора OTRS, который работает с модулем статистики.
sw: Hii sehemu inatoa maelezo kuhusu kazi na majukumu ya Msimamizi wa OTRS anayehusika na moduli ya takwimu.

source: Permission settings, Groups and Queues
ja: 許可設定、グループ及びキュー
ru: Настройки полномочий, Групп и Ролей
sw: Mipangilio ya ruhusa, Makundi na Foleni

source: No new queues and/or groups are created when the stats module is installed.
ja: 統計モジュールがインストールされている場合、新規キューおよび(または)グループは作成されません。
ru: Нет новых очередей и/или групп, созданых при установке модуля статистики.
sw: Hakuna foleni mpya na/au makundi yatakayotengenezwa baada ya usanikishaji wa moduli ya takwimu.

source: The default configuration of the module registration gives all agents with "stats" group permissions access to the stats module.
ja: モジュール登録ではデフォルト設定で、すべての担当者に対して統計モジュールに「統計」グループ許可アクセスを与えます。
ru: В конфигурации по умолчанию модуль регистрации дает всем агентам группы "статистика" права доступа к модулю статистики.
sw: Usanidi chaguo-msingi wa moduli ya usajili inawapa mawakala wote wenye ruhusa za kundi "takwimu" ufikivu kwenye moduli ya takwimu.

source: Access according to permission settings:
ja: 許可設定による権限:
ru: Доступ в соответствии с разрешенными настройками:
sw: Ufikivu kuendana na mipangilio ya ruhusa:

source: <emphasis>rw</emphasis>. Allows configuring statistics and reports.
ja: <emphasis>rw</emphasis>。統計とレポートを構成可能にします。
ru: <emphasis>rw</emphasis>. Разрешает настройку статистики и отчетов.
sw: <emphasis>soma andika</emphasis>. Inaruhusu kusanidi takwimu na ripoti.

source: <emphasis>ro</emphasis>. Permits generating pre-configured statistics and reports.
ja: <emphasis>ro</emphasis>。あらかじめ形成された統計およびレポートを構成可能にします。
ru: <emphasis>ro</emphasis>. Разрешает генерацию предварительно сконфигурированной статистики и отчетов.
sw: <emphasis>soma tu</emphasis>. Inaruhusu kuzalisha ripoti na takwimu zilizosanidiwa tayari.

source: The OTRS administrator decides whether agents with the permission to generate pre-configured reports are allocated ro rights in the "stats" group, or if their respective groups are added in the module registration in SysConfig.
ja: OTRS管理者は、以下のふたつを決定します。ひとつは、事前構成されたレポートを生成する許可を持つ担当者が、「統計」グループ中でro権を割り当てられるか、もうひとつは、それぞれのグループがSysConfigの中のモジュール登録で追加されるかどうかです。
ru: OTRS-администратор самостоятельно определяет когда агенты с правами для генерации предварительно настроенных отчетов выделяются в ro-права для группы "статистика", или если их соответствующие группы добавляются в модуль регистрации в SysConfig.
sw: Msimamizi wa OTRS anaamua kama mawakala wenye haki za kuzalisha ripoti zilizosanidiwa kabla wanapewa haki za kusoma tu kwenye kundi la "takwimu", au kama makundi yao husika yanaongezwa katika moduli ya usajili kwenye SysCondig.

source: Administration of the stats module by the system administrator
ja: システム管理者による統計モジュールの管理
ru: Администрирование модуля статистики системным администратором
sw: Usimamizi wa moduli ya takwimu na msimamizi wa mfumo

source: Generally, no system administrator is needed for the operation, configuration and maintenance of the statistics module. However, a little background information for the system administrator is given at this point.
ja: 一般に、システム管理者は、統計モジュールのオペレーション、構成およびメンテナンスに必要とされません。しかしながら、この点に関してシステム管理者に若干の背景情報は与えられます。
ru: Как правило, системного администратора не требуется для эксплуатации, настройки и обслуживания модуля статистики. Однако, немного справочной информации дано для системного администартора в этой точке.
sw: Kwa ujumla, hakuna msimamizi wa mfumo anayehitajika kwa operesheni, usanidi na matengenezo ya moduli ya takwimu. Hata hivyo, taarifa kidogo za msimamizi wa mfumo zinatolewa katika pointi hii.

source: File paths refer to subdirectories of the OTRS home directory (in most cases<filename>/opt/otrs</filename>).
ja: ファイル・パスは、OTRSホームディレクトリー(ほとんどの場合 <filename>/opt/otrs</filename>)のサブディレクトリを指します。
ru: Пути к файлам см. в подкаталогах домашнего каталога OTRS (в большинстве случаев <filename>/opt/otrs</filename>).
sw: Njia za mafaili zinarejea kwenye mipangilio orodha midogo ya mpangilio orodha wa nyumbani wa OTRS (kwa kesi nyingi<filename>/opt/otrs</filename>).

source: Data base table
ja: データベース・テーブル
ru: Таблица базы данных
sw: Jedwali msingi la data

source: All report configurations are implemented and administrated in XML, and therefore stored in the database table "xml_storage". Other modules whose content is presented in xml format use this table as well.
ja: レポート構成はすべてXMLの中でインプリメントされ処理され、したがって、データベース・テーブル「xml_storage」に格納されます。その内容がxmlフォーマットで示される他のモジュールは同様にこのテーブルを使用します。
ru: Включены все конфигурационные параметры отчета и управляются в XML и, следовательно, хранятся в таблице базы данных "xml_storage". Другие модули, конкент которых хранится в xml-формате также используют эту таблицу.
sw: Usanidi wote wa ripoti unafanyika na kusimamiwa katika XML, na hivyo kuhifadhiwa katika jedwali la hifadhidata "xml_storage". Moduli nyingine ambazo maudhui yake yanawasilishwa katika muundo huu wa xml zinatumia hili jedwali pia.

source: List of all files
ja: すべてのファイルのリスト
ru: Список файлов
sw: Orodha ya mafaili yote

source: The following files are necessary for the stats module to work accurately:
ja: 以下は、統計モジュールが正確に動作するためにのに必須のファイルです:
ru: Следующие файлы необходимы для коректной работы модуля статистики:
sw: Mafaili yafuatayo ni muhimu kwa moduli ya takwimu kufanya kazi vizuri:

source: Caching
ja: キャッシング
ru: Кэширование
sw: Kuhifadhi muda
