Repository: DSigmund/doc-admin
Catalog: i18n/doc-admin.*.po
Languages: ja, ru, sw

source: Number of seconds (positive or negative) between the current date and the selected date to be show by default in the edit screens (like New Phone Ticket or Ticket Compose).
ja: 現在の日付と選択された日付間の秒数（正でも負でも）。デフォルトで編集画面に表示されます。（新規電話チケットやチケット作成のように）
ru: Количество секунд (положительное или отрицательное значение) между текущей датой и выбраной дантой, которое будет отображаться на страницах редактирования по умолчанию (например на странице Новая Заявка на основе телефонного звонка или Создать Заявку).
sw: Idadi ya sekunde (hasi au chanya) kati ya tarehe ya sasa na tarehe iliyochaguliwa kuonyeshwa kwa chaguo-msingi katika skrini za kuhariri (kama Tiketi Mpya Simu au Unda Tiketi).

source: Define years period: Mandatory (Yes / No).
ja: 年の期間を定義：必須（はい/いいえ）
ru: Определить период лет: Обязательно (Да / Нет).
sw: Fananua kipindi cha miaka: Lazima (Ndio / Hapana).

source: Used to set a defined number of years in the past and the future based on the current date of the year select for this field, If set to Yes the following options are available:
ja: この設定は、このフィールドが翻訳可能な値であることの指標として使われます。単に翻訳される表示上の値であり、内部的な値に影響を与えるものではありません。翻訳値は手動で言語ファイルに追加する必要があります。
ru: Используется для установки определенного количества лет в прошлом и будущем относительно текущей даты, установленной для этого поля. Если установлено в значение "Да", следующие опции будут доступны:
sw: Inatumika kufafanua idadi maalumu ya miaka ya nyuma na baadaye kwa kutegemeana na tarehe ya sasa ya mwaka uliochaguliwa kwa hii sehemu, kama imesetiwa kuwa Ndiyo machaguo yafwatayo yanapatikana:

source: Years in the past: Optional, Positive integer.
ja: 過去の年：オプション、正の整数
ru: Лет в прошлом: Опционально, положительное целое число.
sw: Miaka ya nyuma: Hiari, Namba kamili chanya.

source: Define the number of years in the past from the current day to display in the year selection for this dynamic field in edit screens.
ja: 編集画面の年選択で表示する現在の日付から過去の年数を定義します。
ru: Задает количество лет в прошлом относительно текущего дня для отображения при выборе из списка для значения в поле Год.
sw: Fafanua idadi ya miaka ya nyuma kutoka siku ya sasa kuonyesha chaguo la mwaka kwa hii sehemu inayobadilika katika skrini za kuhariri.

source: Years in the future: Optional, Positive integer.
ja: 将来の年：オプション、正の整数
ru: Лет в будущем: Опционально, Положительное целое.
sw: Miaka ya mbeleni: Hiari, Namba kamili chanya.

source: Define the number of years in the future from the current day to display in the year selection for this dynamic field in edit screens.
ja: 編集画面にある年選択で表示するために現在の日付から将来の年数を定義します。
ru: Задает количество лет в будущем,относительно текущего дня, при выборе значения из списка для отображения в поле Год.
sw: Fafanua idadi ya miaka ya mbeleni kutoka siku ya sasa kuonyesha katika chaguo la mwaka kwa hii sehemu inayobadilika katika skrini za kuhariri.

source: Dynamic field Date configuration dialog
ja: 動的フィールド 日付/時刻の構成ダイアログ
ru: Окно настройки динамического поля поля Date
sw: Maongezi ya usanidi wa Tarehe ya Sehemu inayobadilika

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="dynamicfields - screenshot" scale="40" fileref="screenshots/dynamicfields-configuration-date.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="dynamicfields（動的フィールド） - スクリーンショット" scale="40" fileref="screenshots/dynamicfields-configuration-date.png"></graphic>

source: <emphasis>Figure: Dynamic field Date configuration dialog.</emphasis>
ja: <emphasis>図:動的フィールド 日付/時刻の構成ダイアログ</emphasis>
ru: <emphasis>Рисунок: Окно настройки динамического поля Date.</emphasis>
sw: <emphasis>Kielelezo: Maongezi ya usanidi wa Tarehe ya Sehemu inayobadilika.</emphasis>

source: Date / Time Dynamic Field Configuration
ja: 日付/時刻 動的フィールドの編集
ru: Настройка Динамического Поля Date / Time
sw: Usanidi wa Tarehe / Muda wa Sehemu Inayobadilika

source: Date / Time dynamic field is used to store a date time value (Minute, Hour, Day, Month and Year).
ja: 日付/時刻 動的フィールドは日付/時刻の値（分、時、日、月と年）を格納するために使用されます。
ru: Динамическое поле Date / Time используется для хранения значения даты и времени (Минута, Час, День, Месяц и Год).
sw: Sehemu inayobadilika ya Tarehe / Muda inatumika kuhifadhi thamani ya ttarehe muda (Dakika, Masaa. Siku, Mwezi na Mwaka).

source: Date / Time dynamic field settings:
ja: 日付/時刻 動的フィールドの設定：
ru: Настройки динамического поля Date / Time:
sw: Mipangilio ya sehemu inayobadilika ya tarehe / muda:

source: Number of seconds (positive or negative) between the current date and the selected date to be shown by default in the edit screens (like New Phone Ticket or Ticket Compose).
ja: 編集画面でデフォルトで表示される（新規電話チケットまたはチケット作成のように）現在の日付と選択した日付間の秒数（正負可）
ru: Количество секунд (положительное или отрицательное значение) между текущей датой и выбраной дантой, которое будет отображаться на страницах редактирования по умолчанию (например на странице Новая Заявка на основе телефонного звонка или Создать ответ).
sw: Idadi ya sekunde (hasi au chanya) kati ya tarehe ya sasa na tarehe iliyochaguliwa kuonyeshwa kwa chaguo-msingi katika skrini za kuhariri (kama Tiketi Mpya Simu au Unda Tiketi).

source: Used to set a defined number of years in the past and the future from thee current date in the year select of this field, If set to Yes the following options are available:
ja: このフィールドの年設定で、過去に将来（現在日から直近３日）に定義済の年数を設定するために使います。次のオプションが「はい」に設定されて利用可能ならば、：
ru: Используется для установки определенного количества лет в прошлом и будущем относительно текущей даты, выбранной для значения поля. Если установлено в значение Yes, следующие опции будут доступны:
sw: Inatumika kuseti nambari ya miaka iliyofafanuliwa huko nyuma na mbeleni kutoka kwenye tarehe ya sasa katika chaguo la mwaka la sehemu hii, kama imesetiwa kuwa Ndiyo machaguo yafwatayo yanapatikana:

source: Dynamic field Date / Time configuration dialog
ja: 動的フィールド 日付 の構成ダイアログ
ru: Диалог настройки динамического поля Date / Time
sw: Maongezi ya usanidi wa Tarehe / Muda wa Sehemu inayobadilika

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="dynamicfields - screenshot" scale="40" fileref="screenshots/dynamicfields-configuration-datetime.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="dynamicfields（動的フィールド） - スクリーンショット" scale="40" fileref="screenshots/dynamicfields-configuration-datetime.png"></graphic>

source: <emphasis>Figure: Dynamic field Date / Time configuration dialog.</emphasis>
ja: <emphasis>図：動的フィールド 日付 の構成ダイアログ</emphasis>
ru: <emphasis>Рисунок: Окно настройки динамического поля Date / Time. </emphasis>
sw: <emphasis>Kielelezo: Maongezi ya usanidi wa Tarehe / Muda wa Sehemu inayobadilika.</emphasis>

source: Editing a Dynamic Field
ja: 動的フィールドの編集
ru: Редактирование Динамического Поля
sw: Kuhariri sehemu inayobadilika

source: A filled dynamic field overview screen (with the previous examples) should look like:
ja: 入力された動的フィールドの概要画面は（前回のサンプルと）同様に見えるはずです。
ru: Страница просмотра заполненого динамического поля (с предыдущими примерами) должна выглядеть так:
sw: Skrini ya mapitio ya sehemu inayobadilika iliyojazwa (na mifano iliyopita) inatakiwa ionekane kama:

source: Dynamic field overview screen filled with sample data
ja: サンプルデータで埋められた動的フィールドの概要画面
ru: Страница просмотра заполненого динамического поля с тестовыми данными
sw: Skrini ya mapitio ya sehemu zinazobadilika iliyojazwa na data za sampuli

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="dynamicfields - screenshot" scale="40" fileref="screenshots/dynamicfields-overview-filled.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="dynamicfields（動的フィールド） - スクリーンショット" scale="40" fileref="screenshots/dynamicfields-overview-filled.png"></graphic>

source: <emphasis>Figure: Dynamic field overview screen filled with sample data.</emphasis>
ja: <emphasis>図:サンプルデータで埋められた動的フィールドの概要画面</emphasis>
ru: <emphasis>Рисунок: Окно просмотра Динамического поля заполненного тестовыми данными.</emphasis>
sw: <emphasis>Kielelezo: Skrini ya mapitio ya sehemu zinazobadilika iliyojazwa na data za sampuli.</emphasis>

source: To change or edit a dynamic field you must have at least one field defined, select an already added field from the dynamic fields overview screen and update its settings.
ja: 動的フィールドを変更・編集するために、少なくともひとつのフィールドを定義し、動的フィールドの概要画面から既に追加済フィールドを選択し、その設定を更新しなければいけません。
ru: Чтобы изменить или редактировать динамическое поле, нужно иметь определенным хотя бы одно динамическое поле, которое находится в списке выбора динамических полей на странице просмотра.
sw: Kubadilisha au kuhariri sehemu inayobadilika lazima uwe na sehemu moja iliyofafanuliwa, chagua sehemu ambayo tayari imejazwa kutoka kwenye skrini ya mapitio ya sehemu zinazobadilika na sahihisha mipangilio.

source: Not all the dynamic field settings can be changed, the Field type and Object type are fixed from the selection of the field and they can't be changed.
ja: すべての動的フィールド設定が変更できるわけではありません。フィールド・タイプとオブジェクト・タイプはフィールドの選択から固定し、それらを変更することができません。
ru: Не все настройки динамического поля могут быть изменены, тип Поля и тип Объекта не могут быть изменены.
sw: Sio sehemu zote zinazobadilika zinaweza kubadilishwa, aina ya Sehemu na aina ya Kitu zimefungwa kutoka kwenye machaguo ya sehemu na haziwezi kubadilishwa.

source: It is not recommended to change the field internal name, but the label can be changed at any time. If internal name is changed all "SysConfig" settings that have a reference to that particular field needs to be updated as well as user preferences (if defined).
ja: ラベルはいつでも変更することができますが、フィールド内部名の変更は推奨されません。もし内部名が変更されるならば、全ての特別なフィールドを参照するSysConfig設定は、ユーザ選択（定義されていれば）同様に更新されるべきです。
ru: Не рекомендуется изменять внутреннее имя поля, но внешнее название/метка, может быть изменно в любое время. Если вы все-таки изменили внутреннее имя, необходимо изменить в "SysConfig" все настройки ссылающиеся на это имя, а также в личных настройках агента (если там задано).
sw: Haishauriwi kubadilisha jina la ndani la sehemu, lakini lebo inaweza kubadilishwa mda wowote. Kama jina la ndani limebadilishwa mipangilio yote ya "SysConfig" ambayo ina marejeo kwenye sehemu hiyo yanahitaji kusasishwa na pia mapendeleo ya mtumiaji (kama imefafanuliwa).

source: Showing a Dynamic Field on a Screen
ja: 画面上での動的フィールドの表示
ru: Отображение Динамического Поля на Экране
sw: Kuonyesha Sehemu Inayobadilika kwenye Skrini

source: To display a dynamic field on a particular screen there are two mandatory conditions:
ja: 特別の画面に動的フィールドを表示するために、2つの必須条件があります:
ru: Есть два обязательных условия, которые необходимо выполнить, чтобы отобразить динамическое поле на определенных страницах:
sw: Kuonyesha sehemu inayobadilika kwenye skrini fulani kuna masharti mawili ya lazima:

source: The dynamic field must be valid.
ja: 動的フィールドは有効でなければいけません。
ru: Динамическое поле должно быть действительным
sw: Sehemu inayobadilika lazima iwe halali.

source: The dynamic field must be set to 1 or 2 in the configuration of the screen.
ja: 動的フィールドは画面の構成の中で1または2にセットされなければいけません。
ru: Динамическое поле должно быть установлено в 1 или 2 на странице с настройками.
sw: Sehemu inayobadilika lazima isetiwe kuwa 1 au 2 kwenye skrini ya usanidi.

source: Follow these steps to show a dynamic field in a screen
ja: 画面の中で動的フィールドを表示する次のステップに進みます。
ru: Следуйте этим шагам чтобы отобразить динамическое поле на экране
sw: Fuata hatua hizi kuonyesha sehemu inayobadilika katika skrini

source: Be sure that the dynamic field is set to valid, you can see the validity of the field from the dynamic field overview screen. Set to valid by editing the field if necessary.
ja: 必ず動的フィールドを有効にセットして下さい。フィールドフォームの有効性を動的フィールド概要画面から確認できます。必要ならフィールドを編集して有効にして下さい。
ru: Убедитесь что значение динамического поля установлено правильно. Убедится в правильности значения можно посмотрев на страницу просмотра. Немедленно отредактируйте значение, чтобы сделать его правильным.
sw: Kuwa na uhakika kwamba sehemu inayobadilika imesetiwa kuwa halali, unaweza kuona uhalali wa sehemu kutoka kwenye skrini ya mapitio ya sehemu inayobadilika. Seti kuwa halali kwa kuhariri sehemu kama ikihitajika.

source: Open the "sysconfig" and select "Ticket" from the dropdown list in the Actions side bar located in the left part of the screen.
ja: 「Sysconfig」を開き、画面左側のアクション・サイドバーにあるドロップダウンリストから「チケット」を選択して下さい。
ru: Откройте раздел "SysConfig"/Конфигурация системы выберите подраздел "Ticket" из выпадающего списка в левой верхней части экрана - фрейм "Действия".
sw: Fungua "sysconfig" na chagua "Tiketi" kutoka kwenye orodha kunjuzi katika mwambaa upande wa Vitendo ulio katika upande wa kushoto wa skrini.

source: You can also search for "DynamicField" in the search box above or the "sysconfig" key directly if you already know it.
ja: さらに、既にそれを知っていれば、上記の検索ボックスあるいは「sysconfig」キー中の「動的フィールド」を直接検索することができます。
ru: Вы также можете искать параметры, использующие конкретное динамическое поле через окно поиска или, непосредственно параметр "sysconfig", если знаете его название.
sw: Pia unaweza kutafuta "SehemuInayobadilika" katika kisanduku cha kutafuta juu au ufunguo wa "sysconfig" moja kwa moja kama unaujua.

source: Locate the setting sub-group for the screen that you are looking for and click on it. For example "Frontend::Agent::Ticket::ViewPhoneNew".
ja: 探している画面用サブグループ設定へ行ってそれをクリックします。例えば「Frontend::Agent::Ticket::ViewPhoneNew」。
ru: Найдите подгруппу параметров для экрана, который ищете и нажмите на его название. Например, "Frontend::Agent::Ticket::ViewPhoneNew".
sw: Tambua mpangilio kundi dogo kwa skrini unayoitafuta na kibonyeze. Kwa mfano "Mazingira ya mbele::Wakala::Tiketi::OnaSimuMpya".

source: Search for the setting that ends with "###DynamicField". For example "Ticket::Frontend::AgentTicketPhone###DynamicField".
ja: "###DynamicField"で終わるセッティングを検索してください。例えば"Ticket::Frontend::AgentTicketPhone###DynamicField"。
ru: Поиск параметра, наименование которого заканчивается на "###DynamicField". Например, "Ticket::Frontend::AgentTicketPhone###DynamicField".
sw: Tafuta mpangilio uanoishia na "###SehemuInayobadilika". Kwa mfano "Tiketi::Mazingira ya mbele::WakalaTiketiSimu###SehemuInayobadilika".

source: If the setting is empty or does not have the required dynamic field name, click on the "+" button to add a new entry. For example Key: Field1, Content: 1.
ja: セッティングが空か必須の動的フィールド名がない場合は、新規エントリーを加えるためには「+」ボタンをクリックしてください。例えばキー:Field1、Content:1．
ru: Если параметр пустой или не содержит требуемого имени динамического поля, нажмите кнопку "+" и добавьте необходимую пару значений. Например, Ключ: Поле1, Содержание: 1.
sw: Kama mpangilio uko tupu au hauna jina linalotakiwa la sehemu inayobadilika, bofya kwenye kitufe "+" kuongeza ingizo jipya. Kwa mfano Ufunguo: Sehemu1, Maudhui: 1.

source: If the setting already has the dynamic field name listed be sure that is set to "1" to display the field or to "2" to display it as mandatory.
ja: 設定にすでに動的フィールド名がリストされてることが確かならば、フィールドに表示するためには「1」をセットし、必須として表示するためには「2」をセットします。
ru: Если параметр уже содержит описание нужного динамического поля, то убедитесь, что "Содержание" установлено в "1" для его отображения, или "2", чтобы сделать его обязательным для ввода.
sw: Kama mpangilio tayari una orodha ya jina la sehemu inayobadilika kuwa na uhakika kwamba imesetiwa kuwa "1" ili kuonyesha hiyo sehemu au kuwa "2" kuonyesha kwa ulazima.

source: Save the configuration by clicking in the "Update" button and the bottom of the screen and navigate to the screen where you want the field to be displayed.
ja: 画面底部にある「アップデート」ボタンをクリックする、及びあなたがフィールドを表示したい画面へ導いて構成を保存して下さい。
ru: Сохраните изменения параметра, нажав кнопку "Обновить" в нижней части экрана и перейдите к описанию экрана, где это поле должно отображаться.
sw: Hifadhi usanidi kwa kubofya katika kitufe cha "Sasisha" na chini ya skrini na abiri kwenda kwenye skrini ambayo unataka sehemu ionyeshwe.

source: Show Examples
ja: サンプルの表示
ru: Показать Примеры
sw: Onyesha Mifano

source: The following are "sysconfig" configurations examples to show or hide dynamic fields on different screens.
ja: 下記は、異なる画面上の動的フィールドを表示するか非表示にするかの「sysconfig」構成例です。
ru: Далее показаны примеры настройки в "sysconfig" для отображения или скрытия показа динамических полей на разных экранах.
sw: Ifuatayo ni mifano ya usanidi wa "sysconfig" kuonyesha au kuficha sehemu zinazobadilika katika skrini tofauti.

source: Activate Field1 in New Phone Ticket Screen.
ja: 新規電話チケット画面にあるフィールド１を活性化します。
ru: Активировать Field1 на странице Новая Заявка на основе телефонного звонка.
sw: Amilisha Sehemu1 katika Simu Mpya Tiketi Skrini.

source: <emphasis>Group:</emphasis> Ticket
ja: <emphasis>グループ:</emphasis> チケット
ru: <emphasis>Групировать:</emphasis> Заявку
sw: <emphasis>Umbo: Kundi.</emphasis> Tiketi

source: <emphasis>Sub-group:</emphasis> Frontend::Agent::Ticket::ViewPhoneNew
ja: <emphasis>サブグループ:</emphasis> Frontend::Agent::Ticket::ViewPhoneNew
ru: <emphasis>Подгруппа:</emphasis> Frontend::Agent::Ticket::ViewPhoneNew
sw: <emphasis>Kundi-dogo:</emphasis> Mazingira ya mbele::Wakala::Tiketi::OnaSimuMpya

source: <emphasis>Setting:</emphasis> Ticket::Frontend::AgentTicketPhone###DynamicField
ja: <emphasis>設定:</emphasis> Ticket::Frontend::AgentTicketPhone###DynamicField
ru: <emphasis>Настройка:</emphasis> Ticket::Frontend::AgentTicketPhone###DynamicField
sw: <emphasis>Mpangilio:</emphasis> Tiketi::Mazingira ya mbele::WakalaTiketiSimu###SehemuInayobadilika

source: <emphasis>Value:</emphasis>
ja: <emphasis>値:</emphasis>
ru: <emphasis>Значение:</emphasis>
sw: <emphasis>Thamani:</emphasis>

source: Key
ja: キー
ru: Ключ
sw: Ufunguo

source: Content
ja: 内容
sw: Maudhui

source: Field1 in New Phone Ticket Screen.
ja: 新規電話チケット画面のField1
ru: Field1 на странице Новая Заявка на основе телефонного звонка.
sw: Sehemu1 katika Simu Mpya Tiketi Skrini.

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="dynamicfields - screenshot" scale="40" fileref="screenshots/dynamicfields-agentticketphone-field1.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="dynamicfields（動的フィールド） - スクリーンショット" scale="40" fileref="screenshots/dynamicfields-agentticketphone-field1.png"></graphic>

source: <emphasis>Figure: Field1 in New Phone Ticket Screen.</emphasis>
ja: <emphasis>図:新規電話チケット画面中のField1</emphasis>
ru: <emphasis>Рисунок:. Экран приветствия.</emphasis>
sw: <emphasis>Kielelezo: Sehemu1 katika Simu Mpya Tiketi Skrini.</emphasis>

source: Activate Field1 in New Phone Ticket Screen as mandatory.
ja: 新規電話チケット画面中の必須フィールド1を活性化
ru: Сделать Field1 на странице просмотра Заявки созданной на базе телефонного звонка New Phone Ticket Screen as mandatory.
sw: Amilisha Sehemu1 katika Simu Mpya Tiketi Skrini kwa ulazima.

source: Field1 in New Phone Ticket Screen as mandatory.
ja: 新規電話チケット画面中の必須フィールド1
ru: Field1 на странице Новая Заявка на основе телефонного звонка обьязательно.
sw: Sehemu1 katika Simu Mpya Tiketi Skrini kwa ulazima.

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="dynamicfields - screenshot" scale="40" fileref="screenshots/dynamicfields-agentticketphone-field1-mandatory.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="dynamicfields（動的フィールド） - スクリーンショット" scale="40" fileref="screenshots/dynamicfields-agentticketphone-field1-mandatory.png"></graphic>

source: <emphasis>Figure: Field1 in New Phone Ticket Screen as mandatory.</emphasis>
ja: <emphasis>図：新規電話チケット画面中の必須フィールド1</emphasis>
ru: <emphasis>Рисунок: поле Field1 на странице Новая Заявка на основе телефонного звонка объязательное.</emphasis>
sw: <emphasis>Kielelezo: Sehemu1 katika Simu Mpya Tiketi Skrini kwa ulazima.</emphasis>

source: Activate several fields in New Phone Ticket Screen.
ja: 必須として新規電話チケット画面中のフィールド1を活性化
ru: Активировать несколько полей на странице просмомра Новых Телефонных Заявко.
sw: Amilisha sehemu mbali mbali katika Simu Mpya Tiketi Skrini.

source: Several fields in New Phone Ticket Screen as mandatory.
ja: 新規電話チケット画面中の必須の複数フィールド
ru: Некоторые поля на странци Новая Телефонная Заявка обязательны.
sw: Sehemu mbali mbali katika Simu Mpya Tiketi Skrini kwa ulazima.

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="dynamicfields - screenshot" scale="40" fileref="screenshots/dynamicfields-agentticketphone-allfields.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="dynamicfields（動的フィールド） - スクリーンショット" scale="40" fileref="screenshots/dynamicfields-agentticketphone-allfields.png"></graphic>

source: <emphasis>Figure: Several fields in New Phone Ticket Screen as mandatory.</emphasis>
ja: <emphasis>図:新規電話チケット画面中の必須の複数フィールド</emphasis>
ru: <emphasis>Рисунок: Несколько полей на странице Заявки созданной на основе телефонного звонка обязательны</emphasis>
sw: <emphasis>Kielelezo: Sehemu mbali mbali katika Simu Mpya Tiketi Skrini kwa ulazima.</emphasis>

source: Deactivate some fields in New Phone Ticket Screen.
ja: 新規電話チケット画面中の複数の必須フィールドを非活性化
ru: Отключить некоторые поля на странице Новой Заявки, созданной на основе телефонного звонка.
sw: Lemaza baadhi ya sehemu katika Simu Mpya Tiketi Skrini.

source: Some deactivated fields in New Phone Ticket Screen as mandatory.
ja: 新規電話チケット画面中の必須の複数フィールドの非活性化
ru: Некоторые неактивированные поля на странице Новой Заявки созданой на основе телефонного звонка - объязательны.
sw: Baadhi ya sehemu zilizolemazwa katika Simu Mpya Tiketi Skrini kwa ulazima.

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="dynamicfields - screenshot" scale="40" fileref="screenshots/dynamicfields-agentticketphone-somefields.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="dynamicfields（動的フィールド） - スクリーンショット" scale="40" fileref="screenshots/dynamicfields-agentticketphone-somefields.png"></graphic>

source: <emphasis>Figure: Some deactivated fields in New Phone Ticket Screen as mandatory.</emphasis>
ja: <emphasis>図：新規電話チケット画面中の必須の複数フィールドの非活性化</emphasis>
ru: <emphasis>Рисунок: Несколько неактивных полей на экране Создать новую Заявку на основе телефонного звонка сделать обязательными</emphasis>
sw: <emphasis>Kielelezo: Baadhi ya sehemu zilizolemazwa katika Simu Mpya Tiketi Skrini kwa ulazima.</emphasis>

source: Activate Field1 in Ticket Zoom Screen.
ja: チケットズーム画面でフィールド１を活性化
ru: Активировать поле Field1 на странице просмотра подробной информации о Заявке.
sw: Amilisha Sehemu1 katika Skrini Kuza Tiketi.

source: <emphasis>Sub-group:</emphasis> Frontend::Agent::Ticket::ViewZoom
ja: <emphasis>サブグループ:</emphasis> Frontend::Agent::Ticket::ViewZoom
ru: <emphasis>Подгруппа:</emphasis> Frontend::Agent::Ticket::ViewZoom
sw: <emphasis>Kundi-dogo:</emphasis> Mazingira ya mbele::Wakala::Tiketi::OnaKuza

source: <emphasis>Setting:</emphasis> Ticket::Frontend::AgentTicketZoom###DynamicField
ja: <emphasis>設定:</emphasis> Ticket::Frontend::AgentTicketZoom###DynamicField
ru: <emphasis>Установка:</emphasis> Ticket::Frontend::AgentTicketZoom###DynamicField
sw: <emphasis>Mpangilio:</emphasis> Tiketi::Mazingira ya mbele::WakalaTiketiKuza###SehemuInayobadilika

source: Field1 in Ticket Zoom Screen.
ja: チケット・ズーム・画面中のField1
ru: поле Field1/Поле1 на Ticket Zoom экране.
sw: Sehemu1 katika Skrini Kuza Tiketi.

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="dynamicfields - screenshot" scale="40" fileref="screenshots/dynamicfields-agentticketzoom-field1.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="dynamicfields（動的フィールド） - スクリーンショット" scale="40" fileref="screenshots/dynamicfields-agentticketzoom-field1.png"></graphic>

source: <emphasis>Figure: Field1 in Ticket Zoom Screen.</emphasis>
ja: <emphasis>図:チケット・ズーム・画面中のField1</emphasis>
ru: <emphasis>Рисунок: поле Field1/Поле1 на Ticket Zoom экране.</emphasis>
sw: <emphasis>Kielelezo: Sehemu1 katika Skrini Kuza Tiketi.</emphasis>
