Repository: DSigmund/doc-admin
Catalog: i18n/doc-admin.*.po
Languages: ja, ru, sw

source: This operation is used to get all the attributes of a ticket including the dynamic fields, all articles and all of the attachments that belong to the ticket.
ja: このオペレーションは全てのチケットの属性を得るために使用されます。（この属性は、動的フィールド、すべての記事、およびチケットに属する全ての添付を含みます。）
ru: Эта операция используется для получения всех атрибутов заявки, включая динамические поля, все сообщения и все вложения принадлежащие заявке.
sw: Hii operesheni inatumika kupata sifa zote za tiketi ikijumuisha sehemu zinazobadilika, makala zote na viambatanisho vyote ambavyo ni vya tiketi.

source: <TicketGet> <!--You have a MANDATORY CHOICE of the next 3 items at this level--> <!--Optional:--> <UserLogin>?</UserLogin> <!--Optional:--> <CustomerUserLogin>?</CustomerUserLogin> <!--Optional:--> <SessionID>?</SessionID> <!--Optional:--> <Password>?</Password> <!--1 or more repetitions:--> <TicketID>?</TicketID> <!--Optional:--> <DynamicFields>?</DynamicFields> <!--Optional:--> <Extended>?</Extended> <!--Optional:--> <AllArticles>?</AllArticles> <!--Optional:--> <ArticleSenderType>?</ArticleSenderType> <!--Optional:--> <ArticleOrder>?</ArticleOrder> <!--Optional:--> <ArticleLimit>?</ArticleLimit> <!--Optional:--> <Attachments>?</Attachments> </TicketGet>
ja: <TicketGet> <!--このレベルでは次の3つの必須選択項目があります。--> <!--Optional:--> <UserLogin>?</UserLogin> <!--Optional:--> <CustomerUserLogin>?</CustomerUserLogin> <!--Optional:--> <SessionID>?</SessionID> <!--Optional:--> <Password>?</Password> <!--1 or more repetitions:--> <TicketID>?</TicketID> <!--Optional:--> <DynamicFields>?</DynamicFields> <!--Optional:--> <Extended>?</Extended> <!--Optional:--> <AllArticles>?</AllArticles> <!--Optional:--> <ArticleSenderType>?</ArticleSenderType> <!--Optional:--> <ArticleOrder>?</ArticleOrder> <!--Optional:--> <ArticleLimit>?</ArticleLimit> <!--Optional:--> <Attachments>?</Attachments> </TicketGet>

source: TicketSearch operation returns a list of Ticket IDs that matches a predefined criteria.
ja: TicketSearchオペレーションは、事前定義された基準に一致するチケットIDのリストを返します。
ru: Операция "ПоискЗаявки/TicketSearch" возвращает список всех Ticket IDs/Идентификаторов заявок, удовлетворяющих заданному критерию.
sw: Operesheni TiketiTafuta inarudisha orodha ya Vitambulisho vya Tiketi ambazo zinafanana na kigezo kilichofafanuliwa.

source: <TicketSearch> <!--You have a MANDATORY CHOICE of the next 3 items at this level--> <!--Optional:--> <UserLogin>?</UserLogin> <!--Optional:--> <CustomerUserLogin>?</CustomerUserLogin> <!--Optional:--> <SessionID>?</SessionID> <!--Optional:--> <Password>?</Password> <!--Optional:--> <Limit>?</Limit> <!--Zero or more repetitions:--> <TicketNumber>?</TicketNumber> <!--Zero or more repetitions:--> <Title>?</Title> <!--Zero or more repetitions:--> <Queues>?</Queues> <!--Zero or more repetitions:--> <QueueIDs>?</QueueIDs> <!--Optional:--> <UseSubQueues>?</UseSubQueues> <!--Zero or more repetitions:--> <Types>?</Types> <!--Zero or more repetitions:--> <TypeIDs>?</TypeIDs> <!--Zero or more repetitions:--> <States>?</States> <!--Zero or more repetitions:--> <StateIDs>?</StateIDs> <!--Zero or more repetitions:--> <StateType>?</StateType> <!--Zero or more repetitions:--> <StateTypeIDs>?</StateTypeIDs> <!--Zero or more repetitions:--> <Priorities>?</Priorities> <!--Zero or more repetitions:--> <PriorityIDs>?</PriorityIDs> <!--Zero or more repetitions:--> <Services>?</Services> <!--Zero or more repetitions:--> <ServiceIDs>?</ServiceIDs> <!--Zero or more repetitions:--> <SLAs>?</SLAs> <!--Zero or more repetitions:--> <SLAIDs>?</SLAIDs> <!--Zero or more repetitions:--> <Locks>?</Locks> <!--Zero or more repetitions:--> <LockIDs>?</LockIDs> <!--Zero or more repetitions:--> <OwnerIDs>?</OwnerIDs> <!--Zero or more repetitions:--> <ResponsibleIDs>?</ResponsibleIDs> <!--Zero or more repetitions:--> <WatchUserIDs>?</WatchUserIDs> <!--Zero or more repetitions:--> <CustomerID>?</CustomerID> <!--Zero or more repetitions:--> <CustomerUserLogin>?</CustomerUserLogin> <!--Zero or more repetitions:--> <CreatedUserIDs>?</CreatedUserIDs> <!--Zero or more repetitions:--> <CreatedTypes>?</CreatedTypes> <!--Zero or more repetitions:--> <CreatedTypeIDs>?</CreatedTypeIDs> <!--Zero or more repetitions:--> <CreatedPriorities>?</CreatedPriorities> <!--Zero or more repetitions:--> <CreatedPriorityIDs>?</CreatedPriorityIDs> <!--Zero or more repetitions:--> <CreatedStates>?</CreatedStates> <!--Zero or more repetitions:--> <CreatedStateIDs>?</CreatedStateIDs> <!--Zero or more repetitions:--> <CreatedQueues>?</CreatedQueues> <!--Zero or more repetitions:--> <CreatedQueueIDs>?</CreatedQueueIDs> <!--Zero or more repetitions:--> <DynamicFields> <!--You have a MANDATORY CHOICE of the next 6 items at this level--> <!--Optional:--> <Equals>?</Equals> <!--Optional:--> <Like>?</Like> <!--Optional:--> <GreaterThan>?</GreaterThan> <!--Optional:--> <GreaterThanEquals>?</GreaterThanEquals> <!--Optional:--> <SmallerThan>?</SmallerThan> <!--Optional:--> <SmallerThanEquals>?</SmallerThanEquals> </DynamicFields> <!--Optional:--> <Ticketflag> <!--Optional:--> <Seen>?</Seen> </Ticketflag> <!--Optional:--> <From>?</From> <!--Optional:--> <To>?</To> <!--Optional:--> <Cc>?</Cc> <!--Optional:--> <Subject>?</Subject> <!--Optional:--> <Body>?</Body> <!--Optional:--> <FullTextIndex>?</FullTextIndex> <!--Optional:--> <ContentSearch>?</ContentSearch> <!--Optional:--> <ConditionInline>?</ConditionInline> <!--Optional:--> <ArticleCreateTimeOlderMinutes>?</ArticleCreateTimeOlderMinutes> <!--Optional:--> <ArticleCreateTimeNewerMinutes>?</ArticleCreateTimeNewerMinutes> <!--Optional:--> <ArticleCreateTimeNewerDate>?</ArticleCreateTimeNewerDate> <!--Optional:--> <ArticleCreateTimeOlderDate>?</ArticleCreateTimeOlderDate> <!--Optional:--> <TicketCreateTimeOlderMinutes>?</TicketCreateTimeOlderMinutes> <!--Optional:--> <ATicketCreateTimeNewerMinutes>?</ATicketCreateTimeNewerMinutes> <!--Optional:--> <TicketCreateTimeNewerDate>?</TicketCreateTimeNewerDate> <!--Optional:--> <TicketCreateTimeOlderDate>?</TicketCreateTimeOlderDate> <!--Optional:--> <TicketChangeTimeOlderMinutes>?</TicketChangeTimeOlderMinutes> <!--Optional:--> <TicketChangeTimeNewerMinutes>?</TicketChangeTimeNewerMinutes> <!--Optional:--> <TicketChangeTimeNewerDate>?</TicketChangeTimeNewerDate> <!--Optional:--> <TicketChangeTimeOlderDate>?</TicketChangeTimeOlderDate> <!--Optional:--> <TicketCloseTimeOlderMinutes>?</TicketCloseTimeOlderMinutes> <!--Optional:--> <TicketCloseTimeNewerMinutes>?</TicketCloseTimeNewerMinutes> <!--Optional:--> <TicketCloseTimeNewerDate>?</TicketCloseTimeNewerDate> <!--Optional:--> <TicketCloseTimeOlderDate>?</TicketCloseTimeOlderDate> <!--Optional:--> <TicketPendingTimeOlderMinutes>?</TicketPendingTimeOlderMinutes> <!--Optional:--> <TicketPendingTimeNewerMinutes>?</TicketPendingTimeNewerMinutes> <!--Optional:--> <TicketPendingTimeNewerDate>?</TicketPendingTimeNewerDate> <!--Optional:--> <TicketPendingTimeOlderDate>?</TicketPendingTimeOlderDate> <!--Optional:--> <TicketEscalationTimeOlderMinutes>?</TicketEscalationTimeOlderMinutes> <!--Optional:--> <TTicketEscalationTimeNewerMinutes>?</TTicketEscalationTimeNewerMinutes> <!--Optional:--> <TicketEscalationTimeNewerDate>?</TicketEscalationTimeNewerDate> <!--Optional:--> <TicketEscalationTimeOlderDate>?</TicketEscalationTimeOlderDate> <!--Optional:--> <ArchiveFlags>?</ArchiveFlags> <!--Zero or more repetitions:--> <OrderBy>?</OrderBy> <!--Zero or more repetitions:--> <SortBy>?</SortBy> <!--Zero or more repetitions:--> <CustomerUserID>?</CustomerUserID> </TicketSearch>
ja: <TicketSearch> <!--このレベルでは次の3つの必須選択項目があります。--> <!--Optional:--> <UserLogin>?</UserLogin> <!--Optional:--> <CustomerUserLogin>?</CustomerUserLogin> <!--Optional:--> <SessionID>?</SessionID> <!--Optional:--> <Password>?</Password> <!--Optional:--> <Limit>?</Limit> <!--0回以上繰り返し:--> <TicketNumber>?</TicketNumber> <!--0回以上繰り返し:--> <Title>?</Title> <!--0回以上繰り返し:--> <Queues>?</Queues> <!--0回以上繰り返し:--> <QueueIDs>?</QueueIDs> <!--Optional:--> <UseSubQueues>?</UseSubQueues> <!--0回以上繰り返し:--> <Types>?</Types> <!--0回以上繰り返し:--> <TypeIDs>?</TypeIDs> <!--0回以上繰り返し:--> <States>?</States> <!--0回以上繰り返し:--> <StateIDs>?</StateIDs> <!--0回以上繰り返し:--> <StateType>?</StateType> <!--0回以上繰り返し:--> <StateTypeIDs>?</StateTypeIDs> <!--0回以上繰り返し:--> <Priorities>?</Priorities> <!--0回以上繰り返し:--> <PriorityIDs>?</PriorityIDs> <!--0回以上繰り返し:--> <Services>?</Services> <!--0回以上繰り返し:--> <ServiceIDs>?</ServiceIDs> <!--0回以上繰り返し:--> <SLAs>?</SLAs> <!--0回以上繰り返し:--> <SLAIDs>?</SLAIDs> <!--0回以上繰り返し:--> <Locks>?</Locks> <!--0回以上繰り返し:--> <LockIDs>?</LockIDs> <!--0回以上繰り返し:--> <OwnerIDs>?</OwnerIDs> <!--0回以上繰り返し:--> <ResponsibleIDs>?</ResponsibleIDs> <!--0回以上繰り返し:--> <WatchUserIDs>?</WatchUserIDs> <!--0回以上繰り返し:--> <CustomerID>?</CustomerID> <!--0回以上繰り返し:--> <CustomerUserLogin>?</CustomerUserLogin> <!--0回以上繰り返し:--> <CreatedUserIDs>?</CreatedUserIDs> <!--0回以上繰り返し:--> <CreatedTypes>?</CreatedTypes> <!--0回以上繰り返し:--> <CreatedTypeIDs>?</CreatedTypeIDs> <!--0回以上繰り返し:--> <CreatedPriorities>?</CreatedPriorities> <!--0回以上繰り返し:--> <CreatedPriorityIDs>?</CreatedPriorityIDs> <!--0回以上繰り返し:--> <CreatedStates>?</CreatedStates> <!--0回以上繰り返し:--> <CreatedStateIDs>?</CreatedStateIDs> <!--0回以上繰り返し:--> <CreatedQueues>?</CreatedQueues> <!--0回以上繰り返し:--> <CreatedQueueIDs>?</CreatedQueueIDs> <!--0回以上繰り返し:--> <DynamicFields> <!--このレベルでは次の6つの必須選択項目があります。--> <!--Optional:--> <Equals>?</Equals> <!--Optional:--> <Like>?</Like> <!--Optional:--> <GreaterThan>?</GreaterThan> <!--Optional:--> <GreaterThanEquals>?</GreaterThanEquals> <!--Optional:--> <SmallerThan>?</SmallerThan> <!--Optional:--> <SmallerThanEquals>?</SmallerThanEquals> </DynamicFields> <!--Optional:--> <Ticketflag> <!--Optional:--> <Seen>?</Seen> </Ticketflag> <!--Optional:--> <From>?</From> <!--Optional:--> <To>?</To> <!--Optional:--> <Cc>?</Cc> <!--Optional:--> <Subject>?</Subject> <!--Optional:--> <Body>?</Body> <!--Optional:--> <FullTextIndex>?</FullTextIndex> <!--Optional:--> <ContentSearch>?</ContentSearch> <!--Optional:--> <ConditionInline>?</ConditionInline> <!--Optional:--> <ArticleCreateTimeOlderMinutes>?</ArticleCreateTimeOlderMinutes> <!--Optional:--> <ArticleCreateTimeNewerMinutes>?</ArticleCreateTimeNewerMinutes> <!--Optional:--> <ArticleCreateTimeNewerDate>?</ArticleCreateTimeNewerDate> <!--Optional:--> <ArticleCreateTimeOlderDate>?</ArticleCreateTimeOlderDate> <!--Optional:--> <TicketCreateTimeOlderMinutes>?</TicketCreateTimeOlderMinutes> <!--Optional:--> <ATicketCreateTimeNewerMinutes>?</ATicketCreateTimeNewerMinutes> <!--Optional:--> <TicketCreateTimeNewerDate>?</TicketCreateTimeNewerDate> <!--Optional:--> <TicketCreateTimeOlderDate>?</TicketCreateTimeOlderDate> <!--Optional:--> <TicketChangeTimeOlderMinutes>?</TicketChangeTimeOlderMinutes> <!--Optional:--> <TicketChangeTimeNewerMinutes>?</TicketChangeTimeNewerMinutes> <!--Optional:--> <TicketChangeTimeNewerDate>?</TicketChangeTimeNewerDate> <!--Optional:--> <TicketChangeTimeOlderDate>?</TicketChangeTimeOlderDate> <!--Optional:--> <TicketCloseTimeOlderMinutes>?</TicketCloseTimeOlderMinutes> <!--Optional:--> <TicketCloseTimeNewerMinutes>?</TicketCloseTimeNewerMinutes> <!--Optional:--> <TicketCloseTimeNewerDate>?</TicketCloseTimeNewerDate> <!--Optional:--> <TicketCloseTimeOlderDate>?</TicketCloseTimeOlderDate> <!--Optional:--> <TicketPendingTimeOlderMinutes>?</TicketPendingTimeOlderMinutes> <!--Optional:--> <TicketPendingTimeNewerMinutes>?</TicketPendingTimeNewerMinutes> <!--Optional:--> <TicketPendingTimeNewerDate>?</TicketPendingTimeNewerDate> <!--Optional:--> <TicketPendingTimeOlderDate>?</TicketPendingTimeOlderDate> <!--Optional:--> <TicketEscalationTimeOlderMinutes>?</TicketEscalationTimeOlderMinutes> <!--Optional:--> <TTicketEscalationTimeNewerMinutes>?</TTicketEscalationTimeNewerMinutes> <!--Optional:--> <TicketEscalationTimeNewerDate>?</TicketEscalationTimeNewerDate> <!--Optional:--> <TicketEscalationTimeOlderDate>?</TicketEscalationTimeOlderDate> <!--Optional:--> <ArchiveFlags>?</ArchiveFlags> <!--0回以上繰り返し:--> <OrderBy>?</OrderBy> <!--0回以上繰り返し:--> <SortBy>?</SortBy> <!--0回以上繰り返し:--> <CustomerUserID>?</CustomerUserID> </TicketSearch>

source: Examples:
ja: サンプル:
ru: Примеры:
sw: Mifano:

source: Web Service Configuration
ja: ウェブサービス構成
ru: Конфигурация Веб-сервиса
sw: Usanidi wa Huduma za Tovuti

source: The following is a basic but complete web service configuration file in YAML format to use all the Ticket Connector operations. In order to use it in OTRS you need to copy the content, save it into a file called GenericTicketConnector.yml, and import it into OTRS in the Web Services screen in the Admin panel by clicking in the "Add web service" action from the overview screen and then clicking in the "Import web service" action in the add screen.
ja: 下記は基礎的ですが、すべてのチケット・コネクタ・オペレーションを使用するためのYAMLフォーマットによる完全なウェブサービス構成ファイルです。OTRSの中でそれを使用するために内容をコピーする必要があります。それをファイルへ保存して GenericTicketConnector.ymlと呼ばれるファイルを保存します。またそれを、概要画面から「ウェブサービスの追加」アクションをクリックすることによって管理者パネルのウェブサービス画面でOTRSへインポートします。そして追加画面で「ウェブサービスのインポート」アクションをクリックします。

source: Perl SOAP Requester
ja: パールSOAP依頼者
ru: Запрашивающая сторона Perl SOAP
sw: Muombaji wa Perl SOAP

source: The following code is a Perl script that can connect to OTRS via the generic interface. In order to perform the operations provided by the Ticket Connector, it uses two Perl CPAN modules SOAP::Lite and Data::Dumper. Please make sure that your environment is capable to use these modules before you try to run the scipt.
ja: 次のコードは、一般インターフェース経由でOTRSに接続することができるパール・スクリプトです。チケット・コネクタによって提供されるオペレーションを行なうために、二つのパールCPANモジュール、SOAP::Lite および Data::Dumper を使用します。sciptを実行しようとする前にこれらのモジュールを使用するのにあなたの環境が利用可能であることを確かめてください。

source: From its design the web services were conceived to be portable from one OTRS system to another, e.g. from a test or development environment to a production system. Therefore it was needed to have an easy way to extract the web service configuration from the database, and import it to another. To accomplish this task the Generic Interface uses YAML files as the web services configuration basis.
ja: その設計から、ウェブサービスは 単一のOTRSシステムから別のシステム（例えば、テストか開発環境からプロダクション・システムまで）まで ポータブルになるように着想されました。したがって、それはデータベースからウェブサービス構成を抽出し、かつそれを別のものにインポートする、容易な方法を持つために必要でした。このタスクを遂行するために、一般インターフェースはウェブサービス構成基礎としてYAMLファイルを使用します。
sw: Kutoka kwenye usanifu wake huduma za tovuti zilionekana kuweza kutumika kutoa mfumo mmoja wa OTRS kwenda mwingine, mf. kutoka kwenye mazingira ya majaribio au usanifu kwenda kwenye mazingira ya uzalishaji. Kwa hiyo ilihitajika kuwa na njia rahisi ya kupata usanidi wa huduma za tovuti kutoka kwenye hifadhidata, na kuhamishia kwenye nyingine. Kufanikisha kazi hii Kiolesura cha Ujumla kinatumia mafaili ya YAML kama msingi wa usanidi wa huduma za tovuti.

source: Why YAML? YAML is a markup language designed to be human friendly to read and write (it is easier to understand than JSON), it does not have some of the limitations of XML like numeric tags, it is open, standardized, and is complete enough to store the whole web service configuration.
ja: なぜYAMLなのでしょう? YAMLは人間が読み書きするのに優しいことを目指したマークアップ言語です(JSONより理解するほうが簡単です)。YAMLは数的タグのようなXMLが持ついくつかの制限を持ちません。それはオープンで標準化されており、全ウェブサービス構成を格納するほどに十分に完全です。
sw: Kwanini YAML? YAML ni lugha ya dhulisho mabadiliko iliyoundwa kuwa rafiki kwa binadamu kuandika na kusoma (ni rahisi kuelewa zaidi ya JSON) , haina baadhi ya vikwazo vya XML kama lebo za tarakimu, ni wazi, ya kawaida, na ni kamili zaidi kuhifadhi usanidi mzima wa huduma ya tovuti.

source: To learn more about YAML please visit <ulink url="http://www.yaml.org/">http://www.yaml.org/</ulink>.
ja: YAMLについてより知りたければ <ulink url="http://www.yaml.org/">http://www.yaml.org/</ulink> をご覧ください。
ru: Чтобы узнать больше о YAML пожалуйста посетите ссылку <ulink url="http://www.yaml.org/">http://www.yaml.org/</ulink>.
sw: Kujifunza zaidi kuhusu YAML tafadhali tembelea <ulink url="http://www.yaml.org/">http://www.yaml.org/</ulink>.

source: The following is a web service configuration file example in YAML format:
ja: 下記はYAMLフォーマットによるウェブサービス設定ファイル例です:
ru: Ниже приводится конфигурация веб-сервера на основе файла конфигурации в форматеYAML:
sw: ufuatao ni mfano wa usanidi wa huduma ya tovuti katika muundo wa YAML:

source: Configuration Details
ja: 構成詳細
ru: Описание Конфигурации
sw: Undani wa Usanidi

source: Description: a short text that describes the web service.
ja: Description(摘要):ウェブサービスを記述する短いテキスト。
ru: Описание: краткий текст, описывающий веб-сервис.
sw: Maelezo: nakala fupi inayoelezea huduma ya tovuti.

source: RemoteSystem: a short description of the Remote System.
ja: RemoteSystem（リモート・システム）:リモート・システムの短い摘要。
ru: RemoteSystem: краткое описание Удаленной Системы.
sw: MfumoMbali: maelezo mafupi ya Mfumo wa Mbali.

source: Debugger: a container for the debugger settings.
ja: Debugger(デバッガ）:デバッガ・セッティング用のコンテナ。
ru: Debugger: хранилище для хранения настроек отладчика.
sw: Anaye eua: chombo cha mipangilio ya anaye eua.

source: Provider: a container for the provider settings.
ja: Provider(供給者):供給者セッティング用のコンテナ。
ru: Provider: хранилище для хранения настроек поставщика.
sw: Mtoaji: chombo cha mipangilio ya mtoaji.

source: Requester: a container for the requester settings.
ja: Requester(依頼者):依頼者セッティング用のコンテナ。
ru: Requester: хранилище для хранения настроек о запрашивающей стороне.
sw: Muombaji: chombo cha mipangilio ya muombaji.

source: Debugger
ja: デバッガ
ru: Отладчик
sw: Anaye eua

source: DebugThreshold: the debugger level
ja: デバッグ閾値：デバッガ・レベル
ru: DebugThreshold: уровень отладчика
sw: EuaKizingiti: Ngazi ya anaye eua

source: debug: all logs are stored in the database.
ja: debug(デバッグ): 全てのログはすべてデータベースに格納されます。
ru: debug: все журналы хранятся в базе данных.
sw: eua: batli zote zinahifadhiwa kwenye hifadhidata.

source: info: info, notice and error level logs are stored in the database.
ja: info(情報): 情報、通知およびエラーレベルログはデータベースに格納されます。
ru: info: информация, уведомления и журнал ошибкок хранятся в базе данных.
sw: Taarifa: batli za tabaka la taarifa, notisi na kasoro ndio zinahifadhiwa katika hifadhidata.

source: notice: notice and error level logs are stored in the database.
ja: notice(通知): 通知、エラーレベルログデータベースに格納されます。
ru: notice: ошибки уровня уведомление (notice) и ошибка (error) хранятся в базе данных.
sw: notisi: batli za tabaka la notisi na makosa ndio zinahifadhiwa kwenye hifadhidata.

source: error: only error level logs are stored in the database.
ja: error(エラー): エラーレベルログだけがデータベースに格納されます。
ru: error: только ошибки уровня error хранятся в базе данных.
sw: kosa: batli za tabaka la makosa tu ndio zinahifadhiwa kwenye hifadhidata.

source: Provider
ja: 供給者
ru: Поставщик
sw: Mtoaji

source: Operation: a container for each operation settings.
ja: Operation(オペレーション): 各オペレーション設定用コンテナ。
ru: Operation: хранилище для настроек каждой операции.
sw: Operesheni: chombo kwa kila mipangilio ya operesheni.

source: Transport: a container for provider network transport settings.
ja: Transport（トランスポート）: ネットワーク・トランスポート用コンテナ。
ru: Transport: хранилище для настроек поставщика транспортой сети.
sw: Usafirishaji: chombo cha mipangilio ya mtoaji usafiri wa mtandao.

source: &lt;OperationName&gt;: Unique name for the operation, container for its own operation settings (cardinality 0..n, but not duplicate).
ja: &lt;OperationName&gt;: オペレーション用のユニークな名前、それ自身のオペレーション設定用コンテナ(基数0..n, しかし重複しない).
ru: &lt;OperationName&gt;: Уникальное название операции, хранилище для своих собственных настроек (от 0..n, но без повторений).
sw: &lt;OperesheniJina&gt;: Jina la kipekee kwa operesheni, chombo cha mipangilio yake ya operesheni (nambari ya elementi 0..n, haitakiwi kujirudia).

source: This section is based on operations from type "Test::Test" other operations might contain more or different settings.
ja: このセクションは、他のオペレーションがもっと含んでいるかもしれないタイ「Test::Test」、あるいは異なるセッティング、からのオペレーションに基づきます。
ru: Этот раздел основан на операция с типом "Test::Test" другие операции могут содержать больше или другие настройки.
sw: Hiki kifungu kinajikita katika operesheni kutoka aina "Test::Test" operesheni nyingine zinaweza kuwa na zaidi au mipangilio mingine.

source: Description: a short text that describes the operation.
ja: Description（摘要）:オペレーションを記述する短いテキスト。
ru: Описание: краткий текст, описывающий операцию.
sw: Maelezo: nakala fupi inayoelezea operesheni.

source: MappingInbound: a container for the mapping settings for the incoming request data.
ja: MappingInbound（マッピング・インバウンド）: 入信依頼データ用マッピング設定用コンテナ。
ru: MappingInbound: хранилище для настроек отображаемых данных для данных из входящего запроса.
sw: KuunganishaZinazoingia: chombo cha kuunganisha mipangilio ya data za maombi yanayoingia.

source: MappingOutbound: a container for the mapping settings for the outgoing response data.
ja: MappingOutbound（マッピング・アウトバウンド）: 発信応答データ用マッピング用設定コンテナ。
ru: MappingOutbound: хранилище для отображающихся настроек для исходящих данных.
sw: KuunganishaZinazotoka: chombo cha kuunganisha mipangilio ya data za majibu yanayotoka.

source: Type: the operation backend, in Controller::Operation format.
ja: Type（タイプ）: Controller::Operation formatでのオペレーション・バックエンド。
ru: Тип бэкэнд операция в формате Controller::Operation.
sw: Aina: mazingira ya nyuma ya operesheni, katika Mdhibiti::Umbizo la operesheni.

source: MappingInbound
ja: MappingInbound（マッピング・インバウンド）
sw: KuunganishaZinazoingia

source: This section is based on mappings from type "Simple". Other mappings might contain more or different settings.
ja: このセクションは、タイプ「Simple」からのマッピングに基づきます。他のマッピングはより多くの異なる設定を含みます。
ru: Этот раздел основан на отображаемых значениях с типом "Simple". Другие отображаемые значения могут содержать больше или другие настройки.
sw: Kifungu hiki kinajikita katika miunganiko ya aina "Rahisi". Miunganiko mingine inaweza kuwa na mipangilio zaidi au tofauti.

source: Config: a container for this mapping settings.
ja: Config(構成): このマッピング設定用コンテナ。
ru: Config: хранилище настроек для этих отображаемых значений.
sw: Usanidi: chombo cha kuunganisha mipangilio hii.

source: Type: the mapping backend.
ja: Type（タイプ）: マッピング・バックエンド。
ru: Тип: mapping backend.
sw: Aina: kuunganisha mazingira ya nyuma.

source: KeyMapDefault: a container for all non mapped keys settings.
ja: KeyMapDefault: マップ未設定キーのコンテナ
ru: KeyMapDefault: хранилище для всех не отображаемых значений ключей.
sw: UfunguoUnganishaChaguo-msingi: chombo cha mipangilio yote ya funguo isiyounganishwa.

source: ValueMapDefault: a container for all non mapped values settings.
ja: ValueMapDefault: 全てのマップ未設定の値の設定のコンテナ。
ru: ValueMapDefault: хранилище для всех не отображаемых значений настроек.
sw: ThamaniUnganishaChaguo-msingi: chombo cha mipangilio ya thamani zote zisizounganishwa.

source: KeyMapExact: a container for all exact key mappings (cardinality 0 .. 1).
ja: KeyMapExact: 全ての正確なキーマッピング (基数 0 .. 1)。
ru: KeyMapExact: хранилище для всех ключей точных отображаемых значений(от 0 .. 1).
sw: FunguoUnganishaHalisi: chombo cha miunganiko yote halisi ya funguo (nambari ya elementi 0 .. 1)

source: KeyMapRegEx: a container for all regular expression key mappings (cardinality 0 .. 1).
ja: KeyMapRegEx: 全ての正規表現キーマッピング用コンテナ (基数 0 .. 1)。
ru: KeyMapRegEx: хранилище для отображаемых значений всех регулярных выражений.
sw: UfunguoUnganishaRegEx: chombo cha miunganiko yote ya semi za kawaida za ufunguo (nambari ya elementi 0 .. 1).

source: ValueMap: a container for all value mappings (cardinality 0 .. 1).
ja: ValueMap: 全ての値マッピング用コンテナ (基数 0 .. 1)。
ru: ValueMap: хранилище для всех значений отображений (mapping-a).
sw: ThamaniUnganisha: chombo cha miunganiko yote ya thamani (nambari ya elementi 0 .. 1).

source: KeyMapDefault
ja: KeyMapDefault（マップ未設定キーのコンテナ）
sw: UfunguoUnganishaChaguo-msingi

source: MapTo: the new value to be used (only applicable if MapType is set to MapTo).
ja: MapTo: 使用される新しい値 (MapTypeがMapToにセットされた場合のみ適用可能)。
ru: MapTo: новое значение, которое будет использоваться (применима только если параметр MapType установлен в значение MapTo).
sw: UnganishaKwa: thamani mpya ya kutumika (inatumika pale tu UnganishaAina imesetiwa kuwa UnganishaKwa).
