Repository: DSigmund/doc-admin
Catalog: i18n/doc-admin.*.po
Languages: ja, ru, sw

source: <emphasis>Script: Getting help about the restore mechanism.</emphasis>
ja: <emphasis>スクリプト:リストア・メカニズムに関するヘルプ</emphasis>
ru: <emphasis>Сценарий: Получение справки о механизме восстановления.</emphasis>
sw: <emphasis>Hati: Kupata usaidizi wa utaratibu wa urejeshaji.</emphasis>

source: Data that is stored, for example, in the directory <filename>/backup/2010-09-07_14-28/</filename>, can be restored with the command specified in the script below, assuming the OTRS installation is at <filename>/opt/otrs</filename>.
ja: 例えば保存されるデータ（例えば、ディレクトリー<filename>/backup/2010-09-07_14-28/</filename>の中にある）は、以下のスクリプトで指定されたコマンドでリストアすることができます。（OTRSは<filename>/opt/otrs</filename>にインストールされていると仮定します。）
ru: Данные, которые хранятся в директориии <filename>/backup/2010-09-07_14-28/</filename>, могут быть восстановлены с помощью команды, приведенной в приведенном ниже Сценарии при условии что OTRS установлен в <filename>/opt/otrs</filename>.
sw: Data ambazo zimehifadhiwa, kwa mfano, kwenye mpangilio orodha <filename>/chelezo/2010-09-07_14-28/</filename>, inaweza kurejeshwa na amri zilizo kwenye hati hapa chini, kwa kuamini usanikishaji wa OTRS upo kwenye <filename>/opt/otrs</filename>.

source: <emphasis>Script: Restoring OTRS data.</emphasis>
ja: <emphasis>スクリプト: OTRSデータのリストア</emphasis>
ru: <emphasis>Сценарий: Восстановление данных OTRS.</emphasis>
sw: <emphasis>Hati: Kurejesha data za OTRS .</emphasis>

source: Web Service Graphical Interface
ja: ウェブサービス・グラフィカル・インターフェース
ru: Графический интерфейс веб-сервиса
sw: Kiolesura Michoro cha Huduma za Tovuti

source: The web service graphical user interface (GUI) is a tool that allows to construct complex web service configurations in a user friendly and convenient interface. It allows to:
ja: ウェブサービスGUI(GUI)は、ユーザー・フレンドリーで便利なインターフェースで複雑なウェブサービス構成を構築することを可能にするツールです。それは次のものに許可します:
ru: Графический пользовательский интерфейс (GUI) является тем инструментом, который позволяет создавать сложные настройки веб-сервиса в дружественной и приятной среде интерфейса. Он позволяет:
sw: Kiolesura michoro cha huduma za tovuti ni kifaa kinachoruhusu kutengeneza usanidi wa huduma za tovuti changamano katika kiolesura ambacho ni rahisi kutumika. Inaruhusu ku:

source: Create and Delete web services.
ja: ウェブサービスを作成および削除します。
ru: Создание и Удалинеи веб-сервисов
sw: Tengeneza na Kufuta huduma za tovuti.

source: Import and Export configurations (in YAML file format) for existing web services.
ja: 既存のウェブサービスのためのエクスポート/インポート構成(YAMLファイルフォーマット中の)。
ru: Импортировать и Экспортировать настройки (в формате YAML) для существующих веб-сервисов.
sw: Kuagiza na Kuhamisha usanidi (katika umbizo la YAML) kwa huduna za tovuti zilizopo.

source: View, Revert and Export old configurations for existing web services in the Web Service History screen.
ja: ビュー、ウェブサービスで既存のウェブサービス用の復旧と旧構成のエクスポート
ru: Просматривать, Возвращаться и Экспортировать устаревшие конфигурационные параметры для существующих веб-сервисов на странице истории конфигурации.
sw: Ona, rudisha na Hamisha usanidi wa zamani wa huduma za tovuti zilizopo katika skrini ya Historia ya Huduma za Tovuti.

source: Track all communication logs for each web service in the Debugger screen.
ja: デバッガ画面中の各ウェブサービスのすべてのコミュニケーション・ログを追跡してください。
ru: Отслеживать все сообщения журнала для каждого из веб-сервисов на странице Отладчика.
sw: Fuatilia batli zote za mawasiliano kwa kila huduma ya tovuti kwenye skrini ya kueua.

source: Web Service Overview
ja: ウェブサービス概要
ru: Обзор Веб-интерфейса
sw: Mapitio ya Huduma za Tovuti

source: The "Web Services" link in the main screen of Admin Interface (in the System Administration box) leads to the web services overview screen, where you are able to manage your web service configurations. You can add new web services or change the configuration of the existing ones from this screen.
ja: 管理者インターフェース(システム管理ボックス中の)のメイン画面中の「ウェブサービス」リンクは、ウェブサービス概要画面に向かいます。そこでは、ウェブサービス構成を管理することができます。新規ウェブサービスを加えるか、あるいはこの画面からの既存の構成を変更することができます。
ru: Ссылка "Веб-Сервисы/Web Services" на главном экране интерфейса администратора (Панели Администратора) осуществляет переход к экрану обзора веб-сервисов, с помощью которого, вы можете управлять их настройками. Вы можете добавлять новые или изменять настройки существующих на этом экране.
sw: Kiungo cha "Huduma za Tovuti" kwenye skrini kuu ya kiolesura cha Msimaizi (kwenye boksi la Usimamizi wa Mfumo) Inatuongoza kwenye skrini ya mapitio ya huduma za tovuti, ambapo unaweza kusimamia usanidi wa huduma zako za tovuti. Unaweza kuongeza huduma mpya au kubadilisha usanidi kwa zilizopo kutoka kwenye skrini hii.

source: Every web service configuration screen has in the upper part of the screen a "bread crumbs" style navigation path. This navigation path is useful to know exactly in which part of the web service configuration we are, and also enables the user to jump back to any part of the configuration process at any time (this action will not save any changes).
ja: ウェブサービス構成画面は、その上部に案内のために「パンくずリスト」を持っています。この案内はウェブサービス構成のどの部分に自分がいるのかを正確に知るために便利です。 また、その案内は、さらにユーザが構成プロセスの任意の部分にいつでも(このアクションは変更を保存しないでしょう)ジャンプすることを可能にします。
sw: Kila skrini ya usanidi wa huduma za tovuti katika upande wa juu ina staili ya uabiri njia ya "makombo ya mikate". Huu uabiri unasaidia kujua kwa usahihi tupo upande gani wa usanidi wa huduma za tovuti, na pia inasaidia mtumiaji kurukia upande wowote wa mchakato wa usanidi muda wowote (kitendo hiki hakitahifadhi mabadiliko yoyote).

source: To create a new web service, press the button "Add web service", and provide the required information.
ja: 新規ウェブサービスを作るために、「ウェブサービスの追加」ボタンを押し、必須情報を提供します。
ru: Чтобы создать новый веб-сервис, нажмите кнопку "Добавить веб-сервис", введите все необходимы данные.
sw: Kutengeneza huduma mpya ya tovuti bofya kitufe "Ongeza huduma ya tovuti", na utoe taarifa zinazotakiwa.

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="Adminarea web service - screenshot" scale="40" fileref="screenshots/genericinterface-webservice-overview.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="管理者エリア ウェブサービス - スクリーンショット" scale="40" fileref="screenshots/genericinterface-webservice-overview.png"></graphic>

source: <emphasis>Figure: Web services overview.</emphasis>
ja: <emphasis>図:ウェブサービス概要</emphasis>
ru: <emphasis>Рисунок: Обзор Веб-сервисов</emphasis>
sw: <emphasis>Kielelezo: Mapitio ya huduma za tovuti.</emphasis>

source: Web Service Add
ja: ウェブサービスの追加
ru: Добавить Веб Сервис
sw: Ongeza Huduma ya Tovuti

source: The only required field in this part is the web service "Name" that needs to be unique in the system and can not be left empty. Other fields are also necessary for the configuration like the "Debug Threshold" and "Validity" but these fields are already populated with the default value for each list.
ja: この部分中の必要な唯一のフィールドは、システムにおいて独特である必要があり、空にしておくことができないウェブサービス「名」です。さらに、他のフィールドは「デバッグのしきい値」および「有効性」のように構成に必要であるが、これらのフィールドはすでに各リスト用にデフォルト値でたくさんあります。
ru: Единственное поле в этой части - это "Имя" веб-сервиса, которое должно быть уникальным в системе и не может быть пустым. Остальные поля также необходимы для настройки, такие как "Уровень отладки/Debug Threshold" и "Действительность", но эти поля уже заполнены значениями по умолчанию, для каждого списка.
sw: Sehemu inayohitajika katika upande huu ni "Jina" la huduma ya tovuti ambalo linatakiwa kuwa la kipekee kwenye mfumo na halitakiwi kuachwa wazi. Sehemu nyingine ambazo pia ni muhimu kwa usanidi kama "Kizingiti cha kueua" na "uhalali" lakini hizi sehemu tayari zina chaguo-msingi kwa kila orodha.

source: The default value for "Debug Threshold" is "debug". When configured in this manner all communication logs are registered in the database. Each subsequent Debug Threshold value is more restrictive and discards communication logs of lower order than the one set in the system.
ja: 「デバッグのしきい値」のためのデフォルト値は「デバッグ」します。このように構成された時、全てのコミュニケーションログがデータベースで登録されます。続いて起こるデバック閾値はより制限的で システム内の１セットより低く古いコミュニケーションログを破棄します。
ru: Значением по умолчанию для поля "Уровень отладки/Debug Threshold" является "debug". Каждое последующее значение "Уровень отладки/Debug Threshold" является более строгим и отбрасывает журналы связи более низкого порядка, чем то, что установлено в системе ранее.
sw: Thamani chaguo-msingi la "Eua Kizingiti" ni "Eua". Zikiwa zimesanidiwa kwa mpangilio huu batli zote za mawasiliano zinasajiliwa kwenye hifadhidata. Kila Kizingiti cha kueua kinachofwata kina udhibiti zaidi na kinapuuza batli za mawasiliano ya oda ya chini zaidi ya iliyosetiwa kwenye mfumo.

source: Debug Threshold levels (from lower to upper)
ja: デバッグ閾値レベル（下から上へ）
ru: Отладка уровней (от нижних к верхним)
sw: Kizingiti cha viwango vya kueua (kutoka chini kwenda juu)

source: Notice
ja: 通知
ru: Уведомление
sw: Notisi

source: It is also possible to define the network transport protocol for "OTRS as Provider" and "OTRS as requester".
ja: さらに、「供給者としてのOTRS」および「依頼者としてのOTRS」のためのネットワーク・トランスポート・プロトコルを定義することは可能です。
ru: Также есть возможность определить протокол транспортной сети для "OTRS как Поставщика" и "OTRS как Запрашиваемую Сторону".
sw: Pia inawezekana kufafanua itifaki ya usafirishaji wa mtandao kwa "OTRS kama mtoaji" na "OTRS kama mwombaji".

source: Click on the "Save" button to register the new web service in the database or click "Cancel" to discard this operation. You will now be returned to the web service overview screen.
ja: データベースの中で新規ウェブサービスを登録するために「保存」ボタンをクリックするか、またはこのオペレーションを廃棄するために「キャンセル」をクリックして下さい。ウェブサービス概要画面に戻ります。
ru: Нажмите кнопку "Сохнанить", чтобы зарегистрировать новый веб-сервис в базе данных или кнопку "Отменить" чтобы отменить эту операцию.
sw: Bofya kwenye kitufe "Hifadhi" kusajili huduma mpya ya tovuti kwenye hifadhidata au bofya "Katisha" kuchana na operesheni hiyo. Sasa utarudishwa kwenye skrini ya mapitio ya huduma za tovuti.

source: If you already have a web service configuration file in YAML format you can click on the "Import web service" button on the left side of the screen. For more information on importing web services please check the next section "Web Service Change".
ja: YAMLフォーマットの中に既にウェブサービス構成ファイルを持っていれば、画面の左側の「インポート・ウェブサービス」ボタンをクリックすることができます。ウェブサービスのインポートについてより詳細には、次のセクション「ウェブサービス変更」をチェックしてください。
ru: Если у вас уже имеется файл конфигурации веб-сервисов в формате YAML, вы можете импортировать его, нажав на кнопку "Импортировать веб-сервис" слева на экране. Для дальнейшей информации об импорте веб-сервисов обратитесь к следующей секции "Изменение Веб-сервисов/Web Service Change".
sw: Kama tayari una faili la usanidi wa huduma za tovuti katika umbizo la YAML unaweza ku bofya kwenye kitufe "Agiza huduma ya tovuti" upande wa kushoto wa skrini. Kwa maelezo zaidi ya uagizaji wa huduma za tovuti tafadhali angalia kifungu kinachofuata "Badiisha Huduma za Tovuti".

source: To change or add more details to a web service, click on the web service name in the web service overview screen.
ja: ウェブサービスに、より多くの詳細を変更・追加するためには、ウェブサービス概要画面中のウェブサービス名をクリックしてください。
ru: Нажмите на имя веб-сервиса на странице просмотра чтобы изменить или добавить больше элементов веб-сервису.
sw: Kubadilisha au kuongeza maelezo ya huduma ya tovuti, bofya kwenye jina la huduma ya tovuti kwenye skrini ya mapitio ya huduma za tovuti.

source: Web service add
ja: ウェブサービスの追加
ru: Добавить Веб-сервис
sw: Ongeza huduma ya tovuti

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="Adminarea web service add - screenshot" scale="40" fileref="screenshots/genericinterface-webservice-add.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="管理エリア ウェブサービス追加 - スクリーンショット" scale="40" fileref="screenshots/genericinterface-webservice-add.png"></graphic>

source: <emphasis>Figure: Web services add.</emphasis>
ja: <emphasis>図:ウェブサービスの追加</emphasis>
ru: <emphasis>Рисунок: Добавление нового веб-сервиса</emphasis>
sw: <emphasis>Kielelezo: Ongeza huduma za tovuti.</emphasis>

source: Web Service Change
ja: ウェブサービス変更
ru: Изменения веб-сервиса:
sw: Badilisha Huduma ya Tovuti

source: On this screen you have a complete set of functions to handle every part of a web service. On the left side in the action column you can find some buttons that allows you to perform all possible actions on a web service:
ja: この画面においては、ウェブサービスのすべての部分を扱う機能の完全セットを持っています。アクション・カラムの左側に いくつかのボタンがあります。それによりウェブサービス上で全ての可能なアクションを実行できます。
ru: На этом экране имеется полный набор по управлению каждой частью веб-сервиса. Слева, в колонке "Действия" вы найдете несколько кнопок, позволяющих выполнить все доступные действия над веб-сервисом:
sw: Katika skrini hii una seti kamili ya fomula saidizi kushughulikia kila kipande cha huduma ya wavuti. Upande wa kushoto katika safuwima ya kitendo unaweza kupata vitufe ambavyo vitakuruhusu kufanya vitendo vyote vinavyowezekana kwenye huduma ya wavuti:

source: Clone web service.
ja: Clone web service.(クローン・ウェブサービス)
ru: Клонирование веб-сервиса.
sw: Nakili huduma ya tovuti.

source: Export web service.
ja: Export web service.(エクスポート・ウェブサービス)
ru: Экспортировать веб-сервис.
sw: Hamisha huduma ya tovuti

source: Import web service.
ja: Import web service.(インポート・ウェブサービス)
ru: Импортировать веб-сервис.
sw: Agiza huduma ya tovuti

source: Configuration History.
ja: Configuration History.(構成履歴)
ru: История конфигурации.
sw: Historia ya usanidi

source: Delete web service.
ja: Delete web service.(ウェブサービスの削除)
ru: Удалить веб-сервис.
sw: Futa huduma ya tovuti

source: Debugger.
ja: Debugger.(デバッガ)
ru: Отладчик.
sw: Anaye eua.

source: "Configuration history" and "Debugger" will lead you to different screens.
ja: 「構成履歴」および「デバッガ」はあなたを異なる画面ヘ導きます。
ru: Переход к "История конфигурации" и "Отладчик" приведет к открытию различных страниц.
sw: "Historia ya usanidi" na "Anaye eua" itapelekea kwenye skrini tofauti.

source: Web Service Clone
ja: ウェブサービスのクローン
ru: Клонирование веб-сервиса:
sw: Nakala ya Huduma ya Tovuti

source: To clone a web service, you need to click on the "Clone web service" button. A dialog will be shown where you can use the default name or set a new name for the (cloned) web service.
ja: ウェブサービスのクローンを作るために、「クローンのウェブサービス」ボタンをクリックする必要があります。ダイアログは、あなたが使用できるデフォルト名またはウェブサービス用の新規名を表示します。
ru: Для клонирования веб-сервиса необходимо нажать кнопку "Клонировать веб-сервис", появится диалоговое окно, в котором можно использовать имя по умолчанию или же установить новое имя для (клонируемого) веб-сервиса.
sw: Kutengeneza nakala ya huduma ya tovuti, unahitaji ku bofya kitufe cha "Nakili huduma ya tovuti". Maongezi yatatokea ambapo unawea kutumia jina la lililopo au kuseti jina jipya kwa (nakala) ya huduma ya tovuti.

source: <emphasis>Remember </emphasis> that the name of the web service must be unique within the system.
ja: ウェブサービスの名前が間違いなくシステム内にユニークであることを<emphasis>忘れないで</emphasis>ください。
ru: <emphasis>Запомните </emphasis> название веб-сервиса должно быть уникальным для всей системы.
sw: <emphasis>Kumbuka</emphasis> kwamba jina la huduma ya mtandao lazima liwe la kipekee kwenye mfumo.

source: Click on "Clone" button to create the web service clone or "Cancel" to close the dialog.
ja: ウェブサービスのクローンを作成するために「クローン」ボタンをクリックして下さい。またはダイアログを閉じるために「キャンセル」をクリックして下さい。
ru: Нажмите кнопку "Клонировать" чтобы создать копию веб-сервиса или кнопку "Отменитьl", чтобы закрыть диалоговое окно.
sw: Bofya kitufe cha "Nakili" kutengeneza nakala ya huduma ya tovuti au "Katisha" kufunga maongezi.

source: Web service clone
ja: ウェブサービス・クローン
ru: Клонирование веб-сервиса
sw: Nakala ya huduma ya tovuti

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="Adminarea web service clone - screenshot" scale="40" fileref="screenshots/genericinterface-webservice-clone.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="管理エリア ウェブサービス クローン - スクリーンショット" scale="40" fileref="screenshots/genericinterface-webservice-clone.png"></graphic>

source: <emphasis>Figure: Web service clone.</emphasis>
ja: <emphasis>図:ウェブサービスのエクスポート</emphasis>
ru: <emphasis>Рисунок: Клонирование веб-сервиса.</emphasis>
sw: <emphasis>Kielelezo: Nakala ya huduma ya tovuti.</emphasis>

source: Web Service Export
ja: ウェブサービスのエクスポート
ru: Экспорт веб-сервиса
sw: Hamisha Huduma ya Tovuti

source: The "Export web service" button gives you the opportunity to dump the configuration of the current web service into a YAML file, to download it and to store it on your file system. This can be specially useful if you want to migrate the web service from one server to another, for example from a testing environment to a production system.
ja: 「エクスポート ウェブサービス」ボタンは、YAMLファイルの中への現在のウェブサービスの構成をダンプし、それをダウンロードし、ファイルシステム上にそれを格納する機会を与えます。ウェブサービスを統合したければこれは特に有用です。（ひとつのサーバからもうひとつのサーバへ。例えばテスト環境から生産システムへ）
ru: Кнопка "ЭКспорт веб-сервиса/Export web service" дает возможность выгрузить конфигурацию текущего веб-сервиса в файл формата YAML, для загрузки его и сохранения в файловой системе. Это может быть особенно полезно, если вы желаете перенести веб сервис с одного сервера на другой, к примеру, из тесторой среды в рабочую.
sw: Kitufe cha "Hamisha huduma za tovuti" kinakupa nafasi ya kuweka usanidi wa huduma ya tovuti ya sasa kwenye faili la YAML, kulipakua na kuhifadhi katika mfumo wako wa mafaili. Hii inakuwa na manufaa pale unapotaka kuhamisha huduma za tovuti kutoka seva moja kwenda nyingine, kwa mfano kutoka kwenye mazingira ya kupima kwenda mazingira ya uzalishaji.

source: All stored passwords in the web service configuration will be exported in plain text format.
ja: ウェブサービス構成中の格納されたパスワードはすべて、プレインテキスト・フォーマットでエクスポートされます。
ru: Все сохраненные пароли в настройках веб-сервиса будут экспортированы в виде обычного текста.
sw: Nywila zote zilizohifadhiwa katika usanidi wa huduma ya tovuti zitahamishwa katika umbizo la nakala wazi.

source: Right after clicking the "Export web service" button a save dialog of your browser will appear, just like when you click on a file download link on a web page.
ja: 「エクスポート・ウェブサービス」をクリックする直後、ちょうどウェブページ上のファイルダウンロードリンクでクリックする時のようにブラウザの保存ダイアログが現れます。
ru: Сразу же после нажатия кнопки "Экспорт веб-сервиса" появится диалоговое окно сохранения, на подобе того, которое появляется когда вы нажимаете в браузере ссылку сохранить.
sw: Baada tu ya kubofya kitufe cha "Hamisha huduma ya tovuti" maongezi ya kuhifadhi ya kivinjari yatatokea, kama vile ukibofya kiungo cha kupakua kwenye kurasa za tovuti.

source: Each browser on each operating system has its own save dialog screen and style. Depending on the browser and its configuration it is possible that no dialog is shown and the file is saved to a default directory on your file system. Please check your browser documentation for more specific instructions if needed.
ja: 各オペレーティング・システム上のブラウザにはそれぞれそれ自身の保存ダイアログ画面およびスタイルがあります。ブラウザとその構成によってはダイアログが示されないことはありえます。また、ファイルはデフォルト・ディレクトリにあなたのファイルシステム上に保存されます。必要な場合はより特殊な指示があるかブラウザ・ドキュメンテーションをチェックしてください。
ru: Каждый браузер в каждой операционной системе имеет свои собственные экраны диалога при сохранении и их вид. В зависимости от браузера и его настроек, возможен вариант, когда дилог при сохранении не отображается и файл сохраняется в каталоге по умолчанию для вашей файловой системы. Обратитесь к к докментации на браузер для уточнения этих моментов.
sw: Kila kivinjari katika kila mfumo endeshi kina skrini yake ya kuhifadhi maongezi na aina. Kutegemeana na kivinjari na usanidi inawezekana kwamba hakuna maongezi yanayo onyeshwa na faili linahifadhiwa kwenye mpangilio orodha chaguo-msingi katika mfumo wako wa faili. Tafdhali pitia nyaraka ya kivinjari chako kwa maelekezo zaidi kama inahitajika.

source: Web service export
ja: ウェブサービスのエクスポート
ru: Экспорт веб-сервиса
sw: Hamisha huduma ya tovuti

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="Adminarea web service export - screenshot" scale="40" fileref="screenshots/genericinterface-webservice-export.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="管理エリア ウェブサービス エクスポート - スクリーンショット" scale="40" fileref="screenshots/genericinterface-webservice-export.png"></graphic>

source: <emphasis>Figure: Web services export.</emphasis>
ja: <emphasis>図:ウェブサービスのエクスポート</emphasis>
ru: <emphasis>Рисунок: Экспорт веб-сервиса.</emphasis>
sw: <emphasis>Kielelezo: Hamisha huduma ya tovuti.</emphasis>

source: Web Service Import
ja: ウェブサービスのインポート
ru: Импорт веб-сервиса:
sw: Agiza huduma ya tovuti

source: A valid web service configuration YAML file is required to use the import web service feature. Click on the "Import web service" button, browse for the configuration file or provide the complete path in the input box.
ja: 有効なウェブサービス構成YAMLファイルは、インポート・ウェブサービス機能を使用するように要求されます。「インポート・ウェブサービス」ボタンをクリックし、構成ファイルを探してブラウズし、入力ボックス中の完全なパスを提供してください。
ru: Для загрузки имеющегося YAML файла конфигурации веб-сервиса требуется использование функции импорта. Нажмите кнопку "Импорт веб-сервиса", найдите нужный файл или укажите полный путь к нему в окне ввода
sw: Faili halali la YAML la usanidi wa huduma ya tovuti linatakiwa kutumia kipengele cha agiza huduma ya tovuti. Bofya kitufe cha "Agiza huduma ya tovuti", tafuta faili la usanidi au toa njia kamili kwenye boksi la maingizo.

source: Click "Import" button to create a new web service from a file or "Cancel" to close the dialog.
ja: ファイルから新規ウェブサービスを作るために「インポート」ボタンをクリックするか、あるいはダイアログを閉じるために「キャンセルしてください。」
ru: Нажмите кнопку "Импорт" чтобы создать новый веб-сервис с файла или кнопку "Отменить" чтобы закрыть диалоговое окно.
sw: Bofya kitufe "Agiza" kutengeneza huduma mpya ya tovuti kutoka kwenye faili au "Katisha" kufunga maongezi.

source: The web service name will be taken from the configuration file name (e.g. if the file name is MyWebservice.yml the resulting web service will be named MyWebservice). If a web service is registered in the system with the same name as the web service that you want to import, the system will lead you to the web service change screen to let you change the name of the imported web service.
ja: ウェブサービス名は、構成ファイル名から得られます。(例えば、ファイル名がMyWebservice.ymlならば、結果として生じるウェブサービスはMyWebserviceと命名されます。)ウェブサービスが、あなたがインポートしたいウェブサービスと同じ名前でシステムで登録されれば、システムは、あなたにインポートウェブサービスの名前を変更させるためにウェブサービス変更画面に導くでしょう。
ru: Имя веб-сервиса будет взято из имени конфигурационного файла (напрмер, если имя файла MyWebservice.yml, то имя веб-сервиса будет - MyWebservice). Если в сисеме уже зарегистрирован веб-сервис с таким именем, система откроет экран изменения веб-сервиса, чтобы вы могли поменять имя импортируемого веб-сервиса.
sw: Jina la huduma ya tovuti litachukuliwa kutoka kwenye jina la faili la usanidi (mf. kama jina la faili ni HudumaTovutiYangu.yml hivyo basi huduma ya tovuti itaitwa HudumaTovutiYangu). Kama kuna huduma ya tovuti iliyosajiliwa kwenye mfumo kwa jina sawa na unayotaka kuagiza, mfumo utakupeleka kwenye skrini ya kubadilisha huduma ya tovuti ili kukuwezesha kubadilisha jina la huduma ya tovuti uliyoagiza.

source: Web service import
ja: ウェブサービスのインポート
ru: Импорт веб-сервиса
sw: Agiza huduma ya tovuti

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="Adminarea web service import - screenshot" scale="40" fileref="screenshots/genericinterface-webservice-import.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="管理エリア ウェブサービス インポート - スクリーンショット" scale="40" fileref="screenshots/genericinterface-webservice-import.png"></graphic>

source: <emphasis>Figure: Web services import.</emphasis>
ja: <emphasis>図：ウェブサービスのインポート</emphasis>
ru: <emphasis>Рисунок: Импорт веб-сервиса.</emphasis>
sw: <emphasis>Kelelezo: Agiza huduma za tovuti.</emphasis>

source: Web Service History
ja: ウェブサービス履歴
ru: История веб-сервиса
sw: Historia ya Huduma ya Tovuti
