Repository: DSigmund/doc-admin
Catalog: i18n/doc-admin.*.po
Languages: ja, ru, sw

source: In the combination, you must combine any sections entitled "History" in the various original documents, forming one section entitled "History"; likewise combine any sections entitled "Acknowledgements", and any sections entitled "Dedications". You must delete all sections entitled "Endorsements."
ja: 結合後の著作物においては、あなたはそれぞれの原本の「履歴 (History)」と 題されたあらゆる部分をまとめて、「履歴 (History)」と題された一章にしな ければなりません。同様に、「謝辞 (Acknowledgements)」あるいは「献辞 (Dedications)」と題されたあらゆる部分もまとめなければならない。あなたは 「推薦の辞 (Endowsements)」と題されたあらゆる部分も削除しなければなりません。
sw: Katika majumuisho, lazima ujumuishe kifungu chochote kilichoandikwa "Historia" katika nyaraka halisi zozote, kutengeneza kifungu kimoja kiitwacho "Historia"; hivyo hivyo jumuisha vifungu vyovyote viitwavyo "Shukrani", na vifungu vyovyote viitwavyo "Kujitolea." Lazima ufute vifungu vyote viitwavyo "Endorsements."

source: COLLECTIONS OF DOCUMENTS
ja: 文書の収集
sw: MKUSANYIKO WA NYARAKA

source: You may make a collection consisting of the Document and other documents released under this License, and replace the individual copies of this License in the various documents with a single copy that is included in the collection, provided that you follow the rules of this License, for verbatim copying of each of the documents in all other respects.
ja: あなたは、この利用許諾契約書の下で発表された複数の文書で構成される収集著作物を作ることがでます。その場合、それぞれの文書が逐語的に忠実に複製されることを保障するために他のすべての点でこの契約書の定める条件に従う限り、さまざまな文書中のこの契約書の個々の複製物を、収集著作物中に複製物を一つ含めることで代用することがでます。
sw: Unaweza kutengeneza mkusanyiko unaojumuisha Nyaraka hiyo na nyaraka nyingine zilizotolewa chini ya Leseni hii, na kubadilisha nakala binafsi za leseni hii katika nyaraka tofauti kwa kutumia nakala moja ambayo imejumuishwa na mkusanyiko huu, ikiwa kwamba unafuata sheria za Leseni hii, kwa kunakili bila mabadiliko katika kila nyaraka kwa mambo mengine yote.

source: You may extract a single document from such a collection, and distribute it individually under this License, provided you insert a copy of this License into the extracted document, and follow this License in all other respects regarding verbatim copying of that document.
ja: あなたは、このような収集著作物から文書を一つ取り出し、それをこの契約書の下で頒布することができます。ただしその際には、この契約書の複製物を抽出された文書に挿入し、またその他すべての点でこの文書の逐語的に忠実な複製に関してこの契約書が定める条件に従わなければなりません。
sw: Unaweza kutoa dondoo ya nyaraka moja kutoka kwenye mkusanyiko, na kuisambaza kibinafsi chini ya hii Leseni, ikiwa umeingiza nakala ya leseni hii kwenye nyaraka hiyo, na kufuata hii Leseni katika mambo mengine yote kuhusu kunakili bila mabadiliko ya nyaraka hiyo.

source: AGGREGATION WITH INDEPENDENT WORKS
ja: 独立した著作物の集積
sw: KUJUMUISHA NA KAZI BINAFSI

source: A compilation of the Document or its derivatives with other separate and independent documents or works, in or on a volume of a storage or distribution medium, does not as a whole count as a Modified Version of the Document, provided no compilation copyright is claimed for the compilation. Such a compilation is called an "aggregate", and this License does not apply to the other self-contained works thus compiled with the Document, on account of their being thus compiled, if they are not themselves derivative works of the Document.
ja: 文書あるいはその派生物を、他の別の独立した文書あるいは著作物と一緒 にし、一巻の記憶装置あるいは頒布媒体に収めた編集著作物は、編集に起因する著作権が編集著作物に含まれる個々の著作物がその利用者に許可した法的権利を制限するよう行使されない限り、「集積」著作物と呼ばれます。文書が集積著作物に含まれる場合、この契約書は、文書と共にまとめられた他の独立した著作物には、それら自身が文書の派生物で無い限り適用されることにはなりません。
sw: Mkusanyiko wa Nyaraka au sehemu zake na nyaraka nyingine tofauti na huru au kazi, juu ya au ndani ya hifadhi ya wingi au chombo cha usambazaji, haihesabiki kwa ujumla kama Toleo lililonbadilishwa la Nyaraka, ikiwa hakuna hakimiliki ya ukusanyaji iliyoombwa. Mkusanyiko wa aina hii unaitwa "aggregate", na hii Leseni haifanyi kazi kwenye kazi nyingine za binafsi ambazo zimejumuishwa na Nyaraka, kwa kuwa zimejumuishwa, kama zenyewe siyo sehemu za kazi ya Nyaraka.

source: If the Cover Text requirement of section 3 is applicable to these copies of the Document, then if the Document is less than one quarter of the entire aggregate, the Document's Cover Texts may be placed on covers that surround only the Document within the aggregate. Otherwise they must appear on covers around the whole aggregate.
ja: このような文書の複製物において、この利用許諾契約書の第3項によりカバーテキストの掲載が要求されている場合、文書の量が集積著作物全体の2分の1以下であれば、文書のカバーテキストは集積著作物中で文書そのものの周りを囲む中表紙、あるいは文書が電子的形式である場合には表紙の電子的等価物にのみ配置するだけでよいです。その場合以外は、カバーテキストは集積著作物全体を取り巻く印刷された表紙に掲載されなければなりません。
sw: Kama mahitaji ya Nakala ya Jalada ya kifungu 3 yanaweza kutumika kwenye hizi nakala za Nyaraka, basi kama nyaraka ni ndogo zaidi ya robo ya mkusanyiko mzima, Nakala za Jalada la Nyaraka zinaweza kuwekwa kwenye majalada ambayo yanazunguka Nyaraka tu ndani ya mkusanyiko. La sivyo lazima zitokee kwenye majalada kwenye mkusanyiko wote.

source: TRANSLATION
ja: 翻訳
sw: TAFSIRI

source: Translation is considered a kind of modification, so you may distribute translations of the Document under the terms of section 4. Replacing Invariant Sections with translations requires special permission from their copyright holders, but you may include translations of some or all Invariant Sections, in addition to the original versions of these Invariant Sections. You may include a translation of this License provided that you also include the original English version of this License. In case of a disagreement between the translation and the original English version of this License, the original English version will prevail.
ja: 翻訳は改変の一種と見做すので、あなたは文書の翻訳をこの利用許諾契約書の第4項の定める条件の下で頒布することができます。変更不可部分を翻訳によって置き換えるには著作権者の特別許可を必要としますが、元の変更不可部分に追加する形で変更不可部分の全てないし一部の翻訳を含めることはかまいません。 この契約書や文書中の利用許諾告知、保証否認警告すべての英語原本も含める限り、あなたはこの契約書、告知、警告の翻訳を含めることができます。契約書や告知、警告に関して翻訳と英語原本との間に食い違いが生じた場合、英語原本が優先されます。
sw: Tafsiri inachukuliwa kama aina ya ubadilishaji, kwa hiyo unaweza kusambaza tafsiri ya Nyaraka chini ya masharti ya kifungu 4. Kubadilisha Vifungu Visivyobadilika kwa tafsiri inahitaji ruhusa maalumu kutoka kwa wanaoshikilia hakimiliki, lakini unaweza kujumuisha tafsiri ya baadhi au Vifungu Visivyobadilika vyote, kama nyongeza kwa matoleo halisi ya hivi Vifungu Visivyobadilika. Unaweza kujumuisha tafsiri ya hii Leseni ikiwa kwamba umejumuisha pia toleo halisi la Kiingereza la hii Leseni. Ikitokea kutokuwapo na makubaliano kati ya tafsiri na toleo halisi la Kiingereza la hii Leseni, toleo halisi la Kiingereza litatumika.

source: TERMINATION
ja: 契約の終了
sw: USITISHAJI

source: You may not copy, modify, sublicense, or distribute the Document except as expressly provided for under this License. Any other attempt to copy, modify, sublicense or distribute the Document is void, and will automatically terminate your rights under this License. However, parties who have received copies, or rights, from you under this License will not have their licenses terminated so long as such parties remain in full compliance.
ja: この利用許諾契約書の下で明確に提示されている場合を除き、あなたは文書を複製、改変、サブライセンス、あるいは頒布してはなりません。このライセンスで指定されている以外の、文書の複製、改変、サブライセンス、頒布に関するすべての企ては無効であり、この契約書によって保証されるあなたの権利を自動的に終結させることとなります。しかし、この契約書の下であなたから複製物ないし諸権利を得た個人や団体に関しては、そういった人々がこの契約書に完全に従ったままである限り、彼らに与えられた許諾は終結しません。
sw: Huwezi kunakili, kubadilisha, kupata leseni ndogo, au kusambaza Nyaraka hiyo ila tu ikiwa imeonyeshwa chini ya Leseni hii. Jaribio lingine lolote la kunakili, kubadilisha, kupata leseni ndogo, au kusambaza Nyaraka ni batili, na itasitisha kiotomatiki haki zako chini ya Leseni hii. Hata hivyo, washirika waliopokea nakala, au haki, kutoka kwako chini ya Leseni hii hawatasitishiwa leseni zao ikiwa tu wataendeleza ushirikiano kamili.

source: FUTURE REVISIONS OF THIS LICENSE
ja: 将来における本利用許諾契約書の改訂
sw: MAREKEBISHO YA BAADAYE YA HII LESENI

source: The Free Software Foundation may publish new, revised versions of the GNU Free Documentation License from time to time. Such new versions will be similar in spirit to the present version, but may differ in detail to address new problems or concerns. See <ulink url="http://www.gnu.org/copyleft/">http://www.gnu.org/copyleft/</ulink>.
ja: フリーソフトウェア財団は、時によってGNU フリー文書利用許諾契約書の新しい改訂版を出版することができます。そのような新版は現在の版と理念においては似たものになるでしょうが、新たに生じた問題や懸念を解決するため細部に おいては違ったものになるでしょう。詳しく は <ulink url="http://www.gnu.org/copyleft/">http://www.gnu.org/copyleft/</ulink>を 参照して下さい。
sw: Free Software Foundation inaweza kuchapisha toleo jipya, lililorekebishwa la GNU Free Documentation Licence kutoka muda hadi muda. Matoleo hayo mapya yatakuwa sawa kiroho na toleo la sasa, lakini yanaweza kutofautiana kiundani kushughulikia matatizo mapya au wasiwasi. Tembelea <ulink url="http://www.gnu.org/copyleft/">http://www.gnu.org/copyleft/</ulink>.

source: Each version of the License is given a distinguishing version number. If the Document specifies that a particular numbered version of this License "or any later version" applies to it, you have the option of following the terms and conditions either of that specified version or of any later version that has been published (not as a draft) by the Free Software Foundation. If the Document does not specify a version number of this License, you may choose any version ever published (not as a draft) by the Free Software Foundation.
ja: GNU フリー文書利用許諾契約書のそれぞれの版には、新旧の区別が付くようなバージョン番号が振られています。もし文書において、この契約書のある特定の版か「それ以降のどの版でも」適用して良いと指定されている場合、あなたはフリーソフトウェア財団から発行された(草稿として発表されたものを除く)指定の版かそれ以降の版のうちどれか一つを選び、その条項や条件に従うことができます。もし文書がこの契約書のバージョン番号を指定していない場合には、あなたはフリーソフトウェア財団から今までに出版された(草稿として発表されたものを除く)版のうちからどれか一つを選ぶことができます。
sw: Kila toleo la Leseni limepewa nambari ya toleo tofauti na nyingine. Kama nyaraka ikibainisha kwamba toleo la Leseni hii lenye nambari fulani "au toleo lolote la mbele" linahusika nayo, una machaguo ya kufuata masharti na vigezo ya aidha toleo lililobainishwa au toleo lolote la mbele ambalo limechapishwa (sio kama rasimu) na Free Software Foundation. Kama nyaraka haijabainisha nambari ya toleo la hii Leseni, unaweza kuchagua toleo lolote lilillowahi kuchapishwa (sio kama rasimu) na Free Software Foundation.

source: How to use this License for your documents
ja: この利用許諾契約書をあなたの文書に適用するには
sw: Jinsi ya kutumia hii Leseni kwa ajili ya nyaraka zako

source: To use this License in a document you have written, include a copy of the License in the document and put the following copyright and license notices just after the title page:
ja: この利用許諾契約書をあなたが書いた文書に適用するには、この契約書の複製物一つを文書中に含め、以下に示す著作権表示と利用許諾告知を題扉のすぐ後に置いて下さい:
sw: Kutumia hii leseni kwenye nyaraka uliyoandika, jumuisha nakala ya Leseni kwenye nyaraka na weka hakimiliki ifuatayo na notisi za leseni baada tu ya ukurasa wa mbele:

source: Copyright (c) YEAR YOUR NAME. Permission is granted to copy, distribute and/or modify this document under the terms of the GNU Free Documentation License, Version 1.1 or any later version published by the Free Software Foundation; with the Invariant Sections being LIST THEIR TITLES, with the Front-Cover Texts being LIST, and with the Back-Cover Texts being LIST. A copy of the license is included in the section entitled "GNU Free Documentation License".
ja: Copyright (C) 西暦年 あなたの名前. この文書を、フリーソフトウェア財団発行の GNU フリー文書利用許諾契約 書(バージョン1.1かそれ以降から一つを選択)が定める条件の下で複製、頒 布、あるいは改変することを許可します。変更不可部分、表カバーテキスト、 裏カバーテキストは存在しません。この利用許諾契約書の複製物は「GNU フ リー文書利用許諾契約書」という章に含まれています。
sw: Hakimiliki (c) JINA LAKO. Ruhusa imetolewa kunakili, kusambaza na/au kurekebisha nyaraka hii chini ya masharti ya GNU Free Documentation Licence, Toleo 1.1 au toleo lolote la mbele lililochapishwa na Free Software Foundation; na sehemu zisizobadilika zikiwa ORODHESHA VICHWA VYA HABARI VYAO, na Nakala za Jalada la Mbele likiwa ORODHA, na Jalada la Nyuma likiwa ORODHA. Nakala ya leseni imejumuishwa katika kifungu kiitwacho "GNU Free documentation Licence" .

source: If you have no Invariant Sections, write "with no Invariant Sections" instead of saying which ones are invariant. If you have no Front-Cover Texts, write "no Front-Cover Texts" instead of "Front-Cover Texts being LIST"; likewise for Back-Cover Texts.
ja: もし変更不可部分や表カバーテキスト、裏カバーテキストがあれば、「変更不 可部分…は存在しない。」というところを以下で置き換えてください:
sw: Kama hauna Vifungu Visivyobadilika, andika "bila Vifungu Visivyobadilika" badala ya kusema ni vipi havibadiliki. Kama hauna Nakala za Jalada la Mbele, andika "hakuna Nakala za Jalada la Mbele" badala ya "Nakala za Jalada la Mbele kuwa ORODHA"; hivyo hivyo kwa Nakala za Jalada la Nyuma.

source: If your document contains nontrivial examples of program code, we recommend releasing these examples in parallel under your choice of free software license, such as the GNU General Public License, to permit their use in free software.
ja: あなたの文書に、他に類を見ない独自のプログラムコードのサンプルが含まれる場合、フリーソフトウェアにおいてそのコードを利用することを許可するために、そういったサンプルに関してはこの利用許諾契約書と同時にGNU 一般公衆許諾契約書のようなフリーソフトウェア向けライセンスのうちどれか一つを選択して適用してもよい、というような条件の下で発表することを推奨します。
sw: Kama nyaraka yako ina mifano iliyo ya msingi ya kanuni za programu, tunashauri kutoa hii mifano sambamba chini ya leseni huru ya programu ya chaguo lako, kama GNU General Public License, kuruhusu utumizi wake katika programu za bure.

source: First steps
ja: ファースト・ステップ
ru: Первые шаги
sw: Hatua za mwanzo

source: The goal of this chapter is to provide a brief overview of OTRS and the structure of its web interface. The terms 'agents', 'customers', and 'administrators' are introduced. We also login as the OTRS admininstrator and take a closer look at the user preferences available on every account.
ja: この章の目的は、OTRSの簡潔な概要を提供することです。
ru: В этой главе приводится общий обзор OTRS и структура веб-интерфейса. Дается обьяснение таким терминам как: агенты, клиенты и администраторы. В этом разделе вы войдете в систему с правами OTRS-администратора и более внимательно ознакомитесь с настройками пользователей, доступными для каждого из типов аккаунта.
sw: Lengo la sura hii ni kutoa mapitio mafupi ya OTRS na muundo wa kiolesura chake cha tovuti. Misemo 'mawakala', 'wateja', na 'wasimamizi' imetambulishwa. Pia tunaingia kama msimamizi wa OTRS na kuangalia kwa karibu mapendeleo ya mtumiaji yanayopatikana kwenye kila akaunti.

source: Agent web interface
ja: 担当者ウェブインターフェイス
ru: Веб-интерфейс для агентов
sw: Kiolesura cha tovuti cha wakala

source: The agent web interface allows agents to answer customer requests, create new tickets for customers or other agents, write tickets about telephone calls with customers, write FAQ entries, edit customer data, etc.
ja: 担当者は、担当者ウェブインターフェイスで顧客のリクエストに答えることができます。顧客のためあるいは他の担当者のために新規チケットを作成し、顧客との通話に関することをチケットに書き、FAQを記入し、顧客データを編集します。
ru: Агентский веб-интерфейс позволяет агентам отвечать на вопросы клиентов, создавать новые заявки для клиентов и агентов, создавать заявки на основе телефонных звонков клиентов, писать и редактировать записи FAQ-модуля, редактировать данные клиентов и так далее.
sw: Kiolesura cha tovuti cha wakala kinamruhusu wakala kujibu maombi ya wateja, kutengeneza tiketi mpya za wateja au mawakala wengine, kuandika tiketi kuhusu simu zilipigwa na wateja, kuandika maingizo ya maswali yaliyoulizwa mara kwa mara, kuhariri data za wateja, na kadh.

source: Supposing your OTRS host is reachable via the URL <ulink url="http://www.example.com/"> <citetitle>http://www.example.com</citetitle> </ulink> , then the OTRS login screen can be reached by using the address <ulink url="http://www.example.com/otrs/index.pl"> <citetitle>http://www.example.com/otrs/index.pl</citetitle> </ulink> in a web browser (see Figure below).
ja: URL <ulink url="http://www.example.com/"> <citetitle>http://www.example.com</citetitle> </ulink>経由であなたのOTRSホストへ到達すると仮定すれば、ウェブブラウザ（下図参照）でアドレス<ulink url="http://www.example.com/otrs/index.pl"> <citetitle>http://www.example.com/otrs/index.pl</citetitle> </ulink>を使用することでOTRSログイン画面へ到達します。
ru: Предположим, что OTRS доступен по ссылке <ulink url="http://www.example.com/"> <citetitle>http://www.example.com</citetitle> </ulink>, таким образом, агенты и OTRS-администраторы могут войти в OTRS набрав в строке браузера следующий URL-адрес: <ulink url="http://www.example.com/otrs/index.pl"> <citetitle>http://www.example.com/otrs/index.pl</citetitle> </ulink> (см. Рисунок ниже).
sw: Tuseme mwenyeji wa OTRS yako anapatikana kupitia URL <ulink url="http://www.example.com/"> <citetitle>http://www.example.com</citetitle> </ulink> , kisha skrini ya kuingia ya OTRS inaweza kufikiwa kwa kutumia anwani ya wavuti <ulink url="http://www.example.com/otrs/index.pl"><citetitle>http://www.example.com/otrs/index.pl</citetitle> </ulink> katika kivinjari wavuti (ona Kielelezo chini).

source: index.pl - Agent login screen
ja: index.pl - 担当者のログイン画面
ru: index.pl - Экран для входа Агентов.
sw: index.pl - Skrini ya kuingia ya wakala

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="index.pl - screenshot" scale="40" fileref="screenshots/login.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="index.pl - スクリーンショット" scale="40" fileref="screenshots/login.png"></graphic>

source: <emphasis>Figure: Login screen of the agent interface.</emphasis>
ja: <emphasis>図：担当者インターフェイスのログイン画面</emphasis>
ru: <emphasis>Рисунок: Агентский интерфейс, экран входа.</emphasis>
sw: <emphasis>Kielelezo: Skrini ya kuingia ya kiolesura cha wakala.</emphasis>

source: Customer web interface
ja: 顧客ウェブインターフェイス
ru: Пользовательский веб-интерфейс
sw: Kiolesura cha tovuti cha mtumiaji

source: Customers have a separate web interface in OTRS through which they can create new accounts, change their account settings, create and edit tickets, get an overview on tickets that they have created, etc.
ja: 顧客は、OTRSの別々のウェブインターフェイスを持ち、それを通じて、新規アカウントを作成し、アカウント設定を変更し、チケットを作成、編集し、作成したチケットに関する概要を取得することができます。
ru: В OTRS клиенты имеют отдельный веб-интерфейс, с помощью этого веб-интерфейса они могут создавать новые учетные записи, просматривать собственные заявки, создавать и редактировать заявки, изменять настройки своей учетной записи и т.д.
sw: Wateja wana violesura tofauti vya tovuti katika OTRS ambavyo wanaweza kutengeneza akaunti mpya, kubadilisha mipangilio yao ya akaunti, tengeneza na kuhariri tiketi, kupata mapitio ya tiketi walizotengeneza, na kadh.

source: Continuing the above example, the customer login screen can be reached by using the URL <ulink url="http://www.example.com/otrs/customer.pl"> <citetitle>http://www.example.com/otrs/customer.pl</citetitle> </ulink> with a web browser (see Figure below).
ja: 上のサンプルを続け、顧客ログイン画面はウェブブラウザでURL<ulink url="http://www.example.com/otrs/customer.pl"> <citetitle>http://www.example.com/otrs/customer.pl</citetitle> </ulink>を使用することで到達します。（下図参照）
ru: Используя выше приведенный пример, страница входа для клиентов будет доступна по ссылке <ulink url="http://www.example.com/otrs/customer.pl"> <citetitle>http://www.example.com/otrs/customer.pl</citetitle> </ulink> (см. Рисунок ниже).
sw: Mwendelezo wa mfano juu, skrini ya kuingia ya mteja inaweza kufikiwa kwa kutumia URL <ulink url="http://www.example.com/otrs/customer.pl"> <citetitle>http://www.example.com/otrs/customer.pl</citetitle> </ulink> na kivinjari wavuti (ona Kielelezo chini).

source: customer.pl - Customer login screen
ja: customer.pl - 顧客ログイン画面
ru: customer.pl - Пользовательский веб-интерфейс
sw: customer.pl - Skrini ya kuingia ya mteja

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="customer.pl - screenshot" scale="40" fileref="screenshots/customer-login.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="customer.pl - スクリーンショット" scale="40" fileref="screenshots/customer-login.png"></graphic>

source: <emphasis>Figure: Login screen of the customer interface.</emphasis>
ja: <emphasis>図：顧客ログイン画面</emphasis>
ru: <emphasis>Рисунок: Пользовательский веб-интерфейс, страница входа.</emphasis>
sw: <emphasis>Kielelezo: Skrini ya kuingia ya kiolesura cha mteja.</emphasis>

source: Public web interface
ja: 公開ウェブインターフェイス
ru: Общедоступный веб-интерфейс
sw: Kiolesura cha tovuti cha uma

source: In addition to the web interfaces for agents and customers, OTRS also has a public web interface which is available through the FAQ-Module. This module needs to be installed separately. It provides public access to the FAQ system and lets visitors search through FAQ entries without any special authorization.
ja: 担当者と顧客のためのウェブインターフェイスに加えて、OTRSにはさらにFAQモジュールによって利用可能な公開ウェブ・インターフェースがあります。このモジュールを別々にインストールしている必要があります。それはFAQシステムに公衆アクセスを提供し、特別の認可のないFAQエントリーをビジターに捜させます。
ru: В дополнение к веб-интерфейсу для агентов и клиентов, OTRS имеет открытый веб-интерфейс, предоставляющий доступ к FAQ-модулю, который устанавливается отдельно. Он предоставляет открытый доступ к FAQ-системе и позволяет пользователям без авторизации искать информацию в базе знаний.
sw: Kwa nyongeza kwenye violesura vya wavuti kwa ajili ya mawakala na wateja. OTRS pia ina kiolesura cha umma ambacho kinapatikana kupitia moduli ya maswali yanayoulizwa mara kwa mara. Hii moduli inahitaji kusakinishwa pekeyake. Inatoa ufikivu wa umma kwa mfumo wa maswali yanayoulizwa mara kwa mara na inaruhusu wageni kutafuta kwenye maingizo ya maswali yanayoulizwa mara kwa mara bila uidhinishaji wowote maalumu.

source: In our example, the public web interface can be reached via either of the following URLs: <ulink url="http://www.example.com/otrs/faq.pl"> <citetitle>http://www.example.com/otrs/faq.pl</citetitle> </ulink> , <ulink url="http://www.example.com/otrs/public.pl"> <citetitle>http://www.example.com/otrs/public.pl</citetitle> </ulink>
ja: 私達のサンプルでは, 公開ウェブインターフェイスは次のいずれかのURL : <ulink url="http://www.example.com/otrs/faq.pl"> <citetitle>http://www.example.com/otrs/faq.pl</citetitle> </ulink> , <ulink url="http://www.example.com/otrs/public.pl"> <citetitle>http://www.example.com/otrs/public.pl</citetitle> </ulink>に到達できます。
ru: В нашем примере общий веб-интерфейс будет доступен по ссылке: <ulink url="http://www.example.com/otrs/faq.pl"> <citetitle>http://www.example.com/otrs/faq.pl</citetitle> </ulink> , <ulink url="http://www.example.com/otrs/public.pl"> <citetitle>http://www.example.com/otrs/public.pl</citetitle> </ulink>
sw: Katika mfano wetu, kiolesura cha tovuti cha umma kinaweza kufikiwa kwa kupitia aidha ya URL zifuatazo: <ulink url="http://www.example.com/otrs/faq.pl"> <citetitle>http://www.example.com/otrs/faq.pl</citetitle> </ulink> , <ulink url="http://www.example.com/otrs/public.pl"> <citetitle>http://www.example.com/otrs/public.pl</citetitle> </ulink>

source: public.pl - Public web interface
ja: public.pl - パブリック・ウェブインターフェイス
ru: public.pl - Общедоступный веб-интерфейс
sw: public.pl - Kiolesura cha umma cha wavuti

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="public.pl - screenshot" scale="40" fileref="screenshots/public-interface.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="public.pl - スクリーンショット" scale="40" fileref="screenshots/public-interface.png"></graphic>

source: <emphasis>Figure: Public web interface.</emphasis>
ja: <emphasis>図：パブリック・ウェブインターフェイス</emphasis>
ru: <emphasis>Рисунок: Общий веб-интерфейс.</emphasis>
sw: <emphasis>Kielelezo: Kiolesura cha umma cha wavuti.</emphasis>

source: First login
ja: はじめてのログイン
ru: Первое применение
sw: Kuingia kwa mara ya kwanza
