Repository: DSigmund/doc-admin
Catalog: i18n/doc-admin.*.po
Languages: ja, ru, sw

source: Community
ja: コミュニティー
ru: Сообщество
sw: Jamii

source: OTRS has a large user community. Users and developers discuss OTRS and exchange information on related issues through the <link linkend="additional-resources-mailinglists">mailing-lists</link>. You can use the mailing lists to discuss installation, configuration, usage, localization and development of OTRS. You can report software bugs in our <link linkend="additional-resources-bugtracking">bug tracking system</link>.
ja: OTRSには大きなユーザ・コミュニティーがあります。ユーザと開発者は<link linkend="additional-resources-mailinglists">メーリング・リスト</link>によってOTRSおよび関連銘柄についての交換情報について議論します。OTRSのインストール、構成、使用法、各国言語化および開発について議論するためにメーリング・リストを使用することができます。私たちの<link linkend="additional-resources-bugtracking">バグ・トラッキング・システム</link>中のソフトウェア・バグを報告することができます。
sw: OTRS ina jamii kubwa ya watumiaji. Watumiaji na watengenezaji wanajadili OTRS na kubadilishana taarifa kuhusu maswaka husika kupitia <link linkend="additional-resources-mailinglists">orodha ya watumiwa</link>. Unaweza kutumia orodha ya watumiwa kujadili usakinishaji, usanidi, matumizi, undani na uendelezaji wa OTRS. Unaweza kuripoti makosa ya programu katika <link linkend="additional-resources-bugtracking">mfumo wetu wa kufuatilia makosa</link>.

source: The homepage of the OTRS community is: <ulink url="http://www.otrs.com/open-source/"><citetitle>http://www.otrs.com/open-source/</citetitle></ulink>.
ja: OTRSコミュニティーのホームページは次のとおりです:<ulink url="http://www.otrs.com/open-source/"><citetitle>http://www.otrs.com/open-source/</citetitle></ulink> .
ru: Домашняя страница OTRS-сообщества: <ulink url="http://www.otrs.com/open-source/"><citetitle>http://www.otrs.com/open-source/</citetitle></ulink>.
sw: Kurasa ya nyumbani ya jamii ya OTRS ni: <ulink url="http://www.otrs.com/open-source/"><citetitle>http://www.otrs.com/open-source/</citetitle></ulink>.

source: Professional Services for OTRS
ja: OTRSのためのプロフェッショナル・サービス
ru: Профессиональная поддержка OTRS
sw: Huduma za kitaalamu za OTRS

source: Whether you need help in configuring or customizing OTRS or you want to be on the safe side, don't hesitate to contact us: We offer a wide range of professional services such as world-wide enterprise support, consulting and engineering including process design, implementation, customization, application support, and fully managed service.
ja: OTRSを設定するかカスタマイズする際にヘルプを必要とするか、あなたが安全に運用したいかにかかわらず、遠慮なく、私たちと連絡をとってください: 私たちは広範囲の世界的な企業サポートのようなプロフェッショナル・サービス提供します。それは、工程設計、インプリメンテーション、カスタマイズ、アプリケーションサポートおよび完全に管理されたサービスを含むコンサルティングやエンジニアリングです。
sw: Ikiwa unahitaji msaada katika kusanidi au kugeuza kukufaa OTRS au unataka kuwa upande wenye usalama usisiste kuwasiliana nasi: Tunatoa huduma pana ya kitaaluma kama msaada kwa kampuni kubwa dunia nzima, ushauri na uhandisi ikijumuisha ubunifu wa michakato, utekelezaji, kugeuza kukufaa, msaada wa programu, na huduma zinazosimamiwa kikamilifu.

source: Our <ulink url="http://www.otrs.com/en/solutions/service-contracts/">Service Contracts</ulink> guarantee instant help and professional support as well as support assessment and last but not least free access to <ulink url="http://www.otrs.com/en/solutions/subscriptions/otrsfeatureadd-ons/">OTRS Feature Add-ons</ulink> - useful additional features for your OTRS.
ja: 私たちの<ulink url="http://www.otrs.com/en/solutions/service-contracts/">サービス契約</ulink> は、サポート評価と同様に、即時のヘルプおよび専門家のサポートも保証します。そして<ulink url="http://www.otrs.com/en/solutions/subscriptions/otrsfeatureadd-ons/">OTRS機能アドオン</ulink>への最新のしかし可能な限り無料のアクセス- あなたのOTRSのための有用な追加の機能です。
sw: <ulink url="http://www.otrs.com/en/solutions/service-contracts/">Mikataba yetu ya Huduma</ulink> inahakikisha msaada wa hapo hapo na msaada wa kitaalamu pia utathmini wa msaada na mwisho ufikivu wa bure kwa <ulink url="http://www.otrs.com/en/solutions/subscriptions/otrsfeatureadd-ons/">vifaa vya nyongeza vya vipengele vya OTRS</ulink> - vipengele vya nyongeza vya muhimu vya OTRS yako.

source: <ulink url="http://www.otrs.com/">The OTRS Group</ulink> offers specific <ulink url="http://www.otrs.com/en/solutions/training/">training programs</ulink> in different countries. You can either participate in one of our public OTRS Administrator trainings which take place regularly, or benefit from an inhouse training that covers all the specific needs of your company.
ja: <ulink url="http://www.otrs.com/">OTRSグループ</ulink> は、様々な国々の特定の<ulink url="http://www.otrs.com/en/solutions/training/">トレーニング・プログラム</ulink>を提供します。定期的に開催する私たちの公のOTRS管理者トレーニングのうちの1つに参加するか、あるいは社内の特定の要求をすべてカバーするための社内トレーニングから利益を享受することもできます。
ru: <ulink url="http://www.otrs.com/">The OTRS Group</ulink> предлагает специальные <ulink url="http://www.otrs.com/en/solutions/training/">программы тренингов</ulink> в разных странах. Вы можете принять участие в одном из наших публичных OTRS Administrator тренингах, проводимых регулярно, или заказать обучение на территории вашей компании, с учетов всех ее особенностей.
sw: <ulink url="http://www.otrs.com/">OTRS Group</ulink> inatoa <ulink url="http://www.otrs.com/en/solutions/training/">programu maalumu za mafunzo</ulink> katika nchi tofauti. Unaweza kushiriki katika aidha moja ya mafunzo yetu ya umma ya Msimamizi wa OTRS ambayo hufanyika mara kwa mara, au kufaidika na mafunzo ya ndani ambayo yanapitia mahitaji yote ya kampuni yako.

source: This feature of OTRS allows you to model processes (work-flows) in the ticket system. The basic idea is to be able to define recurring processes, and to delegate work items to different people, as well as leading the progress of a process in different directions based on certain criteria.
ja: OTRSのこの機能により、チケット・システムでプロセス(ワークフロー)をモデル化することが可能です。この基本概念は再現するプロセスを定義可能にし、異なる人々に作業項目を任せるためのものです。またある基準に基づく異なる指示のプロセス進行をリードします。
ru: Эта функция в OTRS Позволяет поделировать процессы (потоки работ/задач) в системе управления заявками. ГОсновная идея заключается в том, чтобы задать повторяющиеся процессы и делегировать части работы различным сотрудникам, а также управлять продолжением работы по процессу, в зависимости от определенных условий.
sw: Hiki kipengele cha OTRS kinakuruhusu kutengeneza michakato (mitiririko ya kazi) katika mfumo wa tiketi. Wazo la msingi ni kufafanua michakato inayojirudia, na kugawa kazi kwa watu tofauti, na pia kuongoza maendeleo ya mchakato katika njia tofauti kutegemeana na vigezo fulani.

source: Example process
ja: サンプル・プロセス
ru: Пример процесса
sw: Mchakato wa mfano

source: Let's see an example to make it more demonstrative. We will define a book order process:
ja: より実地的なサンプルで見てみましょう。ここでは本の注文プロセスを定義します:
ru: Давайте рассмотрим некий пример чтобы все было более наглядно и понятно. Мы будем рассматривать процесс покупки книги:
sw: Tuone mfano ili kuona zaidi inavyofanyika. Tutafafanua mchakato wa kuoda kitabu:

source: Recording the demand
ja: 要求の記録
ru: Запись спроса
sw: Ku rekodi mahitaji

source: Before an order will be placed, the demand for literature by an employee will be recorded. The following book is needed in our example:
ja: 受注前に、従業員によって書物の需要が記録されます。以下の本がここでの例に必要となります:
ru: Прежде чем заказ будет размещен, запрос на литературу работником будет записан. Следующая книга нужна в нашем примере:
sw: Kabla oda haijawekwa, maombi ya fasihi ya mwajiriwa yatarekodiwa. Kitabu kifuatacho kitahitajika katika mfano wetu:

source: Title: Prozessmanagement für Dummies Autor: Thilo Knuppertz ISBN: 3527703713
ja: タイトル：Prozessmanagement für Dummies、著者：Thilo Knuppertz、ISBN：3527703713

source: Approval by manager
ja: マネージャーによる承認
ru: Утверждение менеджером
sw: Imehakikiwa na meneja

source: The head of the employee's department needs to decide on the order. In case of a denial, a reason should be recorded by the manager. In case of approval, the order is passed to the purchasing department.
ja: 従業員の部長は注文に関して以下を決定する必要があります。否認の場合には、理由がマネージャーによって記録されるべきです。承認の場合には、オーダーが購買部に渡されます。
ru: Начальник отдела где работает работник должен решить что делать с заказом. В случае отказа, причина отказа должна быть записана старшим по должности. В случае одобрения заказ передается в отдел закупок.
sw: Kiongozi wa idara ya wafanya kazi inabidi aamue kwenye oda. Kama imekataliwa, sababu lazima irekodiwe na meneja. Kama imekubaliwa, oda inapitishwa kwenda kwa idara ya manunuzi.

source: Processing by purchasing department
ja: 購買部による処理
ru: Обрабатывается отделом закупок
sw: Idara chakatishi ya manunuzi

source: Purchasing now has the task to find out where the book can be ordered with the best conditions. If it is out of stock, this can be recorded in the order. In case of a successful order purchasing will record the supplier, the price and the delivery date.
ja: 購入するとは、本を最良の条件で本を注文する場所を見つける職務です。品切れの場合、注文に記録します。購入が成約した場合はサプライヤー、購入価格、配達日を記録します。
ru: Закупка, в данном случае, состоит в том, чтобы найти, где книга может быть заказана на лучших условиях. Если ее нет на рынке, это должно быть записано в заказе. В случае успешного размещения заказа, закупщик записывает поставщика, цену и дату поставки.
sw: Manunuzi sasa yana kazi ya kujua wapi oda ya kitabu itafanywa penye masharti mazuri. Kama vimeisha, inaweza kurekodiwa kwenye oda. Kama oda imefanikiwa manunuzi atarekodi msambazaji, bei na tarehe ya kuwasilisha.

source: Processing by the mail room
ja: 郵便室による処理
ru: Обрабатывается почтовым отделом
sw: Chumba chakatishi cha barua pepe

source: The shipment will arrive at the company. The incoming goods department checks the shipment and records the date of receipt. Now the employee will be informed that their order has arrived and is ready to be collected.
ja: 貨物が会社に入荷すると、貨物の入荷受付部は、その貨物をチェックし受領日を記録します。従業員はこの注文が到着を知らされ、貨物を取りに行く準備をするでしょう。
ru: Посылка будет доставлена в компанию. Отдел приемки, проверяет посылку и записывает дату приема. Теперь работник - заявитель будет извещен, что его заказ прибыл и готов к выдаче.
sw: Vilivyosafirishwa vitawasili kwenye kampuni. Idara ya mali zinazoingia itakagua vilivyosafirishwa na kurekodi siku ya kupokea. Sasa wafanyakazi watapewa taarifa kwamba oda yao imewasili na iko tayari kuchukuiwa.

source: Implementing the example
ja: 例の実行
ru: Выполнение примера
sw: Kutekeleza mfano

source: If we assume that a ticket acts in this work-flow like an accompanying document that can receive change notes, we already have a clear picture of process tickets.
ja: チケットが、このワークフロー中で、 変更ノートを受け取ることができる添付書類のように作用すると考えれば、既にプロセス・チケットの明瞭な青写真を持っていることになります。
ru: Если предположить что заявка действует в этом рабочем потоке как сопроводительный документ, который может принимать сообщения об изменениях, мы получаем полное представление о процессных заявках.
sw: Kama tukiamini kwamba tiketi inatenda kama waraka unao andamana nao katika huu mtiririko wa kazi ambao unaweza kupokea notisi za mabadiliko, sasa tuna picha kamili ya tiketi za mchakati.

source: From the analysis of the example process we can identify the following necessary items:
ja: サンプル・プロセスの分析から、次の必須アイテムを識別することができます。
ru: Проанализировав предыдущий пример мы можем выделить следующие пункты:
sw: Kutoka kwenye uchambuzi wa mchakato wa mfano tunaweza kubainisha vifaa muhimu vifuatavyo:

source: Possibilities to record data, let's call them <emphasis>Activity Dialogs</emphasis>,
ja: データを記録する可能性、それを<emphasis>アクティビティ・ダイアログ</emphasis>と呼びます。
ru: Возможности регистрации данных, назовем их <emphasis>Activity Dialogs/Диалоги Активности</emphasis>,
sw: Uwezekano wa kurekodi data, tuziite <emphasis>Maongezi ya Shughuli</emphasis>,

source: Checks which can react to changed data automatically, let's call them <emphasis>Transitions</emphasis>,
ja: データ変更されたことに対して自動的に反応するチェック機構、それを<emphasis>推移（Transitions)</emphasis>と呼びます。
ru: Проверки, которые могут автоматически реагировать на изменение данных, назовем <emphasis>Переходы</emphasis>,
sw: Inaangalia ipi itabadilika kiotomatiki na data zilizobadilishwa, tuziite <emphasis>Mapito</emphasis>,

source: changes which can be applied to a process ticket after successful transitions of a process ticket, let's call them <emphasis>Transition Actions</emphasis>.
ja: プロセス・チケットの推移が成功した後でプロセス・チケットに適用可能な変更、それを<emphasis>推移アクション（Transition Actions）</emphasis>と呼びます。
ru: изменения, которые могут быть применены для обработки заявки после успешного перехода обработки заявки, назовем их <emphasis>Transition Actions</emphasis>.
sw: mabadiliko yanayoweza kufanyika kwenye tiketi ya mchakato baada ya kufanikiwa kwa mapito ya tiketi ya mchakato, tuyaite <emphasis>Vitendo vya Mpito</emphasis>.

source: We also need an additional item which might not be as obvious:
ja: さらにそれほど明白でないかもしれない追加項目を必要とします:
ru: Также нам необходим дополнительный элемент, который не так очевиден:
sw: Pia tunahitaji vifaa vya ziada ambavyo si dhahiri:

source: A possibility to offer more than just one Activity Dialog to be available. In our example this is needed when the manager must have the choice between "Approve" and "Deny". Let's call this <emphasis>Activity</emphasis>.
ja: 利用可能なアクティビティ・ダイアログをひとつ以上提供する可能性。ここでの例においては、マネージャーが「承認」「拒絶」の選択を持っていなければならない場合にこれ（提供する可能性）が必要です。これを<emphasis>アクティビティ</emphasis>と呼びます。
ru: Возможность предложить, чтобы более чем один Диалог Активности/Activity Dialog был доступен. В нашем примере это необходимо, когда менеджер должен иметь выбор между "Approve/Утвердить" and "Deny/Запретить". Назовем это <emphasis>Activity/Активность</emphasis>.
sw: Uwezekano wa upatikanaji wa Maongezi ya Shughuli zaidi ya aina moja. Katika mfano wetu hii inahitajika pale msimamizi inabidi apate machaguo kati ya "Kubali" na "Kataa". Hii tuiite <emphasis>Shughuli</emphasis>.

source: Now, with Activities, Activity Dialogs, Transitions and Transition Actions we have the necessary tools to model the individual steps of our example. What's still missing is an area where for each work-flow the order of the steps can be specified. Let's call this <emphasis>Process</emphasis>. To be able to refer to all these entities later, we will assign to them an abbreviation in parentheses. This abbreviation is based on an internal identification mechanism called EntityIDs.
ja: さて、アクティビティ、アクティビティ・ダイアログ、推移と推移アクションにより、私たちは、私たちの例の個々のステップを形成するための必要なツールを持つことになります。私たちは、各々のワークフォローにとってステップの順番が指定されうるエリアをまだ見つけていません。これを<emphasis>プロセス</emphasis>と呼びましょう。これらのすべての実体（エンティティ）を後で参照することができるようにするために、それらを括弧中の略語で指定します。この省略は EntityIDs と呼ばれる内部識別メカニズムに基づきます。
ru: Теперь, введя понятия Activities/Активность, Activity Dialogs/Диалоги Активности, Transitions/Переходы и Transition Actions/Действия перехода, мы имеем все необходимые инструменты для построения отдельных этапов нашего примера. Что мы еще не определили, так это область в которой для каждого потока работ/ work-flow был бы задан порядок шагов. Назовем это <emphasis>Process/Процесс</emphasis>. Чтобы иметь возможность ссылаться на все эти сущности/понятия позже, дадим им краткие имена/аббревиатуры в скобках. Эти обозначения основаны на внутреннем механизме идентификации, называемом EntityIDs.
sw: Sasa, tukiwa na Shughuli, Maongezi ya Shughuli, Mapito na Vitendo vya Mpito tuna vifaa vinavyohitajika ili kutengeneza moduli ya hatua binafsi za mfano wetu. Kinachobakia ni eneo ambalo kila mtiririko wa kazi mpangilio wa ngazi unaweza kuwekwa bayana. Hii tuiite <emphasis>Mchakato</emphasis>. Ili tuweze kurejea kwenye hivi vyombo baadae, tutazipa vifupisho katika mabano. Huu ufupisho unategemeana na utaratibu wa ndani wa utambulisho uitwao Kitambulisho cha Chombo.

source: The EntityIDs are conformed with one or two letters (depending on the process part or entity) and then a consecutive number, examples:
ja: エンティティIDs(EntityIDs)は、1個あるいは2個の文字（プロセス部分あるいは実体に依存します）と連続した番号で組み合わせて作られます。
ru: EntityIDs согласовываются с одной или двумя буквами (в зависимости от части процесса), а затем порядковый номер, например:
sw: Vitambulisho vya Chombo vinafanana na vina herufi moja au mbili (kutegemeana na mchakato au chombo) na baada ya hapo mfululizo wa namba, mifano:

source: Process: 'P1', 'P2' ... 'Pn'.
ja: プロセス（Process）: 'P1', 'P2' ... 'Pn'.
ru: Процесс: 'P1', 'P2' ... 'Pn'.
sw: Mchakato: 'P1', 'P2' ... 'Pn'.

source: Activity: 'A1', 'A2' ... 'An'.
ja: アクティビティ（Activity）: 'A1', 'A2' ... 'An'.
ru: Деятельность: 'A1', 'A2' ... 'An'.
sw: Shughuli: 'A1', 'A2' ... 'An'.

source: Activity Dialog: 'AD1', 'AD2' ... 'ADn'.
ja: アクティビティ・ダイアログ（Activity Dialog）: 'AD1', 'AD2' ... 'ADn'.
ru: Диалог Активности: 'AD1', 'AD2' ... 'ADn'.
sw: Maongezi ya Shughuli: 'AD1', 'AD2' ... 'ADn'.

source: Transition: 'T1', 'T2' ... 'Tn'.
ja: 推移（Transition）: 'T1', 'T2' ... 'Tn'.
ru: Переход: 'T1', 'T2' ... 'Tn'.
sw: Mpito: 'T1', 'T2' ... 'Tn'.

source: Transition Action: 'TA1', 'TA2' ... 'TAn'.
ja: 推移アクション（Transition Action）: 'TA1', 'TA2' ... 'TAn'.
ru: Переход действий: 'TA1', 'TA2' ... 'TAn'.
sw: Vitendo vya Mpito: 'TA1', 'TA2' ... 'TAn'.

source: Before the creation of the process and its parts is necessary to prepare the system, we will need to define some Queues, Users and Dynamic Fields as well as set some SysConfig options.
ja: プロセスとその部分の生成がシステムを準備するために必要とする前に、いくつかのSysConfigオプションのセット、キュー、ユーザー、動的フィールドを定義する必要があります。
ru: Перед созданием процесса и его частей необходимо подготовить систему. Нужно определить некоторые Очереди, Клиентов и Динамические Поля, а также установить некоторые опции в файле SysConfig.
sw: Kabla ya utengenezaji wa mchakato na viji sehemu vyake ni muhimu kuuandaa mfumo, tutahitaji kufafanua baadhi ya Foleni, Watumiaji na Sehemu Zinazobadilika na pia kuseti baadhi ya machaguo ya SysConfig.

source: Create the following Queues:
ja: 次のキューを作成します：
ru: Создать следующие Очереди:
sw: Tengeneza foleni zifuatazo:

source: Management
ja: 管理： Management
ru: Управление
sw: Usimamizi

source: Employees
ja: 顧客： Employees
ru: Сотрудники
sw: Wafanyakazi

source: Purchasing
ja: 購買：Purchasing
ru: Покупка
sw: Ununuzi

source: Post office
ja: 郵便局： Post office
ru: Почтовое отделение
sw: Ofisi ya posta

source: Create the following Users:
ja: 次のユーザーを作成します。
ru: Создает следующих Пользователей:
sw: Tengeneza watumiaji wafwatao:

source: Manager
ja: 管理者：Manager
ru: Менеджер
sw: Meneja

source: Employee
ja: 顧客：Employee
ru: Сотрудник
sw: Mfanyakazi

source: Create the following Dynamic Fields:
ja: 次の動的フィールドを作成します。
ru: Создать следующие Динамически Поля:
sw: Tengeneza Sehemu Zinazobadilika zifuatazo:

source: Title
ja: タイトル
ru: Название
sw: Mada

source: Label
ja: ラベル
ru: Метка
sw: Lebo

source: Type
ja: タイプ
sw: Aina

source: Object
ja: オブジェクト
ru: Объект
sw: Kitu

source: Ticket
ja: チケット
ru: Заявк
sw: Tiketi

source: Author
ja: 著者
ru: Автор
sw: Mwandishi

source: Status
ja: 状態
ru: Состояние
sw: Hali

source: Possible Values
ja: 可能な値
ru: Возможные значения
sw: Thamani ziwezekanazo

source: Approval
ja: 承認
ru: Утверждение
sw: Kibali

source: Approval denied
ja: 承認拒否
ru: Отказано в утверждении
sw: Kibali kimekataliwa

source: Approved
ja: 承認済
ru: Утвержденный
sw: Kubaliwa

source: Order denied
ja: 注文拒否
ru: Заказ отменен
sw: Oda imekataliwa

source: Order placed
ja: 発注済
ru: Заказ размещен
sw: Oda imewekwa

source: Shipment received
ja: 貨物受取済
ru: Посылка получена
sw: Vilivyosafirishwa vimepokelewa

source: Note: Please use this exactly this possible values for "Key" and "Value" in the Dynamic Field setup.
ja: ノート: フィールド設定の「キー」と「値」は的確に使用して下さい。
ru: Примечание: Используйте именно эти возможные значения для "Ключ" и "Значение" при создании динамических полей.
sw: Kumbuka: Tafadhali tumia thamani hizi ziwezekanazo kwa "Ufunguo" na "Thamani" kwenye usanidi wa Sehemu Zinazobadilika.

source: Supplier
ja: サプライヤー
ru: Поставщик
sw: Msambazaji

source: Price
ja: 価格
ru: Цена
sw: Bei

source: DeliveryDate
ja: 配達日（DeliveryDate）
sw: TareheUwasilishaji

source: Delivery date
ja: 配達日
ru: Дата доставки
sw: Tarehe ya uwasilishaji

source: DateOfReceipt
ja: 受領日（DateOfReceipt）
sw: TareheYaKupokea

source: Date Of Receipt
ja: 受領日
ru: Дата получения
sw: Tarehe Ya Kupokea

source: Set the the following SysConfig settings:
ja: 次のSysConfigの設定をセットします：
ru: Устанавливает следующие параметры SysConfig:
sw: Seti mipangilio ifuatayo ya SysConfig:

source: 'Ticket::Responsible': Yes
ja: 'Ticket::Responsible': はい
sw: 'Tiketi::Kuwajibika':Ndio

source: <emphasis>Key:</emphasis>
ja: <emphasis>キー:</emphasis>
ru: <emphasis>Ключ:</emphasis>
sw: <emphasis>Ufunguo:</emphasis>

source: <emphasis>Content:</emphasis>
ja: <emphasis>コンテンツ:</emphasis>
ru: <emphasis>Содержание:</emphasis>
sw: <emphasis>Maudhui:</emphasis>

source: Book
ja: 本
ru: Книга
sw: Kitabu

source: Title, Author, ISBN
ja: タイトル、著者、ISBN
ru: Название, Автор, ISBN
sw: Mada, Mwandishi, ISBN

source: General
ja: 一般
ru: Общий
sw: Ujumla

source: Order
ja: 注文
ru: Заказ
sw: Oda

source: Price, Supplier, DeliveryDate
ja: 価格、サプライヤー、配達日
ru: Цена, Поставщик, Дада доставки
sw: Bei, Msambazaji, TareheUwasilishaji

source: Shipment
ja: 配送
ru: Отгрузка
sw: Usafirishaji

source: Now lets start with the real Process Management stuff. In the next step, we will define the individual entities that we need.
ja: それでは、実際のプロセス管理職員で開始しましょう。次のステップで、必要とする個々の実体を定義します。
ru: Теперь давайте перейдем к описанию реального процесса. На следующем шаге мы определим конкретные объекты, которые нам необходимы.
sw: Sasa tuanze na mambo ya kweli ya Usimamizi wa Mchakato. Katika hatua inayofwata, tutafafanua vyombo vyenyewe tunavyohitaji.

source: Process (as a container)
ja: プロセス(コンテナーとしての)
ru: Процесс (в качестве контейнера)
sw: Mchakato (kama chombo)

source: To create a new process is necessary to click on the "Process Management" link in the System Administration box in the Admin panel, this will lead to the Process Management Overview screen. After the creation of the process we can create all other entities (or process parts).
ja: 管理者パネル中のシステム管理ボックスの中の「プロセス・マネジメント」リンクをクリックする際には、新しいプロセスを作成することが必要です。これはプロセス・マネジメント概要への通じます。プロセスの生成の後、他のすべての実体(あるいはプロセス部分)を作成することができます。
ru: Для создания нового процесса необходимо перейти к пункту Управление процессами на панели Администратора, после нажатия на который мы попадем на экран Обзора процессов. После создания процесса мы получим возможность создания всех его объектов (всех составляющих процесса).
sw: Kutengeneza mchakato mpya ni muhimu kubofya kwenye kiungo cha "Usimamizi wa Mchakato" katika boksi la Usimamizi wa Mfumo katika paneli ya Msimamizi, hii itakupeleka kwenye skrini ya Mapitio ya Usimamizi wa Mchakato. Baada ya utengenezaji wa mchakato tunaweza kutengeneza vyombo vingine vyote (au sehemu za mchakato).

source: Activities, Activity Dialogs, Transitions and Transition Actions defined in one process will be available for all the processes in the system.
ja: 1つのプロセスの中で定義されたアクティビティ、アクティビティ・ダイアログ、推移および推移アクションは、システムでのすべてのプロセスに利用可能になります。
ru: Деятельности, Диалоги Активности, Переходы и Действия переходов определенные в одном процессе будут доступны для всех процессов системы.
sw: Shughuli, Maongezi ya Shughuli, Mapito na Vitendo vya Mpito vilivyofafanuliwa kwenye mchakato mmoja vitapatikana kwa kila michakato ya mfumo.

source: The OTRS Admin screen - System Administration
ja: OTRS管理者画面 - システム管理。
ru: Страница Администратора OTRS - Администрирование Системы
sw: Skrini ya msimamizi wa OTRS - Usimamizi wa mfumo

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="process-management - screenshot" scale='40' fileref="screenshots/pm-admin-sysadmin.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="プロセス管理 - スクリーンショット" scale='40' fileref="screenshots/pm-admin-sysadmin.png"></graphic>

source: <emphasis>Figure: OTRS Admin screen - System Administration.</emphasis>
ja: <emphasis>図:OTRS管理者画面 - システム管理</emphasis>
ru: <emphasis>Рисунок: Страница Администратора OTRS - Администрирование системы.</emphasis>
sw: <emphasis>Kielelezo: Skrini ya Msimamizi wa OTRS - Usimamizi wa Mfumo .</emphasis>

source: Click on the "Create New Process" action from the Actions box.
ja: アクション・ボックスから「新しいプロセスを作成する」アクションをクリックしてください。
ru: Нажмите на действие "Создать Новый Процесс" в окне Действий.
sw: Bonyeza kitendo cha "Tengeneza mchakato mpya" kutoka kwenye boksi la vitendo.
