Repository: DSigmund/doc-admin
Catalog: i18n/doc-admin.*.po
Languages: ja, ru, sw

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="Adminarea template and queue - screenshot" scale="40" fileref="screenshots/template-queue-relations2.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="管理者エリア テンプレートとキュー - スクリーンショット" scale="40" fileref="screenshots/template-queue-relations2.png"></graphic>

source: <emphasis>Figure: Change Template relations for a Queue.</emphasis>
ja: <emphasis>図:キューのためのテンプレート関係の変更</emphasis>
ru: <emphasis>Рисунок: Изменение связи между Шаблоном и Очередью.</emphasis>
sw: <emphasis>Kielelezo: Badilisha mahusiano ya Kiolezo kwa Foleni.</emphasis>

source: When choosing a template, additional information could be added to the template text, this depends on the template type:
ja: テンプレートを選択するとき追加の情報がテンプレート・テキストに追加できます。これはテンプレートのタイプに依存します：
ru: При выборе шаблона, дополнительная информация должна быть добавлена к тексту шаблона, в зависимости от его типа:
sw: Wakati wa kuchagua kiolezo, taarifa zaidi zinaweza kuongezwa kwenye nakala ya kiolezo, hii inategemea aina ya kiolezo:

source: PhoneCall and Create templates does not add any content to the template text, however New Email Ticket screen adds the queue assigned signature to the resulting email body (this screen has a separated box to visualize the signature).
ja: しかしながら、「電話」とテンプレートの作成はテンプレート・テキストにいかなるコンテンツも追加しません。新規Eメールチケット画面はキューを追加し、そのキューは解決Eメール本文に署名を割り当てます。（この画面は署名を視覚化するための別のボックスを持ちます。）
ru: Шаблоны типа PhoneCall/Звонок клиента и Create/Новая не добавляют никаких дополнительных данных к тексту шаблона, в то время как для типа New Email Ticket/Новая почтовая заявка добавляется подпись, связанная с очередью к телу окончательного тела письма (для отображения подписи открывается отдельный фрейм).
sw: PigaSimu na Tengeneza violezo haiongezi maudhui yoyote kwenye nakala ya kiolezo, bali skrini Mpya ya Barua pepe za Tiketi inaongeza saini iliyogawiwa kwa foleni kwenye kiini cha barua pepe (hii skrini ina boksi lililowekwa pembeni ili kupata taswira ya saini).

source: Answer templates text when selected also included the salutation associated with the queue, then the text of the template, then the quoted ticket text, and finally the signature associated with the queue.
ja: 返答テンプレートテキストは、選択された時、キューに関連づけられて挨拶文を含みます。 それからテンプレートはのテキスト、それから引用されたチケットのテキスト、そして最後はキューに関連付けられた署名も含みます。
ru: В текст шаблона ответа также включается приветствие, связанное с очередью заявки, затем, текст шаблона, после него, цитируемый текст заявки, и, наконец, подпись, связанная с очередью.
sw: Nakala za violezo majibu zikichaguliwa pia zinajumuisha salamu inayohusika na foleni, kisha nakala ya kiolezo, baada ya hapo nukuu ya nakala ya tiketi, na mwisho saini inayohusika na foleni.

source: Forward templates are similar to Answer templates, but they does not include the salutation part.
ja: 転送テンプレートは返答テンプレートと同様ですが、それらは挨拶文部分を含みません。
ru: Шаблоны типа Forward/Переслать аналогичны шаблонам ответов, но в них не включается приветствие.
sw: Violezo vya kupeleka mbele ni sawa Violezo vya majibu, lakini hazi na sehemu ya salamu.

source: Auto responses
ja: 自動応答
ru: Авто ответы
sw: Majibu otomatiki

source: OTRS allows you to send automatic responses to customers based on the occurrence of certain events, such as the creation of a ticket in a specific queue, the receipt of a follow-up message in regards to a ticket, the closure or rejection of a ticket, etc. To manage such responses, click the link "Auto responses" on the Admin page (see Figure below).
ja: OTRSは、特定のイベントが発生に応じて顧客へ自動応答を送信することを可能にします。それらのイベントとは、特定のキュー中のチケットの生成、チケットに関するフォローアップメッセージの受取、チケットの完了か拒否、等です。そのような応答を管理するためには、管理者ページ上でリンク「自動応答」をクリックしてください(下記の図を参照)。
ru: OTRS позволяет отсылать клиентам автоматические ответы при наступлении в системе определенных событий, таких как создание заявки в определенной очереди, прием откликов клиентов на заявку, закрытие или отказ от заявки и т.д. Для управления ответами используйте ссылку "Авто ответы" на Панели Администрирования (см. Рисунок ниже).
sw: OTRS inakuruhusu kutuma majibu otomatiki kwa wateja kutegemeana na kuonekana kwa matukio fulani, kama utengenezaji wa tiketi katika foleni maalumu, upokeaji wa ujumbe wa ufwatiliaji kuhusu tiketi, ufungaji au ukataliwaji wa tiketi, na kadh. Kusimamia majibu haya, bofya kiungo "Majibu otomatiki" kwenye kurasa ya Msimamizi (ona Kielelezo chini).

source: Auto Response management
ja: 自動応答管理
ru: Управление Автоматическими Ответами (автоответами)
sw: Usimamizi wa Majibu Otomatiki

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="Adminarea auto response - screenshot" scale="40" fileref="screenshots/admin-autoresponse.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="管理者エリア 自動応答 - スクリーンショット" scale="40" fileref="screenshots/admin-autoresponse.png"></graphic>

source: <emphasis>Figure: Auto Response management.</emphasis>
ja: <emphasis>図:自動応答管理</emphasis>
ru: <emphasis>Рисунок: Управление Автоматическими ответами (авто-ответами).</emphasis>
sw: <emphasis>Kielelezo: Usimamizi wa Majibu Otomatiki.</emphasis>

source: To create an automatic response, click on the button "Add auto response", provide the needed data and submit it (see Figure below).
ja: 自動応答を作成するために、「自動応答の追加」をボタンをクリックし、必要とされるデータを提供し、送信して下さい(下記の図を参照)。
ru: Чтобы создать новый авто-ответ, нажмите на кнопку "Добавить авто-ответ", введите необходимые данные и нажмите кнопку "Отправить" (см. Рисунок ниже).
sw: Kutengeneza jibu otomatiki, bofya kitufe "Ongeza jibu otomatiki", weka data zinazotakiwa kisha wasilisha (ona kielelezo chini).

source: Adding an Auto Response
ja: 自動応答の追加
ru: Добавление Автоматического ответа (автоответа)
sw: Kuongeza Jibu Otomatiki

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="Adminarea auto response - screenshot" scale="40" fileref="screenshots/add-autoresponse.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="管理者エリア 自動応答 - スクリーンショット" scale="40" fileref="screenshots/add-autoresponse.png"></graphic>

source: <emphasis>Figure: Adding an Auto Response.</emphasis>
ja: <emphasis>図：自動応答の追加</emphasis>
ru: <emphasis>Рисунок: Добавление Автоматического ответа (автоответа).</emphasis>
sw: <emphasis>Kielelezo: Kuongeza Jibu Otomatiki.</emphasis>

source: The subject and text of auto responses can be generated by variables, just as in signatures and salutations. If you insert, for example, the variable &lt;OTRS_CUSTOMER_EMAIL[5]&gt; into the body of the auto answer, the first 5 lines of the customer mail text will be inserted into the auto answer. You will find more details about the valid variables that can be used at the bottom of the screen shown in the Figure.
ja: 署名と挨拶文でそうであったように、自動応答の件名およびテキストは、変数によって生成することができます。例えば、自動応答の本文に可変&lt;OTRS_CUSTOMER_EMAIL[5]&gt;を挿入すれば、顧客メール・テキストの最初の5行が自動応答に挿入されるでしょう。図示された画面の一番下にて使用することができる有効な変数に関するより多くの詳細を見つけるでしょう。
ru: Как и в случае с подписями и приветствиями, тема и текст авто ответа может быть сгенерирована с помощью переменных. Если, например, в текст/тело авто ответа вставить переменную &lt;OTRS_CUSTOMER_EMAIL[5]&gt; , то первые 5 строк текста из письма клиенту будут вставлены в авто ответ. Более подробную информацию о допустимых переменных, которые можно использовать можно найти в нижней части экрана, как это показано на Рисунке.
sw: Mada na nakala ya majibu otomatiki yanaweza kuzalishwa na vishika nafasi, kama saini na salamu. Kama ukiingiza, kwa mfano, kishika nafasi &lt;OTRS_CUSTOMER_EMAIL[5]&gt; kwenye kiini cha jibu otomatiki, mistari 5 ya kwanza ya barua ya mteja itaingizwa kwenye jibu otomatiki. Utapata undani zaidi kuhusu vishika nafasi halali ambavyo vinaweza kutumika upande wa chini wa skrini iliyoonyeshwa kwenye Kielelezo.

source: For every automatic answer, you can specify the event that should trigger it. The system events that are available after a default installation are described in the Table 5-3.
ja: すべての自動返答ではそれをきっかけとすべきイベントを指定することができます。デフォルトのインストレーションの後で利用可能なシステム・イベントはテーブル5-3に述べられています。
ru: Для каждого авто-ответа можно указать специальное событе, при наступлении которого этот авто-ответ будет отсылатся. Предопределенные события, доступные после новой установки приведены в Таблицу 5-3.
sw: Kwa kila jibu otomatiki, unaweza kuweka bayana tukio la kulichochea. Matukio ya mfumo ambayo yanapatikana baada ya usakinishaji wa kawaida yameelezewa katika jedwali 5-3.

source: Events for Auto answers
ja: 自動応答用イベント
ru: События для Автоматических ответов
sw: Matukio kwa majibu Otomatiki

source: auto reply
ja: 自動応答
sw: jibu otomatiki

source: Creation of a ticket in a certain queue.
ja: あるキュー中のチケットの自動返答生成
ru: Создание заявки в определенной очереди.
sw: Utengenezaji wa tiketi katika foleni fulani

source: auto reply/new ticket
ja: 自動応答/新規チケット
sw: jibu otomatiki/tiketi mpya

source: Reopening of an already closed ticket, e.g. if a customer replies to such ticket.
ja: 既に完了チケットへの返信。例えば顧客がそのチケットへ返信した場合
ru: Открытие уже закрытой заявки, например если клиент отвечает на определенную заявку.
sw: Ufunguzi wa tiketi iliyofungwa, mf. mteja akijibu hiyo tiketi.

source: auto follow up
ja: 自動フォローアップ
sw: ufwatiliaji otomatiki

source: Reception of a follow-up for a ticket.
ja: チケットに対するフォローアップの受付
ru: Прием входящих заявок.
sw: Upokeaji wa ufwatiliaji wa tiketi.

source: auto reject
ja: 自動拒否
sw: kukataa kiotomatiki

source: Automatic rejection of a ticket, done by the system.
ja: システムによって行われたチケットの自動拒否
ru: Автоматический отказ от заявки, сделаннный системой.
sw: Ukataaji otomatiki wa tiketi, unafanywa na mfumo.

source: auto remove
ja: 自動削除
sw: ondoa kiotomatiki

source: Deletion of a ticket, done by the system.
ja: システムによって行われたチケットの削除
ru: Удаление заявко, завершенных системой.
sw: Ufutaji wa tiketi, unafanywa na mfumo.

source: As with other OTRS entities, auto responses too cannot be deleted, only deactivated, by setting the Valid option to <emphasis>invalid</emphasis> or <emphasis>invalid-temporarily</emphasis>.
ja: 他のOTRSの実体と同様に、自動応答も単に非活性化されるだけであり、削除はできません。（有効オプションを<emphasis>無効</emphasis>または<emphasis>無効-暫定</emphasis>に設定することによって）
ru: Как и в случае с другими сущностями OTRS, Авто ответы также не могут быть удалены, только деактивированы путем установки опции Действительный в значения <emphasis>не действительный</emphasis> или <emphasis>не действительный-временно</emphasis>.
sw: Kama ilivyo kwa vyombo vingine vya OTRS, majibu otomatiki pia haiwezi kufutwa, inalemazwa tu kwa kuseti chaguo Halali kuwa <emphasis>batili</emphasis> au <emphasis>batili-kwa muda</emphasis>.

source: To add an auto response to a queue, use the "Auto Response &lt;-&gt; Queues" link on the Admin page (see Figure below). All system events are listed for every queue, and an auto answer with the same event can be selected or removed via a listbox.
ja: キューに対する自動応答を加えるためには、管理者ページ上で「自動応答&lt;-&gt; キュー」リンクを使用してください(下記の図を参照)。全てのシステム・イベントは全てのキューのためにリストされます。また、同じイベントを備えた自動応答はリストボックスによって選択するか、削除することができます。
ru: Чтобы добавить авто ответ к очереди, используйте ссылку "Авто Ответы &lt;-&gt; Очереди" в Панели Администрирования (см. Рисунок ниже). Все системные события отображаются для каждой очереди и авто ответ с тем же событием может быть выбран или удален используя список.
sw: Kuongeza majibu otomatiki kwenye foleni, tumia kiungo "Majibu Otomatiki &lt;-&gt; Foleni" kwenye kurasa ya Msimamizi (ona Kielelezo chini). Matukio yote ya mfumo yameorodheshwa kwa kila foleni, na jibu otomatiki kwa tukio hilo hilo linaweza kuchaguliwa au kuondolewa kupitia kisanduku cha orodha.

source: Manage Queue - Auto Response relations
ja: キュー自動応答関連の管理
ru: Управление связью Очередь-Автоматический Ответ
sw: Simamia Foleni - Mahusiano ya Majibu Otomatiki

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="Adminarea queue - auto response - screenshot" scale="40" fileref="screenshots/admin-autoresponse-queue.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="管理者エリア キュー - 自動応答 - スクリーンショット" scale="40" fileref="screenshots/admin-autoresponse-queue.png"></graphic>

source: <emphasis>Figure: Queue-Auto Response relations management.</emphasis>
ja: <emphasis>図:キュー自動応答関連の管理</emphasis>
ru: <emphasis>Рисунок: Управление связью Очередь-Автоматический ответ.</emphasis>
sw: <emphasis>Kielelezo: Usimamizi wa mahusiano ya Foleni-Maajibu Otomatiki.</emphasis>

source: To define the different auto responses that will be available for a queue, click on the corresponding queue name (see Figure below). It is also possible to edit an existing auto response - to do so, click on the response and edit in the same manner as editing a new auto response.
ja: キューに利用可能になる異なる自動応答を定義するためには、対応するキュー名をクリックしてください(下記の図を参照)。さらに、既存の自動応答を編集することは可能です。それには「応答」をクリックして、「新規自動応答を編集」として同じやり方で編集してください。
ru: Чтобы определить различные авто ответы для очереди, нажмите на соответствующее имя очереди (см. Рисунок ниже). Также есть возможность редактировать тот или инной авто ответ, чтобы сделать это, кликните на ответ и внесите необходимые изменения, так как будто создаете новый авто ответ.
sw: Kufafanua majibu otomatiki mbali mbali yatakayopatikana kwa ajili ya foleni, bofya jina la foleni linalohusika (ona kielelezo chini). Pia inawezekana kurekebisha jibu otomatiki lililopo kufanya hivyo, bofya majibu na hariri kwa njia ile ile kama ya kuhariri jibu otomatiki jipya.

source: Change Auto Response relations for a Queue
ja: キュー用の自動応答関連の変更
ru: Изменение связи между Автоматическим Ответом и Очередью
sw: Badilisha mahusiano ya Majibu Otomatiki kwa Foleni

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="Adminarea auto response and queue - screenshot" scale="40" fileref="screenshots/autoresponses-queues-relations.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="管理者エリア 自動応答とキュー - スクリーンショット" scale="40" fileref="screenshots/autoresponses-queues-relations.png"></graphic>

source: <emphasis>Figure: Change Auto Response relations for a Queue.</emphasis>
ja: <emphasis>図:キュー用の自動応答関連の変更</emphasis>
ru: <emphasis>Рисунок: Изменение связи между Автоматическим Ответом и Очередью.</emphasis>
sw: <emphasis>Kielelezo: Badilisha mahusiano ya MAjibu Otomatiki kwa Foleni.</emphasis>

source: Email addresses
ja: Eメール・アドレス
ru: Адреса электронной почты
sw: Anwani za barua pepe

source: To enable OTRS to send emails, you need a valid email address to be used by the system. OTRS is capable of working with multiple email addresses, since many support installations need to use more than one. A queue can be linked to many email addresses, and vice versa. The address used for outgoing messages from a queue can be set when the queue is created. Use the "Email Addresses" link from the Admin page to manage all email addresses of the system (see Figure below).
ja: OTRSがEメールを送ることを可能にするために、システムによって使用されるために有効なEメール・アドレスを必要とします。多くのサポート・インストレーションはひとつ以上の使用する必要があるので、OTRSは複数ので稼働できます。キューは多くのEメール・アドレスにリンクすることができ、その逆も可です。キューが作成されると、キューから送信メッセージとして送信するEメール・アドレスは、セットされます。システムの全てのEメール・アドレスを管理するために、管理者ページから「Eメール・アドレス」リンクを使用してください(下記の図を参照)。
ru: Чтобы OTRS мог отсылать емейлы, нужен действительный адрес электронной почты, который будет использоваться системой. OTRS способен работать с несколькими адресами электронной почты поскольку большинство систем использует больше одного почтового ящика. Очередь может быть связана с несколькими емейл-адресами и наоборот. При создании очереди можно установить адрес электронной почты, который будет использоваться для исходящих писем. Для управления всеми адресами электронной почты системы перейдите по ссылке "Email-адреса" в Панели Администрирования (см. Рисунок ниже).
sw: Kuwezesha OTRS kutuma barua pepe, unahitaji anwani halali ya barua pepe ya kutumika na mfumo. OTRS ina uwezo wa kufanya kazi na barua pepe zaidi ya moja, kwa kuwa usakinishaji mwingi wa msaada unahitaji kutumia zaidi ya moja. Foleni inaweza kuunganishwa na anwani nyingi za baua pepe, na kinyume chake. Anwani inayotumika kwa ujumbe unaotoka kutoka kwenye foleni inaweza kusetiwa wakati foleni inatengenezwa. Tumia kiungo cha "Anwani za Barua pepe" kutoka kwenye kurasa ya Msimamizi kusimamia barua pepe zote za mfumo (ona Kielelezo chini).

source: Managing Email Addresses
ja: システム・Eメール・アドレス管理
ru: Управление Адресами Электронной Почты
sw: Usimamizi wa Anwani za Barua pepe

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="Adminarea email - screenshot" scale="40" fileref="screenshots/admin-email.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="管理者エリア Eメール - スクリーンショット" scale="40" fileref="screenshots/admin-email.png"></graphic>

source: <emphasis>Figure: System Email Addresses management.</emphasis>
ja: <emphasis>図:システム・Eメール・アドレス管理</emphasis>
ru: <emphasis>Рисунок: Управление Системными Адресами Электронной Почты.</emphasis>
sw: <emphasis>Kielelezo: Usimamizi wa Anwani za Barua pepe za mfumo.</emphasis>

source: If you create a new mail address (see Figure below),you can select the queue or sub queue to be linked with it. This link enables the system to sort incoming messages via the address in the To: field of the mail into the right queue.
ja: 新規Eメールアドレス(下記の図を参照)を作れば、それとリンクされるキューかサブキューを選択することができます。このリンクでシステムは受信メッセージをソートすることが可能となります。正しいキューの中で メールのTo;フィールドアドレスによりソートされます。
ru: При создании нового почтового адреса (см. Рисунок ниже) можно выбрать очередь или под-очередь, которая должна быть связана с этим адресом. Эта связь позволяет системе сортировать входящие сообщения по полю "Кому" и разместить заявку в соответствующую очередь.
sw: Ukitengeneza anwani mpya ya barua pepe (ona kielelezo chini), unaweza kuchagua foleni au sehemu ya foleni ya kuunganishwa nayo. Hiki kiungo kinawezesha mfumo kupanga meseji zinazoingia kwa kupitia anwani katika sehemu ya Kwa: ya barua kwenye foleni sahihi.

source: Adding a system Email Address
ja: システム・メール・アドレスの追加
ru: Добавление системного Адреса Электронной Почты
sw: Kuongeza Anwani ya Barua pepe yamfumo

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="Adminarea email - screenshot" scale="40" fileref="screenshots/add-email.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="「管理者エリア Eメール - スクリーンショット」" scale="40" fileref="screenshots/add-email.png"></graphic>

source: <emphasis>Figure: Adding a system Email Address.</emphasis>
ja: <emphasis>図:システム・メール・アドレスの追加</emphasis>
ru: <emphasis>Рисунок: Добавление адреса электронной почты системы.</emphasis>
sw: <emphasis>Kielelezo: Kuongeza Anwani ya Barua pepe ya mfumo.</emphasis>

source: As with other OTRS entities, email addresses cannot be deleted, only deactivated by setting the Valid option to <emphasis>invalid</emphasis> or <emphasis>invalid-temporarily</emphasis>.
ja: 他のOTRSの実体と同様に、Eメール・アドレスも単に非活性化されるだけであり、削除はできません。（有効オプションを<emphasis>無効</emphasis>または<emphasis>無効-暫定</emphasis>に設定することによって）
ru: Как и другие сущности OTRS, емейл адреса не могут быть удалены, только деактивированы, установив опцию Действительный в значение <emphasis>не действительный</emphasis> или <emphasis>не действительный-временно</emphasis>.
sw: Kama ilivyo kwa vyombo vingine vya OTRS, anwani za barua pepe haziwezi kufutwa, zinalemazwa tu kwa kuseti chaguo Halali kuwa <emphasis>batili</emphasis> au <emphasis>batili-kwa muda</emphasis>.

source: Notifications
ja: 通知
ru: Уведомления
sw: Taarifa

source: OTRS allows notifications to be sent to agents and customers, based on the occurrence of certain events. Agents can set the system events for their own notifications via the <link linkend="user-preferences">preferences</link> link.
ja: OTRSは、あるイベントの発生に基づいて担当者や顧客へ通知することが可能です。担当者は、<link linkend="user-preferences">選択（選好）</link> のリンク経由で自身への通知用のシステム・イベントを設定できます。
ru: OTRS позволяет отправлять уведомления агентам и клиентам при наступлении в системе определенных событий. Агенты могут выбрать системные события для своих собственных уведомлений перейдя по ссылке <link linkend="user-preferences">предпочтения</link>
sw: OTRS inaruhusu taarifa kutumwa kwa mawakala na wateja, kwa kutegemea matukio mbali mbali. Mawakala wanaweza kuseti matukio ya mfumo kwa taarifa zao binafsi kupitia kiungo cha <link linkend="user-preferences">mapendeleo</link>.

source: Through the "Agent Notifications" link on the Admin page, you can manage the notifications of your system (see Figure below). You can use filters to list only certain notifications.
ja: 管理者ページの「担当者通知」リンクによって、システムの通知を管理することができます(下記の図を参照)。ある通知だけをリストするためにフィルタを使用することができます。
ru: Используя ссылку "Уведомления Агентов" в Панели Администрирования можно управлять уведомлениями системы (см. Рисунок ниже). Используя фильтры можно быстро найти необходимую информацию.
sw: Kupitia kiungo cha "Taarifa za Wakala" kwenye kurasa ya Msimamizi, unaweza kusimamia taarifa za mfumo wako (ona Kielelezo chini). Unaweza kutumia vichujio kuorodhesha baadhi ya taarifa.

source: Managing Notifications
ja: 通知管理
ru: Управление Уведомлениями
sw: Kusimamia Taarifa

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="Adminarea notifications - screenshot" scale="40" fileref="screenshots/admin-notification.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="管理者エリア 通知 - スクリーンショット" scale="40" fileref="screenshots/admin-notification.png"></graphic>

source: <emphasis>Figure: Notification management.</emphasis>
ja: <emphasis>図:通知管理</emphasis>
ru: <emphasis>Рисунок: Управление уведомлениями.</emphasis>
sw: <emphasis>Kielelezo: Usimamizi wa taarifa.</emphasis>

source: You can customize the subject and the text of the notifications. Click on the notification you want to change from the list, and its content will get loaded for editing (see Figure). Please note that there is a notification with the same name for each of the available languages.
ja: 件名および通知テキストをカスタマイズすることができます。リストから変更したい通知をクリックしてください(図を参照)。そうすれば、内容が編集用にロードされます。利用可能な言語の各々の同じ名前を持った通知があることをご留意ください。
ru: Также есть возможность настроить тему и текст уведомления. Выберите из списка уведомление, которое необходимо изменить и его содержимое будет загружено для редактирования (см. Рисунок). Пожалуйста, обратите внимание, что уведомление с тем же именем доступно для каждого из установленных в вашей системеязыков.
sw: Unaweza kugeuza somo na nakala za taarifa kukufaa. Bofya kwenye taarifa unayotaka kubadilisha kutoka kwenye orodha, na yaliyomo kwenye taarifa yatawekwa tayari kuhaririwa (ona Kielelezo). Tafadhali tambua kuna taarifa zenye majina sawa kwa kila lugha inayopatikana.

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="Adminarea notifications - screenshot" scale="40" fileref="screenshots/customize-notification.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="「管理者エリア 通知 - スクリーンショット」" scale="40" fileref="screenshots/customize-notification.png"></graphic>

source: <emphasis>Figure: Customizing a Notification.</emphasis>
ja: <emphasis>通知のカスタマイズ</emphasis>
ru: <emphasis>Рисунок: Настройка уведомлений.</emphasis>
sw: <emphasis>Kielelezo: Kugeuza Taarifa kukufaa.</emphasis>

source: Just as with signatures and salutations, it is possible to dynamically create the content of a notification, by using special variables. You can find a list of variables at the bottom of the screen shown in the Figure.
ja: 署名と挨拶文でそうであるように、特殊変数の使用により、通知の内容を動的に作成することは可能です。図の中で示される画面最下部の変数のリストを見つけることができます。
ru: Как в случае с подписями и приветствиями, используя специальные переменные можно автоматически создавать контент для уведомлений. В нижней части экрана приводится полный список этих переменных, см. Рисунок.
sw: Kama ilivyo kwa saini na salamu, inawezekana kutengeneza maudhui ya taarifa, kwa kutumia vishika nafasi maalumu. Unaweza kutafuta orodha ya vishika nafasi katika upande wa chini wa skrini iliyoonyeshwa kwenye Kielelezo.
