Repository: DSigmund/doc-admin
Catalog: i18n/doc-admin.*.po
Languages: ja, ru, sw

source: FAQ Connector for the GenericInterface
ja: GenericInterface （一般インターフェイス）のためのFAQコネクター
ru: FAQ коннектор для GenericInterface
sw: Kiungo cha maswali yanayoulizwa mara kwa mara cha Kiolesurachakawaida

source: It is now possible to access the data of the FAQ module (OTRS knowledge database) via web service (GenericInterface). This can be useful to embed FAQ articles on your company website, for example.
ja: ウェブサービス（GenericInterface）経由で FAQモジュール（OTRS知識データベース）のデータにアクセスすることができるようになりました。例えば、これはあなたの会社ウェブサイト上のFAQ記事を埋め込むのに役立ちます。
ru: Появилась возможность доступа к данным модуля FAQ (база знаний OTRS) через веб сервисы (GenericInterface). Это может быть полезно, например, для включения статей FAQ в ваши корпоративные веб сайты.
sw: Sasa inawezekana kuzipata data za moduli za maswali yanayoulizwa mara kwa mara (Hifadhidata ya maarifa ya OTRS) kupitia huduma ya tovuti (KiolesuraChaUjumla). Hii itakuwa ina faida kupachika makala za maswali yanayoulizwa mara kwa mara kwenye tovuti ya kampuni yako, kwa mfano.

source: New features of OTRS 3.1
ja: OTRS 3.1の新しい機能

source: GENERIC INTERFACE - A Web Service Framework
ja: 一般インターフェース - ウェブサービス・フレームワーク

source: GI is a flexible framework to allow web service interconnections of OTRS with third party applications.
ja: GI は、サードパーティー・アプリケーションを持ち、OTRS のウェブサービス相互接続が可能で柔軟なフレームワークです。

source: OTRS can act in both ways - as a provider (server, requested from remote) or requester (client, requesting remotely).
ja: OTRSは、両方の方法で操作可能です - 供給者（サーバ、遠隔操作要求者）あるいは、依頼人（遠隔操作要求する顧客）として。

source: Simple web service connections can be created without programming by configuring the Generic Interface.
ja: 一般インターフェースの設定によりプログラムせずにシンプルなウェブサービス接続を作成することができます。

source: Complex scenarios can be realized by plugging in custom OTRS extensions that add perl code to the GI infrastructure on different architectural layers.
ja: さまざまなアーキテクチャ層のGIインフラストラクチャに Parlコードを追加するカスタムOTRS拡張をプラグインすることによって複雑なシナリオも実現することができます。

source: <emphasis>Connectors</emphasis> expose parts of OTRS to Generic Interface web services.For example, a ticket connector exposes the ticket create/update function, so that they can be used in a web service regardless which network transport is used.
ja: <emphasis>コネクター</emphasis>は、一般インターフェース・ウェブサービスに、OTRSの部分を露出し（向け）ます。たとえば、チケット・コネクターはチケット作成・更新機能に露出し（向け）、その結果、それらはウェブサービスで使用することができます。ウェブサービスがどのネットワークを使用しているかに無関係に。

source: A scheduler daemon process supports asynchronous event handling. This is useful to asynchronously start web service requests from OTRS to another system, after the agent''s request has been answered (e.g. when a ticket has been created). Otherwise, it might block the response, resulting in increased response times for the agent.
ja: スケジューラ・デーモン・プロセスは非同期イベントの取り扱いをサポートします。これは、OTRSから他のシステムまでウェブサービスリクエストを非同期にスタートするために有用です。担当者のリクエストが返答された後で（例えば例えばチケットが作成された時）。そうでなければ、それは担当者の対応時間の増加につながり、対応をブロックするかもしれません。

source: With the Generic Interface, new web services can be configured easily by using existing OTRS modules, without additional code. They can be combined to create a new web service. When configuring a new web service connection, the administrator has to add:
ja: 一般インターフェースで、新しいウェブサービスは、補足コードなしで既存のOTRSモジュールの使用により容易に設定することができます。それらは新しいウェブサービスを作るために組み合わせることができます。新しいウェブサービス接続を設定する場合、管理者は次のことを追加しなければなりません:

source: A new web service in the admin GUI
ja: 管理者用GUIの新しいウェブサービス

source: The basic meta data (Transport type (SOAP), URL etc.) and
ja: 基本的なメタデータ（トランスポート・タイプ（SOAP）、URL等）と

source: Existing operations (part of a connector) and specify for each operation how the data must be mapped (inbound and outbound)
ja: 既存のオペレーション(コネクターの一部)、そして各オペレーションのためにデータをマップ(受信と送信を)される方法をを明示特定します。

source: A Generic Interface Debugger will help the OTRS administrator to check how requests are coming in and how they are handled through the different layers.
ja: 一般インターフェース・デバッガは、OTRS管理者が、リクエストがどのように中へ入るか、また、それらがどのように異なるレイヤーに扱われるかを、チェックするのを助けるでしょう。

source: Current Features
ja: 現在の機能

source: Network transports: SOAP/HTTP. Others like REST and JSON are scheduled to be added in the future depending on customers demand.
ja: ネットワーク・トランスポート： SOAP/HTTP、その他のREST やJSONが、顧客からの要求次第で将来追加される予定です。

source: Configurable data mapping Graphical User Interface for key/value transformations with respect to incoming and outgoing data.
ja: 受信・送信データに関しての キー/値変換用の設定可能なデータマッピング・グラフィカルユーザーインターフェイス。

source: Graphical debugger to check the configuration and flow of information of configured web services.
ja: 設定されたウェブサービスの情報のフローと設定をチェックするグラフィカルなデバッガ。

source: A ticket connector allowing the use of OTRS as a web service for ticket handling.
ja: チケット取り扱いのためのウェブサービスとしてOTRSの使用を可能にするチケット・コネクター。

source: Future Features
ja: 将来の機能

source: Additional network transports (REST, JSON).
ja: 追加のネットワーク・トランスポート(REST、JSON)。

source: The GI will replace the iPhoneHandle as the backend for mobile apps.
ja: GI はモバイル用アプリケーションのバックエンドとして iPhoneHandle に代替されるでしょう。

source: Additional connectors will be added to provide more parts of OTRS for use with web services (e.g. to allow the creation, update, or deletion of agents, users, services or CIs).
ja: 追加のコネクタは、ウェブサービスを使用するOTRSのより多くの部分を提供するために追加されるでしょう。（例えば、担当者、ユーザ、サービスあるいはCIの作成、更新、削除を許可すること）

source: DYNAMIC FIELDS
ja: 動的フィールド

source: The DynamicFields Feature replaces the existing ticket and article FreeText and FreeTime fields with a dynamic structure that will also allow to create custom forms in OTRS.
ja: DynamicFields の機能は、OTRSでユーザー設定のフォームを作成することも可能にする動的構造と、既存のチケットおよび記事 FreeText、および FreeTime フィールドとを代替します。

source: An unlimited amount of fields can be configured using an own graphical user interface for administration.
ja: 自身の管理者用GUIを使って無制限の量のフィールドを設定することができます。

source: The fields can have different types that can be used for both, tickets and articles. Available by default are:
ja: フィールドにはチケットおよび記事の両方のために使用することができる、異なるタイプが存在します。デフォルトで利用可能なものは以下の通りです:

source: Text
ja: テキスト
sw: Nakala

source: Multiline text
ja: 複数行テキスト

source: Checkbox
ja: チェックボックス
sw: Kisanduku tiki

source: Dropdown
ja: ドロップダウン
sw: Kunjuzi

source: Multi-select
ja: 複数選択

source: Date
ja: 日付
sw: Tarehe

source: Date and time
ja: 日時

source: New custom field types (e.g. custom field type dropdown with an external data source) can be added with small effort as the fields are created in a modular, pluggable way.
ja: 新しいカスタム・フィールド・タイプ （例えば外部データ・ソースを伴うカスタム・フィールド・タイプ：ドロップダウン）は、プラグイン接続できるモジュラーで作成されるフィールドとして少ない労力で追加できます。

source: A future scenario is, that DynamicFields can be used for objects other than tickets or in custom modules. For example, a custom module adding objects to handle "orders" in OTRS could use the DynamicFields to attach properties/data to these orders.
ja: 将来のシナリオは以下の通りです。DynamicFieldsは、チケット以外の、あるいはカスタム・モジュール中のオブジェクトに使用することができます。例えばOTRSでは「注文 (order)」を取り扱うオブジェクトを追加するカスタム・モジュールは、これらの「注文」にプロパティ/データ（properties/data）を付加するためにDynamicFields動的フィールドを使うことができます。

source: A database update script will transform historic FreeText fields and related configuration settings into the new structure.
ja: データベース更新スクリプトは、時系列のFreeTextフィールドおよび関連設定を新しい構造に変換します。

source: TICKET MANAGEMENT IMPROVEMENTS
ja: チケット管理の改善点

source: Ticket creation improved
ja: 改善されたチケット生成

source: Multiple email addresses can now be specified as 'To:', 'CC:' or 'BCC:' when creating a new phone or email ticket.
ja: 新規の電話やEメールアドレスを作成する時に、複数のEメールアドレスを'To:', 'CC:' or 'BCC:' として指定できます。

source: Inbound phone call support
ja: 着信呼のサポート

source: Inbound phone calls can now be registered within an existing tickets (until now, only outbound calls were registered).
ja: 着信呼が既存のチケット内に（現在のところ発信呼のみ登録されています）登録されるようになりました。

source: Ticket overview preview improved
ja: 改善されたチケット概要のプレビュー

source: It is now possible to exclude articles of certain sender types (e.g. articles from internal agents) in the SysConfig from being displayed in the overview preview mode.
ja: 特定の送信者のタイプ（例えば内部担当者の記事）の記事を除外することが可能となりました。概要プレビューモードのSysConfig内で表示することができます。

source: A certain article type can be configured which will display articles of that type as expanded by default when the view is accessed.
ja: 閲覧時、特定の記事のタイプ（それはデフォルトで拡張されたタイプ記事を表示します）を設定可能です。

source: Ticket move improved
ja: 改善されたチケットの移動

source: The screen shown after moving a ticket is now configurable. Options are the ticket zoom view (LastScreenView) or the ticket list (LastScreenOverview).
ja: チケットを移動させた後に表示される画面はが設定可能になりました。そのオプションは、チケット・ズーム・ビュー(LastScreenView)あるいはチケット・リスト(LastScreenOverview)です。

source: Bulk action improved
ja: バルク・アクション（Bulk action）の改善

source: With the new bulk action, outbound emails can now be sent from multiple tickets at the same time. As tickets can have different queues, and these queues each can have different templates, salutations and signatures, these are not used in the Bulk Action email.
ja: 新規のバルク・アクションにて、同時に複数のチケットからEメールを発信可能になりました。チケットは異なるキューをもち、これらのキューは各々異なるテンプレート、挨拶文、署名を持ちます。これらはBulk Action Eメールでは使用されません。

source: An additional bulk action allows configuring the ticket type for selected tickets.
ja: 追加のバルク・アクションは選択したチケットに対してチケット・タイプを設定することを可能にします。

source: Configurable Reject Sender Email Address
ja: 構成可能な受信拒否するEメール・アドレス

source: The feature allows configuring an email address instead of the administrator address to reject the creation of new tickets by email. This feature can be used in all cases where customers are not allowed to create new tickets by email.
ja: この機能は、メールによって新規チケットの作成を拒否するために administrator アドレスの代わりとなるEメールアドレスを構成することを許可します。この機能は、顧客がメールで新規チケットを作成できないような全てのケースで使われます。

source: PROCESS AUTOMATION
ja: プロセス・オートメーション

source: Escalation events added
ja: 追加されたエスカレーション・イベント

source: OTRS will now create events for each of the available escalation types (response, update and resolution). This allows performing actions (such as notifications) before the escalation occurs, in the moment it occurs, and in the moment that the escalation ends.
ja: OTRSは、利用可能なエスカレーション・タイプ(返答、更新あるいは解決)を作成することができるようになりました。この機能は、エスカレーションが発生する前後、あるいは発生しているまさにその瞬間に行動（たとえば通知）をとることを可能にします。

source: Notification mechanism improved
ja: 改善された通知メカニズム

source: A new generic agent notification module allows the OTRS administrator to define messages that will be shown in the agent web front-end when agents log into the system.
ja: 新しい一般担当者向け通知モジュールは OTRS管理者がメッセージを定義できるようにしました。そのメッセージは、担当者がシステムにログインする時に担当者のウェブフロントエンドに表示されます。

source: Time calculation improved
ja: 時間計算の改善

source: All kinds of times will now be calculated by and based on the application server only solving the issues that were caused by variances between the clock times of application and data base servers.
ja: すべての時間類は、アプリケーション・サーバーによってあるいは基づいて計算されます。アプリケーションとデータ間の時計の時刻の変数に起因する問題を解決するためです。

source: GenericAgent improved
ja: 改善されたGenericAgent（一般担当者）

source: The GenericAgent can now filter for tickets change time.
ja: GenericAgentはチケットの変更時間に対してフィルターできるようになりました。

source: In addition, the GenericAgent can set the ticket responsible for matched tickets.
ja: さらに、GenericAgentは一致したチケットの責任者を設定可能になりました。

source: USER INTERFACE, RICH TEXT EDITOR, CHARSET
ja: ユーザ・インターフェース、リッチ・テキストエディター、CHARSET（文字セット）

source: User interface performance improved
ja: 改善されたユーザ・インターフェース・パフォーマンス

source: The speed for rendering and article display was improved, thanks to Stelios Gikas &lt;stelios.gikas@noris.net&gt;!
ja: レンダリングのスピードと記事表示速度が改善されました。（Stelios Gikas&lt;stelios.gikas@noris.net&gt;に感謝！）

source: Rich Text Editor Update
ja: リッチ・テキストエディターのアップデート

source: IOS5 support added.
ja: IOS5 のサポートを追加

source: Block quotes can be left with the enter key.
ja: ブロック引用はエンター・キーで終了します。

source: Update from CKEditor 3.4 to CKEditor 3.6, so improvements refer to the releases of <ulink url="http://ckeditor.com/blog/CKEditor_3.5_released">CKEditor 3.5</ulink> and <ulink url="http://ckeditor.com/blog/CKEditor_3.6_released">CKEditor 3.6</ulink>.
ja: CKEditorのバージョンは3.4から3.6にアップデートされ、その改善は<ulink url="http://ckeditor.com/blog/CKEditor_3.5_released">CKEditor 3.5</ulink>および<ulink url="http://ckeditor.com/blog/CKEditor_3.6_released">CKEditor 3.6</ulink>のリリースを参照下さい。

source: IE9 support improved.
ja: IE9サポートを改善しました。

source: Resizable dialogs.
ja: サイズ変更可能なダイアログ。

source: Unicode Support - Non-UTF-8 Internal Encodings Dropped
ja: Unicodeサポート - 内部エンコードとしてUTF-8以外を非サポート

source: UTF-8 is now the only allowed internal charset of OTRS.
ja: UTF-8はOTRSの許可された内部唯一のキャラクタセットとなりました。

source: All language files are now formatted in UTF-8, which simplifies their handling and future improvements of the translation mechanism.
ja: 言語ファイルはすべてUTF-8にフォーマットされるようになりました。それは、言語ファイルの取扱いと将来的な翻訳メカニズムの改善を簡略化します。

source: DATABASE DRIVER SUPPORT
ja: データベース・ドライバーのサポート

source: PostgreSQL DRIVER compatibility improved
ja: 改善されたPostgreSQLドライバー互換性

source: PostgreSQL 9.1 support added.
ja: PostgreSQL 9.1 のサポート追加。

source: A new legacy driver is now available for PostgreSQL 8.1 or earlier versions.
ja: レガシーのドライバーは、PostgreSQL 8.1以前のバージョンで利用可能になりました。

source: MS SQL DRIVER compatibility improved
ja: 改善されたMs SQLドライバー互換性

source: The MS SQL driver now stores binary data in VARBINARY rather than deprecated type TEXT as well as NVARCHAR to store text strings rather than VARCHAR (for improved Unicode support).
ja: MS SQL ドライバーは、あまり使われなくなったタイプのTEXTよりも、バイナリデータをVARBINARYに格納します。また、同様に、テキスト文字列を保存するためにVARCHARよりもNVARCHARに格納します。（改善されたユニコードのサポートのため）

source: MAIL INTEGRATION
ja: Eメールの統合

source: Mail handling improved
ja: 改善されたEメール取り扱い

source: When connecting to IMAP mail accounts, it is now possible to handle emails from a specific email folder, aside from the INBOX folder.
ja: IMAP Eメールアカウントに接続時、INBOXフォルダーに加えて特定のEメール・フォルダーからのEメールを扱うことができるようになりました。

source: OTRS can now connect to IMAP servers using Transport Layer Security (TLS), which is useful for modern restricted environments.
ja: OTRSは、トランスポート層セキュリティ(TLS)を使用して最新の制約された環境でIMAPサーバに接続できます。

source: Hardware and software requirements
ja: ハードウェアとソフトウェアの必要条件
ru: Требования к апаратному и програмному обеспечению
sw: Mahitaji ya programu na vifaa

source: OTRS can be installed on many different operating systems. OTRS can run on linux and on other unix derivates (e.g. OpenBSD or FreeBSD). You can also run it on Microsoft Windows. OTRS does not have excessive hardware requirements. We recommend using a machine with at least a 2 GHz Xeon or comparable CPU, 2 GB RAM, and a 160 GB hard drive for a small setup.
ja: OTRSは、様々なオペレーティング・システムにインストールすることができます。OTRSはlinuxおよび他のunix派生的(例えばOpenBSDまたはFreeBSD)の上で走らせることができます。さらに、マイクロソフト・ウィンドウズ上でそれを実行することができます。OTRSには過度のハードウェア要件がありません。最少構成のセットアップのためには、最低Xeon - 2GHz またはその互換CPU、2GB RAM, 160GB HDDのマシンをご利用されることをお勧めします。
sw: OTRS inaweza kusakinishwa katika mifumo endeshi tofauti. OTRS inaweza kufanya kazi kwenye Linux na mifumo mingine ya Unix (mf. OpenBSD au FreeBSD). Unaweza kuitumia pia katika Microsoft Windows. OTRS haina mahitaji mengi ya vifaa. Tunashauri kutumia mashine yenye japo 2 GHz Xeon au CPU inayoendana nayo, 2 GB RAM, na kiendeshi diski kuu chenye 160 GB kwa ajili ya mpangiio mdogo.

source: To run OTRS, you'll also need to use a web server and a database server. Apart from that, you should install perl and/or install some additional perl modules on the OTRS machine. The web server and <application>Perl</application> must be installed on the same machine as OTRS. The database back-end may be installed locally or on another host.
ja: さらに、OTRSを実行するために、ウェブサーバとデータベース・サーバを使用する必要があるでしょう。それとは別に、<application>perl</application>をインストールし、かつ、またはいくつかの追加のperlモジュールをOTRSマシンにインストールするべきです。OTRSと同じマシンにウェブサーバとパールをインストールしなければいけません。データベース・バックエンドは、ローカルにあるいは別のホスト上でインストールしても結構です。
ru: Если вы хотите использовать OTRS, вам потребуются некоторые другие компоненты програмного обеспечения. Основные требования к програмному обеспечению: веб-сервер и сервер баз данных, рабочая среда для выполнения Perl с некоторыми дополнительными модулями. Веб-сервер и <application>Perl</application> должны быть установлены на той же машине что и OTRS. База данных может быть установлена на локальной машине или же на другом хосте.
sw: Kuanzisha OTRS, utahitaji pia kutumia seva ya wavuti na seva ya hifadhidata. Kuachana na hilo, unatakiwa kusakinisha perl na/au kusakinisha baadhi ya moduli za ziada za perl kwenye mashine ya OTRS. Seva ya wavuti na <application>Perl</application> lazima zisakinishwe kwenye mashine sawa na OTRS. Mazingira ya nyuma ya hifadhidata yanaweza kusakinishwa kwa ndani au kwenye mwenyeji mwingine.

source: For the web server, we recommend using the <application>Apache HTTP Server</application>, because its module mod_perl greatly improves the performance of OTRS. Apart from that, OTRS should run on any web server that can execute Perl scripts.
ja: ウェブサーバについては、<application>Apache HTTP Server</application>の利用をお勧めします。そのモジュールmod_perlがOTRSの性能を非常に改善するためです。それとは別に、OTRSは、Perlスクリプトを実行することができるウェブサーバ上で走らせるべきです。
ru: В качестве веб-сервера, мы рекомендуем использовать <application>apache 2</application>. Это связано с тем, что его модуль mod_perl позволяет существенным образом улучшить производительность OTRS. Если у вас нету возможности использовать Apache в качестве веб-сервера, OTRS может работать на любом другом веб-сервере, поддерживающем выполнение Perl-скриптов.
sw: Kwa ajili ya seva ya tovuti, tunashauri utumiaji wa <application>Seva ya Apache HTTP</application>, kwasababu moduli yake ya mod_perl inaboresha kwa asilimia kubwa utendaji wa OTRS. Kuachana na hilo, OTRS inatakiwa kufanya kazi katika seva yoyote ya tovuti ambayo inaweza kutekeleza hati za Perl.

source: You can deploy OTRS on different databases. You can choose between <application>MySQL</application>, <application>PostgreSQL</application>, <application>Oracle</application>, or <application>Microsoft SQL Server</application>. If you use <application>MySQL</application> you have the advantage that the database and some system settings can be configured during the installation, through a web front-end.
ja: 異なるデータベース上のOTRSを展開させることができます。<application>MySQL</application>、<application>PostgreSQL</application>、<application>Oracle</application>あるいは<application>Microsoft SQL Server</application>のいずれかを選択可能です。<application>MySQL</application>を使用すれば、ウェブ・フロントエンドによって、インストール中にデータベースおよびいくつかのシステム・セッティングを設定することができるという長所を持ちます。
ru: В качестве базы данных, можно использовать <application>MySQL</application>, <application>PostgreSQL</application>, <application>Oracle</application> или <application>MSSQL</application>. В случае использования <application>MySQL</application> в качестве сервера базы данных - есть возможность задать некоторые настройки посредством веб-интерфейса, при установке системы.
sw: Unaweza kutumia OTRS katika hifadhidata tofauti. Unaweza kuchagua kati ya <application>MySQL</application>, <application>PostgreSQL</application>, <application>Oracle</application>, au <application>Microsoft SQL Server</application>. Kama ukitumia <application>MySQL</application> una faida kwamba hifadhidata na baadhi ya mipangilio ya mfumo inaweza kusanidiwa wakati wa usakinishaji, kupitia mazingira ya mbele ya wavuti.

source: For <application>Perl</application>, we recommend using at least version 5.8.8. You will need some additional modules which can be installed either with the Perl shell and CPAN, or via the package manager of your operating system (<application>rpm</application>, <application>yast</application>, <application>apt-get</application>).
ja: <application>Perl</application>は最低バージョン5.8.8を使用することを推奨します。Perl・シェルおよびCPANで、あるいはオペレーティング・システム(<application>rpm</application>および<application>yast</application>、<application>apt-get</application>)のパッケージ・マネージャーによってインストールすることができるいくつかの追加モジュールを必要とするでしょう。

source: Software requirements
ja: ソフトウェア必要条件
ru: Требования к програмному обеспечению
sw: Mahitaji ya programu

source: Perl support
ja: Perlサポート
ru: поддержка Perl
sw: Usaidizi wa perl

source: Perl 5.10 or higher
ja: Perl 5.10以上
ru: Perl 5.10 или выше
sw: Perl 5.10 au zaidi

source: Web server support
ja: ウェブサーバ・サポート
ru: Поддержка Веб-сервера
sw: Usaidizi wa seva ya wavuti

source: Apache2 + mod_perl2 or higher (recommended)
ja: Apache2 + mod_perl2、またはそれ以上(推奨)
ru: Apache2 + mod_perl2 или выше (рекомендуется)
sw: Apache2 + mod_perl2 au zaidi (inapendekezwa)

source: Webserver with CGI support (CGI is not recommended)
ja: CGIサポート(CGIは非推奨)を備えたウェブサーバー
ru: Веб-сервер с поддержкой CGI-интерфейса (CGI-интерфейс не рекомендуется)
sw: Seva ya wavuti yenye usaidizi wa CGI (CGI haipendekezwi)

source: Microsoft Internet Information Server (IIS) 6 or higher
ja: マイクロソフト・インターネット・インフォメーション・サーバー(IIS)6以上
sw: Microsoft Internet Information Server (IIS) 6 au zaidi

source: Database support
ja: データベース・サポート
ru: Поддержка базы данных
sw: Usaidizi wa hifadhidata

source: MySQL 5.0 or higher
ja: MySQL 5.0以上
ru: MySQL 5.0 или выше
sw: MySQL 5.0 au zaidi

source: PostgreSQL 8.0 or higher (8.2 or higher recommended)
ja: PostgreSQL 8.0以上(8.2以上推薦)

source: Oracle 10g or higher
ja: Oracle 10g以上
ru: Oracle 10g или выше
sw: Oracle 10g au zaidi

source: Microsoft SQL Server 2005 or higher
ja: Microsoft SQL Server 2005以上
sw: Microsoft SQL Server 2005 au zaidi

source: The section in the manual about <link linkend="installation-of-perl-modules">installation of Perl modules</link> describes in more detail how you can set up those which are needed for OTRS.
ja: <link linkend="installation-of-perl-modules">Perl・モジュールのインストール</link>に関するマニュアル中のセクションは、OTRSに必要とされるものをどのようにセット・アップすることができるかをより詳細に説明しています。
ru: Раздел руководства <link linkend="installation-of-perl-modules">установка Perl-модулей</link> более подробно описывает как можно настроить модули, необходимые для работы OTRS.
sw: Hiki kifungu katika mwongozo kuhusu <link linkend="installation-of-perl-modules">usakinishaji wa moduli za Perl</link> kinaelezea kwa undani jinsi unavyoweza kuanzisha vile vinavyohitajika na OTRS.

source: If you install a binary package of OTRS, which was built for your operating system (rpm, Windows-Installer), either the package contains all Perl modules needed or the package manager of your system should take care of the dependencies of the Perl modules needed.
ja: あなたがOTRS(それらはあなたのオペレーティング・システム(rpm、Windowsインストーラー)のために構成された)のバイナリ・パッケージをインストールする場合、パッケージはPerl・モジュールをすべて含んでいるか、あるいは、システムのパッケージ・マネージャーは、Perl・モジュールの依存性に留意する必要があります。

source: Web browser support
ja: ウェブブラウザー・サポート
ru: Поддержка веб-браузера
sw: Usaidizi wa kivinjari wavuti

source: To use OTRS, you'll be OK if you use a modern browser with JavaScript support enabled. We do not support the following browsers:
ja: OTRSを使用するために、JavaScriptをサポートする最新のブラウザを使用すれば、問題ありません。次のブラウザはサポートしません:

source: Internet Explorer before version 8
ja: Internet Explorer バージョン 8 以前
ru: Браузер Internet Explorer до 8 версии
sw: Internet Explorer kabla ya toleo la 8

source: Firefox before version 10
ja: Firefox バージョン 10 以前
ru: Браузер Firefox до 10 версии
sw: Firefox kabla ya toleo la 10

source: Safari before version 5
ja: Safari バージョン 5 以前
ru: Браузер Safari до 5-й версии
sw: Safari kabla ya toleo la 5

source: We recommend always using the latest version of your browser, because it has the best JavaScript and rendering performance. Dramatical performance varieties between the used browsers can occur with big data or big systems. We are happy to consult you on that matter.
ja: ブラウザの最新バージョンを常に使用することを推奨します。それは最良のJavaScriptとレンダリングパフォーマンスを有するためです。巨大なデータあるいは巨大なシステムでブラウザを使うとそのパフォーマンスに劇的な違いが生じます。その問題に関してご意見頂ければうれしく思います。
ru: Мы рекомендуем использовать самые последние версии браузеров, т.к. они обладают лучшей производительностью JavaScript и производительность рендеринга. Критическая разница в производительности на разных браузерах может возникать при больших объемах данных или в "тяжелых"системах. Мы всегда рады оказать помощь в таких случаях.
sw: Tunashauri mara zote kutumia toleo la hivi karibuni la kivinjari chako, kwa sababu ina utendaji bora wa JavaScript na utungilizaji. Utofauti mkubwa wa utendaji kati ya vivinjari vilivyotumika unaweza kutokea na data nyingi au mifumo mikubwa.Tunafurahia kukushauri katika suala hili.
