Repository: DSigmund/doc-admin
Catalog: i18n/doc-admin.*.po
Languages: ja, ru, sw

source: System Configuration
ja: システム構成
ru: Настройка Системы
sw: Usanidi wa Mfumo

source: OTRS config files
ja: OTRS構成ファイル
ru: Конфигурационные файлы OTRS
sw: Mafaili ua usanidi wa OTRS

source: All OTRS configuration files are stored in the directory <filename>Kernel</filename> and in its subdirectories. There is no need to manually change any other file than <filename>Kernel/Config.pm</filename>, because the rest of the files will be changed when the system gets upgraded. Just copy the configuration parameters from the other files into <filename>Kernel/Config.pm</filename> and change them as per your needs. This file will never be touched during the upgrade process, so your manual settings are safe.
ja: OTRS構成ファイルはすべてディレクトリ<filename>Kernel</filename>およびそのサブディレクトリに格納されます。システムがアップグレードされる時、残りのファイルは変更されるので、<filename>Kernel/Config.pm</filename>以外のファイルを手動で変更する必要はありません。構成パラメータを他のファイルから<filename>Kernel/Config.pm</filename>に単にコピーして、必要に応じてそれらを変更してください。このファイルがアップグレード・プロセス中に接触されることはなので手動構成は安全に実施できます。
ru: Все конфигурационные файлы OTRS хранятся в директории <filename>Kernel</filename> и ее поддиректориях. Нет необходимости изменять другие файлы кроме <filename>Kernel/Config.pm</filename>, потому что остальные файлы будут изменены, после обновления системы. Просто скопируйте конфигурационные параметры из других файлов в <filename>Kernel/Config.pm</filename> и измените их в соответствии с вашими потребностями. Этот файл никогда не будет затронут во время обновления, так что настройки, которые вы произвели вручную будут сохранены.
sw: Mafaili yote ya usanidi ya OTRS yanahifadhiwa katika mpangilio orodha <filename>Kernel</filename> na katika sehemu zake ndogo. Hakuna haja ya kubadilisha kwa mikono faili jingine zaidi ya <filename>Kernel/Config.pm</filename>, kwa sababu mafaili yaliyobaki yatabadilishwa mfumo ukiboreshwa. Nakili parameta za usanidi kutoka mafaili mengine kwenda <filename>Kernel/Config.pm</filename> na zibadilishe kutegemeana na mahitaji yako. Hili faili halitaguswa wakati wa mchakato wa kuboreshwa, kwahiyo mipangilio yako ya mikono iko salama.

source: In the directory <filename>Kernel/Config/Files</filename> there are some other files that are parsed when the OTRS login page is accessed. If additional applications like the FAQ or the File Manager are installed, the configuration files for those can also be found in the mentioned path.
ja: ディレクトリ <filename>Kernel/Config/Files</filename>では、OTRSログイン・ページにアクセス時に、解析される他のいくつかのファイルがあります。FAQまたはファイル・マネージャーのような追加アプリケーションがインストールされている場合、それらのための構成ファイルも上記パスで見つけることができます。
ru: В каталоге <filename>Kernel/Config/Files</filename> есть некоторые другие файлы, которые передаются, когда запускается страница входа в OTRS. Если установлены дополнительные приложения, такие как FAQ (ЧАВО) или Менеджер Файлов, то их конфигурационные файлы также могут быть найдеты по указанному пути.
sw: Katika mpangilio orodha <filename>Kernel/Config/Files</filename> kuna mafaili mengine ambayo yanachanganuliwa wakati kurasa ya kuigia ya OTRS inafikiwa. Kama programu-tumizi za ziada kama Maswali yanayoulizwa mara kwa mara au Meneja Mafaili zimesakinishwa, mafaili ya usanidi ya hizi pia yanaweza kupatikana katika njia iliyotajwa.

source: If the OTRS web interface is accessed, all .xml files in the <filename>Kernel/Config/Files</filename> directory are parsed in alphabetical order, and the settings for the central framework and additional applications will be loaded. Afterwards, the settings in the files <filename>Kernel/Config/Files/ZZZAAuto.pm</filename>, <filename>Kernel/Config/Files/ZZZAuto.pm</filename> and <filename>Kernel/Config/Files/ZZZProcessManagement.pm</filename> (if it exists) will be evaluated. These files are used by the graphical interface for system configuration caching and should never be changed manually. Lastly, the file <filename>Kernel/Config.pm</filename> that contains your individual settings and manually changed configuration parameters, will be parsed. Reading the configuration files in this order makes sure that your specific configuration settings are used by the system.
ja: OTRSウェブ・インターフェースがアクセスされる場合、<filename>Kernel/Config/Files</filename>ディレクトリ中の.xmlファイルはすべて、ABC順と設定でで解析されます。また、中央のフレームワークおよび追加アプリケーションのための設定がロードされるでしょう。後で、<filename>Kernel/Config/Files/ZZZAAuto.pm</filename>、<filename>Kernel/Config/Files/ZZZAuto.pm</filename> と<filename>Kernel/Config/Files/ZZZProcessManagement.pm</filename> といったファイル(もし存在していれば)の設定は、評価されるでしょう。これらのファイルはグラフィカル・インターフェースによってシステム構成キャッシングに使用され、手動で変更されるべきではありません。最後に、個々のセッティングおよび手動で変更された構成パラメータを含んでいるファイル <filename>Kernel/Config.pm</filename>は解析されるでしょう。この順に構成ファイルを読めば、あなたの特別な構成設定がシステムによって使用されることを確実にします。
ru: Если веб-интерфейс OTRS доступен - все .xml-файлы из директории <filename>Kernel/Config/Files</filename> анализируются в алфавитном порядке, затем подгружаются настройки главного фреймворка и дополнительных приложений. Затем, будут применены настройки в двух файлах <filename>Kernel/Config/Files/ZZZAAuto.pm</filename> и <filename>Kernel/Config/Files/ZZZAuto.pm</filename> и <filename>Kernel/Config/Files/ZZZProcessManagement.pm</filename> (если он существует). Эти файлы используются графическим веб-интерфейсом конфигурации системы и никогда не должны редактироваться вручную. Последним применяется файл <filename>Kernel/Config.pm</filename>, который содержит индивидуальные настройки и параметры конфигурации, изменяемые вручную. Чтение конфигурционных файлов в таком порядке гарантирует, что специфические параметры вашей конфигурации будут использованы системой.
sw: Kama kiolesura cha tovuti cha OTRS kimefikiwa, mafaili yote ya .xml katika mpangilio orodha wa <filename>Kernel/Config/Files</filename> yanachanganuliwa katika mpangilio wa alfabeti, na mipangilio ya kiunzi cha kati na programu-tumizi za ziada zitapakiwa. Baada ya hapo, mipangilio ya kwenye mafaili <filename>Kernel/Config/Files/ZZZAAuto.pm</filename>, <filename>Kernel/Config/Files/ZZZAuto.pm</filename> na <filename>Kernel/Config/Files/ZZZProcessManagement.pm</filename> (kama lipo) yata tathminiwa. Haya mafaili yanatumiwa na kiolesura michoro kwa ajili ya kuhifadhi kwa muda usanidi wa mfumo na hayatakiwi kubadilishwa kwa mikono kamwe. Mwisho, faili <filename>Kernel/Config.pm</filename> lenye mipangilio yako na parameta zilizobadilishwa kwa mikono, litachanganuliwa. Kusoma mafaili ya usanidi kwa mpangilio huu inahakikisha kwamba mipangilio yako maalumu inatumiwa na mfumo.

source: Configuring the system through the web interface
ja: ウェブインターフェースによるシステムの構成
ru: Настройка системы через графический веб-интерфейс
sw: Usanidi wa mfumo kupitia kiolesura cha mtandao

source: Since OTRS 2.0, nearly all configuration parameters of the central framework or additional installed applications, can be changed easily with the graphical interface for system configuration. Log in as OTRS administrator and follow the SysConfig link on the Admin page to execute the new configuration tool (see Figure below).
ja: OTRS 2.0以降は、中央フレームワークまたは追加でインストールされたアプリケーションのほぼすべての構成パラメタは、システム構成用グラフィカル・インターフェースで簡単に変更することができるので、新規構成ツールを実行するため、OTRS管理者としてログインして、管理者ページのSysConfigリンクをたどってください(下記の図を参照)。
ru: Начиная с версии OTRS 2.0 и в последующих версиях, с помощью графического веб-интерфейса для настройки системы можно легко изменить почти все конфигурационные параметры центального фреймворка и дополнительно установленных модулей . Для его использования, войдите в систему как OTRS-администратор и перейдите по ссылке Конфигурация системы/SysConfig в Панели Администрирования (см. Рисунок ниже).
sw: Tangu OTRS 2.0, karibu parameta zote za usanidi za kiunzi cha kati au vya programu-tumizi za ziada zilizosakinishwa, zinaweza kubadilishwa kirahisi na kiolesura michoro cha mfumo. Ingia kama msimamizi wa OTRS na fuata kiungo cha SysConfig katika kurasa ya Msimamizi kutekeleza kifaa kipya cha usanidi (ona Kielelezo chini).

source: The graphical interface for system configuration
ja: システム構成用のグラフィカル・インターフェース
ru: Графический интерфейс для настройки системы
sw: Kiolesura michoro cha usanidi wa mfumo

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="sysconfig - screenshot" scale="40" fileref="screenshots/admin-sysconfig.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="sysconfig（シスコンフィグ）） - スクリーンショット" scale="40" fileref="screenshots/admin-sysconfig.png"></graphic>

source: <emphasis>Figure: The graphical interface for system configuration.</emphasis>
ja: <emphasis>図:システム構成用のグラフィカル・インターフェース</emphasis>
ru: <emphasis>Рисунок: Графический интерфейс для настройки системы.</emphasis>
sw: <emphasis>Kielelezo: Kiolesura mchoro cha usanidi wa mfumo.</emphasis>

source: OTRS currently has over 600 configuration parameters, and there are different ways to quickly access a specific one. With the full text search, all configuration parameters can be scanned for one or more keywords. The full text search not only searches through the names of the configuration parameters, but also through the descriptions of the parameters. This allows an element to be found easily even if its name is unknown.
ja: OTRSは、現在600以上の構成パラメタを持っていて、特定のものに素早くアクセスする異なる複数の方法があります。全文検索で、構成パラメタはすべて1つ以上のキーワードでスキャンできます。全文検索は、構成パラメタの名前だけでなくパラメタの記述を通じても検索します。これによりその名前を知らなくとも要素を容易に見つけることができます。
ru: Поскольку в настоящее время в OTRS имеется больше 600 параметров конфигурации, есть несколько различных способов быстрого доступа к специфическим настройкам. Используя полнотекстовый поиск можно просмотреть все конфигурационные параметры на предмет совпадения с определенным ключевым словом. Полнотекстовый поиск ищет совпадения не только в названиях конфигурационных параметров, но также и в их описаниях. Это позволяет найти тот или инной элемент даже в том случае если его название неизвесно.
sw: OTRS kwa sasa ina zaidi ya parameta za usanidi 600, na kuna njia tofauti za kufikia kila moja kirahisi. Kwa utafutaji wa nakala kamili, parameta zote za usanidi zinaweza kutafutwa kwa kutumia herufi moja au mbili za muhimu. Utafutaji wa nakala huru hautafuti tu kwenye majina ya parameta za usanidi, bali pia kwenye maelezo ya parameta. Hii inafanya elementi kupatikana kirahisi hata kama jina lake halijulikani.

source: Furthermore, all configuration parameters are sorted in main groups and sub groups. The main group represents the application that the configuration parameter belongs to, e.g. "Framework" for the central OTRS framework, "Ticket" for the ticket system, "FAQ" for the FAQ system, and so on. The sub groups can be accessed if the application is selected from the groups listbox and the "Select group" button is pressed.
ja: 更に、全ての構成パラメタはメイングループおよびサブグループの中でソートされます。メイングループは、構成パラメタが属するアプリケーションを意味します。例えば中央のOTRSフレームワーク用「フレームワーク」、チケット・システムの「チケット」、FAQシステム用の「FAQ」などです。アプリケーションがグループ・リストボックスから選択され、「グループ選択」ボタンが押される場合、サブグループにアクセスすることができます。
ru: Кроме этого, все параметры конфигурации отсортированы по основным группам и подгруппам. Главная группа представляет собой приложение соостоящие из подгрупп "Framework" для главного OTRS-фреймворка, "Ticket" для системы обработки заявок, "FAQ" - для системы ответов и вопросов и так далее. Подгруппы могут быть доступны если приложение выбирается из списка групп "Выборор групп" кнопка нажата.
sw: Kwa zaidi, parameta zote za usanidi zinapangwa katika makundi muhimu na makundi madogo. Makundi muhimu yanawakilisha programu-tumizi ambazo parameta za usanidi zipo ndani yake, mf. "Kiunzi" kwa ajili ya kiunzi cha kati cha OTRS, "Tiketi" kwa ajili ya mfumo wa tiketi, "Maswali yanayoulizwa Mara kwa Mara" kwa ajili ya mfumo wa Maswali yanayoulizwa Mara kwa Mara, na kadhalika. Makundi madogo yanaweza kufikiwa kama programu-tumizi imechaguliwa kutoka kwenye boksi la orodha ya makundi na kitufe cha "Chagua kundi" kimebonyezwa.

source: Every configuration parameter can be turned on or off via a checkbox. If the parameter is turned off, the system will ignore this parameter or use a default. It is possible to switch a changed configuration parameter back to the system default using the Reset link. The Update button submits all changes to system configuration parameters.
ja: すべての構成パラメタはチェックボックスからオン・オフできます。パラメタをオフにすれば、システムはこのパラメタを無視するかまたはデフォルトを使用します。リセット用リンクを使用して、変更した構成パラメタをシステム・デフォルトへ戻し切り替えることは可能です。アップデート・ボタンですべてのシステム構成パラメタへの変更を送信します。
ru: Каждый параметр конфигурации может быть "включен" или "выключен" с помощью флажка. Если параметр "выключен" (флажок не выбран) система будет игнорировать этот параметр или использовать настройки по умолчанию. Также, воспользовавшиь кнопкой "Восстановить" можно переключится между измененным значением конфигурационного параметра и его значением по умолчанию.
sw: Kila parameta ya usanidi inaweza kuwashwa au kuzimwa kwa kupitia kisanduku tiki. Kama parameta imezimwa, mfumo utapuuza hii parameta au kutumia chaguo-msingi. Inawezekana kurudisha parameta ya usanidi iliyobadilishwa kuwa chaguo-msingi la mfumo kwa kutumia kiungo cha kuseti upya. Kitufe cha Kusasisha kinawasilisha mabadiliko yote kwenye parameta za usanidi wa mfumo.

source: If you want to save all the changes you made to your system's configuration, for example to setup a new installation quickly, you can use the "Export settings" button, which will create a .pm file. To restore your own settings, just press the "Import settings" and select the .pm created before.
ja: 例えば 迅速に新規インストールをセットアップ等、システムの構成に加えた変更をすべて保存したい場合には「エクスポート設定」ボタンを使用できます。その際、.pmファイルを作成します。自身の設定をリストアするためには、「インポート設定」ボタンを押すだけです。そして作成した.pmファイルを選択します。
ru: Если нужно сохранить все изменения, внесенные в конфигурацию системы, например, для быстрой настройки новой установки, можно воспользоваться кнопкой "Экспортировать настройки", которая создаст .pm-файл. Чтобы восстановиь свои собственные настройки, нажмите кнопку "Импортировать настройки" и выберите .pm-файл с настройками созданными ранее.
sw: Kama unataka kuhifadhi mabadiiko yote uliyofanya kwenye usanidi wa mfumo wako, kuanzisha usakinishaji mpya kwa haraka, unaweza utumia kitufe "Hamisha mipangilio", ambacho kitatengeneza faili la .pm. Kurudisha mipangilio yako, bonyeza "Agiza mipangilio" na chagua .pm iliyotengenezwa kabla.

source: For security reasons, the configuration parameters for the database connection cannot be changed in the SysConfig section. They have to be set manually in <filename>Kernel/Config.pm</filename>.
ja: セキュリティ上の理由で、データベース接続用の構成パラメタはSysConfigセクションの中で変更することができません。<filename>Kernel/Config.pm</filename>の中でそれらを手動でセットしなければならない。
ru: Из за соображений безопасности, параметры конфигурации соединения с базой даных не могут быть изменены в SysConfig. Их нужно установлены вручную в файле <filename>Kernel/Config.pm</filename>.
sw: Kwa sababu za kiusalama, parameta za usanidi wa miunganiko ya hifadhidata haziwezi kubadilishwa katika kifungu SysConfig. Inabidi zisetiwe kwa mikono katika <filename>Kernel/Config.pm</filename>.

source: Configuration
ja: 構成
ru: Настройка Системы
sw: Usanidi

source: By default, a clean installation of OTRS does not include any dynamic fields. If you plan to use such fields in tickets or articles you need to create dynamic fields.
ja: デフォルトで、OTRSのクリーン・インストールは動的フィールドを含んでいません。チケットまたは記事の中でそのようなフィールドを使用することを計画すれば、動的フィールドを作る必要があります。
ru: По умолчанию, первоначально установленная система OTRS не содержит никаких динамических полей. Если вы планируете их использование для заявок и сообщений/заметок, вам необходимо их создать. После установки некоторых дополнительных пакетов, например, ITSM, в системе появятся стандартные динамические поля, необходимые для их работы.
sw: Kwa kawaida, upakuaji mpya wa OTRS haujumuishi sehemu zozote zinazobadilika. Ukitaka kutumia sehemu hizo katika tiketi au makala inakubidi uzitengeneze.

source: The configuration of a dynamic field is split in two parts, to add a new dynamic field or manage an existing one you need to navigate into the "Admin" panel in the "Dynamic Fields" link. To show, show as mandatory or hide a dynamic field in one screen you need to change the OTRS settings in the "SysConfig" screen.
ja: 動的フィールドの構成はふたつの部分に分かれています。ひとつは新しい動的フィールドを追加するため。もうひとつは、既存の動的フィールドを管理するためです。（既存のものは「動的フィールド」リンクにある「管理者」パネルへとあなたが案内する必要があります。）画面の中で、必須として表示するため、あるいは動的フィールドを非表示にするため、あなたは「SysConfig」画面の中でOTRS設定を変更する必要があります。
ru: Настройка динамических полей разделена на две части. Для создания новых или управления ранее созданными полями перейдите по ссылке "Динамические поля" в Панели Администратора. Для управления показом, обязательностью показа или скрытием полей на конкретных экранах используйте настройки Конфигурации системы/SysConfig для этих экранов.
sw: Usanidi wa sehemu zinazobadilika umegawanyika katika nyanja mbili, kuongeza sehemu mpya inayobadilika au kusimamia iliyopo unahitaji kwenda paneli ya "Msimamizi" kwenye kiungo "Sehemu Zinazobadilika". Kuonyesha, kuonyesha kwa ulazima au kuficha sehemu inayobadilika katika skrini moja unahitaji kubadilisha mipangilio ya OTRS katika skrini ya "SysConfig".

source: Adding a Dynamic Field
ja: 動的フィールドの追加
ru: Добавление Динамического Поля
sw: Kuongeza Sehemu Inayobadilika

source: Click on the "Admin" button located in the navigation bar, then click on the "Dynamic Field" link inside "Ticket Settings" box located in the lower center of the screen. The dynamic fields overview will display as follows:
ja: ナビゲーション・バーにある「管理者」ボタンをクリックして、次に、画面の底部中央付近にある「チケット設定」ボックスの内部の「動的フィールド」リンクをクリックしてください。概要が以下のように表示する動的フィールド:
ru: Откройте Панель Администратора, нажмите на ссылку "Динамические поля" в разделе "Настройки заявок", расположенном в нижней половине экрана, по центру. Список динамических полей выглядит следующим образом:
sw: Bofya kwenye kitufe cha "Msimamizi" kilicho kwenye mwambaa wa uabiri, kisha bofya kwenye kiungo "Sehemu Inayobadilika" ndani ya boksi la "Mipangilio ya Tiketi" lililo ndani kushoto mwa skrini. Mapitio ya sehemu zinazobadilika itaonekana kama ifuatavyo:

source: Dynamic fields overview screen, empty
ja: 動的フィールド概要画面、空
ru: Экран обзора динамических полей пуст
sw: Skrini ya mapitio ya Sehemu zinazobadilika, wazi

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="Adminarea dynamicfields - screenshot" scale="40" fileref="screenshots/dynamicfields-overview-empty.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="管理者エリア dynamicfields（動的フィールド） - スクリーンショット" scale="40" fileref="screenshots/dynamicfields-overview-empty.png"></graphic>

source: <emphasis>Figure: Dynamic fields overview screen, empty.</emphasis>
ja: <emphasis>図:動的フィールド概要画面、空</emphasis>
ru: <emphasis>Рисунок: Страница просмотра Динамических полей, пустая</emphasis>
sw: <emphasis>Kielelezo: Skrini ya mapitio ya sehemu zinazobadilika, wazi.</emphasis>

source: Notice that this screen will change as you add more dynamic fields to list all created dynamic fields. This screen might already have some fields if the installation was updated from an older version of OTRS.
ja: 作られてた全ての動的フィールドをリストへ、あなたがさらに動的フィールドを追加すると、この画面が変化することにご留意下さい。インストレーションがOTRSのより古いバージョンから更新された場合、この画面には既にいくつかのフィールドがあるかもしれません。
ru: Обратите внимание, что вид экрана изменится при добавлении динамических полей. Он также может уже иметь несколько полей, если вы провели обновление со старых версий OTRS, в которых динамические поля еще не использовались. Они теперь заменили понятие Свободные/Дополнительные поля/FreeText fields.
sw: Tambua kwamba hii skrini itabadilika kadri uongezavyo sehemu zinazobadilka kuorodhesha sehemu zote zinazobadilika. Hii skrini inaweza tayari kuwa na baadhi ya sehemu kama usanikishaji ulirekebishwa kutoka toleo la zamani la OTRS.

source: The Actions in the side bar at the left of the screen describes two possibilities: Article and Ticket, each one has it's own dropdown selection of dynamic fields.
ja: 画面の左のサイド・バーのアクションは、2つの可能性について表しています: それは記事およびチケットで、各々は動的フィールドの自身のdropdown選択を持っています。
ru: Раздел "Действия" в левой части экрана позволяет выбрать два варианта объекта для поля: Article/Заметка и Ticket/Заявка, каждый из которых имеет свой собственный набор значений типов полей в выпадающих списках.
sw: Vitendo kwenye ufito wa pembeni kushoto kwa skrini vinaelezea uwezekano wa aina mbili: Makala na Tiketi, kila moja ina uchaguzi kunjuzi wa sehemu zinazobadilika.

source: The installation of an OTRS package could add more objects to the Action side bar.
ja: OTRSパッケージのインストレーションはより多くのオブジェクトをアクション・サイド・バーに追加しました。
ru: Установка некоторых дополнительных пакетов OTRS может привести к добавлению типов объектов в разделе "Действия".
sw: Usanikishaji wa kifurushi cha OTRS unaweza kuongeza vitu katika ufito wa pembeni.

source: The general procedure to create a dynamic field is:
ja: 動的フィールドを作る基本手順は次のとおりです:
ru: Общая процедура для создания динамического поля:
sw: Utaratibu wa kawaida wa kutengenza sehemu zinazobadilika ni:

source: Click on the desired dynamic field object dropdown in the Action side bar.
ja: アクション・サイド・バーで希望するの動的フィールドオブジェクトdropdownをクリックしてください。
ru: Кликните на объект выбраного вами динамического поля в выпадающем списке на боковой панели действий.
sw: Bofya kwenye kitu cha sehemu inayobadilika unachotaka kwenye mwambaa upande wa Kitendo.

source: Click on the dynamic field type that you want to add from the list.
ja: リストから追加したい動的フィールドタイプをクリックしてください。
ru: Выберите в списке и нажмите на тип динамического поля, которое вы хотите добавить.
sw: Bofya kwenye aina ya sehemu inayobadilika unayotaka kuongeza kutoka kwenye orodha.

source: Fill the configuration.
ja: 構成を記入してください。
ru: Настройка
sw: Jaza usanidi

source: Save.
ja: 保存してください。
ru: Сохранить.
sw: Hifadhi

source: The configuration dialogs for the dynamic fields are split in two parts, the upper section is common among all the fields and the lower part might be different from one type of dynamic field to another.
ja: 動的フィールドのための構成ダイアログはふたつの部分に分かれます。上部のセクションはすべてのフィールド中に一般的です。また、下方部分は別のタイプへの1つのタイプの動的フィールドとは異なるかもしれません。
ru: Диалог настройки динамических полей разделен на две части, верхняя часть является общей для всех полей, а нижняя часть может различаться в зависимости от типа динамического поля.
sw: Maongezi ya usanidi wa sehemu zinazobadilika yamegawanywa katika sehemu mbili, upande wa juu ni wa kawaida baina ya sehemu zote na upande wa chini unaweza kuwa tofauti kwa aina moja ya sehemu inayobadilika kwenda nyingine.

source: General dynamic field settings:
ja: 一般的な動的フィールドセッティング:
ru: Общие настройки динамического поля:
sw: Mipangilio ya ujumla ya sehemu zinazobadilika:

source: Name: Mandatory, unique, only letters and numbers are allowed.
ja: 名前:必須で、ユニークで、文字および数字だけが許可されます。
ru: Название: Обязательное поле, уникальное, только буквы и числа в качестве допустимых символов.
sw: Jina: Lazima, kipekee, herufi na nambari tu zinaruhusiwa,

source: This is the internal name of the field, used for example to show or hide a field in one screen. Any modification of a field name (not recommended) requires a manual update of the "SysConfig" settings where the field is referenciated.
ja: これは、1つの画面の中で例えばフィールドを表示または非表示するために使用するような、フィールドの内部名前である。フィールド名のどんな修正する(推奨しませんが)場合でも、フィールドがreferenciated（参照）される「SysConfig」設定の手動のアップデートが必要です。
ru: Это внутреннее имя поля, используемое, например, для показа или скрытия поля на отдельных экранах. Любое изменение имени поля (не рекомендуется) потребует ручного изменения в параметрах "SysConfig", которые ссылаются на это поле.
sw: Hili ni jina la ndani la sehemu, linatumika kwa mfano kuonyesha au kuficha sehemu katika skrini. Mabadiliko yoyote ya jina la sehemu (haishauriwi) inahitaji usasishaji kwa mikono wa mipangilio ya "SysConfig" ambapo sehemu ina rejea.

source: Label: Mandatory.
ja: ラベル：必須
ru: Метка: Обязательное.
sw: Lebo: Lazima

source: This is the field name to be displayed on the screens, it supports translations.
ja: これは画面に表示されるフィールド名である。それは翻訳を支援します。
ru: Это имя, под которым поле будет показано на тех экранах, на которых оно активно. Оно может быть переведено на дргуие языки.
sw: Hili ndio jina la sehemu litakaloonyeshwa kwenye skrini, ina msaada kwa tafsiri.
