Repository: DSigmund/doc-admin
Catalog: i18n/doc-admin.*.po
Languages: ja, ru, sw

source: It is also possible to create notifications based on events. You can specify in detail when and to whom you want such a notification to be sent. You can choose from a wide variety of parameters, such as: recipient group(s), agent(s), role(s), email address(es), type of event triggering the notification, ticket-type, state, priority, queue, lock, service, SLA, etc.
ja: さらに、イベントに基づいた通知を作成することは可能です。誰がいつあなたにそのような通知を送信するか、を詳細に指定することができます、以下のような様々のパラメタから選択することができます: 受信グループ, 担当者, 役割, Eメールアドレス, 通知契機イベントタイプ, チケットタイプ, 状態, 優先度, キュー, ロック, サービス, SLA, 等。
ru: Также есть возможность создавать уведомления основаные на системных событиях. Можно подробно указать когда и кому такое уведомление будет отправлено. Выбрать можно из большого количества параметров, таких как: группа(ы) получателя, агент(ы), роль(и), адресс(а) электронной почты, тип события, который генерирует уведомление, тип заявки, состояние, приоритет, очередь, блокировка, сервис, SLA и т.д.
sw: Pia inawezekana kutengeneza taarifa zitokanazo na matukio. Unaweza kubainisha kwa undani wakati gani na kwa nani taarifa hiyo itumwe. Unaweza kuchagua kutokea kwenye parameta nyingi, kama: makundi ya wapokeaji, mawakala, majukumu, anuani za barua pepe, aina ya matukio yanayochochea taarifa, aina-tiketi, hali, kipaumbele, foleni, funga, huduma, SLA, na kadhalika.

source: In order to see a list of all event based notifications, click on the link "Notifications (Event)" on the Admin page (see Figure).
ja: すべてのイベントに基づいた通知のリストを見るためには、管理者ページ上でリンク「通知(イベント)」をクリックしてください(図を参照)。
ru: Чтобы увидеть список всех событий, основаных на уведомлениях, нажмите на ссылку "Уведомления (События)" в Панели Администрирования (см. Рисунок).
sw: Ili kuona orodha ya taarifa zote zinazojikita kwenye tukio, bofya kwenye kiungo "Taarifa (Tukio)" kwenye ukurasa wa Msimamizi (ona Kielelezo).

source: Managing Event-based Notifications
ja: 通知管理に基づくイベント
ru: Управление Уведомлениями, которые базируются на Событиях
sw: Kusimamia Taarifa zinazohusika na Matukio

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="Adminarea event based notifications - screenshot" scale="40" fileref="screenshots/admin-notification-eventbased.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="「管理者エリア イベントベースの通知 - スクリーンショット」" scale="40" fileref="screenshots/admin-notification-eventbased.png"></graphic>

source: <emphasis>Figure: Event based Notification management.</emphasis>
ja: <emphasis>図:通知管理に基づくイベント</emphasis>
ru: <emphasis>Рисунок: Управления Уведомлениями, базирующихся на Событиях.</emphasis>
sw: <emphasis>Kielelezo: Kusimamia Taarifa zinazohusika na Matukio.</emphasis>

source: As shown in Figure, you can create a new notification by clicking on the Add button (see Figure).
ja: 図の中で示されるように、追加ボタンをクリックすることにより新規通知を作成することができます(図を参照)。
ru: Как показано на Рисунке , можно создать новое уведомление нажав на кнопку "Добавить (см. Рисунок).
sw: Kama ilivyo onyeshwa kwenye kielelezo, unaweza kutengeneza taarifa mpya kwa kubofya kitufe cha kuongeza (ona kielelezo).

source: Managing Event based Notifications
ja: 通知管理に基づくイベントの登録
ru: Управление Уведомлениями, которые базируются на Событиях
sw: Kusimamia Taarifa zinazohusika na Matukio

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="Adminarea event based notifications - screenshot" scale="40" fileref="screenshots/admin-notification-eventbased-new.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="管理者エリア イベントベースの通知 - スクリーンショット" scale="40" fileref="screenshots/admin-notification-eventbased-new.png"></graphic>

source: <emphasis>Figure: Registering an Event based Notification management.</emphasis>
ja: <emphasis>図: 通知管理に基づくイベントの登録</emphasis>
ru: <emphasis>Рисунок: Регистрация Уведомления, основаного на Событии.</emphasis>
sw: <emphasis>Kielelezo: Kuandikisha usimamizi wa taarifa unaotegemea matukio.</emphasis>

source: Please note that the content of the event based notifications can also be dynamically created by using the special variables listed at the bottom of the screen shown in the Figure.
ja: 図の中で示される画面の一番下にリストされた特殊変数の使用により、通知に基づいたイベント内容をダイナミックに作成することができることにご留意ください。
ru: Обратите внимание, что содержимое уведомления, которое базируется на событии также может быть создано динамически, используя специальные переменные, приведенные в списке, в нижней части экрана, как это показано на Рисунке.
sw: Tafadhali tambua kwamba maudhui ya taarifa zinazotegemea matukio zinaweza kutengenezwa kwa kutumia vishika mahali maalumu vilivyo orodheshwa upande wa chini wa skrini iliyoonyeshwa kwenye Kielelezo.

source: The "S/MIME Certificates" link on the Admin page allows you to manage your S/MIME certificates (see Figure below). You can add or remove certificates, and also search through the SMIME data.
ja: 管理者ページの「S/MIME証明書」リンクによってS/MIME証明書を管理することができます(下記の図を参照)。証明書の追加及び削除、またSMIMEデータの検索もできます。
ru: Ссылка "S/MIME Certificates" на Панели Управления OTRS позволяет управлять вашими S/MIME сертификатами (см. Рисунок ниже). Можно добавлять или удалять сертификаты а также производить поиск в SMIME-данных.
sw: Kiungo cha "Hati za S/MIME" katika ukurasa wa Msimamizi kinakusaidia kusimamia hati zako za S/MIME (ona Kielelezo chini). Unaweza kuongeza au kuondoa hati, na kutafuta kwenye data za SMIME.

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="Adminarea smime - screenshot" scale="40" fileref="screenshots/admin-smime.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="「管理者エリア SMIME - スクリーンショット」" scale="40" fileref="screenshots/admin-smime.png"></graphic>

source: <emphasis>Figure: S/MIME management.</emphasis>
ja: <emphasis>図: S/MIME 管理</emphasis>
ru: <emphasis>Рисунок: Управление S/MIME.</emphasis>
sw: <emphasis>Kielelezo: Usimamizi wa S/MIME.</emphasis>

source: PGP
ja: PGP鍵

source: Through the "PGP Keys" link on the Admin page, it is possible to manage the key ring of the user who shall be used for PGP with OTRS (see Figure below), e.g. the local OTRS user or the web server user. It is possible to add and remove keys and signatures, and you can search through all data in your key ring.
ja: 管理者ページの「PGP鍵」リンクによって、OTRS(例えば地方のOTRSユーザ、ウェブサーバ・ユーザ)(下記の図を参照)を備えたPGP鍵に使用されるものとするユーザのkey ringを管理することは可能です。キーと署名を加えること、削除することは可能です。また、key ring中のすべてのデータを捜すことができます。
ru: Используя ссылку "PGP-ключи" на Панели Управления OTRS, можно управлять ключами пользователя, который желает использвоать PGP вместе с OTRS (см. Рисунок ниже), например локальный пользователь OTRS или пользователь веб-сервера. Также есть возможность добавлять, удалять ключи и подписи, производить поиск по ключам.
sw: Kupitia kiungo cha "Fungo za PGP" kwenye ukurasa wa Msimamizi, inawezekana kusimamia pete ya ufunguo wa mtumiaji atakayetumika kwa ajili ya PGP kwa OTRS (ona Kielelezo chini), mf. mtumiaji wa OTRS wa ndani au mtumiaji wa seva ya wavuti. Inawezekana kuongeza au kuondoa funguo na saini, na unaweza kutafuta kwenye data zako zote katika pete yako ya funguo.

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="Adminarea pgp - screenshot" scale="40" fileref="screenshots/admin-pgp.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="管理者エリア PGP - スクリーンショット" scale="40" fileref="screenshots/admin-pgp.png"></graphic>

source: <emphasis>Figure: PGP management.</emphasis>
ja: <emphasis>図: PGP鍵 管理</emphasis>
ru: <emphasis>Рисунок: Управление PGP.</emphasis>
sw: <emphasis>Kielelezo: Usimamizi wa PGP.</emphasis>

source: States
ja: 状態
ru: Состояния
sw: Hali

source: Through the "States" link on the Admin page, you can manage the different ticket states you want to use in the system (see Figure below).
ja: 管理者ページの「状態」リンクによって、システムの中で使用したい異なるチケット状態を管理することができます(下記の図を参照)。
ru: Используя ссылку "Состояния" на Панели Управления OTRS, можно управлять различными статусами заявок, которые вы хотите использовать в системе (см. Рисунок ниже).
sw: Kupitia kiungo cha "Hali" kwenye kurasa ya Msimamizi, unaweza kusimamia hali za tiketi mbali mbali unazotaka kutumia katika mfumo.

source: Managing ticket states
ja: チケット状態管理
ru: Управление состояниями заявок
sw: Kusimamia hali za tiketi

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="Adminarea states - screenshot" scale="40" fileref="screenshots/admin-states.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="管理者エリア 状態 - スクリーンショット" scale="40" fileref="screenshots/admin-states.png"></graphic>

source: <emphasis>Figure: State management.</emphasis>
ja: <emphasis>図:状態管理</emphasis>
ru: <emphasis>Рисунок: Управление состоянимями.</emphasis>
sw: <emphasis>Kielelezo: Usimamizi wa hali.</emphasis>

source: After a default setup, there are some states defined:
ja: デフォルトの開始後、定義される「状態」がいくつかあります。
ru: После установки в системе будут следующие предустановленные состояния:
sw: Baada ya mpangilio wa kawaida, kuna hali zilizofafanuliwa:

source: closed successful
ja: 完了（成功）
ru: закрыта успешно
sw: imefungwa kwa mafanikio

source: closed unsuccessful
ja: 完了（不成功）
ru: закрыта неуспешно
sw: imefungwa pasipo mafanikio

source: merged
ja: 結合済
ru: обьедененные
sw: unganishwa

source: new
ja: 「新規」（new）
ru: новая
sw: mpya

source: open
ja: 対応中（open）
ru: открытая
sw: wazi

source: pending auto close+
ja: 保留（自動完了＋）
ru: ожидание авто закрытие+
sw: inasubiri kufunga kiotomatiki+

source: pending auto close-
ja: 保留（自動完了-）
ru: ожидание авто закрытие-
sw: inasubiri kufunga kiotomatiki-

source: pending reminder
ja: 保留（期限付）
ru: ожидание напоминание
sw: kikumbusho kinachosubiri

source: removed
ja: 削除済
ru: удаленная
sw: ondolewa

source: Every state is linked to a type, which needs to be specified if a new state is created. By default the state types are:
ja: 全ての状態はタイプにリンクされます。それは新規状態が作成されならば指定されねばなりません。デフォルトの状態タイプは次の通りです。
ru: Каждое состояние связано с типом, который нужно указать когда создается новое состояние. По умолчанию есть такие типы состояний:
sw: Kila hali imeunganishwa na aina, inayohitaji kuwekwa bayana endapo hali mpya itatengenezwa. Kwa kawaida aina za hali ni:

source: closed
ja: 完了済
ru: закрытая
sw: imefungwa

source: pending auto
ja: 保留（自動）
ru: ожидание авто
sw: inasubiri kiotomatiki

source: The SysConfig link leads to the section where many OTRS configuration options are maintained.
ja: SysConfigのリンクは、多くのOTRSコンフィグレーション・オプションがメンテナンスされるセクションへと辿り着きます。
ru: Ссылка SysConfig - указывает на мест,о где хранится большинство конфигурационные параметров OTRS.
sw: Kiungo cha SysConfig kinaelekeza kwenye kifungu ambacho machaguo mengi ya usanidi wa OTRS yanadumishwa.

source: The SysConfig link on the Admin page loads the graphical interface for system configuration (see Figure below). You can upload your own configuration files for the system, as well as backup all your current settings into a file. Almost all configuration parameters of the OTRS framework and installed applications can be viewed and changed through this interface. Since all configuration parameters are sorted into groups and sub groups, it is possible to navigate quickly through the vast number of existing parameters. It is also possible to perform a full-text search through all of the configuration parameters.
ja: 管理者ページのSysConfigリンクは、システム構成用のグラフィカル・インターフェースをロードする(下記の図を参照)。 現在の全ての設定を１ファイルにバックアップするように、システム用の自分の構成ファイルをアップロードすることができます。OTRSフレームワークおよびインストールされたアプリケーションの構成パラメタはほとんどすべて、このインターフェースを通って見て変更することができます。全ての構成パラメタがグループおよびサブグループへソートされるので、既存のパラメタの莫大な数によってすばやく閲覧することは可能です。さらに、構成パラメタのすべてによって全文検索を行なうことも可能です。
ru: Чтобы загрузить графический интерфейс для конфигурации системы, перейдите по ссылке "SysConfig" в Панели Администрирования (см. Рисунок ниже). В систему можно как загружать собственные конфигурационные файлы, так и архивировать текущие настройки в файл. Почти все конфигурационные параметры OTRS-фреймворка и дополнительно установленных приложений могут быть просмотрены и изменены посредством веб-интерфейса. Поскольку все конфигурационные параметры хранятся в группах и подгруппах, то можно быстро переходить между различными параметрами. Также можно осуществлять полнотекстовый поиск по всем конфигурационным параметрам.
sw: Kiungo cha SysConfig katika kurasa ya Msimamizi inapakia kiolesura michoro cha usanidi wa mfumo (ona Kielelezo chini). Unaweza kupakia mafaili yako binafsi ya usanidi kwa ajili ya mfumo, na pia kuweka cheleza ya mipangilio yako ya sasa kwenye faili. Karibu parameta zote za usanidi wa kiunzi cha OTRS na programu-tumizi zilizosakinishwa zinaweza kuonekana na kubadilishwa kupitia hiki kiolesura. Kwa sababu parameta zote za usanidi zinaweza kupangwa kwenye makundi na makundi madogo, inawezekana kupitia kwa urahisi idadi kubwa ya parameta zilizopo. Pia inawezekana kufanya utafutaji wa nakala-kamili kwenye parameta zote za usanidi.

source: The graphical interface for system configuration (SysConfig)
ja: システム構成(SysConfig)用のグラフィカル・インターフェース
ru: Графический интерфейс для настройки системы (SysConfig)
sw: Kiolesura michoro cha usanidi wa mfumo (SysConfig)

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="Adminarea sysconfig - screenshot" scale="40" fileref="screenshots/admin-sysconfig.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="管理者エリア sysconfig - スクリーンショット" scale="40" fileref="screenshots/admin-sysconfig.png"></graphic>

source: <emphasis>Figure: The graphical interface for system configuration (SysConfig).</emphasis>
ja: <emphasis>図:システム構成(SysConfig)用のグラフィカル・インターフェース</emphasis>
ru: <emphasis>Рисунок: Графический интерфейс для настройки системы (SysConfig).</emphasis>
sw: <emphasis>Kielelezo: Kiolesura michoro kwa ajili ya usanidi wa mfumo (SysConfig).</emphasis>

source: The graphical interface for system configuration is described in more detail in the chapter <link linkend="sysconfig"> "Configuring the system through the web interface"</link>.
ja: システム構成用グラフィカル・インターフェイスに関してこの章<link linkend="sysconfig"> "ウェブ・インターフェイスからのシステム構成"</link>でより詳細に記述されます。
ru: Более подробно графический интерфейс для настройки системы рассматривается в главе <link linkend="sysconfig"> "Настройка системы через веб-интерфейс" </link>.
sw: Kiolesura michoro cha usanidi wa mfumo kinaelezewa kuwa undani zaidi katika sura <link linkend="sysconfig"> "Kusanidi mfumo kupitia kiolesura cha tovuti"</link>.

source: Using mail accounts
ja: Eメールアカウントの使用
ru: Использование почтовый ящиков
sw: Kutumia akaunti zote za barua

source: There are several possibilities to transport new emails into the ticket system. One way is to use a local MTA and the <link linkend="email-receiving-cmd">otrs.PostMaster.pl script</link> that pipes the mails directly into the system. Another possibility is the use of mail accounts which can be administrated through the web interface. The "PostMaster Mail Accounts" link on the Admin page loads the management console for the mail accounts (see Figure below). OTRS supports the mail protocols: POP3, POP3S, IMAP and IMAPS.
ja: チケット・システムへ新規Eメールを移送する可能性いくつかあります。ひとつはローカルMTAとシステムに直接メールを繋ぐ<link linkend="email-receiving-cmd">otrs.PostMaster.pl script</link>です。もうひとつの可能性は、ウェブ・インターフェイスをと通して管理されるメールアカウントを使用することです。管理ページにある"ポストマスター・メールアカウント"リンクは、メールアカウント(下図参照)管理コンソールをロードします。OTRSがサポートするメール・プロトコル：POP3, POP3S, IMAPとIMAPSです。
ru: Есть несколько возможных вариантов доставки новых писем электронной почты в систему обработки заявок. Одним из них является <link linkend="email-receiving-cmd">скрипт otrs.PostMaster.pl </link>, который напрямую помещает письма в систему. Другой способ - это использование почтовых ящиков, управляемых посредством веб-интерфейса. Перейдя по ссылке "Почтовые ящики PostMaster" в Панели Администрирования, OTRS загружает консоль для управления почтовыми ящиками (см. Рисунок ниже). OTRS поддерживает почтовые протоколы: POP3, POP3S, IMAP и IMAPS.
sw: Kuna njia nyingi za kusafirisha barua pepe mpya kuingia kwenye mfumo wa tiketi. Njia mojawapo ni kutumia MTA ya ndani na <link linkend="email-receiving-cmd">otrs.PostMaster.pl script</link> ambayo inapitisha barua moja kwa moja ndani kwenye mfumo. Njia nyingine ni kutumia akaunti za barua ambazo zinaweza kusimamiwa kupitia kiolesura cha tovuti. Kiungo cha "Akaunti za Barua za MkuuWaPosta" katika kurasa ya Msimamizi kinapakia kiweko simamizi kwa ajili ya akaunti za barua (ona Kielelezo chini). OTRS ina msaada kwa itifaki zza barua: POP3, POP3S, IMAP na IMAPS.

source: Mail account management
ja: Eメールアカウント管理
ru: Управление почтовыми ящиками
sw: Usimamizi wa akaunti za barua

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="Adminarea postmaster - screenshot" scale="40" fileref="screenshots/admin-mailaccount.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="管理者エリア ポストマスター - スクリーンショット" scale="40" fileref="screenshots/admin-mailaccount.png"></graphic>

source: <emphasis>Figure: Mail account management.</emphasis>
ja: <emphasis>図: Eメールアカウント管理</emphasis>
ru: <emphasis>Рисунок: Управление почтовыми ящиками.</emphasis>
sw: <emphasis>Kielelezo: Usimamizi wa akaunti za barua.</emphasis>

source: See the section about <link linkend="email-receiving-pop3">PostMaster Mail Accounts</link> for more details.
ja: より詳細については、<link linkend="email-receiving-pop3">PostMasterメールアカウント</link> に関するセクションを参照してください。
ru: За более подробной информацией обращайтесь к разделу <link linkend="email-receiving-pop3">Почтовые аккаунты PostMaster</link>.
sw: Ona kifungu kuhusu <link linkend="email-receiving-pop3">Akaunti za Posta za MkuuWaPosta</link> kwa maelezo zaidi.

source: Filtering incoming email messages
ja: 受信Eメール・メッセージのフィルタリング
ru: Фильтрация входящих почтовых сообщений
sw: Inachuja barua pepe zinazoingia

source: OTRS has the capability to filter incoming email messages. For example, it is possible to put certain emails automatically into specified queues, or to set a specific state or ticket type for some mails. The filters apply to all incoming mails. You can manage your filters via the link "PostMaster Filter" on the Admin page (see Figure below).
ja: OTRSは、受信Eメール・メッセージのフィルタリング能力を持っています。例えば、指定されたキューに特定のEメールを自動的に入れるか、いくつかのメールのために特定の状態かチケット・タイプをセットすることが可能です。フィルタはすべての受信メールに適応します。管理者ページ上でリンク「PostMasterフィルタ」によってフィルタを管理することができます(下記の図を参照)。
ru: OTRS имеет возможность фильтрации входящих сообщений. Например, можно автоматически помещать определенные письма в заданные очереди или присвоить заданное состояние или тип заявки некоторым письмам. Фильтры применяются ко всем входящим письмам. Управлять этими фильтрами можно по ссылке "PostMaster фильтры" с Панели Администрирования (см. рисунок ниже).
sw: OTRS ina uwezo wa kuchuja barua pepe zinazoingia. Kwa mfano, inawezekana kuweka barua pepe zinazoingia kwenye foleni fulani kiotomatiki, au kuseti hali fulani au aina ya tiketi kwa baadhi ya barua. Vichujio vinafanya kazi kwa barua zote zinazoingia. Unaweza kusimamia vichujio vyako kupitia kiungo "Kichujio cha MkuuWaPota" katika kurasa ya Msimamizi (ona Kielelezo chini).

source: Managing filter rules for incoming messages
ja: ポストマスター・フィルタ管理
ru: Управление правилами фильтрации для входящих сообщений
sw: Kusimamia sheria za uchujaji wa ujumbe unaingia

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="Adminarea postmasterfilter - screenshot" scale="40" fileref="screenshots/admin-postmasterfilter.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="管理者エリア ポストマスター・フィルター - スクリーンショット" scale="40" fileref="screenshots/admin-postmasterfilter.png"></graphic>

source: <emphasis>Figure: PostMaster filter management.</emphasis>
ja: <emphasis>図:ポストマスター・フィルタ管理</emphasis>
ru: <emphasis>Рисунок: Управление фильтрами PostMaster.</emphasis>
sw: <emphasis>Kielelezo: Usimamizi wa kichujio cha MKuuWaPosta.</emphasis>

source: A filter consists of one or more criteria that must be met in order for the defined actions to be executed on the email. Filter criteria may be defined for the headers or the body of an email, e.g. search for specific header entries, such as a sender address, or on strings in the body. Even regular expressions can be used for extended pattern matching. If your filter matches, you can set fields using the X-OTRS headers in the GUI. These values will be applied when creating the ticket or follow-up message in OTRS. The Table 5-4 lists the different X-OTRS headers and their meaning.
ja: フィルタは、Eメール上で実行される定義されたアクションのために、順番に合致しなければならない1つ以上の基準から成ります。フィルター基準は、本文にヘッダーあるいはEメールの本文のために定義できます。(例えば送信者アドレスや本文中の文字列などのような特定のヘッダー入力の検索)正規表現でさえ拡張パターン一致のために使用することができます。フィルタが一致する場合、GUIの中でX-OTRSヘッダーを使用して、フィールドをセットすることができます。OTRSでチケットかフォローアップ・メッセージを作成する時、これらの値が適用されるでしょう。テーブル5-4は異なるX-OTRSヘッダーおよびそれらの意味をリストします。
ru: Фильтр состоит из одного или нескольких критериев, которые применяются для определения порядка действий над письмом. Фильтры могут быть определены для заголовка или тела пиьсма, например, для определенных данных заголовка, как то адрес отправителя или определенных строк в теле письма. Можно использовать регулярные выражения для расширенного разбора. Если критерий фильтра выполняется, вы можете заполнить поля, называемые X-OTRS заголовки, в данном интерфейсе.Эти значения будут использованы при создании заявки или регистрации отклика клиента в OTRS. Таблица 5-4 содержит список различных X-OTRS заголовков и их назначение.
sw: Kichujio kina kigezo kimoja au zaidi ambacho lazima kitimizwe ili vitendo vilivyofafanuliwa vitekelezwe kwenye barua pepe. Vigezo vya uchujaji vinaweza kufafanuliwa kwa ajili ya vichwa au kiini cha barua pepe, mf. tafuta maingizo maalumu ya vichwa, kama anwani ya mtumaji, au kuhusu tungo kwenye kiini. Hata semi za kawaida zinaweza kutumika kwa ulinganishaji ruwaza uliopanuliwa. Kama kichujio chako kikilingana, unaweza kuseti sehemu kwa kutumia vichwa vya X-OTRS katika GUI. Hizi thamani zitatumika wakati wa kutengeneza tiketi au ufwatiliaji ujumbe katika OTRS. Jedwali 5-4 linaorodhesha vichwa tofauti vya X-OTRS na maana zake.

source: Note: You also can use X-OTRS-FollowUp-* headers to set values for follow up emails.
ja: さらに、フォローアップEメールに対して値をセットするために X-OTRS-FollowUp-*ヘッダーを使用することができます。
ru: Примечание: Вы также можете использовать X-OTRS-Followup-* заголовки для писем с ответами/дополнениями клиентов.
sw: Kumbuka: Unaweza pia kutumia vichwa vya X-OTRS-Ufwatiliaji* kuseti thamani za barua pepe za ufwatiliaji.

source: Function of the different X-OTRS-headers
ja: 異なるX-OTRSヘッダーの機能
ru: Функции различных X-OTRS-заголовков
sw: Kazi za vichwa-vya-X-OTRS tofauti

source: Possible values
ja: 可能な値
ru: Возможные значения:
sw: Thamani ziwezekanazo

source: X-OTRS-Priority:
ja: X-OTRS-優先度:
sw: Kipaumbele cha-X-OTRS:

source: 1 very low, 2 low, 3 normal, 4 high, 5 very high
ja: 1 極低い, 2 低い, 3 普通, 4 高い, 5 極高い
ru: 1 очень низкий, 2 низкий, 3 нормальный, 4 высокий, 5 очень высокой
sw: 1 chini sana, 2 chini, 3 kawaida, 4 juu, 5 juu sana

source: Sets the priority of a ticket.
ja: チケットの優先度を設定します。
ru: Устанавливает приоритет заявки.
sw: Inaseti kipaumbele cha tiketi.

source: X-OTRS-Queue:
ja: X-OTRS-キュー:
sw: Foleni ya-X-OTRS:

source: Name of a queue in the system.
ja: システム内でのキュー名
ru: Название очереди в системе.
sw: Jina la foleni kwenye mfumo.
