Repository: DSigmund/doc-admin
Catalog: i18n/doc-admin.*.po
Languages: ja, ru, sw

source: The SysConfig groups <link linkend="ConfigReference_Framework:Core::Stats">Framework:Core::Stats</link>, <link linkend="ConfigReference_Framework:Core::Stats::Graph">Framework:Core::Stats::Graph</link> and <link linkend="ConfigReference_Framework:Frontend::Agent::Stats">Framework:Frontend::Agent::Stats</link> contain all configuration parameters for the basic set-up of the statistics module. Moreover, the configuration parameter <link linkend="ConfigReference_Framework:Frontend::Agent::ModuleRegistration:Frontend::Module_AgentStats">$Self-&gt;{'Frontend::Module'}-&gt;{'AgentStats'}</link> controls the arrangement and registration of the modules and icons within the statistics module.
ru: Группы SysConfig <link linkend="ConfigReference_Framework:Core::Stats">Framework:Core::Stats</link>, <link linkend="ConfigReference_Framework:Core::Stats::Graph">Framework:Core::Stats::Graph</link> and <link linkend="ConfigReference_Framework:Frontend::Agent::Stats">Framework:Frontend::Agent::Stats</link> содержат все параметры конфигурации базового набора из модуля статистики. Больше того, конфигурационный параметр <link linkend="ConfigReference_Framework:Frontend::Agent::ModuleRegistration:Frontend::Module_AgentStats">$Self->{'Frontend::Module'}->{'AgentStats'}</link> управляет организацией и регистрацией модулей и иконками в модуле статистики.
sw: Makundi ya SysConfig<link linkend="ConfigReference_Framework:Core::Stats">Kiunzi:Kiini::Takwimu</link>, <link linkend="ConfigReference_Framework:Core::Stats::Graph">Kiunzi:Kiini::Takwimu::Grafu</link> na <link linkend="ConfigReference_Framework:Frontend::Agent::Stats">Kiunzi:Mazingirayambele::Wakala::Takwimu</link> ina usanidi wote wa parameta kwa ajili ya mpangilio wa msingi wa moduli ya takwimu. Zaidi, parameta ya usanidi <link linkend="ConfigReference_Framework:Frontend::Agent::ModuleRegistration:Frontend::Module_AgentStats">$Self-&gt;{'Frontend::Module'}-&gt;{'AgentStats'}</link> inadhibiti mpangilio na usajili wa moduli na ikoni ndani ya moduli ya takwimu.

source: Version 1.1, March 2000
sw: Toleo 1.1, Machi 2000

source: DynamicFieldStartTime
sw: SehemuInayobadilikaMudaKuanza

source: DynamicFieldEndTime
sw: SehemuInayobadilikaMudaKumaliza

source: DynamicFieldsForEvents
sw: SehemuZinazobadilikaKwaajiliyaMatukio

source: TicketFieldsForEvents
sw: SehemuZaTiketiKwaajiliyaMatukio

source: OTRS 4 - Admin Manual
ru: OTRS v.4 - Руководство Администратора

source: OTRS runs on many operating systems (Linux, Solaris, AIX, FreeBSD, OpenBSD, Mac OS 10.x) and supports several database systems for the central OTRS back-end (MySQL, PostgreSQL, Oracle, MSSQL).
ru: OTRS работает во многих операционных системах (Linux, Solaris, AIX, FreeBSD, OpenBSD, Mac OS 10.x) и поддерживает работу с разнообразными СУБД для основного сервера баз данных OTRS (MySQL, PostgreSQL, Oracle, MSSQL).

source: New features of OTRS 4
ru: Новые возможности OTRS 4

source: A new cleaner flat design has been implemented.
ru: Применен новый, упрощенный плоский дизайн интерфейса.

source: Agents can now reply directly to a ticket note. The original notes body is quoted in the new note.
ru: Агенты теперь могут просто создать ответ на сообщение/заметку. Текст отвечаемого сообщения включается в качестве цитаты в создаваемое сообщение.

source: Agents can now make use of templates in all screens with internal notes.
ru: Агенты могут использовать шаблоны на всех экранах с внутренними заметками/сообщениями.

source: Ticket action screens (such as note, owner etc.) now allow to do actions without always creating an article (configurable).
ru: При операциях с заявками (такими как создать заметку, назначить владельца и пр.) теперь можно обойтись без создания новой заметки (настраивается).

source: New ticket overview based on "my services" that an agent can subscribe to. Notification options for new tickets and follow-ups can now be based on "my queues", "my services" or combinations of both.
ru: Появился Новый вид обзора заявок, основанный на списке "Мои сервисы", на который агент может подписаться. Также добавлены новые способы подписки на оповещения о новых заявках и дополнениях к ним, основанные на списках "Мои очереди", "Мои сервисы" или комбинации из них.

source: OTRS can now display tickets with thousands of articles.
ru: OTRS теперь может отображать заявки с тысячами сообщений/заметок.

source: Customer online list in Dashboard now links directly to CustomerInformationCenter page for the customer.
ru: Строки списока "Клиенты онлайн" в Дайджесте имеет теперь ссылки на страницу клиента в CustomerInformationCenter.

source: Agents can now persistently reorder their main menu with drag&amp;drop.
ru: Агенты теперь могут, по желанию, изменить порядок пунктов главного меню с помощью drag&amp;drop.

source: Agents and customers can now search tickets by attachment name.
ru: Агенты и клиенты могут осуществлять поиск заявок по имени вложения.

source: New Dashboard Widget for running process tickets.
ru: Новый виджет в Дайджесте для выполняемых процессных заявок.

source: New search options for the last change time of the ticket.
ru: Доступна новая возможность поиска завок по времени последнего изменения.

source: Added new screen for outgoing emails on a ticket that are not replies.
ru: Добавлен новый экран для исходящих почтовых сообщений из заявки, не являющихся ответами.

source: Scalability &amp; Performance
ru: Масштабируемость и Производительность

source: OTRS 4 can handle more concurrent users/requests on the same hardware, and response times for single requests are shorter as well, especially for pages with lots of data.
ru: OTRS 4 может обрабатывать одновременно большее количество пользователей/запросов на том же оборудовании и время реакции на одиночные запросы уменьшено, в особенности для страниц с большим количеством данных.

source: The GenericInterface now also supports HTTP REST as network transport protocol.
ru: GenericInterface теперь поддерживает дополнительно HTTP REST в качестве сетевого транспортного протокола.

source: Postmaster filters are no longer limited to 4 match/set fields. They can now have a configurable amount of fields (default 12, up to 99).
ru: Фильры Postmaster больше не ограничены количеством из 4 полей проверки. Теперь можно настроить количество таких полей (от 12 по умолчанию, до 99).

source: A new configuration option Ticket::MergeDynamicFields makes it possible to specify which dynamic fields should also be merged when a ticket is merged to another ticket.
ru: Новая возможность конфигурации Ticket::MergeDynamicFields делает возможным задать, какие динамические поля должны быть объединены при слиянии заявки с другой заявкой.

source: Added new options to check dynamic fields of type text on patterns relating to error messages (translated), if they do not match.
ru: Добавлена новая возможность проверки значений динамических полей типа Текст на соответствие шаблону и выдачи сообщения (переводимого) при несоответствии.

source: Added new options to restrict dynamic fields of type date/datetime on future or past dates.
ru: Добавлена возможность ограничить вводимые значения динамических полей типа Дата/Время датами в будущем или прошлом.

source: OTRS can be configured to automatically unlock a ticket if articles are added and the owner is out of office.
ru: Теперь имеется возможность автоматической разблокировки заявки, если добвлено новое сообщение к заявке, а владелец ее установил опцию "Вне офиса".

source: Linked tickets of a specific type (e.g. merged or removed) can now be hidden via SysConfig option.
ru: Связанные заявки отдельных типов (например, объединенные или удаленные) могут быть скрыты через настройку в SysConfig.

source: ACL handling has been improved, made more consistent and easier to debug.
ru: Управление ACL было улучшено, сделано более логичным и удобным для отладки.

source: Added new ACL option PossibleAdd to add items to a possible list without resetting (like Possible does).
ru: Новая возможность конфигурации ACL - PossibleAdd для добавления элементов к списку Possible/Возможных без сброса/очистки (как это работает в Possible).

source: Added new ACL value modifiers [Not], [NotRegExp], [Notregexp], for all ACLs parts.
ru: Добавлены новые модификаторы значений для ACL [Not], [NotRegExp], [Notregexp], для всех компонентов ACL.

source: Process handling has been improved, made more consistent and easier to debug.
ru: Управление Процессами улучшено, сделано более логичным, последовательным и удобным для отладки.

source: A new GUID-based entity naming scheme for the OTRS Process configuration makes it possible to safely transfer processes from one system to another without duplicating the entities.
ru: Новая, основанная на GUID схема именования объектов в конфигурации Процессов в OTRS, делает возможным успешный перенос процессов из одной системы в другую без дублирования объектов.

source: Added new Transition Action to create a new ticket.
ru: Добавлено новое Действие Перехода/Transition Action для создания новой заявки.

source: Added possibility to define variable Transition Action attributes based on current process ticket values.
ru: Добавлена возможность задать различные атрибуты Transition Action/Действия Перехода, основанные на текущих значениях процессной заявки.

source: The possibility to schedule System Maintenance periods is available from the System Administration panel in the Admin interface.
ru: Возможность управления периодами Технического обслуживания/System Maintenance с панели Системного Администрирования в интерфейсе администратора.

source: A notification about an incoming System Maintenance period will be shown with some (configurable) time in advance.
ru: Уведомление о предстоящем периоде Технического обслуживания/System Maintenance в определенное (в настройках) время заранее.

source: If a System Maintenance is active, a notification about it will be shown on the Agent and Customer interface, and only admin users can log on to the system.
ru: Если режим Технического Обслуживания активен, уведомления об этом будут показаны агентам и клиентам в соответствующем интерфейсе и только администраторы системы могут к ней подключиться.

source: An overview screen informs admins about active sessions, which can be ended all on one click or one by one.
ru: Специальный экран информирует администратора об активных сеансах и он может их завершить все одним нажатием или последовательно, один за другим.

source: Added possibility to disable sysconfig import via configuration.
ru: Добавлена возможность запретить импорт конфигурации с помощью параметров настройки.

source: Added the possibility to restrict customer self registration by email address whitelist or blacklist, thanks to Renée Bäcker.
ru: Добавлена возможность ограничить саморегистрацию клиентов с помощью белых и черных спиской почтовых адресов, спасибо Renee Backer.

source: Added new dashboard module that shows the output of an external command, thanks to ib.pl.
ru: Добавлен новый модуль Дайджеста, отображающий результат выполнения внешних команд, спасибо ib.pl.

source: Development
ru: Разработка

source: New powerful template engine based on Template::Toolkit.
ru: Новый, мощный, механизм работы с шаблонами страниц, основанный на Template::Toolkit.

source: A central object manager makes creating and using global objects much easier (thanks to Moritz Lenz @ noris network).
ru: Централизованный Менеджер объектов делает создание и использование глобальных объектов более простым (спасибо Moritz Lenz @ noris network).

source: The OPM package format was extended to signal that a package has been merged into another package, allowing the package manager to correctly handle this situation on package installation or update.
ru: Новый формат пакетов OPM расширен средствами, указывающими, что этот пакет является частью другого пакета, позволяющими Менеджеру пакетов корректно управлять подобными ситуациями при установке или обновлении пакетов.

source: Caching was centralized in one global cache object which also performs in-memory caching for all data.
ru: Кэширование было объединено в единый глобальный объект управления кэшированием, который, также, выполняет кэширование в памяти для всех типов данных.

source: Added cache benchmark script, thanks to ib.pl.
ru: Добавлен скрипт оценки производительности кэширования, спасибо ib.pl.

source: OTRS can be installed on many different operating systems. OTRS can run on linux and on other unix derivates (e.g. OpenBSD or FreeBSD). OTRS does not have excessive hardware requirements. We recommend using a machine with at least a 2 GHz Xeon or comparable CPU, 2 GB RAM, and a 160 GB hard drive for a small setup.
ru: OTRS может быть установлен на многих операционных системах. OTRS работает Linux и других UNIX-подобных ОС (таких как например, OpenBSD или FreeBSD). Для работы OTRS не требуется каких нибудь специальных требований к оборудованию. Мы рекомендуем использовать машины, с процессором, как минимум 2 ГГц Xeon или совместимых CPU, 2 Гб ОЗУ и 160 Гб свободного пространства на жестком диске для небольших инсталляций.

source: For <application>Perl</application>, you will need some additional modules which can be installed either with the Perl shell and CPAN, or via the package manager of your operating system (<application>rpm</application>, <application>yast</application>, <application>apt-get</application>).
ru: Для <application>Perl</application>, вам могут потребоваться дополнительные модули, которые могут установлены либо через оболочку Perl и CPAN, либо с помощью менеджнра пакетов вашей ОС (<application>rpm</application>, <application>yast</application>, <application>apt-get</application>).

source: PostgreSQL 8.4 or higher
ru: PostgreSQL 8.4 или выше.

source: If you install a binary package of OTRS, which was built for your operating system (rpm), either the package contains all Perl modules needed or the package manager of your system should take care of the dependencies of the Perl modules needed.
ru: Для установки OTRS используются бинарные пакеты, собранные специально под вашу операционную систему (rpm), который включает все необходимые модули языка Perl, или пакеты, содержащие все необходимые Perl модули или менеджер пакетов вашей ОС должен показать перечень требуемых модулей.

source: To use OTRS, you'll be OK if you use a modern browser with JavaScript support enabled. These browsers are not supported:
ru: При использовании OTRS необходимо использовать последние версии браузеров с включенной поддержкой JavaScript. Следующие версии браузеров не поддерживаются:

source: Our <ulink url="https://www.otrs.com/otrs-business-solution-improving-customer-service/">OTRS Business Solution</ulink>™ offers you best professional support from the OTRS team, reliable OTRS security and regular free updates as well as an <ulink url="https://www.otrs.com/otrs-business-solution-improving-customer-service/#OTRS-Business-Solution-Cloud-Services">exclusive set of additional Business Features</ulink> that you can flexibly activate or deactivate according to different deployment scenarios.
ru: Наше решение <ulink url="https://www.otrs.com/otrs-business-solution-improving-customer-service/">OTRS Business Solution</ulink>™ предлагает вам профессиональную поддержку от команды OTRS, надежные и регулярные бесплатные обновления безопасности и , а также <ulink url="https://www.otrs.com/otrs-business-solution-improving-customer-service/#OTRS-Business-Solution-Cloud-Services"> специальный набор дополнительных бизнес - функций</ulink>, которые вы можете легко подключать или отключать, в зависимости от выбранного сценария внедрения.

source: From OTRS 4.0.1, parameters are not longer mandatory fixed values, but instead, they can inherit from the original ticket using format: &lt;OTRS_Ticket_property&gt;.
ru: Начиная с OTRS 4.0.1, параметры теперь необязательно имеют фиксированные значения, но, вместо этого, они могут наследовать их из оригинальной заявки используя формат: &lt;OTRS_Ticket_property&gt;.

source: From OTRS 4.0.6, the format &lt;OTRS_TICKET_property&gt; is now supported, older format is still usable, but deprecated as it will be dropped in further versions.
ru: Начиная с версии OTRS 4.0.6, поддерживается формат &lt;OTRS_TICKET_property&gt;, старый формат тоже может использоваться, но не рекомендуется, так как будет отменен в будущих версиях.

source: Contains all conditions that are necessary for this Transition to take effect. Example:
ru: Содержит все условия, необходимые для осуществления этого Transition/Перехода. Пример:

source: Creates a ticket with an article, the new ticket can be linked with process ticket. Example:
ru: Создает заявку с сообщением, новая заявка может быть связана с процессной заявкой. Пример:

source: 'Title' The ticket title.
ru: 'Название' Название заявки.

source: 'Queue' or 'QueueID' specifies the name or id of the queue to be used in the new ticket.
ru: 'Queue' или 'QueueID' задает имя или идентификатор очереди для использования в новой заявке.

source: 'Lock' or 'LockID' sets the lock status of the ticket.
ru: 'Lock' или 'LockID' задает статус блокировки для заявки.

source: 'Priority' or 'PriorityID' specifies the name or od if the priority to be used in the new ticket.
ru: 'Priority' или 'PriorityID' задает приоритет или его идентификатор, если они будут использоваться в новой заявке.

source: 'State' or 'StateID' specifies the name or id of the state to be used in the new ticket.
ru: 'State' или 'StateID' задает состояние или его идентификатор для использования в новой заявке.

source: 'CustomerID', the customer id to be set for the new ticket.
ru: 'CustomerID', идентификатор клиента/компании клиента для указания в новой заявке.

source: 'CustomerUser', the login of the customer that will be assigned in the ticket.
ru: 'CustomerUser', имя входа/login клиента, назначаемый новой заявке.

source: 'OwnerID', the ID of the agent that will be the new ticket owner.
ru: 'OwnerID', ID агента, который будет новым владельцем заявки.

source: 'TN', custom number for the new ticket.
ru: 'TN', пользовательский номер новой заявки.

source: 'Type' or 'TypeID' specifies the name or id of the ticket type to be used in the new ticket.
ru: 'Type' или 'TypeID' задает название или id типа заявки для использования в новой заявке.

source: 'Service' or 'ServiceID' specifies the name or id of the service to be used in the new ticket.
ru: Service' или 'ServiceID' задает название или id Сервиса для использования в новой заявке.

source: 'SLA' or 'SLaID' specifies the name or id of the SLA to be used in the new ticket.
ru: 'SLA' or 'SLaID' задает название или id SLA для использования в новой заявке.

source: 'ResponsibleID', the ID of the agent that will be the new ticket responsible.
ru: 'ResponsibleID', ID агента, назначаемого ответственным за новую заявку.

source: 'PendingTime', a predefined date to set the Ticket Pending Times, when the ticket state belongs to a pending state type
ru: 'PendingTime/Время напоминания', предопределенная дата для Ticket Pending Times, если состояние заявки относится к типу состояния - отложить

source: 'PendingTimeDiff', a dynamically date ( expressed in seconds from current date/time ) to set the Ticket Pending Times, when the ticket state belongs to a pending state type
ru: 'PendingTimeDiff', динамическая дата (разница, выражаемая в секундах от текущей даты/времени) для установки Ticket Pending Times, если состояние заявки относится к типу состояния - отложить

source: 'HistoryType' defines the type of the history entry. Possible values: AddNote, ArchiveFlagUpdate, Bounce, CustomerUpdate, EmailAgent, EmailCustomer, EscalationResponseTimeNotifyBefore, EscalationResponseTimeStart, EscalationResponseTimeStop, EscalationSolutionTimeNotifyBefore, EscalationSolutionTimeStart, EscalationSolutionTimeStop, EscalationUpdateTimeNotifyBefore, EscalationUpdateTimeStart, EscalationUpdateTimeStop, FollowUp, Forward, Lock, LoopProtection, Merged, Misc, Move, NewTicket, OwnerUpdate, PhoneCallAgent, PhoneCallCustomer, PriorityUpdate, Remove, ResponsibleUpdate, SendAgentNotification, SendAnswer, SendAutoFollowUp, SendAutoReject, SendAutoReply, SendCustomerNotification, ServiceUpdate, SetPendingTime, SLAUpdate, StateUpdate, Subscribe, SystemRequest, TicketDynamicFieldUpdate, TicketLinkAdd, TicketLinkDelete, TimeAccounting, TypeUpdate, Unlock, Unsubscribe, WebRequestCustomer.
ru: 'HistoryType/Тип записи Истории' задает типы/названия записей истории заявки. Возможные значения: AddNote, ArchiveFlagUpdate, Bounce, CustomerUpdate, EmailAgent, EmailCustomer, EscalationResponseTimeNotifyBefore, EscalationResponseTimeStart, EscalationResponseTimeStop, EscalationSolutionTimeNotifyBefore, EscalationSolutionTimeStart, EscalationSolutionTimeStop, EscalationUpdateTimeNotifyBefore, EscalationUpdateTimeStart, EscalationUpdateTimeStop, FollowUp, Forward, Lock, LoopProtection, Merged, Misc, Move, NewTicket, OwnerUpdate, PhoneCallAgent, PhoneCallCustomer, PriorityUpdate, Remove, ResponsibleUpdate, SendAgentNotification, SendAnswer, SendAutoFollowUp, SendAutoReject, SendAutoReply, SendCustomerNotification, ServiceUpdate, SetPendingTime, SLAUpdate, StateUpdate, Subscribe, SystemRequest, TicketDynamicFieldUpdate, TicketLinkAdd, TicketLinkDelete, TimeAccounting, TypeUpdate, Unlock, Unsubscribe, WebRequestCustomer.

source: 'TimeUnit' the time invested in the current ticket article expressed in seconds, minutes, hours, etc.
ru: 'TimeUnit/Единицы времени' - время, потраченное на текущее действие по заявке, выраженное секундах, минутах, часах, и т. д.

source: 'DynamicField_NameX' where DynamicField_ is a required prefix and NameX is the name of a Dynamic Field to be set in the new ticket (on ticket level, not article levels)
ru: DynamicField_NameX' где DynamicField_ обязательный префикс и NameX имя Динамического поля заданного для новой заявки (только на уровне заявки, не сообщений/заметкок)

source: 'LinkAs' to define the new ticket relation with originator ticket, from the new ticket point of view, for example Normal, Parent, Child etc.
ru: 'LinkAs/Связать как' для определения отношения к оригинальной заявке, с точки зрения новой заявки, например, Normal/Обычная, Parent/Родитель, Child/Потомок и т. д.

source: From OTRS 2.0 on, Access Control Lists (ACLs) can be used to control access to tickets, modules, queues, etc., or to influence actions on tickets (closing, moving, etc.) in certain situations. ACLs can be used to supplement the existing permission system of <link linkend="adminarea-roles">roles</link> and <link linkend="adminarea-groups">groups</link>. Using ACLs, rudimentary work-flows within the system can be mapped, based on ticket attributes.
ru: Начиная с OTRS 2.0, Access Control Lists (ACLs) могут использоваться для управления доступом к заявкам, модулям, очередям и пр., или для влияния на действия по заявкам (закрытие, перемещение и т.д д.) в определенных ситуациях. ACL могут быть использованы в дополнение к существующей системе разрешений/прав <link linkend="adminarea-roles">Роли</link> и <link linkend="adminarea-groups">Группы</link>. С использованием ACL могут быть построены элементарные work-flows, основанные на атрибутах заявки.

source: In a general way ACLs are used to reduce the possible options for a ticket based on a defined set of rules.
ru: В основном, ACL используются для ограничения возможных действий над заявками, основанные на заданном наборе правил.
