Repository: DSigmund/doc-admin
Catalog: i18n/doc-admin.*.po
Languages: ja, ru, sw

source: Each module has its own and different parameters. Please review the <link linkend="available-transition-actions">module documentation</link> to learn all require and optional parameters.
ja: モジュールはそれぞれそれ自身のものおよび異なるパラメーターを持っています。全ての必須及び任意のパラメタを知るために<link linkend="available-transition-actions">モジュール・ドキュメンテーション</link>をレビューして下さい。
ru: Каждый модуль имеет свои собственные и другие параметры, пожалуйста просмотрите документацию к этому модулю <link linkend="available-transition-actions">module documentation</link>, чтобы узнать все обязательные и опциональные параметры.
sw: Kila moduli ina parameta zake tofauti. Tafadhali pitia <link linkend="available-transition-actions">nyaraka za moduli</link> ili kujifunza parameta zote zinazohitajika na za hiari.

source: Add new Transition Action
ja: 新規推移アクションの追加
ru: Добавить новый Переход
sw: Ongeza vitendo vya mpito mpya

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="process-management - screenshot" scale='40' fileref="screenshots/pm-edit-transitionaction.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="プロセス - 管理 - スクリーンショット" scale='40' fileref="screenshots/pm-edit-transitionaction.png"></graphic>

source: <emphasis>Figure: Add new Transition Action.</emphasis>
ja: <emphasis>新規推移アクションの追加</emphasis>
ru: <emphasis>Рисунок: Добавить новый переход деятельности.</emphasis>
sw: <emphasis>Kielelezo: Ongeza vitendo vya mpito mpya.</emphasis>

source: After all parameters and values are set click on the submit button to save the changes.
ja: 全ての条件を設定後、変更を保存するために送信ボタンをクリックします。
ru: Как только все параметры и значения установлены, нажмите кнопку отправить чтобы изменения вступили в силу.
sw: Baada ya parameta na thamani zote kusetiwa bofya kitufe kuwasilisha ili kuhifadhi mabadiliko.

source: Create the following Transitions Actions:
ja: 次の推移アクションを作成してください:
ru: Создать следующие Переходы:
sw: Tengeneza vitendo vya mpito vifwatavyo:

source: "Move the process ticket into the 'Management' queue" (TA1)
ja: 「「管理」キューへプロセス・チケットを移動」(TA1)
ru: "Переместить обработку Заявки в очередь 'Менеджмент' " (TA1)
sw: "Peleka tiketi ya mchakato kwa Foleni ya 'Usimamizi' (TA1)

source: This action is supposed to be executed when the Transition "Approval" (T1) applied.
ja: このアクションは推移「承認」(T1)が適用される時、実行されると思われます。
ru: Предполагается, что это действие будет выполнено когда применен Переход "Утверждение" (T1).
sw: Hiki kitendo kinatakiwa kutekelezwa wakati Mpito "Kibali" (T1) umetumika.

source: "Change ticket responsible to 'manager'" (TA2)
ja: 「チケットの責任者を「マネージャ」に変更」」 (TA2)
ru: "Изменяет ответственного за заявку на 'manager'" (TA2)
sw: "Badilisha tiketi inayowajibika kwa 'manager'" (TA2)

source: To be executed when the Transition "Approval" (T1) applied.
ja: 推移「承認」(T1)の適用時、実行されるべきです。
ru: Будет выполнено когд применен Переход "Approval" (T1).
sw: Itatekelezwa pale mpito "Kibali" (T1) umetumika.

source: "Move the process ticket into the 'Employees' queue"" (TA3)
ja: 「「従業員」キューへのプロセス・チケットの移動」(TA3)
ru: "Перемещает процесс обработки заявки в очередь 'Employees' "" (TA3)
sw: "Peleka tiketi ya mchakato kwenye Foleni ya 'Wateja'" (TA3)

source: To be executed when:
ja: 以下の場合実行されるべきです：
ru: Будет выполнено когда:
sw: Itatekelezwa wakati:

source: The Transition "Approval denied" (T2) applied
ja: 推移: 「否認」(T2)が適用された
ru: Применение Перехода "Отказано в утверждении" (T2)
sw: Mpito "Kibali kimekataliwa" (T2) umetumika

source: The Transition "Order denied" (T4) applied
ja: 推移: 「注文拒否」（T4）が適用された
ru: Применение Перехода "Order denied" (T4)
sw: Mpito "Oda imekataliwa" (T4) umetumika

source: The Transition "Shipment received" (T6) applied
ja: 推移：「出荷受取」（T6)が適用された
ru: Применение Перехода "Поставка получена" (T6)
sw: Mpito "Vilivyosafirishwa vimepokelewa" (T6) umetumika

source: "Change ticket responsible to 'Employee'" (TA4)
ja: 「チケットの責任者を「従業員」へ変更」(TA4)
ru: "Изменить ответственного за заявку на 'Employee'" (TA4)
sw: "Badilisha tiketi inayowajibika kwa 'Mwajiriwa'" (TA4)

source: The transition "Approval denied" (T2) applied
ja: 推移:「承認拒否」(T2)が適用された
ru: Применен переход "Отказано в утверждении" (T2)
sw: Mpito "Kibali kimekataliwa" (T2) umetumika

source: The transition "Order denied" (T4) applied
ja: 推移:「注文拒否」(T4) が適用された
ru: Применен переход "Заказ отменен" (T4)
sw: Mpito "Oda imekataliwa" (T4) umetumika

source: The transition "Shipment received" (T6) applied
ja: 推移:「貨物受取」(T6) が」適用された
ru: Применен переход "Поставка получена" (T6)
sw: Mpito "Vilivyosafirishwa vimepokelewa" (T6) umetumika

source: "Move process ticket into the 'Purchasing' queue" (TA5)
ja: 「プロセス・チケットを「購入」キュー」（TA5)へ移動する
ru: "Перемещает обработку Заявки в очередь 'Purchasing' " (TA5)
sw: "Peleka tiketi ya mchakato kwa Foleni ya 'Manunuzi'" (TA5)

source: To be executed when the transition "Approved" (T3) applied.
ja: 推移「承認済」(T3)が適用された場合に実行されるべきです。
ru: Будет выполнено когда применен Переход "Утверждено" (T3).
sw: Itatekelezwa pale mpito "Imekubaliwa" (T3) umetumika.

source: "Move process ticket into the 'Post office' queue" (TA6)
ja: 「プロセス・チケットを「郵便局」キューへ移動」（TA6)
ru: "Перемесить процессную заявку в очередь "Post office" " (TA6)
sw: "Peleka tiketi za mchakato kwenye Foleni ya 'Ofisi ya posta'" (TA6)

source: To be executed when the transition "Order placed" (T5) applied.
ja: 推移「発注」（T5)が適用されたら実行されるべきです。
ru: Будет выполнено когда применен Переход "Заказ размещен" (T5).
sw: Itatekelezwa pale mpito "Oda imewekwa" (T5) umetumika.

source: "Close ticket successfully" (TA7)
ja: 「チケットが正しく完了しました（TA7)」
ru: "Закрыть Заявку со статусом успешно" (TA7)
sw: "Kufunga tiketi kumefanikiwa" (TA7)

source: "Close ticket unsuccessfully" (TA8)
ja: 「チケットが正しく完了しませんでした」（TA8)
ru: "Закрыть заявку со статусом не успешно" (TA8)
sw: "Kufunga tiketi hakujafanikiwa" (TA8)

source: As you can see, there are places where the same Transition Actions should be executed. Therefore it is reasonable to make it possible to link Transition Actions freely with Transitions to be able to reuse them.
ja: ご覧のように、同じ推移アクションが実行されるべき場所があります。したがって、それらを再使用することができるように推移アクションと推移とを自由にリンクすることを可能にすることは合理的なやり方です。
ru: Как можно видеть, есть места, где одинаковые Transition Actions/Действия Перехода будут выполняться. Таким образом было бы логично сделать возможным связывать Transition Actions свободно с Transitions/Переходами, для их повторного использования.
sw: Kama unavyo ona, kuna sehemu ambazo vitendo vya mpito vile vile vitatekelezwa. Hivyo ni busara kuwezesha muunganiko wa Vitendo vya Mpito na Mapito kirahisi ili kuweza kurudia kuvitumia.

source: Activities
ja: アクティビティ
ru: Деятельность
sw: Shughuli

source: We chose the approach to see Activities as a basket which can contain one or more Activity Dialogs.
ja: アクティビティをひとつのバスケットとみなすアプローチを選択します。それは単数または複数のアクティビティ・ダイアログを含むことができます。
ru: Мы выбрали такой подход чтобы рассматривать Деятельности в качестве корзины, которая может хранить однин или больше Диалогов Деятельности. Нам нужны эти действия в нашем примере:
sw: Tumechagua mbinu ya kuona shughuli kama kikapu ambacho kina Maongezi ya Shughuli.

source: Click on "Activities" in the "Available Process Elements", then click on "Create New Activity".
ja: 「利用可能なプロセス要素」中の「アクティビティ」をクリックして、次に、「新規アクティビティの作成」をクリックしてください。
ru: Кликните на "Деятельности" в меню "Доступные Элементы Процесса", а затем кликните на "Создать новую Деятельность".
sw: Bofya "Shughuli" katika "Elementi za Michakato Zilizopo", kisha bofya "Tengeneza Shughuli Mpya".

source: Create New Activity button
ja: 新規アクティビティボタンの作成
ru: Создать Новую кнопку Деятельности
sw: Tengeneza kitufe kipya cha shughuli

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="process-management - screenshot" scale='40' fileref="screenshots/pm-accordion-new-activity.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="プロセス - 管理 - スクリーンショット" scale='40' fileref="screenshots/pm-accordion-new-activity.png"></graphic>

source: <emphasis>Figure: Create New Activity button.</emphasis>
ja: <emphasis>図：新規アクティビティボタンの作成</emphasis>
ru: <emphasis>Рисунок: Создание кнопки New Activity/Новая Активность.</emphasis>
sw: <emphasis>Kielelezo: Tengeneza Kitufe kipya cha Shughuli .</emphasis>

source: In the opened popup screen fill the "Activity Name", Then drap the required Activity Dialogs from the "Available Activity Dialogs" pool, and drop then into to the "Assigned Activity Dialogs" pool. This dialogs will be presented (in the ticket zoom screen) in the same order as it is defined on this screen translating from top to bottom, to left to right.
ja: 開かれたポップ・アップ・画面中で「アクティビティ名」を記入して下さい。次に、必要なアクティビティ・ダイアログを”利用可能なアクティビティ・ダイアログ”プールからドラッグして、「割り当てされたアクティビティ・ダイアログ」プールへドロップします。このダイアログはチケット・ズーム画面で同じ順序で表示されるでしょう。その順序とは最上部から最下部、左から右へ推移するこの画面で定義されたものです。
ru: В открывшемся всплывающем окне заполните "Activity Name/Имя Активности", затем захватите мышкой требуемые Activity Dialogs/Диалоги Активности из списка "Available Activity Dialogs/Доступные Диалоги Активности" и перетащите их в список "Assigned Activity Dialogs/Назначенные Диалоги Активности". Эти диалоги будут отображаться (на экране подробного просмотра заявки) с таком же порядке как это было задано на этом экране - лексикографически, т.е. сверху вниз, слева направо.
sw: Katika skrini ibukizi iliyofunguliwa jaza "Jina la Shughuli", kisha kokota Maongezi ya Shughuli yanayotakiwa kutoka "Maongezi ya Shughuli Yanayopatikana" na ziweke kwenye "Maongezi ya Shughuli Yaliyogawiwa". Haya maongezi yataonyeshwa (katika skrini iliyokutwa ya tiketi) katika oda ile ile kama ilivyofafanuliwa kwenye skrini hii ikitafsiri kutoka juu kwenda chini, kwenda kushoto kwenda kulia.

source: This order is specially important in the first Activity, since the first Activity Dialog for this activity is the only one that is presented when the process starts
ja: この順序は特に最初のアクティビティで重要です。というのは、このアクティビティのための最初のアクティビティ・ダイアログはそれがプロセスが開始する時に表示されるただひとつのものだからです。
ru: Такой порядок особенно важен в первой Деятельности, так как первый Диалог Деятельности для этой Деятельности является единственным, который находится при запуске процесса
sw: Hii oda ni muhimu hasa kwa Shughuli ya kwanza, kwa kuwa Maongezi ya kwanza ya Shughuli kwa shughuli hii ndio ya pekee yanawasilishwa mchakato ukianza.

source: Create the following Activities:
ja: 次のアクティビティを作成しましょう。
ru: Создать следующие Деятельности:
sw: Tengeneza Shughuli zifuatazo

source: "Recording the demand" (A1)
ja: 「依頼（要求）の記録」（A1)
ru: "Recording the demand/Запись запроса" (A1)
sw: "Kurekodi mahitaji" (A1)

source: Contains the Activity Dialog "Recording the demand" (AD1)
ja: アクティビティ・ダイアログ「依頼（要求）の記録」を含みます（AD1）
ru: Содержит Activity Dialog/Диалог Активности "Recording the demandЗапись запроса" (AD1)
sw: Ina Maongezi ya Shughuli "Kurekodi mahitaji" (AD1)

source: "Approval" (A2)
ja: 「承認」(A2)
ru: "Approval/Утверждение" (A2)
sw: "Kibali" (A2)

source: Contains the Activity Dialogs "Approval denied" (AD2) as well as "Approved" (AD3)
ja: アクティビティ・ダイアログ「承認」（AD3)と同様に「承認拒否」（AD2)を含みます。
ru: Содержит Диалоги Активности "Отказано в одобрении" (AD2) а также "Утвержден" (AD3)
sw: Ina Maongezi ya Shughuli "Kibali kimekataliwa" (AD2) na pia "Imekubaliwa" (AD3)

source: "Order" (A3)
ja: 「注文」（A3)
ru: "Заказ" (A3)
sw: "Oda" (A3)

source: Contains the Activity Dialogs "Order rejected" (AD4) as well as "Order placed" (AD5)
ja: アクティビティ・ダイアログ「発注」（AD5)と同様に「注文拒否」（AD4)を含みます。（AD5）
ru: Содержит Диалоги Активности "Заказ отклонен" (AD4) а также "Заказ размещен" (AD5)
sw: Ina Maongezi ya Shughuli "Oda imekataliwa" (AD4) na pia "Oda imewekwa" (AD5)

source: "Incoming" (A4)
ja: 「入荷」(A4)
ru: "Входящие" (A4)
sw: "Zinazoingia" (A4)

source: Contains the Activity Dialog "Shipment received" (AD6)
ja: アクティビティ・ダイアログ「貨物受取」（AD6)を含みます。
ru: Содержит Activity Dialog/Диалог Активности "Shipment received/Посылка получена" (AD6)
sw: Ina Maongezi ya Shughuli "Vilivyosafirishwa vimepokelewa" (AD6)

source: "Process complete" (A5): This is an Activity without possible Activity Dialogs. It will be set after "Approval denied", "Order denied" or "Shipment received" and represents the end of the process.
ja: 「プロセス完了」（A5）：これは可能なアクティビティ・ダイアログのないアクティビティです。「承認拒否」、「注文拒否」または「貨物受取」の後にセットされ、プロセスの終了を表します。
ru: "Process complete/Процесс завершен" (A5): Это Activity/Действие без возможных Activity Dialogs/Диалогов Активности. Оно должно быть вставлено после "Approval denied/Не утверждено", "Order denied/Заказ отвергнут" или "Shipment received/Посылка получена" и указывает на окончание процесса.
sw: "Mchakato umekamilika" (A5): Hii ni shughuli bila maongezi ya shughuli yawezekanayo. Ita setiwa baada ya "Kibali kimekataliwa", "Oda imekataliwa" au "Vilivyosafirishwa vimepokelewa" na inaashiria mwisho wa mchakato.

source: Now we can clearly see that Activities are precisely defined states of a process ticket. After a successful Transition a process ticket moves from one Activity to another.
ja: アクティビティが、プロセス・チケットの正確に定義された状態であることを明確に理解しました。成功した推移の後、プロセス・チケットはあるアクティビティから別のアクティビティへ遷移します。
ru: Теперь мы можем видеть, что Деятельность точно определяет сосотояние процесса Заявки. После успешного Перехода Заявка перемещается из одного вида деятельности в другой.
sw: Sasa tunaweza kuona shughuli zimefafanuliwa kuwa hali za michakato ya tiketi. Baada ya kufanikiwa kwa mpito tiketi inapelekwa kutoka shughuli moja kwenda nyingine.

source: Book ordering process Path
ja: 本の注文プロセスのパス
ru: Схема процесса заказа книги
sw: Njia ya mchakato wa kuoda kitabu

source: Let us conclude our example with the last missing piece in the puzzle, the Process as the a flow describer. In our case this is the whole ordering work-flow. Other processes could be office supply ordering or completely different processes.
ja: フローの記述者としてのプロセス、パズルの最後の欠けた１ピースで私たちの例を終えることにしましょう。私たちのケースでは、これは全注文ワークフローです。他のプロセスは事務用品注文あるいは完全に異なるプロセスでありえます。
ru: Давайте закончим наш пример с последней недостающей частью головоломки - Процессом, как описанием потока работ. В нашем случае это весь рабочий процесс заказа. Другие процессы могут быть похожими, типа заказа офисных принадлежностей, или совершенно иными.
sw: Tuhitimishe mfano wetu na kipande cha mwisho kisichokwepo cha fumbo, mchakato kama mfafanuzi wa mtiririko. Katika kesi yetu huu ni upangaji mzima wa mtiririko wa kazi. Michakato mingine inaweza kuwa kuewka oda za vifaa vya ofisi na michakato mingine tofauti kabisa.

source: The process has a starting point which consists of the start Activity and the start Activity Dialog. For any new book order, the start Activity Dialog (first Activity Dialog for the first Activity) is the first screen that is displayed. If this is completed and saved, the Process ticket will be created and can follow the configured work-flow.
ja: プロセスには、スタート・アクティビティおよびスタート・アクティビティ・ダイアログをから成る、出発点があります。任意の新しい本オーダーについては、スタート・アクティビティ・ダイアログ(最初のアクティビティのための第1のアクティビティ・ダイアログ)は、表示される最初の画面です。これが完成し保存されれば、プロセス・チケットは作成され、形成されたワークフローに続くことができます。
ru: Процесс имеет начальную точку, состоящую из стартового Activity/Действия и стартового Activity Dialog/Диалога активности. Для любого нового заказа книги, начальный Activity Dialog/Диалог активности (первый диалог для первого Действия) является первым отображаемым экраном. Если он завершен и сохранен, будет создаваться новая процессная заявка, которая далее будет выполняться в соответствии с заданным потоком работ/work-flow.
sw: Mchakato una pointi ya kuanza ambayo ina Shughuli ya kuanza na Maongezi ya Shughuli ya kuanza. Kwa oda yeyote mpya ya kitabu, skrini ya kwanza kuonyeshwa ni ya Maongezi ya Shughuli (Maongezi ya kwanza ya Shughuli kwa Shughuli ya kwanza). Kama hii imemalizika na kuhifadhiwa, tiketi ya mchakato itatengenezwa na kufwata sanidi ya mtiririko wa kazi.

source: The process also contains the directions for how the process ticket can move through the Process. Let's call this the "Path". It consists of the start Activity, one or more Transitions (possibly with Transition Actions), and other Activities.
ja: プロセスには、プロセス・チケットどのようにしてがプロセスを通過できるのかについての指示も含まれています。これを「パス」と呼びましょう。それは、スタート・アクティビティ、1つ以上の推移(恐らく推移アクションを持った)および他の活動から成ります。
ru: Процесс также содержит указания, как процессная заявка будет продвигаться внутри Процесса. Назовем это "Path/Схема". Она состоит из начального Activity/Действия, одного или более Transitions/Переходов (возможно, с Transition Actions/Действиями переходов) и других Activities/Действий.
sw: Mchakato pia una mwelekeo ambao tiketi ya mchakato itapitishwa ndani ya mchakato. Tuiite hii "Njia". Ina Shughuli ya kuanza, Mpito mmoja au zaidi (pengine na Vitendo vya Mpito), na Shughuli nyingine.

source: Assuming that the Activities has already assigned their Activity Dialogs drag an Activity from the accordion (in the left part of the screen) and drop it into the canvas area (below process information). Notice that an arrow from the process start (green circle) to the Activity is placed automatically. (This is the first Activity and its first Activity Dialog is the first screen that will be shown when the process starts).
ja: アクティビティがすでにアクティビティ・ダイアログを割り当てしたと仮定すると、アクティビティをアコーデオン（画面左部）からドラッグします。そしてそれをキャンバスエリア（以下のプロセス情報）にドロップします。プロセス・スタート(緑の円)からアクティビティまでの矢印が自動的に置かれることに注目してください。(これは最初のアクティビティです。また、その最初のアクティビティ・ダイアログは プロセスが開始するときに表示される最初の画面です)。
ru: Предполагая, что эти Активности/Activities уже назначены их Диалогам/Activity Dialogs, перетащите Активность из "гармошки" (в левой части экрана) и поместите на область схемы (ниже информации о процессе). Заметьте, что стрелка от начала процесса (зеленый кружок) к Активности будет проложена автоматически. (Это первая Активность и ее первый Диалог будет первым экраном, который будет показан при старте Процесса).
sw: Tukiamini kwamba Shughuli tayari zimegawia Maongezi Ya Shughuli kuokota Shughuli kutoka kwenye kodiani (katika upande wa kushoto wa skrini) na kuzidondosha kwenye eneo la turubai (chini ya taarifa za mchakato). Tambua mshale kutoka mwanzo wa mchakato (duara la kijani) kwenda kwenye Shughuli imewekwa kiotomatiki. (Hii ni Shughuli ya kwanza na Maongezi yake ya kwanza ya Shughuli ni skrini ya kwanza ambayo itaonyeshwa wakati mchakato unaanza).

source: Drag first Activity into the canvas
ja: キャンバスに第1のアクティビティをドラッグしてください。
ru: Перетащите первую Активность на полотно схемы.
sw: Kokota shughuli ya kwanza kwenye turubai

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="process-management - screenshot" scale='40' fileref="screenshots/pm-canvas-drag-activity.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="プロセス - 管理 - スクリーンショット" scale='40' fileref="screenshots/pm-canvas-drag-activity.png"></graphic>

source: <emphasis>Figure: Drag first Activity into the canvas.</emphasis>
ja: <emphasis>図:キャンバスに第1のアクティビティをドラッグしてください</emphasis>
ru: <emphasis>Рисунок: Помещение первой Активности на полотно схемы.</emphasis>
sw: <emphasis>Kielelezo: Kokota shughuli ya kwanza kwenye turubai.</emphasis>

source: Next, drag another Activity into the canvas too. now we will have two Activities in the canvas the first one is connected to the start point and the second has no connections, you can hover the mouse over each activity to reveal their own Activity Dialogs.
ja: 次に、キャンバスに別のアクティビティをドラッグしてください。キャンバスに2つのアクティビティを持つことになります。ひとつはスタート点に接続され、もう一方は接続点を持ちません。それぞれのアクティビティ上でマウスポインタを持っていくと、それらアクティビティ・ダイアログを確認することができます。
ru: Затем, перетащите следующую Активность на схему, таким же образом. Теперь, мы имеем две Активности на схеме, первая имеет соединение с точкой начала Процесса, а вторая пока не имеет соединений. Вы можете навести курсор мыши на каждую Активность, чтобы отобразить их собственный Диалог Активности.
sw: Kokota shughuli nyingine kwenye turubai. sasa tuna shughuli mbili kwenye turubai ya kwanza imeunganishwa na pointi ya kuanza na ya pili haina muunganiko, unaweza kupitisha kipanya juu ya kila shughuli ku dhihirisha Maongezi Shughuli yao.

source: Drag second Activity into the canvas
ja: 第二のアクティビティをキャンバスにドラッグします。
ru: Перетащите вторую Активность на полотно схемы.
sw: Kokota shughuli ya pili kwenye turubai

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="process-management - screenshot" scale='40' fileref="screenshots/pm-canvas-drag-activity2.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="プロセス - 管理 - スクリーンショット" scale='40' fileref="screenshots/pm-canvas-drag-activity2.png"></graphic>

source: <emphasis>Figure: Drag second Activity into the canvas.</emphasis>
ja: <emphasis>図：第二のアクティビティをキャンバスにドラッグします</emphasis>
ru: <emphasis>Рисунок: Помещение второй Активности на полотно схемы.</emphasis>
sw: <emphasis>Kielelezo: Kokota shughuli ya pilikwenye turubai.</emphasis>

source: Then let's create the "Path" (connection) between this two Activities, for this we will use the Transitions, Click on Transitions in the accordion drag a Transition and drop it inside the first Activity, notice that the Activity change its color indicating that the Transition is attached, as soon as the Transition is dropped the end point of the Transition arrow will be placed next to the process start point. Drag the Transition arrow end point and drop it inside the other Activity to create the connection between the Activities.
ja: それからこの2つのアクティビティ間の「パス」を作成しましょう、そのために推移を使います。アコーディオン状の推移をクリックし、推移をドラッグしそれを最初のアクティビティの内部にドロップします。アクティビティはその色が 推移が添付されたことを示して、変化することに気づいて下さい。推移が推移の端の矢印にドロップされるとすぐに、スタート開始点の隣に置かれるでしょう。 アクティビティ間の接点を作成するために、推移の矢印の終了点をドラッグしてそれを他のアクティビティの内部にドロップします。
ru: Теперь, давайте создадим "Path" (соединение) между двумя Активностями, для чего используем Переходы/Transitions. Кликните по Переходу на "гармошке", перетащите его на схему и отпустите внутри первой Активности, обратите внимание что значок Активности изменил цвет, показывая этим, что Переход присоединен. Как только вы отпустите мышь конец стрелки Перехода будет помещен рядом с точкой начала Процесса. Перетащите конец стрелки Перехода и опустите его внутри значка другой Активности для создания соединения между Активностями.
sw: Kisha tutengeneze "Njia" (uhusiano) kati ya shughuli hizi mbili, kwa hili tutatumia Mapito, Bofya kwenye Mapito kwenye kodiani kokota Mpito na udondoshe ndani ya Shughuli ya kwanza, tambua kwamba Shughuli inabadilisha rangi kuonyesha Mpito umeambatanishwa, baada tu ya mpito kudondoshwa mwisho wa mshale wa Mpito utawekwa karibu na pointi ya kuanza mchakato. Kokota mwisho wa mshale wa Mpito na udondoshe ndani ya shughuli nyingine kutengeneza uhusiano kati ya Shughuli hizo.

source: Drag a Transition into the canvas
ja: キャンバスに推移をドラッグします。
ru: Перетащите Transition/Переход на полотно схемы.
sw: Kokota Mapito kwenda kwenye turubai

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="process-management - screenshot" scale='40' fileref="screenshots/pm-canvas-drag-transition.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="プロセス - 管理 - スクリーンショット" scale='40' fileref="screenshots/pm-canvas-drag-transition.png"></graphic>

source: <emphasis>Figure: Drag a Transition into the canvas.</emphasis>
ja: <emphasis> 図:キャンバスに推移をドラッグします。</emphasis>
ru: <emphasis>Рисунок: Перетащите Transition/Переход на полотно схемы.</emphasis>
sw: <emphasis>Kielelezo: Kokota Mapito kwenda kwenye turubai.</emphasis>

source: Now that the "Path" between the Actions is defined, then we need to assign the Transition Actions to the Transition, double click the Transition label (in the canvas), this will open a new popup window.
ja: アクション間の「パス」が今定義されたので、次に推移に推移アクションを割り当てする必要があります。推移ラベル(キャンバス中の)をダブルクリックし、新しいポップアップ・ウィンドウを開きます。
ru: Теперь, когда "Path/Последовательность" Действий задана - необходимо назначить Действия Переходов/Transition Actions для Переходов/Transition. Двойной щелчок по имени Перехода (на схеме) откроет новое дополнительное окно.
sw: Sasa "Njia" kati ya vitendo imefafanuliwa, kisha tunahitaji kuweka Vitendo vya Mpito chini ya Mpito, bofya marambili lebo ya mpito (ndani ya turubai), hii itafungua dirisha ibukizi jipya.
