Repository: DSigmund/doc-admin
Catalog: i18n/doc-admin.*.po
Languages: ja, ru, sw

source: Web server which runs as the OTRS user: <placeholder type="screen" id="0"/>
ru: Web server работающий как пользователь OTRS: <placeholder type="screen" id="0"/>

source: Webserver with wwwrun user (e. g. SUSE): <placeholder type="screen" id="0"/>
ru: Webserver с пользователем wwwrun (например в SUSE): <placeholder type="screen" id="0"/>

source: Webserver with apache user (e. g. Red Hat, CentOS): <placeholder type="screen" id="0"/>
ru: Webserver с пользователем apache (например, Red Hat, CentOS): <placeholder type="screen" id="0"/>

source: Webserver with www-data user (e. g. Debian, Ubuntu): <placeholder type="screen" id="0"/>
ru: Webserver с пользователем www-data (например, Debian, Ubuntu): <placeholder type="screen" id="0"/>

source: Step 4.2: With the RPM:
ru: Шаг 4.2: С помощью RPM:

source: <placeholder type="screen" id="0"/> In this case the RPM update automatically restores the old configuration files and sets file permissions.
ru: <placeholder type="screen" id="0"/> В этом случае обновление из RPM автоматически восстанавливает старые конфигурационные файлы и устанавливает нужные права на файлы.

source: Step 5: Check needed Perl modules
ru: Шаг 5: Проверка требуемых Perl модулей

source: Step 6: Apply the database changes
ru: Шаг 6: Применение обновлений базы данных

source: Step 6.1: Database schema update
ru: Шаг 6.1: Схема обновления БД

source: Note: new tables created in the MySQL UPGRADING process will be created with the default table storage engine set in your MySQL server. In MySQL 5.5 the new default type is <code>InnoDB</code>. If existing tables, e.g. "users", have the table storage engine e.g. <code>MyISAM</code>, then an error will be displayed when creating the foreign key constraints.
ru: Примечание: новые таблицы, созданные в процессе MySQL UPGRADING будут созданы с методом доступа по умолчанию, установленном в вашем MySQL сервере. В MySQL 5.5 применяется новый метод - <code>InnoDB</code>. Если существующие таблицы, например, "users", имеют метод доступа, например, <code>MyISAM</code>, может появиться сообщение об ошибке при создании внешних ключей.

source: You have two options: you can change the default storage engine of MySQL back to <code>MyISAM</code> so that new tables will have the same engine as the existing tables, or change the existing tables to use InnoDB as storage engine.
ru: Имеется два варианта: вы можете изменить стандартный метод доступа MySQL обратно в <code>MyISAM</code>, при этом новые таблицы будут иметь тот же метод, что и старые, или перенастроить существующие таблицы на использование InnoDB.

source: Any problems with regards to the storage engine will be reported by the <filename>otrs.CheckDB.pl</filename> script, so please run it to check for possible issues. <placeholder type="screen" id="0"/>
ru: Любые проблемы, связанные с использованием метода доступа будут отражены в отчете скрипта <filename>otrs.CheckDB.pl</filename>. Выполните его для обнаружения возможных проблем. <placeholder type="screen" id="0"/>

source: Step 6.2: Database migration script
ru: Шаг 6.2: Скрипт миграции БД

source: Run the migration script (as user <code>otrs</code>, NOT as <code>root</code>): <placeholder type="screen" id="0"/> Do not continue the upgrading process if this script did not work properly for you. Otherwise data loss may occur.
ru: Выполните скрипт для миграции (как пользователь <code>otrs</code>, НЕ как <code>root</code>): <placeholder type="screen" id="0"/> Не продолжайте процесс обновления, если этот скрипт отрабатывает неправильно, по вашему мнению. Иначе, вы можете потерять данные.

source: Step 7: Own themes
ru: Шаг 7: Собственные темы

source: Note: The OTRS themes of 3.3 are NOT compatible with OTRS 4, so don't use your old themes!
ru: Примечание: Темы OTRS 3.3 и OTRS 4 НЕ совместимы между собой, так что не используйте старые темы!

source: Themes are located under <filename>/opt/otrs/Kernel/Output/HTML/*/*.tt</filename>.
ru: Темы расположены в <filename>/opt/otrs/Kernel/Output/HTML/*/*.tt</filename>.

source: Please note that OTRS 4 comes with a new templating engine based on <ulink url="http://www.template-toolkit.org">Template::Toolkit</ulink>. All customized templates must be converted from DTL to the new format. Please see <ulink url="http://otrs.github.io/doc/manual/developer/4.0/en/html/package-porting.html#package-porting-template-engine">the development manual</ulink> for detailed instructions.
ru: Обращаем внимание, что OTRS 4 теперь использует новый механизм шаблонов основанный на <ulink url="http://www.template-toolkit.org">Template::Toolkit</ulink>. Все кастомизированные шаблоны должны быть преобразованы из DTL в новый формат. Читайте <ulink url="http://otrs.github.io/doc/manual/developer/4.0/en/html/package-porting.html#package-porting-template-engine">Руководство разработчика</ulink> для детальных пояснений.

source: Step 8: Refresh the configuration cache and delete caches
ru: Шаг 8: Обновление конфигурации кэша и удаления данных кэшей.

source: Please run (as user <code>otrs</code>, <emphasis>not</emphasis> as <code>root</code>): <placeholder type="screen" id="0"/>
ru: Выполните (как пользователь <code>otrs</code>, <emphasis>не</emphasis> как <code>root</code>): <placeholder type="screen" id="0"/>

source: Step 9: Restart your services
ru: Шаг 9: Перезапустите сервисы

source: Step 10: Check installed packages
ru: Шаг 10: Проверьте установленные пакеты

source: The OTRS packages of 3.3 are NOT compatible with OTRS 4, so you have to perform a package upgrade!
ru: Пакеты OTRS от 3.3 НЕ совместимы с OTRS 4, поэтому надо переустановить обновленные пакеты!

source: Support
ru: Поддержка

source: Step 11: Check GenericAgent jobs
ru: Шаг 11: Проверьте задания Планировщика задач/GenericAgent

source: If you have any GenericAgent jobs (or even any custom developments) that automatically set ProcessID or ActivityID dynamic fields, you need to update these to set the fields to the new long EntityIDs that were generated by <filename>DBUpdate-to-4.pl</filename>.
ru: Если у вас имеются задания GenericAgent/Планировщика задач (или, даже какие-то собственные разработки), которые автоматически устанавливают значения динамических полей ProcessID или ActivityID, необходимо обновить установку этих полей в новый формат long EntityIDs, которые генерируются скриптом <filename>DBUpdate-to-4.pl</filename>.

source: Step 12: Update and activate cronjobs
ru: Шаг 12: Обновление и активация планировщика задач cronjobs

source: There are several OTRS default cronjobs in <filename>/opt/otrs/var/cron/*.dist</filename>. They can be activated by copying them without the ".dist" filename extension. Do this to make sure you get the latest versions of the cronjobs and new cronjobs as well. <placeholder type="screen" id="0"/> Please check the copied files and re-apply any customizations that you might have made. To schedule these cronjobs on your system, you can use the script <filename>Cron.sh</filename>. Make sure to execute it as the <code>otrs</code> user! <placeholder type="screen" id="1"/>
ru: В OTRS есть несколько стандартных заданий cron в файле <filename>/opt/otrs/var/cron/*.dist</filename>. Для их применения скопируйте их в файл, опустив в окончании его имени расширение ".dist". Выполните это, чтобы быть уверенным в том, что вы используете последние версии заданий cron и вновь включенные задания. <placeholder type="screen" id="0"/> Проверьте скопированные файлы и сделайте нужные изменения, которые вы, возможно делали. Для применения этих cronjobs в вашей системе можно использовать скрипт <filename>Cron.sh</filename>. Убедитесь, что вы запускаете от имени пользователя <code>otrs</code>! <placeholder type="screen" id="1"/>

source: Step 13: Update Customer database configuration
ru: Шаг 13: Обновление конфигурации баз данных клиентов

source: If you're using an external customer database and this database does NOT provide the OTRS specific fields create_time, create_by, change_time and change_by, please set <code>ForeignDB => 1</code> for <code>$Self->{CustomerUser}</code> and <code>$Self->{CustomerCompany}</code> (see <filename>Kernel/Config/Defaults.pm</filename>).
ru: Если вы используете внешние БД клиентов и эти базы НЕ предоставляют определенных для OTRS полей create_time, create_by, change_time и change_by, установите значение <code>ForeignDB => 1</code> для <code>$Self->{CustomerUser}</code> и <code>$Self->{CustomerCompany}</code> (см. <filename>Kernel/Config/Defaults.pm</filename>).

source: Step 14: Rebuild Ticket index
ru: Шаг 14: Перестройка индексов заявок

source: Please run <filename>bin/otrs.RebuildTicketIndex.pl</filename> to regenerate the ticket index. This can be done in the background to calculate the ticket numbers for the queue view screens. You can already use your system.
ru: Выполните <filename>bin/otrs.RebuildTicketIndex.pl</filename> для обновления индексов заявок. Это можно сделать в фоновом режиме для пересчета номеров заявок для экранов обзора очередей. Теперь можно пользоваться системой.

source: Step 14: Well done!
ru: Шаг 14: Браво, процесс закончен!

source: If available for your platform you should use pre-built packages to install OTRS, since it is the simplest and most convenient method. You can find them in the download area at <ulink url="http://www.otrs.com">http://www.otrs.com</ulink>. The following sections describe the installation of OTRS with a pre-built or binary package on SUSE and Red Hat systems. Only if you are unable to use the pre-built packages for some reason should you follow the manual process.
ru: Самый простой и удобный способ установки OTRS (если доступно для вашей платформы) - использовать готовые пакеты, которые можно найти и загрузить перейдя по ссылке <ulink url="http://www.otrs.com">http://www.otrs.com</ulink>. Последующие разделы описывают установку OTRS из готовых пакетов для систем на SUSE и Red Hat. В случае, если нет возможности использовать готовые пакеты - установку придется производить вручную.

source: Step 1: Install .tar.gz
ru: Шаг 1: Установите .tar.gz

source: If you want to install OTRS from source, first download the source archive as .tar.gz, .tar.bz2, or .zip file from <ulink url="http://www.otrs.com/try/">http://www.otrs.com/try/</ulink>
ru: Если вы решили устанавливать OTRS из исходных кодов, перейдите по ссылке <ulink url="http://www.otrs.com/try/">http://www.otrs.com/try/</ulink> и загрузите архив с исходными кодами в любом удобном для вас формате: .tar.gz, .tar.bz2, или .zip

source: Step 2: Install Additional Perl Modules
ru: Шаг 2: Установка дополнительных perl модулей

source: Use the following script to get an overview of all installed and required cpan modules. <placeholder type="screen" id="0"/> To install missing Perl modules, you can:
ru: Используйте следующий скрипт для просмотра всех установленных и требующихся cpan модулей. <placeholder type="screen" id="0"/> Для установки недостающих модулей Perl можно:

source: a) Install the packages via the package manager of your Linux distribution
ru: а) Установить пакеты с помощью менеджера пакетов вашего дистрибутива Linux

source: For Red Hat, CentOS, Fedora or compatible systems: <placeholder type="screen" id="0"/>
ru: For Red Hat, CentOS, Fedora или совместимые системы: <placeholder type="screen" id="0"/>

source: For SUSE Linux Enterprise Server, openSUSE or compatible systems: first determine the name of the package the module is shipped in. Usually the package for My::Module would be called "perl-My-Module". <placeholder type="screen" id="0"/> Then install: <placeholder type="screen" id="1"/>
ru: Для SUSE Linux Enterprise Server, openSUSE или совместимых систем: сначала определите имя пакета полученного модуля. Обычно, пакет для My::Module будет называться "perl-My-Module". <placeholder type="screen" id="0"/> Затем установите: <placeholder type="screen" id="1"/>

source: For Debian, Ubuntu or compatible systems first determine the name of the package the module is shipped in. Usually the package for My::Module would be called "libmy-module-perl". <placeholder type="screen" id="0"/> Then install: <placeholder type="screen" id="1"/> Please note that it might be that you can't find all modules or their required versions in your distribution repository, in that case you might choose to install those modules via CPAN (see below).
ru: Для Debian, Ubuntu или совместимых систем сначала определите имя пакета полученного модуля. Обычно, пакет для My::Module будет называться "libmy-module-perl". <placeholder type="screen" id="0"/> Затем установите <placeholder type="screen" id="1"/> Возможна ситуация, при которой вы не сможете найти все модули или их требуемые версии в вашем репозитарии, в этом случае вы можете выбрать для установки этих модулей способ через CPAN (смотри ниже).

source: b) Install the required modules via the CPAN shell
ru: b) Установите требуемые модули с помощью оболочки CPAN

source: Note that when you're on Linux you should run CPAN as your superuser account because the modules should be accessible both by the OTRS account and the account under which the web server is running. <placeholder type="screen" id="0"/> Any optional modules listed by the script should be installed depending on the special requirements of the target system.
ru: Обратите внимание, что под Linux необходимо запускать CPAN от имени суперпользователя, потому что модули должны быть доступны через учетную запись OTRS и аккаунт под которым работает веб-сервер. <placeholder type="screen" id="0"/> Любые дополнительные модули перечисленные в выводе скрипта должны устанавливаться в зависимости от специфических требований системы.

source: Step 3: Create OTRS User
ru: Шаг 3: Создайте пользователя OTRS

source: Create user: <placeholder type="screen" id="0"/> Add user to webserver group (if the webserver is not running as the OTRS user): <placeholder type="screen" id="1"/>
ru: Создайте пользователя: <placeholder type="screen" id="0"/> Добавьте пользователя в группе веб-сервера (если веб-сервер работает не как пользователь OTRS): <placeholder type="screen" id="1"/>

source: Step 4: Activate Default Config Files
ru: Шаг 4: Активируйте Default Config Files

source: There are two OTRS config files bundled in $OTRS_HOME/Kernel/*.dist and $OTRS_HOME/Kernel/Config/*.dist. You must activate them by copying them without the ".dist" filename extension. <placeholder type="screen" id="0"/>
ru: Есть два конфигурационных файла OTRS расположенных в $OTRS_HOME/Kernel/*.dist и $OTRS_HOME/Kernel/Config/*.dist. Скопируйте их без расширения ".dist". <placeholder type="screen" id="0"/>

source: Step 5: Check if all needed modules are installed
ru: Шаг 5: Проверьте, что все требуемые модули установлены

source: <placeholder type="screen" id="0"/> "syntax OK" tells you all mandatory perl modules are installed.
ru: <placeholder type="screen" id="0"/> "syntax OK" говорит о том, что все обязательные модули perl установлены.

source: Step 6: Configuring the Apache web server
ru: Шаг 6: Настройка веб-сервера Apache

source: Restart your web server to load the new configuration settings. On most systems you can start/restart your web server with the command <command>/etc/init.d/apache2 restart</command>.
ru: Перестартуйте ваш веб-сервер для применения новых настроек. На большинстве систем рестарт веб-сервера выполняется командой <command>/etc/init.d/apache2 restart</command>.

source: Step 7: File Permissions
ru: Шаг 7: Права доступа к файлам

source: <command>otrs.SetPermissions.pl</command> <arg choice='opt'> --otrs-user= <replaceable>OTRS user, defaults to 'otrs'</replaceable> </arg> <arg choice='req'> --web-group= <replaceable>group of the web server user</replaceable> </arg>
ru: <command>otrs.SetPermissions.pl</command> <arg choice='opt'> --otrs-user= <replaceable>пользователь OTRS, по умолчанию - 'otrs'</replaceable> </arg> <arg choice='req'> --web-group= <replaceable>группа пользователей веб-сервера</replaceable> </arg>

source: File permissions need to be adjusted to allow OTRS to read and write files: <placeholder type="cmdsynopsis" id="0"/> For example:
ru: Права доступа к файлам должны быть скорректированы, чтобы OTRS мог читать и писать файлы: <placeholder type="cmdsynopsis" id="0"/> Например:

source: Step 8: Database Setup and Basic System Configuration
ru: Шаг 8: Настройка СУБД и базовые настройки системы

source: Please use the web installer at <ulink url="http://yourhost/otrs/installer.pl">http://yourhost/otrs/installer.pl</ulink> (replace "yourhost" with your OTRS hostname) to setup your database and basic system settings such as email accounts.
ru: Используйте веб установщик <ulink url="http://yourhost/otrs/installer.pl">http://yourhost/otrs/installer.pl</ulink> (замените "yourhost" именем вашего OTRS хоста) для установки вашей СУБД и выполнения базовых настроек системы, таких как почтовые учетные записи.

source: Step 9: First login
ru: Шаг 9: Первый вход в систему

source: Now you are ready to login to your system at <ulink url="http://yourhost/otrs/index.pl">http://yourhost/otrs/index.pl</ulink> with the credentials you configured in the web installer (User: root@localhost).
ru: Теперь вы готов ко входу в систему по ссылке <ulink url="http://yourhost/otrs/index.pl">http://yourhost/otrs/index.pl</ulink> с учетной записью созданной в веб установщике (пользователь: root@localhost).

source: With this step, the basic system setup is finished.
ru: На этом, начальная установка системы закончена.

source: Step 10: First email
ru: Шаг 10: Первое электронное письмо

source: To check email reception, you can pipe an email directly into <filename>/opt/otrs/bin/otrs.Postmaster.pl</filename>: <placeholder type="screen" id="0"/>
ru: Чтобы проверить прием электронной почты, вы можете направить письмо непосредственно в <filename>/opt/otrs/bin/otrs.Postmaster.pl</filename>: <placeholder type="screen" id="0"/>

source: Step 11: Cronjobs for the OTRS user
ru: Шаг 11: Cronjobs для пользователя OTRS

source: There are several OTRS default cronjobs in <filename>/opt/otrs/var/cron/*.dist</filename>. They can be activated by copying them without the ".dist" filename extension. <placeholder type="screen" id="0"/> To schedule these cronjobs on your system, you can use the script Cron.sh. Make sure to execute it as the OTRS system user!
ru: В OTRS есть несколько стандартных заданий cron в файле <filename>/opt/otrs/var/cron/*.dist</filename>. Для их применения скопируйте их в файл, опустив в окончании его имени расширение ".dist". <placeholder type="screen" id="0"/> Для применения этих cronjobs в вашей системе можно использовать скрипт <filename>Cron.sh</filename>. Убедитесь, что вы запускаете от имени пользователя OTRS !

source: Scheduling the cronjobs for the first time: <placeholder type="screen" id="0"/> Updating the cronjob schedules if you made changes: <placeholder type="screen" id="1"/> Stopping the cronjobs (useful for maintenance): <placeholder type="screen" id="2"/> Note: From OTRS 3.3.7 on OTRS Scheduler uses a cronjob to start-up and keep alive. Please make sure that scheduler_watchdog cronjob is activated.
ru: Первичное размещение заданий cronjobs: <placeholder type="screen" id="0"/> Обновление заданий cronjobs, если вы делали изменения: <placeholder type="screen" id="1"/> Остановка cronjobs (полезно при техобслуживании): <placeholder type="screen" id="2"/> Обратите внимание: с версии OTRS 3.3.7 OTRS Scheduler/Планировщик использует cronjob для запуска и поддержки. Убедитесь, что scheduler_watchdog задание cronjob активировано.

source: Step 12: Further Information
ru: Шаг 12: Дополнительная информация

source: We advise you to read the OTRS <link linkend="performance-tuning">performance tuning chapter</link>.
ru: Мы советуем вам ознакомиться с <link linkend="performance-tuning">раздел настройки производительности</link>.

source: If you encounter problems with the installation, you can send a message to our mailing list otrs@otrs.org (http://lists.otrs.org/).
ru: При обнаружении проблем при установке, вы можете послать сообщение на наш otrs@otrs.org (http://lists.otrs.org/).

source: You can also ask the OTRS Group to either help you in planning or deploying OTRS, or review your installed OTRS system. Our <ulink url="http://www.otrs.com/en/services/">professional services</ulink> are designed to help you deploy OTRS faster and to get the most benefit out of OTRS.
ru: Вы, также, можете послать запрос в OTRS Group на помощь в планировании или развертывании OTRS или проверки установленной системы. Наши <ulink url="http://www.otrs.com/en/services/">профессиональные услуги</ulink> предназначены для того, чтобы помочь вам быстрее развернуть систему и получить наибольшую выгоду от OTRS.

source: OTRS on Windows
ru: OTRS на Windows

source: OTRS can be run on a wide range of system platforms, including Enterprise Linux Platforms such as Red Hat Enterprise Linux, and SUSE Linux Enterprise Server, as well as a series of other Linux derivatives.
ru: OTRS может работать на широком ряде системных платформ, включая такие корпоративные Linux платформы как Red Hat Enterprise Linux, и SUSE Linux Enterprise Server, а также набором других дистрибутивов Linux.

source: However, when running OTRS on Windows platforms we have encountered repeated performance losses, and despite an exhaustive analysis, it has not been possible to solve these issues to our satisfaction due to technical differences. It is thus with a heavy heart that we have ceased development on our Windows Installer and the OTRS Appliance due to the currently limited availability of necessary third-party components offered by other vendors.
ru: Однако, при работе OTRS на Windows платформах мы столкнулись с повторяющимися потерями производительности, и, несмотря на исчерпывающий анализ, не получилось решить эти вопросы, к нашему удовлетворению в связи с техническими различиями. Таким образом, с тяжелым сердцем, мы прекратили развитие установщика Windows с OTRS Appliance в связи с ограниченным в настоящее время наличием необходимых сторонних компонентов, предлагаемых другими поставщиками.

source: Under these circumstances, we are not able to guarantee the continuing operation of OTRS on Windows platforms, and therefore recommend migrating to one of the Linux platforms mentioned above or recommend using our <ulink url="https://www.otrs.com/solutions/managed-otrs/"><emphasis role="bold">OTRS Business Solution™</emphasis> Managed</ulink>.
ru: В связи с этими обстоятельствами, мы не способны гарантировать продолжение работы OTRS на Windows платформе и в свою очередь рекомендуем перейти на одну из платформ Linux, упомянутых выше или рекомендуем использовать наше решение <ulink url="https://www.otrs.com/solutions/managed-otrs/"><emphasis role="bold">OTRS Business Solution™</emphasis> Managed</ulink>.

source: To make it easier for you to migrate from Windows to Linux and to offer you the best OTRS performance, we have prepared detailed instructions for you here.
ru: Для облегчения перехода с Windows на Linux предоставить вам наилучшую производительность OTRS, мы приготовили здесь для вас детальные инструкции.

source: How to migrate existing Windows installations to Linux
ru: Как перенести существующую Windows-систему на Linux

source: Introduction and preparation
ru: Введение и подготовка

source: If you have a windows based installation and you would like to change to a linux based system you will need to setup a linux server or virtual machine and install OTRS there (see <link linkend="installation">the installation instructions</link>). This will be the target system for the migration.
ru: Если у вас есть OTRS, установленная на Windows и вы желаете перенести ее на linux, вам потребуется установить Linux server или виртуальную машину и установить там OTRS (смотри <link linkend="installation">инструкции по установке</link>). Это будет система для миграции.
