Repository: DSigmund/doc-admin
Catalog: i18n/doc-admin.*.po
Languages: ja, ru, sw

source: Label translations have to be added manually to language translations files.
ja: ラベルの翻訳を言語変換ファイルに手動で加えなければならない。
ru: Перевод метки должен быть добавлен в файл перевода вручную.
sw: Tafsiri za lebo inabidi ziongezwe kwa mikono kwenye mafaili ya utafsiri wa lugha.

source: Field order: Mandatory.
ja: フィールド順：必須
ru: Порядок Полей: Обязательно.
sw: Oda ya sehemu: Lazima.

source: Defines the relative order in which the field will be displayed on the screen, by default each new field has the last position, a change in this setting will affect the order of the other created dynamic fields.
ja: 相対的な順序を定義します。画面で表示されるフィールドの相対的な順序を定義します。デフォルトでは各々の新規フィールドは最後尾に位置します。この設定の変更は他に作られた動的フィールドの順序に影響します。このセッティングの変化は、他の作られた動的フィールドの順序に影響するでしょう。
ru: Определяет относительный порядок, в котором поля будут отображаться на экране, по умолчанию каждое новое поле занимает последнюю позицию, изменение этого параметра будет влиять на порядок отображения других динамических полей.
sw: Inafafanua oda tegemezi ambayo sehemu itaonyeshwa kwenye skrini, kwa chaguo-msingi kila sehemu mpya ina sehemu ya mwisho, mabadiliko katika huu mpangilio utaathiri oda ya sehemu nyingine zinazobadilika zilizotengenezwa.

source: Validity: Mandatory.
ja: 有効性:必須
ru: Срок действия: Обязательный.
sw: Uhalali: Lazima.

source: An invalid dynamic field will not be displayed in any screen, no matter if is configured to displayed.
ja: 如何に表示するように構成しても、無効の動的フィールドはどの画面にも表示されません。
ru: Не действительное динамическое поле не будет отображаться на любом экране, независимо от того какое значение установлено в конфигурации.
sw: Sehemu inayobadilika batili haitaonyeshwa katika skrini yoyote, hata kama imesanidiwa kuonyeshwa.

source: Field type: Mandatory, Read only.
ja: フィールド・タイプ:必須。読み込み専用。
ru: Тип поля: Обязательное, Только для чтения.
sw: Aina ya sehemu: Lazima, Soma tu.

source: Shows the current selected field type.
ja: 現在の選択されたフィールド・タイプを示します。
ru: Показывает текущий выбранный тип поля.
sw: Inaonyesha aina ya sehemu iliyochaguliwa.

source: Object type: Mandatory, Read only.
ja: オブジェクト・タイプ:必須。読み込み専用
ru: Тип Объекта: Обязательный, Только для чтения.
sw: Aina ya kitu: Lazima, Soma tu.

source: Shows the scope of field.
ja: フィールドの範囲を示します。
ru: Отображает область действия для поля.
sw: Inaonyesha upeo wa sehemu.

source: To illustrate each specific field type settings a few fields will be added in our example. These new fields will be referenciated in later sections.
ja: 例では、特定のフィールド・タイプの設定を各々説明するために、少数のフィールドが追加されます。これらの新規フィールドは後のセクションの中でreferenciated（参照）されるでしょう。
ru: Для иллюстрации каждого конкретного параметра настройки в нашем примере будет добавлено несколько полей. Ссылки на эти поля будут упоминаться в последующих разделах.
sw: Kuonyesha mipangilio ya kila aina maalumu ya sehemu sehemu chache zitaongezwa kwenye mfano wetu. Hizi sehemu mpya zitafanyiwa marejeo kwenye vifungu vya mbele.

source: For the following examples all the dynamic fields will be created for the Ticket object if you need to create a dynamic field for Article object, just choose the field from the Article dropdown list.
ja: 次の例については、記事オブジェクトのための動的フィールドを作る必要があれば、チケット・オブジェクトのためにすべての動的フィールドが作られます。単に記事ドロップダウン・リストからフィールドを選択して下さい。
ru: В следующих примерах все динамические поля будут созданы для объекта Заявка, если необходимо создать динамическое поле для объекта Статья, просто выберите поле из выпадающего списка.
sw: Kwa mfano ufwatao sehemu zote zinazobadilika zitatengenezwa kwa ajili ya kitu cha Tiketi kama unahitaji kutengeneza sehemu inayobadilika kwa kitu cha Makala, chagua tu sehemu kutoka kwenye orodha kunjuzi ya Makala.

source: The following fields will be added into the system:
ja: 次のフィールドがシステムへ追加されます。:
ru: В систему будут добавлены следующие поля:
sw: Sehemu zifuatazo zitaongezwa kwenye mfumo:

source: Text Dynamic Field Configuration
ja: テキスト動的フィールドの構成
ru: Настройка Динамического Поля типа Text
sw: Nakala ya Usanidi wa Sehemu Inayobadilika

source: Text dynamic field is used to store a single line string.
ja: テキスト動的フィールドは単一行の文字列を格納するために使用されます。
ru: Динамические текстовые поля используются для хранения простой строки.
sw: Sehemu inayobadilika ya Nakala inatumika kuhifadhi tungo ya mstari mmoja.

source: Text dynamic field settings:
ja: テキスト動的フィールド設定:
ru: Настройки динамического поля типа Text:
sw: Nakala ya mpangilio wa sehemu inayobadilika:

source: Default value: Optional.
ja: デフォルト値:オプション。
ru: Значение по умолчанию: Необязательное.
sw: Thamani ya chaguo-msingi: Hiari.

source: This is the value to be shown by default on the edit screens (like New Phone Ticket or Ticket Compose).
ja: これは、デフォルトでは編集画面上に表示される値です。(新規電話チケットまたはチケットが作成されるような画面）
ru: Это значение, которое будет отображаться по умолчанию на экранах редактирования (например, New Phone Ticket/Новая телефонная заявка или Ticket Compose/Создать ответ).
sw: Hii ni thamani ya kuonyeshwa kwa kawaida kwenye shrini za kuhariri (kama Simu Npya ya Tiketi au Tunga Tiketi)

source: Show link: Optional.
ja: リンクの表示：オプション。
ru: Показать ссылку: Необязательное.
sw: Onyesha kiungo: Hiari.

source: If set, the field value will be converted into a clickable link for display screens (like ticket zoom or overviews).
ja: セットされたら、フィールド値は、表示画面用に（チケット・ズームや概要のように）クリック可能なリンクに変換されます。
ru: Если установлено, то значение поля будет преобразовано в кликабельную ссылку, которая будет отображаться на экране.
sw: Kama imeseetiwa, thamani ya sehemu itabadilishwa kuwa kiungo kinachobonyezeka kwa ajili ya skrini za kuonyesha (kama kuza tiketi au mapitio).

source: For example, if "Show link" is set to "http://www.otrs.com", clicking on the filled value will make your browser to open the OTRS web page.
ja: 例えば、「リンクを表示」を「http://www.otrs.com」にセットするなら、値を入力してクリックすれば、ブラウザでOTRSウェブページが開きます。
ru: Например, если "Показать ссылку" установленно в "http://www.otrs.com", нажатие на заполненное значение приведет к открытию веб-страницы OTRS.
sw: Kwa mfano, kama "Onyesha kiungo" imesetiwa kuwa "http://www.otrs.com", kubofya kwenye thamani ya sehemu kitafanya kivinjari chako kufungua ukurasa wa tovuti wa OTRS.

source: The use of $LQData{"NameX"} in the Set link value, where NameX is the name of the field will add the field value as part of the link reference.
ja: セット・リンク値中の $LQData{「NameX」}を使うなら、NameX があるところに、フィールドの名前がリンク参照の一部としてフィールド値を加えるでしょう。
sw: Matumizi ya $LQData{"JinaX"} katika thamani ya Seti kiungo, ambapo JinaX ni jina la sehemu litaongeza sehemu hiyo kama sehemu ya marejeo ya kiungo.

source: Dynamic field Text configuration dialog
ja: 動的フィールド・テキストの構成ダイアログ。
ru: Окно конфигурации Динамического поля Text
sw: Maongezi ya usanidi wa Nakala ya Sehemu inayobadilika.

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="dynamicfields - screenshot" scale="40" fileref="screenshots/dynamicfields-configuration-text.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="dynamicfields（動的フィールド） - スクリーンショット" scale="40" fileref="screenshots/dynamicfields-configuration-text.png"></graphic>

source: <emphasis>Figure: Dynamic field Text configuration dialog.</emphasis>
ja: <emphasis>図:動的フィールド・テキストの構成ダイアログ</emphasis>
ru: <emphasis>Рисунок: Диалоговое окно настройки Динамического поля Text.</emphasis>
sw: <emphasis>Kielelezo: Maongezi ya usanidi wa Nakala ya Sehemu inayobadilika..</emphasis>

source: Textarea Dynamic Field Configuration
ja: テキスト領域動的フィールド構成
ru: Настройка Динамического Поля Textarea
sw: Usanidi wa Eneo la nakala ya Sehemu Zinazobadilika

source: Textarea dynamic field is used to store a multiple line string.
ja: テキスト領域の動的フィールドは複数行の文字列を格納するために使用されます。
ru: Динамическое поле Textarea используется для хранения строк, состоящих из нескольких линий.
sw: Eneo la nakala ya sehemu zinazobadilika hutumika kuhifadhi tungo za mstari zaidi ya mmoja

source: Textarea dynamic field settings:
ja: テキストエリア動的フィールドの設定:
ru: Настройки динамического поля Textarea:
sw: Mpangiio wa sehemu zinazobadilika za eneo la nakala

source: Number of rows: Optional, integer.
ja: 列の数:オプション、整数。
ru: Количество строк: Необязательное, Целое.
sw: Idadi ya safu: Hiari, namba kamili.

source: Used to define the height of the field in the edit screens (like New Phone Ticket or Ticket Compose).
ja: 編集画面(新規電話チケットあるいはチケット作成のように)にフィールドの高さを定義するために使用されます。
ru: Используется для определения высоты поля на странице редактирования.
sw: Inatumika kufafanua urefu wa sehemu kwenye skrini za kuhariri (kama Simu Mpya ya Tiketi au Tunga Tiketi).

source: Number of cols: Optional, Integer.
ja: 列の数：オプション、整数。
ru: Количество столбцов: Необязательное, Целое.
sw: Idadi ya safu: Hiari, namba kamili.

source: This value is used to define the width of the field in the edit screens.
ja: この値は、編集画面でフィールドの幅を定義するために使用されます。
ru: Это значение используется для задания ширины поля при редактировании.
sw: Hii thamani inatumika kufafanua upana wa sehemu kwenye skrini za kuhariri.

source: This is the value to be shown by default in the edit screens (it can be a multiple line text).
ja: これは、編集画面中のデフォルトによって示される値です。(複数行テキストも可)
ru: Это значение будет отображаться по умолчанию (может быть текстом, состоящим из нескольких строк).
sw: Hii ni thamani itakayo onyeshwa kwa kawaida kwenye skrini za kuhariri (inaweza kuwa nakala ya zaidi ya mstari mmoja).

source: Dynamic field Textarea configuration dialog
ja: 動的フィールドテキストエリアの構成ダイアログ。
ru: Окно конфигурации Динамического поля Textarea
sw: Usanidi wa maongezi ya sehemu zinazobadilika za eneo la nakala

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="dynamicfields - screenshot" scale="40" fileref="screenshots/dynamicfields-configuration-textarea.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="dynamicfields（動的フィールド） - スクリーンショット" scale="40" fileref="screenshots/dynamicfields-configuration-textarea.png"></graphic>

source: <emphasis>Figure: Dynamic field Textarea configuration dialog.</emphasis>
ja: <emphasis>図:動的フィールドテキストエリアの構成ダイアログ</emphasis>
ru: <emphasis>Рисунок: Окно настройки Динамического Поля Textarea.</emphasis>
sw: <emphasis>Kielelezo: Maongezi ya usanidi wa Nakalaeneo ya Sehemu inayobadilika..</emphasis>

source: Checkbox Dynamic Field Configuration
ja: チェックボックス動的フィールド構成
ru: Конфигурация Динамического Поля Checkbox
sw: Usanidi wa Sehemu Inayobadilika ya Kisanduku tiki

source: Checkbox dynamic field is used to store true or false value, represented by a checked or unchecked check box.
ja: チェックボックス動的フィールドは、真偽値を格納するために使用されます。チックボックス内のチェックの有無で表現されます。
ru: Динамическое поле Checkbox используется для хранения значений true или false, изображено как выбранныи или не выбранный флажок.
sw: Sehemu inayobadilika ya kisanduku tiki inatumika kuhifadhi thamani ya kweli au uongo, inayowakilishwa na boksi lenye tiki au lisilo na tiki.

source: Checkbox dynamic field settings:
ja: チェックボックス動的フィールドの設定:
ru: Настройки динамического поля Checkbox:
sw: Mipangilio ya sehemu inayobadilika ya kisanduku tiki:

source: Default value: Mandatory.
ja: デフォルト値:必須。
ru: Значение по умолчанию: Обязательное.
sw: Thama ya Kawaida: Lazima.

source: This is the value to be shown by default on the edit screens (like New Phone Ticket or Ticket Compose), the default value for this field is closed selection which can be Checked or Unchecked.
ja: これは、編集画面上デフォルトによって示される値です。(新規電話チケットあるいはチケット作成のように)このフィールド用のデフォルト値は、チェックの有無をすることができる閉じた選択です。
ru: Это значение, которое будет показано по умолчанию на страницах редактирования (например заявка, созданная на основе телефонного звонка), значение по умолчанию для этого поля недоступно для выбора и может принимать значения Выбрано/Checked или Unchecked/Не выбрано.
sw: Hii ndiyo thamani ya kuonyeshwa kwa chaguo-msingi katika skrini za kuhariri (kama Tiketi Mpya ya Simu au Unda Tiketi), thamani chaguo-msingi la hii sehemu ni uchaguzi uliofungwa ambao unaweza kutikiwa au kutotikiwa.

source: Dynamic field Checkbox configuration dialog
ja: 動的フィールド・チェックボックスの構成ダイアログ
ru: Диалог настройки Динамического поля Checkbox
sw: Usanidi wa maongezi wa sehemu inayobadilika ya kisanduku tiki

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="dynamicfields - screenshot" scale="40" fileref="screenshots/dynamicfields-configuration-checkbox.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="dynamicfields（動的フィールド） - スクリーンショット" scale="40" fileref="screenshots/dynamicfields-configuration-checkbox.png"></graphic>

source: <emphasis>Figure: Dynamic field Checkbox configuration dialog.</emphasis>
ja: <emphasis>図:動的フィールド・チェックボックスの構成ダイアログ</emphasis>
ru: <emphasis>Рисунок: Окно настройки Динамического Поля Checkbox.</emphasis>
sw: <emphasis>Kielelezo: Usanidi wa maongezi wa sehemu inayobadilika ya kisanduku tiki.</emphasis>

source: Dropdown Dynamic Field Configuration
ja: ドロップダウン動的フィールドの構成
ru: Настройка Динамического Поля Dropdown (Выпадающий Список)
sw: Usanidi wa Kikunjuzi cha Sehemu Inayobadilika

source: Dropdown dynamic field is used to store a single value, from a closed list.
ja: ドロップダウン動的フィールドは単一の値を格納するために閉じたリストから使用されます。
ru: Динамическое поле Выпадающий Список (Dropdown) используется для хранения одного значения, которое выбирается из закрытого списка.
sw: Kikunjuzi cha sehemu inayobadilika kinatumika kuhifadhi thamani moja, kutoka kwenye orodha iliyofungwa.

source: Dropdown dynamic field settings:
ja: ドロップダウン動的フィールドの設定:
ru: Настройки динамического поля Dropdown:
sw: Mipangilio ya sehemu kunjuzi inayobadilika:

source: Possible values: Mandatory.
ja: 可能な値：必須。
ru: Возможные значения: Обязательное.
sw: Thamani zinazowezekana: Lazima.

source: List of values to choose. If used, a new value is necessary to specify the Key (internal value) and the Value (display value).
ja: 例えば、「リンクを表示」が「http://www.otrs.com」にセットするなら、値を入力してクリックすれば、ブラウザでOTRSウェブページが開きます。
ru: Спискок значений для выбора. При добавлении нового значеня необходимо указать Ключ (внутреннее значение) и Значение (значение, которое отображается).
sw: Orodha ya thamani za kuchagua. Kama ikitumika, thamani mpya ni muhimu kubainisha Ufunguo (thamani ya ndani) na Thamani (thamani ya kuonyeshwa).

source: This is the value to be show by default on the edit screens (like New Phone Ticket or Ticket Compose), the default value for this field is closed selection defined by the Possible values.
ja: この値はデフォルトで編集画面に表示されます。(新規電話チケットあるいはチケット作成のように)このフィールドのデフォルト値は、可能な値によって定義された閉じた選択です。
ru: Это значение будет отображено по умолчанию на страницах редактирования (наример, на странице Новая телефонная заявка, или странице создания ответа), значение по умолчанию для этого поля - определяется параметром "Значение по умолчанию" с возможностью выбора всех возможных значений в списке "Значения".
sw: Hii ndiyo thamani ya kuonyeshwa kwa chaguo-msingi katika skrini za kuhariri (kama Tiketi Mpya ya Simu au Unda Tiketi), thamani chaguo-msingi la hii sehemu ni uchaguzi uliofungwa unaofafanuliwa na thamani Ziwezekanazo.

source: Add empty value: Mandatory, (Yes / No).
ja: 空の値の追加：必須、(はい/いいえ）
ru: Добавить пустое значени: Обязательное, (Да / Нет).
sw: Ongeza sehemu tupu: Lazima, (Ndio/Hapana).

source: If this option is activated an extra value is defined to show a "-" in the list of possible values, this special value is empty internally.
ja: このオプションが活性化されるなら、特別な値が、可能な値のリスト中で「-」を表示されて定義されます。この特別な値は内部的には空です。
ru: Если эта опция включена, дополнительная стоимость определяется для отображения "-" в списке возможных значений, это специально значение пустоне внутри.
sw: Kama hili chaguo limeamilishwa thamani ya ziada inafafanuliwa kuonyesha "-" kwenye orodha ya thmani ziwezekanazo, hii thamani maalumu ni wazi ndani.

source: Translatable values: Mandatory, (Yes / No).
ja: 翻訳可能な値:必須、(はい/いいえ）
ru: Переводимые значения: Обязательное, (Да / Нет).
sw: Tafsiri thamani: Lazima, (Ndio/Hapana).

source: This setting is used mark the possible values of this field to be translated. Only the display values are translated, internal values are not affected, the translation of the values needs to be manually added to the language files.
ja: この設定は、このフィールドが翻訳可能な値であることの指標として使われます。単に翻訳される表示上の値であり、内部的な値に影響を与えるものではありません。翻訳値は手動で言語ファイルに追加する必要があります。
ru: Этот параметр задает возможность перевода на язык системы значений этого поля. Переводятся только отображаемые значения, внутренние значения не подлежат переводу. Перевод полей должен быть занесен вручную в соответствующий пользовательский файл локализации. Для русского языка - ru_custom.pm.
sw: Huu mpangilio unatumika kuweka alama thamani zinazoweza kutafsiriwa za hii sehemu. Thamani zinazoonyeshwa tu ndio zita tafsiriwa, thamani za ndani hazita athiriwa, utafsiri wa thamani inabidi uongezwe kwa mikono kwenye mafaili ya lugha.

source: If set, the field value will be converted into a clickable HTP link for display screens (like Zoom or overviews).
ja: セットされたら、フィールド値は 表示画面（ズームや概要のように）用にクリック可能ならHTPリンクに変換されます。
ru: Если установлено, то значение поля будет установлено в кликабельные ссылки.
sw: Kama imesetiwa, thamani ya sehemu itabadilishwa kuwa kiungo cha HTP kinachobonyezeka kwa ajili ya skrini za kuonyesha (kama Kuza au mapitio).

source: For example, if Show link is set to "http://www.otrs.com", clicking on the filed value will make your browser to open the OTRS web page.
ja: 例えば、もし「表示」リンクが「 http://www.otrs.com 」にセットされたら、フィールド値をクリックすればブラウザでOTRSのウェブページが開きます。
ru: Например, если ссылка Показать установлена в значение "http://www.otrs.com", нажатие на значение поля приведет к открытию веб-страницы OTRS.
sw: Kwa mfano, kama Onyesha kiungo imesetiwa kuwa "http://www.otrs.com", kubofya kwenye thamani hii ya sehemu kutafanya kivinjari chako kufumgua ukurasa wa tovuti wa OTRS.

source: The use of $LQData{"NameX"} in the Set link value, where NameX is the name of the field, will add the field value as part of the link reference.
ja: セット・リンク値中で $LQData{「NameX」} が使われた場合、NameX がフィールドの名前なら、リンク参照の一部としてフィールド値を加えるでしょう。
ru: Использование конструкции $LQData{"NameX"} в поле Set link/Показывать ссылку, где NameX - имя поля, добавляет значение поля как часть ссылки.
sw: Matumizi ya $LQData{"JinaX"} katika thamani ya Seti kiungo, ambapo JinaX ni jina la sehemu, itaongeza sehemu hiyo kama sehemu ya marejeo ya kiungo.

source: Dynamic field Dropdown configuration dialog
ja: 動的フィールド・ドロップダウンの構成ダイアログ
ru: Окно настройки динамического поля Dropdown
sw: Maongezi ya usanidi wa Kikunjuzi cha Sehemu inayobadilika

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="dynamicfields - screenshot" scale="40" fileref="screenshots/dynamicfields-configuration-dropdown.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="dynamicfields（動的フィールド） - スクリーンショット" scale="40" fileref="screenshots/dynamicfields-configuration-dropdown.png"></graphic>

source: <emphasis>Figure: Dynamic field Dropdown configuration dialog.</emphasis>
ja: <emphasis>図:動的フィールド・ドロップダウンの構成ダイアログ</emphasis>
ru: <emphasis>Рисунок: Окно настройки динамического поля Dropdown.</emphasis>
sw: <emphasis>Kielelezo: Maongezi ya usanidi wa Kikunjuzi cha Sehemu inayobadilika.</emphasis>

source: Multiselect Dynamic Field Configuration
ja: 多重選択動的フィールドの構成
ru: Конфигурация Динамического Поля Multiselect (множественный выбор)
sw: Uteuzi Anuwai wa Usanidi wa Sehemu Inayobadilika

source: Multiselect dynamic field is used to store multiple values, from a closed list.
ja: 多重選択動的フィールドは多数の値を格納するために閉じたリストから使用されます。
ru: Динамическое поле Multiselect используется для хранения нескольких значений из заданного списка.
sw: Uteuzi Anuwai wa sehemu inayobadilika unatumika kuhifadhi thamani anuai, kutoka kwenye orodha iliyofungwa.

source: Multiselect dynamic field settings:
ja: 多重選択動的フィールドの設定:
ru: Настройка Динамического Поля Multiselect (множественный выбор):
sw: Mipangilio ya sehemu inayobadilika ya uteuzi anuwai:

source: List of values to choose from. When adding additional list items, it is necessary to specify the Key (internal value) and the Value (display value).
ja: フォームを選択するための値のリスト。 追加のリスト項目を追加するなら、キー（内部値）と値（表示値）を指定する必要があります。
ru: Список значений для выбора. При добавлении нового значения в список, необходимо указать Ключ (внутреннее значение) и Значение (значение, которое отображается).
sw: Orodha ya thamani za kuchagua. Wakati wa kuongeza vifaa vya nyongeza kwenye orodha, ni muhimu kubainisha Ufunguo (thamani ya ndani) na Thamani (thamani ya kuonyeshwa).

source: This is the value to be shown by default on the edit screens (like New Phone Ticket or Ticket Compose), the default value for this field is closed selection as defined by the Possible values.
ja: これは、編集画面上にデフォルトで示される値です(新規電話チケットあるいはチケット作成のように)。このフィールドのデフォルト値は、可能な値によって定義されるような閉じた選択です。
ru: Это значение будет отображено по умолчанию на страницах редактирования (например, на странице Заявки, созданной на основе телефонного звонка или странице создания Заявки), значение по умолчанию для этого поля - задается параметром "Значение по умолчанию" из заданного списка значений.
sw: Hii ndiyo thamani ya kuonyeshwa kwa chaguo-msingi katika skrini za kuhariri (kama Tiketi Mpya ya Simu au Unda Tiketi), thamani chaguo-msingi la hii sehemu ni uchaguzi uliofungwa kama ulivyofafanuliwa na thamani Ziwezekanazo.

source: If this option is activated an extra value is defined to show as a "-" in the list of possible values. This special value is empty internally.
ja: このオプションが活性化される場合、特別な値が、可能な値のリスト中で「-」を表示されて定義されます。この特別な値は内部的には空です。
ru: Если эта опция включена, задается возможность для отображения "-" в списке возможных значений, это специальное значение для указания на пустое значение.
sw: Kama hili chaguo limeamilishwa thamani ya ziada inafafanuliwa kuonyesha "-" katika orodha ya thamani ziwezekanazo. Hii thamani maalumu ni tupu ndani

source: Dynamic field Multiselect configuration dialog
ja: 動的フィールド 複数選択の構成ダイアログ
ru: Диалог конфигурации Динамического поля Multiselect (множественный выбор)
sw: Maongezi ya usanidi wa Uteuzi Anuwai wa Sehemu inayobadilika

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="dynamicfields - screenshot" scale="40" fileref="screenshots/dynamicfields-configuration-multiselect.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="dynamicfields（動的フィールド） - スクリーンショット" scale="40" fileref="screenshots/dynamicfields-configuration-multiselect.png"></graphic>

source: <emphasis>Figure: Dynamic field Multiselect configuration dialog.</emphasis>
ja: <emphasis>図:動的フィールド 複数選択の構成ダイアログ</emphasis>
ru: <emphasis>Рисунок: Окно настройки динамического поля Multiselect.</emphasis>
sw: <emphasis>Kielelezo: Maongezi ya usanidi wa Uteuzi Anuwai wa Sehemu inayobadilika.</emphasis>

source: Date Dynamic Field Configuration
ja: 日付動的フィールド設定
ru: Настройка Динамического Поля Date
sw: Usanidi wa Sehemu Inayobadilika ya Tarehe

source: Date dynamic field is used to store a date value (Day, Month and Year).
ja: 日付動的フィールドは日付値(日、月および年)を格納するために使用されます。
ru: Динамическое поле Date используется для хранения значения (День, Месяць и Год).
sw: Sehemu inayobadilika ya Tarehe inatumika kuhifadhi thamani ya tarehe (Siku, Mwezi na Mwaka).

source: Date dynamic field settings:
ja: 日付動的フィールド設定:
ru: Настройки динамического поля Date (Дата):
sw: Mipangilio ya sehemu inayobadilika ya tarehe:

source: Default date difference: Optional, Integer.
ja: デフォルトの時差：オプション、整数
ru: Разница дат по умолчанию: Опционально, Целое.
sw: Chaguo-msingi la utofauti wa tarehe: Hiari, Namba kamili.
