Repository: DSigmund/doc-admin
Catalog: i18n/doc-admin.*.po
Languages: ja, ru, sw

source: Sets the queue where the ticket shall be sorted. If set in X-OTRS header, all other filter rules that try to sort a ticket into a specific queue are ignored. If you use a sub-queue, specify it as &quot;Parent::Sub&quot;.
ja: チケットがソートされる場合、キューをセットします。もしX-OTRSヘッダーの中でセットされれば、特定のキューへチケットをソートしようとする他のすべてのフィルタ規則が無視されます。サブキューを使用する場合は、「Parent::Sub」としてそれを指定してください。
ru: Устанавливает очередь, из которой заявка должна быть распределена. Если установлены X-OTRS-заголовки, все остальные правила фильтрации, пытающиеся распределить заявку в определенной очереди игнорируются. Если вы используете подочереди, указывайте их как "Parent::Sub".
sw: Inaseti foleni ambapo tiketi itapangwa. Kama imesetiwa kwenye kichwa cha X-OTRS, sheria zote nyingine zinazojaribu kupanga tiketi kwenye foleni fulani zinapuuzwa. Kama ukitumia foleni-ndogo, ibainishe kama &quot;Parent::Sub&quot;.

source: X-OTRS-Lock:
ja: X-OTRS-ロック:
sw: Kitasa cha-X-OTRS:

source: lock, unlock
ja: ロック、アンロック
ru: блокировать, разблокировать
sw: funga, fungua

source: Sets the lock state of a ticket.
ja: チケットのロック状態を設定します
ru: Устанавливает состояние блокирования заявки.
sw: Inaseti hali ya kitasa cha tiketi.

source: X-OTRS-Ignore:
ja: X-OTRS-無視:
sw: X-OTRS-Puuza:

source: Yes or True
ja: 「はい」 あるいは 「真」
ru: Yes или True
sw: Ndio au Kweli

source: If this X-OTRS header is set to "Yes", the incoming message will completely be ignored and never delivered to the system.
ja: このX-OTRSヘッダーが「はい」にセットされれば、受信メッセージは完全に無視され、システムに配達されないでしょう。
ru: Если этот X-OTRS заголовок установлен в "Yes", входящие сообщения будут полностью игнорироватся и никогда не попадут в систему.
sw: Kama hiki kichwa cha OTRS kimesetiwa kuwa "Ndio", ujumbe unaoingia utapuuzwa na hautapokelewa na mfumo.

source: X-OTRS-State:
ja: X-OTRS-状態:
sw: Hali ya-X-OTRS:

source: new, open, closed successful, closed unsuccessful, ...
ja: 新規、対応中、完了（成功）、完了（不成功）...
ru: новая, открытая, закрытая успешно, закрытая неуспешно, ...
sw: mpya, fungua, imefungwa kwa mafanikio, imefungwa pasipo mafanikio, ...

source: Sets the next state of the ticket.
ja: チケットの次の状態を設定します
ru: Устанавливает следующее состояние заявки.
sw: Inaseti hali inayofwata ya tiketi.

source: X-OTRS-State-PendingTime:
ja: X-OTRS-状態-保留時間:
sw: X-OTRS-Hali-Muda Inasubiri:

source: e. g. 2010-11-20 00:00:00
ja: 例えば 2010-11-20 00:00:00
ru: например 2010-11-20 00:00:00
sw: mf. 2010-11-20 00:00:00

source: Sets the pending time of a ticket (you also should sent a pending state via X-OTRS-State). You can specify absolute dates like "2010-11-20 00:00:00" or relative dates, based on the arrival time of the email. Use the form "+ $Number $Unit", where $Unit can be 's' (seconds), 'm' (minutes), 'h' (hours) or 'd' (days). Only one unit can be specified. Examples of valid settings: "+50s" (pending in 50 seconds), "+30m" (30 minutes), "+12d" (12 days). Note that settings like "+1d 12h" are not possible. You can specify "+36h" instead.
ja: チケットの保留時間を設定します。（X-OTRS-Stateによって保留状態を送信もして下さい）電子メールの到着時刻に基づいて、「2010-11-20 00:00:00」のような絶対日付あるいは相対日付を指定することができます。フォーム「+ $Number $Unit」を使用してください。ここで、「$Unit」は、's'の(秒)、「m」(分)、「h」(時間)あるいは「d」(日)です。1ユニットのみ指定することができます。有効な設定例:「+50s」(50秒でペンディング)、「+30m」(30分)、「+12d」(12日)。「+1d 12h」のようなセッティングができないことに注意してください。その代わりに「+36h」を指定できます。
ru: Задает время ожидания для заявки (вы также должны установить состояние ожидания, используя X-OTRS-State). Можно задать абсолютное значение типа "2010-11-20 00:00:00" или относительную дату, основанную на времени поступления письма. Используйте формат "+ $Number $Unit", где $Unit должно быть 's' (секунды), 'm' (минуты), 'h' (часы) или 'd' (дни). Только одна единица измерения может быть задана. Примеры правильного ввода: "+50s" (отложить на 50 секунд), "+30m" (30 минут), "+12d" (12 дней). Значение типа "+1d 12h" недопустимо. Для такого случая правильным будет "+36h".
sw: Inaseti muda wa kusubiri wa tiketi (pia lazima utume hali ya kusubiri kupitia X-OTRS-Hali). Unaweza kubainisha tarehe halisi kama "2010-11-20 00:00:00" au tarehe inayohusika, kutegemeana na muda wa kuwasili wa barua pepe. Au tumia mfumo "+ $Namba$Kizio", ambapo $Kizio inaweza kuwa 's' (sekunde), 'm' (dakika), 'h' (masaa) au 'd' (siku). Kizio kimoja tu kinaweza kubainishwa. Mfano wa mipangilio halali: "+50s" (inasubiri kwa sekunde 50), "+30m" (dakika 30), "+12d" (siku 12). Tambua kwamba mipangilio kama "+1d 12h" haiwezekani. Unaweza kubainisha "+36" badala yake.

source: X-OTRS-Type:
ja: X-OTRS-タイプ:
sw: X-OTRS-Aina:

source: default (depends on your setup)
ja: デフォルト (あなたの実施したセットアップに依存します)
ru: по умолчанию (в зависимости от настроек)
sw: chaguo-msingi (inategemea mpangilio wako)

source: Sets the type of a ticket (if Ticket::Type is activated).
ja: チケットタイプの設定 (Ticket::Type が活性化されていれば)。
ru: Устанавливает тип заявки (если активировано Ticket::Type).
sw: Inaseti aina ya tiketi (kama Tketi::Aina imeamilishwa).

source: X-OTRS-Service:
ja: X-OTRS-サービス:
sw: X-OTRS-Huduma:

source: (depends on your setup)
ja: （セットアップにもよりますが）
ru: (в зависимости от настроек)
sw: (inategemea na mpangilio wako)

source: Sets the service of a ticket (if Ticket::Service is active). If you want to set a sub-service you should specify it as &quot;Parent::Sub&quot;.
ja: チケットのサービスを設定します。(Ticket::Service がアクティブならば)。サブキューを使用する場合は、&quot;Parent::Sub&quot; としてそれを指定してください。
ru: Указывает сервис для заявки (если Ticket::Service включен). Если вы желаете задать подсервис сервиса, он указывается в формате "Parent::Sub".
sw: Inaseti huduma ya tiketi (kama Tiketi::Huduma iko hai). Kama ukitaka kuseti huduma-ndogo unatakiwa kuibainisha kama &quot;Parent::Sub&quot;.

source: Sets the SLA of a ticket (if Ticket::Service support is active).
ja: チケットのSLAを設定します。(Ticket::Service support がアクティブならば)。
ru: Устанавливает SLA для заявки (если активирована поддержка Ticket::Service).
sw: Inaseti SLA ya tiketi (kama Tiketi::Usaidizi wa huduma umeamilishwa)

source: X-OTRS-CustomerUser:
ja: X-OTRS-顧客ユーザ:
sw: X-OTRS-MtejaMtumiaji:

source: CustomerUser
ja: CustomerUser（顧客ユーザ）
sw: MtejaMtumiaji

source: Sets the customer user for the ticket.
ja: チケット用顧客ユーザーを設定します。
ru: Устанавливает клиентского пользователя для заявки.
sw: Inaseti mteja mtumiaji wa tiketi.

source: X-OTRS-CustomerNo:
ja: X-OTRS-顧客番号:
sw: X-OTRS-Nambari ya Mteja:

source: CustomerNo
ja: CustomerNo（顧客番号）
sw: Nambari ya Mteja

source: Sets the customer ID for this ticket.
ja: このチケットの顧客IDを設定します。
ru: Устанавливает ID пользователя для заявки.
sw: Inaseti kitambulisho cha mteja kwa hii tiketi.

source: X-OTRS-SenderType:
ja: X-OTRS-送信者タイプ：
sw: X-OTRS-AinaMtumaji:

source: agent, system, customer
ja: 担当者、システム、顧客
ru: агент, система, клиент
sw: wakala, mfumo, mteja

source: Sets the type of the ticket sender.
ja: このチケット送信者のタイプを設定します。
ru: Устанавливает тип отправителя заявки.
sw: Inaseti aina ya mtumaji wa tiketi.

source: X-OTRS-ArticleType:
ja: X-OTRS-記事タイプ:
sw: X-OTRS-AinaMakala:

source: email-external, email-internal, email-notification-ext, email-notification-int, phone, fax, sms, webrequest, note-internal, note-external, note-report
ja: 外部Eメール、内部Eメール、外部Eメール通知、内部Eメール通知、電話、ファックス、SMS,ウェブリクエスト、内部ノート、外部ノート、ノートレポート。
sw: Barua pepe-nje, Barua pepe-ndani, Barua pepe-taarifa-nje, Barua pepe-taarifa-ndani, simu, faksi, ujumbe mfupi wa maneno, maombi ya wavuti, notisi-ndani, notisi-nje, notisi-ripoti

source: Sets the article type for the incoming ticket.
ja: 受信チケットの記事タイプを設定します。
ru: Устанавливает тип статьи для входящих заявок.
sw: Inaseti aina ya makala kwa tiketi inayoingia.

source: Depends on Dynamic Field configuration (Text: Notebook, Date: 2010-11-20 00:00:00, Integer: 1)
ja: 動的フィールドの構成に依存します（テキスト：ノートブック、日付：2010-11-20 00:00:00, Integer: 1)
ru: В зависимости от конфигурации Динамических Полей (Текст: Notebook, Дата: 2010-11-20 00:00:00, Количество: 1)
sw: Inategemeana na usanidi wa Sehemu Zinazobadilika (Nakala: Daftari, Tarehe: 2010-11-20 00:00:00, Namba kamili: 1)

source: Saves an additional info value for the ticket on &lt;DynamicFieldName&gt; Dynamic Field.
ja: 摘要:動的フィールド&lt;DynamicFieldName&gt; でチケットの追加情報値を保存します。
ru: Сохраняет дополнительную информацию для заявки в динамическом поле &lt;DynamicFieldName&gt;.
sw: Inahifadhi taarifa ya thamani ya ziada kwa ajili ya tiketi kwenye &lt;SehemuInayobadilikaJina&gt; Sehemeu Inayobadilika.

source: X-OTRS-Loop:
ja: X-OTRS-ループ:
sw: X-OTRS-Kitanzi:

source: True
ja: 真
ru: Истина
sw: Kweli

source: If this X-OTRS header is set, no auto answer is delivered to the sender of the message (mail loop protection).
ja: このX-OTRSヘッダーが設定されたら、メッセージ送信者へ自動返信は配信されません。（メール・ループ保護のため）
ru: Если этот X-OTRS заголовок установлен, то отправителю сообщение недоставляется ни одного автоматического ответа (защита от зацыкливания).
sw: Kama hiki kichwa cha X-OTRS kimesetiwa, hakuna majibu otomatiki yanayo pokelewa na mtumaji wa ujumbe (ulinzi wa barua kitanzi).

source: You should specify a name for every filter rule. Filter criteria can be specified in the section "Filter Condition". Choose via the listboxes for "Header 1", "Header 2" and so on for the parts of the messages where you would like to search, and specify on the right side the values you wish to filter on. In the section "Set Email Headers", you can choose the actions that are triggered if the filter rules match. You can select for "Header 1", "Header 2" and so on to select the X-OTRS-Header and set the associated values (see Figure below). Filter rules are evaluated in alphabetical order, and are all executed except if the "Stop after match" setting has been set to "Yes" in one of the rule (in this case evaluation of the remaining filters is cancelled).
ja: すべてのフィルタ・ルールに対して名前を指定するべきです。フィルター基準はセクション「フィルタ条件」の中で指定することができます。「ヘッダー1」、「ヘッダー2」あるいは、あなたが検索したいメッセージの部分等をリストボックスから選んでください。そしてあなたがフィルターしたい値を右側で指定して下さい。セクション「セット電子メール・ヘッダー」では、フィルタ規則が一致する場合、起きるアクションを選ぶことができます。X-OTRSヘッダーを選択し、かつ関連する値(下記の図を参照)をセットするために、「ヘッダー1」、「ヘッダー2」などを選択することができます。フィルタ規則はアルファベティカルに評価され、すべて実行されます。但し、「Stop after match」セッティングが規則のうちの1つで「はい」にセットされている場合を除きます。(この場合、残りのフィルタの評価は取り消されます。)
ru: Для каждого правила фильтрации нужно указать имя. Критерии фильтрации можно указать в разделе "Условия Фильтрации". Выберите из списка "Заголовок 1", "Заголовок 2" и так далее для части сообщения, где нужно производить поиск и в правой части укажите значения необходимые для фильтрации. В разделе "Установки Email Заголовков" можно указать действия, которые будут выполняться при выполнении правил фильтрации. Также можно выбрать "Заголовок 1", "Заголовок 2" и так далее для X-OTRS-заголовков и установить их значения (см. Рисунок ниже). Правила применяются в алфавитном порядке и выполняются все, за исключением случая, когда параметр "Прекратить после совпадения" установлен в "Да" в одном из правил (в этом случае применение остальных фильров отменяется).
sw: Unatakiwa kuweka bayana jina kwa kila sheria ya kuchuja. Kigezo cha kuchuja kinaweza kuwekwa bayana katika kifungu "Masharti ya Kuchuja". Chagua kupitia visanduku vya orodha "Kichwa1","Kichwa2" na kuendelea kwa zile sehemu za ujumbe ambazo ungependa kutafuta , na weka bayana upande wa kulia thamani unazotaka kuchuja. Katika kifungu "Seti Vichwa vya Barua pepe", unaweza kuchagua vitendo vitakavyo chochewa kama sheria za uchujaji zitafanana. Unaweza kuchagua kwa "Kichwa1","Kichwa2" na kuendelea ili kuchagua Kichwa cha X-OTRS na kuseti thamani zinazohusika (ona kielelezo chini). Sheria za kuchuja zinatathminiwa kwa kufuata oda ya alfabeti, na zinatekelezwa zote isipokuwa kama mipangilio ya "Sitisha Baada ya Kufananisha" imesetiwa kuwa "Ndio" katika moja ya sheria (kwa kesi hii utathmini wa vichujio vingine unasitishwa).

source: Adding filter rules for incoming messages
ja: 入信メッセージに対するフィルタ・ルールの追加
ru: Добавление правил фильтрации для входящих сообщений
sw: Kuongeza sheria za uchujaji wa ujumbe unaoingia

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="Adminarea postmasterfilter - screenshot" scale="40" fileref="screenshots/add-postmasterfilter.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="管理者エリア ポストマスター・フィルター - スクリーンショット" scale="40" fileref="screenshots/add-postmasterfilter.png"></graphic>

source: <emphasis>Figure: Add a PostMaster filter.</emphasis>
ja: <emphasis>図:PostMasterフィルタの追加</emphasis>
ru: <emphasis>Рисунок: Добавление фильтров PostMaster.</emphasis>
sw: <emphasis>Kielelezo: Ongeza kichujio cha MkuuWaPosta.</emphasis>

source: Sort spam mails into a specific queue
ja: 特定のキューの中へのスパム・メールのソート
ru: Сортирование спама в определенную очередь
sw: Inapanga barua taka katika foleni maalumu

source: A useful filter rule would be to let OTRS automatically move mails marked for spam ,by using a spam detection tool such as SpamAssassin, into the "Junk" queue. SpamAssassin adds the "X-Spam-Flag" header to every checked mail. When the mail is marked as spam, the Header is set to "Yes". So the filter criteria would be "X-Spam-Flag: Yes". To create a filter rule with this criteria you can insert the name as, for example, "spam-mails". In the section for "Filter Condition", choose "X-Spam-Flag:" for "Header 1" from the listbox. Insert "Yes" as value for this header. Now the filter criteria is specified. To make sure that all spam mails are placed into the "Junk" queue, choose in the section for "Set Email Headers", the "X-OTRS-Queue:" entry for "Header 1". Specify "Junk" as value for this header. Finally add the new filter rule to activate it for new messages in the system.
ja: OTRSは、有用なフィルタ規則によってスパムと判定されたEメールを自動的に移動します。SpamAssassinのようなスパム検出ツールによって「ジャンク」キューへ移動します。SpamAssassinは「X-Spam-Flag」ヘッダーを全てのチェックしたメールに追加します。メールがスパムとして判定された場合、ヘッダーは「はい」にセットされます。したがって、フィルター条件は「X-Spam-Flag」が「Yes」になります。この基準でフィルタ規則を作成するために、例えば「spam-mails」として名前を挿入することができます。「フィルタ条件」のためのセクションでは、リストボックスあｋら「Header 1」に対して「X-Spam-Flag」を選んでください。このヘッダーに見合う値として「はい」を挿入してください。今、フィルター条件は指定されます。スパム・メールがすべて「ジャンク」キューに入れられることを確認し、「Set Email Headers」のためのセクションで「Header 1」のために入力した「X-OTRS-Queue:」を選択して下さい。このヘッダーの値として「ジャンク」を指定してください。最後に、システムでの新規メッセージを活性化する、新規フィルタ規則を追加して下さい。
ru: Полезные правила фильтрации помогают OTRS автоматически сортировать почту помеченую как спам с инструментом обнаружения спама, таких как SpamAssassin, в очередь "Junk". SpamAssassin добавляет "X-Spam-Flag" заголовок для каждого проверяемого письма. Если письмо помечено как спам, заголовок установливается в "Да". Так критерием фильтра будет "X-Spam-Flag: Yes". Чтобы создать правило фильтрации с этим критериям можно задать имя, например "спам-почты". Также выбрать в разделе "Условия фильтра" для "Заголовок 1" из списка "X-Spam-Flag:". Вставить "Да" в качестве значения для этого заголовка. Теперь критерий фильтра указан. Чтобы убедиться, что все спам-письма попадут в "Junk" очередь выберите в разделе "Установить заголоки письма" для "Заголовок 1" - "X-OTRS-Queue:" . Укажите "Junk" в качестве значения для этого заголовка. Наконец добавьте новые правила фильтрации, чтобы активировать его для следующих новых писем в системе.
sw: Sheria yenye manufaa ya kuchuja itakuwa kuruhusu OTRS kuhamisha kiotomatiki barua pepe zenye alama barua taka, kwa kutumia kifaa cha kutambua barua taka kama SpamAssassin, kwenda kwenye foleni "Taka". SpamAssassin inaongeza kichwa "X-Barua taka-Bendera" kwenye kila barua pepe iliyokaguliwa. Pale barua pepe inawekwa alama kama barua taka, Kichwa kinasetiwa kuwa "Ndiyo". Kwa hiyo kigezo cha kuchuja kitakuwa "X-Barua taka-Bendera: Ndiyo". Kutengeneza sheria ya kuchuja kwa kutumia hiki kigezo unaweza kuingiza jina kama, kwa mfano "barua taka-barua". Katika kipengele cha "Masharti ya Kuchuja", chagua "X-Barua taka-Bendera:" kwa ajili ya "Kichwa 1" kutoka kwenye boksi la orodha. Ingiza "Ndiyo" kama thamani kwa hiki kichwa. Sasa kigezo cha kuchuja kimebainishwa. Kuhakikisha kwamba barua taka zote zinawekwa kwenye foleni "Taka", chagua kwenye kipengele cha "Seti vichwa vya Barua pepe", ingizo la "X-OTRS-Foleni:" kwa ajili ya "Kichwa 1". Bainisha "Taka" kama thamani ya hiki kichwa. Mwisho ongeza chujio jipya kuamilisha kwa ajili ya ujumbe mpya kwenye mfumo.

source: There are additional modules, that can be used to <link linkend="email-receiving-filter">filter incoming messages</link> more specifically. These modules might be useful when dealing with larger, more complex systems.
ja: 追加モジュール(<link linkend="email-receiving-filter">受信メッセージのフィルタリング</link>をより明確にするために使用することができる)があります。より大きく、より複雑なシステムに対処する場合、これらのモジュールは有用かもしれません。
ru: Есть дополнительные модули, которые можно использовать для более подробной <link linkend="email-receiving-filter">фильтрации входящих сообщений</link>. Эти модули будут полезны для больших и сложных систем.
sw: Kuna moduli za ziada, ambazo zinaweza kutumika <link linkend="email-receiving-filter">kuchuja ujumbe unaoingia</link> kwa umaalumu zaidi. Hizi moduli zinaweza kuwa na manufaa wakati wa kushughulika na mifumo mikubwa na tangamanifu zaidi.

source: Executing automated jobs with the GenericAgent
ja: GenericAgentでの自動仕事の実行
ru: Выполнение автоматизированных заданий с помощью GenericAgent
sw: Kutekeleza kazi za kiotomatiki na WakalaWaUjumla

source: The GenericAgent is a tool to execute tasks automatically. The GenericAgent, for example, can close or move tickets, send notifications on escalated tickets, etc.
ja: GenericAgent（一般担当者）はタスクを自動的に実行するツールです。「一般担当者」は例えば、チケットを完了したり、移動したり、エスカレートされたチケットに対して通知を送信したりできます。
ru: GenericAgent является инструментом для автоматического выполнения задач. GenericAgent, например, может закрывать или перемещать заявки, отправлять уведомления для эскалированных заявок и т.д.
sw: KiolesuraChaUjumla ni kifaa cha kutekeleza kazi kiotomatiki. KiolesuraChaUjumla , kwa mfano, kinaweza kufunga au kuhamisha tiketi, kutuma taarifa kwa tiketi zilizopandishwa, na kadh.

source: Click the link "GenericAgent" on the Admin page (see Figure below). A table with all automated jobs in the system is displayed. These jobs can then be edited, run manually or removed entirely.
ja: 管理者ページ上でリンクGenericAgen（一般担当者）をクリックしてください(下記の図を参照)。システムでのすべての自動ジョブを備えたテーブルが表示されます。その後、これらのジョブは編集、手動で動作、または完全に削除することができます。
ru: Перейдите по ссылке "GenericAgent" в Панели Управления (см. Рисунок ниже). Откроется таблица со списком автоматизированных заданий. Их можно редактировать, переключив способ вызова на ручной, или удалить.
sw: Bofya kiungo "WakalaWaJumla" katika kurasa ya Msimamizi (ona Kielelezo chini). Jedwali lenye kazi zote za kiotomatiki za mfumo litaonyeshwa. Hizi kazi zinaweza kuhaririwa, kuanzishwa kwa mikono au kuondolewa kabisa.

source: Job list for the GenericAgent
ja: GenericAgent（一般担当者）のためのジョブ・リスト
ru: Список заданий для GenericAgent
sw: Orodha ya kazi kwa WakalaWaUjumla

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="Adminarea genericagent - screenshot" scale="40" fileref="screenshots/admin-genericagent.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="管理者エリア genericagent（一般担当者） - スクリーンショット" scale="40" fileref="screenshots/admin-genericagent.png"></graphic>

source: <emphasis>Figure: Job list for the GenericAgent.</emphasis>
ja: <emphasis>図: GenericAgentのためのジョブ・リスト</emphasis>
ru: <emphasis>Рисунок: Список заданий для GenericAgent.</emphasis>
sw: <emphasis>Kielelezo: Orodha ya kazi kwa WakalaWaUjumla.</emphasis>

source: Click the "Add job" button to create a new job. You first need to supply a name. Then you can specify how the job will be executed: automatic at fixed times (like a cronjob, this mode will operate on all tickets found by the ticket filter) or based on ticket events (right after a single ticket was modified, if it matches the ticket filter). Note that if you manually run event based jobs from the overview screen, they will operate on all tickets fund by the ticket filter.
ja: 新規ジョブを作成するために「ジョブ追加」ボタンをクリックしてください。最初に名前を提供する必要があります。その後、ジョブがどのように実行されるか特定することができます:指定時刻で自動（cronjobのようにこのモードはチケット・フィルターによってすべてのチケットで作動します。）あるいは、チケット・イベンで自動（チケット・フィルターにマッチしていれば単一のチケットが変更された直後に）。
ru: Нажмите "Добавить задаие" для создание новой задачи. В первую очередь укажите имя. Затем, вы можете указать как она должна выполняться: автоматически в фиксированное время (как cronjob, этот режим будет оперировать всеми заявками, найденными с помощью фильтра заявок) или базируясь на событиях (сразу после изменения отдельной заявки, если она удовлетворяет фильтру). Помните, что если вы вручную запускаете задание, основанное на событии, с экрана обзора заданий, оно будет оперировать всеми заявками прошедшими фильтр.
sw: Bofya kitufe cha "Ongeza Kazi" kutengeneza kazi mpya. Kwanza unahitaji kutoa jina. Kisha utaweka bayana jinsi kazi itakavyofanyika: kiotomatiki katika mida iliyopangwa (kama kazi iliyopangwa, moduli hii itafanya kazi kwa tiketi zote zitakazopatikana na kichujio cha tiketi) au kutegemeana na matukio ya tiketi (baada ya tiketi moja tu kubadilishwa, kama itafanana na kichujio cha tiketi). Tambua kwamba kama ukianzisha kazi kwa mikono zinazotegemea matukio kutoka kwenye skrini ya mapitio, zitafanya kazi kwenye tiketi zote zilizopatikana na kichujio cha tiketi.

source: Creating a job for the GenericAgent
ja: GenericAgent（一般担当者）のためのジョブ作成
ru: Создание заданий для GenericAgent
sw: Kutengeneza kazi za WakalaWaUjumla

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="Adminarea genericagent - screenshot" scale="40" fileref="screenshots/add-genericagent-job.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="「管理者エリア genericagent（一般担当者） - スクリーンショット」" scale="40" fileref="screenshots/add-genericagent-job.png"></graphic>

source: <emphasis>Figure: Creating a job for the GenericAgent.</emphasis>
ja: <emphasis>図: GenericAgentのためのジョブ作成</emphasis>
ru: <emphasis>Рисунок: Создание заданий для GenericAgent.</emphasis>
sw: <emphasis>Kielelezo: Kutengeneza kazi za WakalaWaUjumla.</emphasis>

source: For every job, you can specify a ticket filter, for example to only operate on tickets in a certain queue. All filter criteria must be met for a job to be run on a ticket.
ja: すべてのジョブについては、チケット・フィルタを指定することができるが、例えば、ある特定のキュー中ではチケット上でのみ作動します。フィルター条件はすべて、チケット上で実行されるジョブのために満たされなければならない。
ru: Для каждого задания необходимо задать фильтр заявок, например, отбирать только заявки в определенной очереди. Чтобы задание выполнялось для заявки она должна удовлетворять всем критериям фильтра.
sw: Kwa kila kazi, unaweza kuweka bayana kichujio cha tiketi, kwa mfano kufanya kazi kwa tiketi kwenye foleni fulani tu. Vigezo vyote vya tiketi lazima vifikiwe kwa kazi kufanyika kwenye tiketi.

source: Finally, the ticket can be modified by setting various ticket fields like a new queue or state. It is possible to attach a note to the ticket(s) or run a execute a customized module. You also have the option to delete the ticket(s) from the database. This can be useful to purge outdated or invalid data from the system.
ja: すべてのジョブについては、チケット・フィルタを指定することができるが、例えば、ある特定のキュー中ではチケット上でのみ作動します。フィルター条件はすべて、チケット上で実行されるジョブのために満たされなければなりません。最後に、チケットは新規キューか状態のような様々なチケット・フィールドの設定により修正することができます。チケットにノートを付けるか、カスタマイズされたモジュールを実行することは可能です。さらに、データベースからチケットを削除するオプションがあります。これはシステムからの時代遅れのデータあるいは無効のデータを除去するのに有用になりえます。
ru: Наконец, данные заявки можно изменить, задавая различные поля, такие как очередь или состояние. Можно создать заметку к заявке(ам) или выполнить пользовательский модуль. Можно также удалить заявку(и) из базы данных. Это может быть полезно для очистки системы от ошибочных или устаревших данных, потерявших актуальность.
sw: Hatimaye, tiketi inaweza kubadilishwa kwa kuseti sehemu mbali mbali za tiketi kama foleni au hali mpya. Inawezekana kuambatanisha notisi kwenye tiketi (moja au nyingi) au kuanzisha utekelezaji wa moduli iliyogeuzwa kukufaa. Pia una chaguo la kufuta tiketi (moja au nyingi) kutoka kwenye hifadhidata. Hii inakuwa na manufaa kuondoa data zilizopitwa na wakati au zilizobatili kutoka kwenye mfumo.
