Repository: DSigmund/doc-admin
Catalog: i18n/doc-admin.*.po
Languages: ja, ru, sw

source: Every change to the web service configuration creates a new entry in the web service history (as a journal). The web service history screen displays a list of all configuration versions for a web service. Each row (version) in the "Configuration History List" represents a single revision in the web service history.
ja: ウェブサービス構成へのすべての変更はウェブサービス履歴(ジャーナルとしての)に新規エントリーを作ります。ウェブサービス履歴画面は、ウェブサービスのためのすべての構成バージョンのリストを表示します。「構成履歴の一覧」の中の列(バージョン)はそれぞれ、ウェブサービス履歴に一度の修正を表わします。
ru: Каждое изменение настроек веб-сервиса порождает новую запись в истории веб-сервиса (типа журнала). Экран истории веб-сервиса отображает список всех версий конфигурации для веб-сервиса. Каждая строка (версия) в "Истории конфигурации" представляет одно изменение в истории веб-сервиса.
sw: Kila mabadiliko ya usanidi wa huduma ya tovuti inatengeneza ingizo jipya kwenye historia ya huduma ya tovuti (kama jarida). Skrini ya historia ya huduma ya tovuti inaonyesha orodha ya matoleo yote ya usanidi wa huduma ya tovuti. Kila safu mlalo (toleo) kwenye "Orodha ya Historia ya Usanidi" inawakilisha mojawapo ya marekebisho kwenye historia ya huduma ya tovuti.

source: Click on one of the rows to show the whole configuration as it was on that particular date / time. The configuration will be shown in the "History details" section of this screen. Here you are also able to export the selected web service configuration version or to restore that version into the current web service configuration.
ja: それが特定の日付/時刻であれば、全体の構成を示すには行のうちの1つをクリックしてください。構成はこの画面の「履歴詳細」セクションの中で示されるでしょう。ここでは、選択されたウェブサービス構成バージョンをエクスポートすることも、あるいは現在のウェブサービス構成へそのバージョンを回復することもできます。
ru: Нажатие на конкретную строку приводит к показу всей конфигурации на конкретную дату/время. Конфигурация отображается в секции "Детали истории" на этом экране. На этом экране вы также имеете возможность экспортировать выбранную версию конфигурации веб-сервиса или восстановить эту версию, сделав ее текущей.
sw: Bofya kwenye moja ya safu mlalo kuonyesha usanidi mzima kama ulivyo kwa tarehe / muda huo. Usanidi utaonyeshwa kwenye sehemu "Undani wa Historia" ya skrini. Hapa pia unaweza kuhamisha toleo la usanidi wa huduma ya tovuti au kurejesha hilo toleo kwenye usanidi uliopo wa huduma za tovuti.

source: The "Export web service configuration" behaves exactly as the "Export web service" feature in the web service change screen. For more information refer to that section.
ja: 「エクスポート・ウェブサービス構成」は、ウェブサービス変更画面中の「エクスポート・ウェブサービス」機能として正確に作用します。より詳細には、そのセクションを参照します。
ru: "Экспортировать настройки веб-сервиса" ведет себя точно так же как "Экспортировать веб-сервис". Для более подробной информации обратитесь к этому разделу.
sw: Kipengele "Hamisha usanidi wa huduma ya tovuti" kina tabia sawa na "Hamisha huduma ya tovuti" kwenye skrini ya kubadilisha huduma ya tovuti. Kwa maelezo zaidi nenda kwenye hiyo sehemu.

source: If changes to the current web service configuration do not work as expected and it is not easy to revert the changes manually, you can click on the "Revert web service configuration" button. This will open a dialog to ask you if you are sure to revert the web service configuration. Click "Revert web service configuration" in this dialog to replace the current configuration with the selected version, or click "Cancel" to close the dialog.
ja: 現在のウェブサービス構成への変更が予想通りに働かず、変更を手動で復帰するのが簡単でない場合、「ウェブサービス構成を復帰」ボタンをクリックすることができます。これは、あなたが必ずウェブサービス構成を復帰させるかどうかあなたに尋ねるためにダイアログを開始するでしょう。現在の選択したバージョンで構成を代替するためにこのダイアログで「ウェブサービス構成を復帰」をクリックするか、あるいは、「キャンセル」をクリックしてダイアログを閉じます。
ru: Если сделанные изменения в конфигурации веб-сервиса приводят к неправильным результатам и исправить вручную сделанные изменения затруднительно, вы можете нажать на кнопку "Вернуть конфигурацию веб-сервиса". Нажатие приведет к открытию диалогового окна с вопросом, действительно ли вы желаете вернуться к предыдущей версии. Нажмите на кнопку "Вернуть конфигурацию веб-сервиса" в этом окне для замены текущей конфигурации выбранной версией или нажмите "Отменить" для закрытия окна.
sw: Kama mabadiliko kwenye usanidi wa huduma ya tovuti iliyopo hayafanyi kazi kama ilivyotegemewa na sio rahisi kurudisha hali kabla ya mabadiliko, bofya kitufe "Rudisha usanidi wa huduma ya tovuti". Hii itafungua maongezi yatakayokuuliza kama una uhakika unataka kurudisha usanidi wa huduma ya tovuti. Bofya "Rudisha usanidi wa huduma ya tovuti" kwenye haya maongezi kubadili usanidi uliopo na toleo lililochaguliwa, au bofya "Katisha" kufunga maongezi.

source: Remember that any passwords stored in the web service configuration will be exported in plain text format.
ja: ウェブサービス構成に格納されたどんなパスワードもプレインテキスト・フォーマットでエクスポートされるだろうということを覚えておいてください。
ru: Помните, что все пароли сохраненные в конфигурации веб-сервиса будут экспортироваться в виде обычного текста.
sw: Kumbuka kwamba nywila zote zilizohofadhiwa katika usanidi wa huduma ya tovuti zita hamishwa katika umbizo la nakala wazi.

source: Please be careful when you restore a configuration because this the process is irreversible.
ja: 構成を回復する場合は注意してください。このプロセスは不可逆です。
ru: Пожалуйста, будьте внимательны при восстановление параметров конфигурации, эта операция не может быть отменена.
sw: Tafadhali kuwa makini wakati unarudisha usanidi kwani huu mchakato haubadiliki.

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="Adminarea web service history - screenshot" scale="40" fileref="screenshots/genericinterface-webservice-history.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="管理エリア ウェブサービス 履歴 - スクリーンショット" scale="40" fileref="screenshots/genericinterface-webservice-history.png"></graphic>

source: <emphasis>Figure: Web service history.</emphasis>
ja: <emphasis>図:ウェブサービス履歴</emphasis>
ru: <emphasis>Рисунок: История веб-сервиса</emphasis>
sw: <emphasis>Kielelezo: Historia ya huduma ya tovuti.</emphasis>

source: Web Service Delete
ja: ウェブサービスの削除
ru: Удаление веб-сервиса
sw: Futa Huduma ya Tovuti

source: Sometimes it is necessary to delete a web service completely. To do this you can press on the "Delete web service" button and a new dialog will appear asking for confirmation.
ja: 時としてウェブサービスを完全に削除することが必要な場合があります。これをするために、あなたは「ウェブサービスの削除」ボタンを押すことができます。すると、新規ダイアログが確認を求めて現われるでしょう。
ru: Иногда возникает необходимость удалить веб-сервис полностью. Для этого можно нажать кнопку "Удалить веб-сервис", появится диалоговое окно с вопросом о подтверждении операции.
sw: Wakati mwingine ni lazima kufuta huduma ya tovuti kabisa. Kufanya hivi unabonyeza kitufe "Futa huduma ya tovuti" na maongezi mapya yatatokea kukuuliza uthibitisho.

source: Click on "Delete" to confirm the removal of the web service or on "Cancel" to close the dialog.
ja: ウェブサービスの削除を確認するために「削除」をクリックするか、またはダイアログを閉じるために「キャンセル」をクリックして下さい。
ru: Кликните на кнопку "Удалить" чтобы подтвердить удаление веб-сервиса или кнопку "Отменить" чтобы закрыть диалоговое окно.
sw: Bofya "Futa" kuthibitisha uondoaji wa huduma ya tovuti au "Katisha" kufunga maongezi.

source: Deleting a web service can't be undone, please be careful when deleting a web service.
ja: ウェブサービスの削除はやり直しがききません。ウェブサービスを削除する場合、注意してください。
ru: Операция удаления веб-сервиса не может быть отменена, пожалуйста, будьте внимательны при удалении веб-сервисов.
sw: Kufuta huduma ya tovuti hakubadiliki, tafadhali kuwa makini wakati wa kufuta huduma ya tovuti.

source: Web service delete
ja: ウェブサービスの削除
ru: Удаление веб-сервиса
sw: Futa huduma ya tovuti

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="Adminarea web service delete - screenshot" scale="40" fileref="screenshots/genericinterface-webservice-delete.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="管理エリア ウェブサービス 削除 - スクリーンショット" scale="40" fileref="screenshots/genericinterface-webservice-delete.png"></graphic>

source: <emphasis>Figure: Web service delete.</emphasis>
ja: <emphasis>図：ウェブサービスの削除</emphasis>
ru: <emphasis>Рисунок: Удаление веб-сервиса</emphasis>
sw: <emphasis>Kielelezo: Futa huduma ya tovuti.</emphasis>

source: Web Service Debugger
ja: ウェブサービス・デバッガ
ru: Отладчик веб-сервиса:
sw: Kieuaji cha Huduma ya Tovuti

source: The Debugger stores the log of a web service. In the debugger screen you can track all the web service communications for either provider or requester types.
ja: デバッガは、ウェブサービスのログを格納します。デバッガ画面では、供給者あるいは依頼者タイプのいずれかのためのウェブサービス・コミュニケーションをすべて追跡することができます。
ru: Отладчик хранит журнал веб-сервиса. На странице отладчика можно следить за всеми связями веб-сервера, когда он работает в роли поставщика и получателя.
sw: Anaye eua anahifadhi batli ya huduma ya tovuti. Katika skrini ya kueua unaweza kufwatilia mawasiliano yote ya huduma za tovuti kwa aidha aina za mtoaji au muombaji.

source: When this screen is shown the request list starts to load. After the list is fully filled you can choose one of the rows (that means a communication sequence) to check its details. This details will appear in a box below.
ja: この画面が示される場合、依頼リストがロードし始めます。リストが完全に満たされた後、その詳細をチェックするために列のうちの1つを選ぶことができます。(列とはコミュニケーション・シーケンスを意味します)これは詳述します、下のボックスに現われます。
ru: Когда отображается эта страница начинает загружаться список запросов. После того как список будет полность загружен, можно выбрать одну из строк (что означает последовательность связей) и просмотреть подробню информацию. Эта информация будет отображаться во всплывающем окне ниже.
sw: Hii skrini ikionyeshwa orodha ya maombi inaanza kupakuliwa. Baada ya orodha kujaa unaweza kuchagua moja ya safu mlalo (hii ina maana mlolongo wa mawasiliano) kukagua undani wake. Maelezo haya yatatokea kwenye boksi chini.

source: You can narrow the communication list using the filter on the right part of the screen. You can filter by:
ja: 画面の右側ではフィルタを使用して、コミュニケーション・リストを狭くすることができます。次のものによってフィルタすることができます：
ru: Можно сузить список используя фильтр в правой части страницы. Фильтрацию можно производить по:
sw: Unaweza kupunguza orodha ya mawasiliano kwa kutumia kichujio upande wa kulia wa skrini. Unaweza kuchuja na:

source: Communication type (provider or requester)
ja: コミュニケーション・タイプ(供給者または依頼者)
ru: Тип связи (поставщик или запрашиваемая сторона)
sw: Aina ya mawasiliano (mtoaji au mpokeaji)

source: Date: before and / or after a particular date
ja: 日付:前、及び/または特定の日付の後
ru: Дата: до и / или после определенной даты
sw: Tarehe: kabla na / au baada tarehe fulani

source: The remote IP Address
ja: リモートのIPアドレス
ru: Удаленный IP-адрес
sw: Anuani ya IP ya mbali

source: A combination of all.
ja: 上記すべての組み合わせ
ru: Сочетание всех.
sw: Mjumuisho wa yote.

source: After filter settings are set, push the "Refresh" button and a new list will be displayed meeting your search criteria.
ja: フィルタ設定がセットされた後、「リフレッシュ」ボタンを押してください。検索基準を満たす新規リストが表示されるはずです。
ru: После того как настройки фильтра завершены, нажмите кнопку "Обновить" и новый список, отвечающий вашим критериям будет отображен.
sw: Baada ya mpangilio wa kichujio kusetiwa, bonyeza kitufe cha "Onyesha Upya" na orodha mpya itaonyeshwa inayofikia vigezo vya utafutaji wako.

source: Depending on the search criteria for the filters the new list could return no results.
ja: フィルターの検索基準に依存しますが、新規リストが結果を返さないこともあり得ます。
ru: В зависимости от критериев поиска установленых в фильтре, новый поиск может вернуть пустой список.
sw: Kutegemea na vigezo vya utafutaji kwa vichujio orodha mpya inaweza isitoe matokeo yoyote.

source: On the left part of the screen under the action column you can select "Go back to the web service" or clear the debugger log by pushing the "Clear" button. This will open a dialog that ask you to confirm erasing of the log. Click "Clear" in the dialog button to perform the action or click on "Cancel" to close this dialog.
ja: アクション・カラムの下の画面の左の側では、「ウェブサービスに戻る」を選択するか、あるいは「クリア」ボタンを押すことによりデバッガログを取り除くことができます。ダイアログが開いて、ログの削除を確認されます。アクションを実行するためにダイアログボタンで「クリア」をクリックするか「キャンセル」をクリックしてこのダイアログを閉じます。
ru: В левой части экрана, под фреймом действий, вы можете выбрать "Вернуться к веб-сервису" или очистить журнал отладки, нажатием на кнопку "Очистить". При этом откроется диалоговое окно, где вас попросят подтвердить очистку журнала. Нажмите "Очистить" в диалоговом окне для выполнения этого действия или "Отменить" для закрытия диалога.
sw: Upande wa kushoto wa skrini chini ya safuwima ya kitendo unaweza kuchagua "Rudi nyuma kwenye huduma ya tovuti" au futa batli ya anaye eua kwa kubonyeza kitufe "Futa". Hii itafungua maongezi yanayo kuuliza kuthibitisha kufuta batli. Bofya "Futa" katika kitufe cha maongezi kufanya kitendo au bofya "Sitisha" kufunga maongezi.

source: In the "Request details" section you can see all the details for the selected communication. Here you can track the complete flow and check for possible errors or confirm success responses.
ja: 「リクエスト詳細」セクションで、選択されたコミュニケーションの詳細をすべて見ることができます。ここでは、完全なフローを追跡し、起こりうるエラーをチェックし、あるいは成功の応答を確認することができます。
ru: В разделе "Подробности Запроса" можно просматривать подробную информацию о комуникации. Здесь можно следить за полным потоком и проверять всевозможные ошибки или подтвержать успешные ответы.
sw: Kwenye sehemu ya "Undani wa maombi" unaweza kuona maelezo yote ya mawasiliano yaliyochaguliwa. Hapa unaweza kufuatilia mtiririko mzima na kukagua kasoro zozote au kuthibitisha mafanikio ya majibu.

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="Adminarea web service debugger - screenshot" scale="40" fileref="screenshots/genericinterface-webservice-debugger.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="管理エリア ウェブサービス デバッガ - スクリーンショット" scale="40" fileref="screenshots/genericinterface-webservice-debugger.png"></graphic>

source: <emphasis>Figure: Web service debugger.</emphasis>
ja: <emphasis>図:ウェブサービス・デバッガ</emphasis>
ru: <emphasis>Рисунок: Отладчик веб-сервиса.</emphasis>
sw: <emphasis>Kielelezo: Kieuaji cha huduma ya tovuti.</emphasis>

source: Web Service Configuration Change
ja: ウェブサービス構成変更
ru: Изменение настроек веб-службы
sw: Badili Usanidi wa Huduma ya Tovuti

source: Returning to the web service change screen, now we are going to review the right side of it. Here we have the possibility to modify all the general data for a web service such as name, description, debug threshold, etc. Also there are two more sections below that allows us to modify specific parameters for communication types "OTRS as Provider" and "OTRS as Requester".
ja: ウェブサービス変更画面に戻って、その右側をレビューしましょう。ここでは、ウェブサービスのためのすべての一般データを修正することができます。一般データとはたとえば名前、記述、デバッグ閾値などです。さらに下には二つ以上の選択があります。それによって、「供給者としてのOTRS」や「依頼者としてのOTRS」といったコミュニケーション・タイプ用の特定のパラメタを変更することができます。
ru: Возвратившись на экран изменения, перейдем к обзору правой его части. Здесь вы имеете возможность изменить все основные данные веб-сервиса, такие как имя, уровень отладки и т.д. Также, здесь, ниже, имеются еще две секции позволяющие изменить специальные параметры для типа связи "OTRS как провайдер" и "OTRS как получатель".
sw: Tukirudi kwenye skrini ya kubadilisha huduma ya tovuti, sasa tutafanya mapitio ya upande wake wa kulia. Hapa tuna uwezo wa kubadili data zote za ujumla za huduma ya tovuti kama jina, maelezo, kizingiti cha kueua, na kadhalika. Pia kuna sehemu nyingine mbili chini zinazoturuhusu kubadili parameta maalumu za aina za mawasilinao "OTRS kama Mtoaji" na "OTRS kama Muombaji".

source: The web service configuration needs to be saved on each level. This means that if a setting is changed, links to other, deeper parts of the configuration will be disabled forcing you to save the current configuration level. After saving the disabled links will be re-enabled again allowing you to continue with the configuration.
ja: ウェブサービス構成は各レベル上に保存する必要があります。このことは設定が変われば、現在の構成レベルを保存してしまうことで、他へのリンクや構成の深い部分が無効にしてしまうことを意味します。保存後に、無効となったリンクは 再び構成を継続することを可能にすることで、再度可能にできます。
sw: Usanidi wa huduma ya tovuti unahitaji kuhifadhiwa katika kila hatua. Hii inamaanisha kama mpangilio umebadilishwa, viungo vya kwenda kwa sehemu nyingine za ndani za usanidi vitalemazwa kukulazimisha wewe kuhifadhi usanidi wa ngazi uliyopo. Baada ya kuhifadhi viungo vilivyo lemazwa vitawezeshwa tena kukuwezesha kuendelea na usanidi.

source: On the "OTRS as provider" section it is possible to set or configure the network transport protocol. Only network transport back-ends that are registered are shown on the list. To configure the network transport click on the "Configure" button. It is also possible to add new operations in this box. To do this select one of the available operations from the "Add Operation" list. This will lead you to the operation configuration screen. After saving the new operation it will be listed in the table above.
ja: 「供給者としてのOTRS」セクションにおいては、ネットワーク・トランスポート・プロトコルをセットするか構成することが可能です。登録されるネットワーク・トランスポート・バックエンドだけがリストに示されます。ネットワーク・トランスポートを構成するためには「構成」ボタンをクリックします。さらに、このボックスの中に新規オペレーションを追加することは可能です。これを行うするためには「オペレーションを追加」リストから可能なオペレーションをひとつ選択します。これはあなたをオペレーション構成画面ヘ導くでしょう。新規オペレーションを保存した後に、それは上記のテーブルにリストされるでしょう。
sw: Katika kifungu "OTRS kama mtoaji" inawezekana kuseti au kusanidi itifaki ya usafirishaji wa mtandao. Mazingira ya nyuma ya usafirishaji mtandao yaliyosajiliwa tu ndiyo yanaonyeshwa kwenye orodha. Kusanidi usafirishaji wa mtandao bofya kwenye kifufe cha "Sanidi". Pia inawezekana kuongeza operesheni mpya katika boksi hili. Kufanya hivi chagua moja ya operesheni zilizopo kutoka kwenye orodha "Ongeza Operesheni". Hii itakupeleka kwenye skrini ya kusanidi operesheni. Baada ya kuhifadhi operesheni mpya itaorodheshwa kwenye jedwali juu.

source: "OTRS as requester" is very similar to the previous one, but instead of "operations" you can add invokers here.
ja: 「依頼者としてのOTRS」は前のものに非常に似ています。しかし、「オペレーション」の代わりに、ここで依頼アクション(Invokers)を加えることができます。
ru: "OTRS как запрашивающая сторона" очень похож на предыдущий, но вместо "операций" здесь можно добавить invokers
sw: "OTRS kama muombaji" ni sawa na iliyopita, lakini badala ya "operesheni" unaweza kuongeza wachochezi hapa.

source: Click the "Save" button to save and continue configuring the web service, "Save and finish" to save and return to the web service overview screen, or "Cancel" to discard current configuration level changes and return to web service overview screen.
ja: ウェブサービスの構成を保存し継続するために「保存」ボタンをクリックするか、あるいはウェブサービス概要画面に保存し返るために「保存して終了」をクリックするか、現在の構成レベル変更を廃棄し、かつウェブサービス概要画面に返るために「キャンセル」をクリックして下さい。
ru: Нажмите кнопку "Сохранить" для сохранения и продолжения настройки веб-сервиса. "Сохранить и продолжить" - для сохранения и возврата в окно обзора веб-сервисов, или "Отменить" для отмены, сделанных на этом уровне, изменений и возврата к окну обзора веб-сервисов.
sw: Bofya kitufe "Hifadhi" kuhifadhi na kuendelea na usanidi wa huduma za tovuti, "Hifadhi na maliza" kuhifadhi na kurudi kwenye skrini ya mapitio ya huduma za tovuti, au "Sitisha" kupuuza mabadiliko ya ngazi za usanidi wa sasa na kurudi kwenye skrini ya mapitio ya huduma za tovuti.

source: Web service change
ja: ウェブサービスの変更
ru: Изменение веб-сервиса
sw: Badilisha huduma ya tovuti

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="Adminarea web service change - screenshot" scale="40" fileref="screenshots/genericinterface-webservice-change.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="「管理エリア ウェブサービス 変更 - スクリーンショット」" scale="40" fileref="screenshots/genericinterface-webservice-change.png"></graphic>

source: <emphasis>Figure: Web services change.</emphasis>
ja: <emphasis>図:ウェブサービスの変更</emphasis>
ru: <emphasis>Рисунок: Изменения веб-службы.</emphasis>
sw: <emphasis>Kielelezo: Badilisha huduma ya tovuti.</emphasis>

source: Like the other Generic Interface configuration screens such as Network Transport, Operation, Invoker and Mapping, the initial configuration (add) screen will only present two options: "Save" and "Cancel". If the configuration is re-visited, a new option "Save and Finish" will appear. The behavior of this feature is defined below.
ja: 他の一般インターフェイスの構成画面のように（ネットワーク・トランスポート、オペレーション、依頼アクション(Invokers)およびマッピング）初期の構成（追加）画面は単にふたつのオプションを表します。「保存」と「キャンセル」です。構成画面に再度戻ると、新規オプション「保存および終了」が現われます。この特徴の振る舞いは下に定義されます。
sw: Kama skrini nyingine za ujumla za Kiolesura cha usanidi kwa mfano Usafirishaji wa Mtandao, Operesheni, Mchochezi na Muunganiko, skrini ya usanidi (ongeza) wa awali itaonyesha machaguo mawili: "Hifadhi" na "Sitisha". Usanidi ukirudiwa, chaguo jipya "Hifadhi na Maliza" litaonekana. Tabia ya kipengele hiki imafafanuliwa chini.

source: "Save" will store the current configuration level in the database and it will return to the previous screen to review your changes or to configure deeper settings.
ja: 「保存」はデータベースに現在の構成レベルを格納するでしょう。そして、それは、あなたが行った変更をレビューする、あるいはより深い設定を構成するために、前画面に戻ります。
ru: "Сохранить и Закончить" сохранит настройки текущего уровеня в базе данных и вернет к предыдущей странице в иерархии конфигурации.
sw: "Hifadhi" itahifadhi usanidi wa ngazi uliyopo kwa sasa kwenye hifadhidata na itarudi kwenye skrini iliyopita kufanya mapitio ya mabadiliko uliyofanya au kufanya usanidi wa mipangilio ya ndani.

source: "Save and Finish" will store the current configuration level in the database and it will return to the previous screen in the configuration hierarchy (to the immediate upper configuration level).
ja: 「保存および終了」はデータベースに現在の構成レベルを格納します。また、それは、構成階層中の前画面(直上部の構成レベルへ)に戻ります。
ru: "Save and Finish" сохнанит текущий уровень настроек в базе данных и вернется к предыдущей странице в иерархии конфигурации.
sw: "Hifadhi na Maliza" itahifadhi usanidi wa ngazi uliyopo kwa sasa kwenye hifadhidata na itarudi kwenye skrini iliyopita kwenye mfumo wa viwango wa usanidi (kwa ngazi ya juu inayofuata ya usanidi)

source: "Cancel" will discard any configuration change to the current configuration level and will return to the previous screen in the configuration hierarchy.
ja: 「キャンセル」は、現在の構成レベルへのどんな構成変更も廃棄し、構成階層中の前画面に戻ります。
ru: "Отменить" будет отменять любые изменения конфигурации и возвращать их к текущему уровню конфигурации, после чего возвращаться на к предыдущему экрану в иерархии настроек.
sw: "Katisha" itapuuza mabadiliko yoyote ya usanidi kwa ngazi uliyopo na itarudi kwenye skrini iliyopita kwenye mfumo wa viwango wa usanidi.

source: Web Service Provider Network Transport
ja: ウェブサービス供給者のネットワーク・トランスポート
ru: Транспортаня сеть Веб-сервиса
sw: Usafirishaji Mtandao wa Mtoaji wa Huduma ya Tovuti

source: In future the list of available network transports will be increased. Currently only the "HTTP::SOAP" transport is available. Each transport has different configuration options to setup and they might use different frontend modules to configure it, but mostly they should look similar to the "HTTP::SOAP" transport configuration module.
ja: 今後、利用可能なネットワーク・トランスポートのリストは増加するでしょう。現在、「HTTP::SOAP」トランスポートだけが利用可能です。各トランスポートはセットアップのために異なる設定オプションを持っています。また、それらは、それを構成するために異なるフロント・エンド・モジュールを使用するかもしれません。しかし、ほとんど、それらは「HTTP::SOAP」トランスポート構成モジュールに類似しているべきです。

source: It is quite simple to configure the "HTTP::SOAP" protocol as provider. There are only two settings: "Namespace" and "Maximum message length". These fields are required. The first one is a URI to give SOAP methods a context, reducing ambiguities, and the second one is a field where you can specify the maximum size (in bytes) for SOAP messages that OTRS will process.
ja: 供給者として「HTTP::SOAP」プロトコルを構成することは全く簡単です。設定は二つのみです。:「ネームスペース」および「最大のメッセージ長」。これらのフィールドは必須です。最初のものは、曖昧さを少なくする文脈に、SOAP方法を与えるURIです。また、第2のものは、OTRSが処理する SOAPメッセージのために最大サイズ(バイトで)を指定することができるフィールドです。
sw: Ni rahisi kusanidi itifaki "HTTP::SOAP" kama mtoaji. Kuna mipangilio miwili tu: "Nafasiyajina" na "Upeo wajuu wa urefu wa ujumbe". Hizi sehemu zinahitajika. Ya kwanza ni URI kuzipa njia za SOAP maudhui, kupunguza utata, na ya pili ni sehemu ambayo unaweza kuweka bayana ukomo wa juu wa ukubwa (katina baiti) kwa ujumbe wa SOAP ambao OTRS itachakatisha.
