Repository: DSigmund/doc-admin
Catalog: i18n/doc-admin.*.po
Languages: ja, ru, sw

source: Please note that if you upgrade from OTRS 2.2 or earlier, you must take an extra step; please read <ulink url="http://bugs.otrs.org/show_bug.cgi?id=6798">http://bugs.otrs.org/show_bug.cgi?id=6798</ulink>.
ja: OTRS 2.2以前からアップグレードする場合は、余計な手間を踏む必要があります：AA。を読んでください。 <ulink url="http://bugs.otrs.org/show_bug.cgi?id=6798">http://bugs.otrs.org/show_bug.cgi?id=6798</ulink>を読んで下さい。

source: Within a single minor version you can skip patch level releases if you want to upgrade. For instance you can upgrade directly from OTRS 3.3.1 to version 3.3.4. If you need to do such a "patch level upgrade", you should skip steps 9 and 13-16.
ja: 単一の小さなバージョン内では、アップグレードしたければ、パッチ・レベル・リリースをスキップすることができます。例えば、OTRS 3.3.1からバージョン3.3.4に直接アップグレードすることができます。そのような"パッチ・レベル・アップグレード"を行う必要があれば、ステップ9および13-16をスキップするべきです。

source: Please note that if you perform a patch level upgrade from OTRS 3.3.6 or earlier, you need to activate a new cron job that controls the scheduler process. Please copy the file <filename>/opt/otrs/var/cron/scheduler_watchdog.dist</filename> to <filename>/opt/otrs/var/cron/scheduler_watchdog</filename> and update your crontab with <filename>/opt/otrs/bin/Cron.sh start</filename> (as "otrs" user, not root).
ja: OTRS 3.3.6以前からのパッチ・レベル・アップグレードを行なうならば、 スケジューラ・プロセスをコントロールする新規cronジョブを活性化する必要があることに注意してください。ファイル <filename>/opt/otrs/var/cron/scheduler_watchdog.dist</filename> を<filename>/opt/otrs/var/cron/scheduler_watchdog</filename> にコピーして<filename>/opt/otrs/bin/Cron.sh start</filename> でcrontabを更新して下さい(rootではなく"otrs" ユーザとして)。

source: Stop all relevant services.
ja: 全ての関連サービスを停止

source: e. g. (depends on used services): <placeholder type="screen" id="0"/>
ja: 例えば（使用中のサービスに依存しますが）：<placeholder type="screen" id="0"/>

source: Backup everything below $OTRS_HOME (default: OTRS_HOME=/opt/otrs):
ja: 以下の全てをバックアップ $OTRS_HOME (default: OTRS_HOME=/opt/otrs):

source: Make sure that you have backed up everything ;-)
ja: 全てバックアップしたことを確認して下さい。

source: Setup new system (optional)
ja: 新規システム（オプション）のセットアップ

source: If possible, try this install on a separate machine for testing first.
ja: 可能ならばまずテスト用にこれを別マシンでインストールしてみて下さい。

source: Install the new release (tar or RPM).
ja: 新規リリースをインストール（tarまたはPRM)。

source: With the tarball:
ja: talballで：

source: Restore old configuration files
ja: 旧構成ファイルをリストア
ru: Восстановить старые конфигурационные файлы
sw: Rejesha usanidi wa ma faili ya zamani

source: Restore TicketCounter.log
ja: TicketCounter.logをリストア
ru: Восстановить TicketCounter.log
sw: Rudisha TicketCounter.log

source: In order to let OTRS continue with the correct ticket number, restore the <filename>TicketCounter.log</filename> to <filename>$OTRS_HOME/var/log/</filename> (default: <filename>OTRS_HOME=/opt/otrs</filename>). This is especially important if you use incremental ticketnumbers.
ja: OTRSにてチケット番号を正確に継続させるために、<filename>$OTRS_HOME/var/log/</filename> (default: <filename>OTRS_HOME=/opt/otrs</filename>)に<filename>TicketCounter.log</filename>をリストアしてください。インクリメントのチケット番号を使用しているならば、特にこれは重要です。

source: Restore article data
ja: 記事データのリストア
ru: Восстановить данные статьи
sw: Rejesha data za makala

source: If you configured OTRS to store article data in the filesystem you have to restore the <filename>article</filename> folder to <filename>$OTRS_HOME/var/</filename> (default: <filename>OTRS_HOME=/opt/otrs</filename>).
ja: OTRSを構成し、ファイルシステムに記事データを格納するならば、<filename>$OTRS_HOME/var/</filename> (default: <filename>OTRS_HOME=/opt/otrs</filename>)に<filename>article</filename>フォルダーをリストアしなければなりません。

source: With the RPM: <placeholder type="screen" id="0"/>
ja: RPMで：<placeholder type="screen" id="0"/>

source: In this case the RPM update automatically restores the old configuration files.
ja: この場合、RPMアップグレードは自動で旧構成ファイルをリストアします。

source: Own themes
ja: 自身のテーマ

source: Note: The OTRS themes between 3.2 and 3.3 are NOT compatible, so don't use your old themes!
ja: ノート: OTRSテーマの3.2と3.3は互換性がありません。だから旧テーマを使用しないで下さい。

source: Themes are located under $OTRS_HOME/Kernel/Output/HTML/*/*.dtl (default: OTRS_HOME=/opt/otrs).
ja: テーマは $OTRS_HOME/Kernel/Output/HTML/*/*.dtl (default: OTRS_HOME=/opt/otrs) 下にあります。

source: Please also note that dtl-Files must be in utf-8 from OTRS 3.3 on.
ja: dtl-FilesはOTRS 3.3上ではutf-8でなければいけません。

source: Set file permissions.
ja: ファイル権限を設定

source: If the tarball is used, execute: <placeholder type="screen" id="0"/> with the permissions needed for your system setup.
ja: talballを使用する場合は、システム設定に必要な権限で<placeholder type="screen" id="0"/>を実行します。

source: Check needed Perl modules
ja: 必要な perlモジュールをチェックします。

source: Verify that all needed perl modules are installed on your system and install any modules that might be missing. <placeholder type="screen" id="0"/>
ja: システムに必要とされるperlモジュールがすべてインストールされ不足しているおそれのあるモジュールをインストールすることを確認してください。<placeholder type="screen" id="0"/>
ru: Проверьте наличие всех требуемых perl модулей и доустановите те, которые могли быть пропущены по разным причинам. <placeholder type="screen" id="0"/>
sw: Hakikisha kwamba moduli zote za perl zinazohitajika zimesakinishwa kwenye mfumo wako na sakinisha moduli zozote ambazo zinakosekana. <placeholder type="screen" id="0"/>

source: Schema update:
ja: スキーマ・アップデート：

source: Note: new tables created in the MySQL UPGRADING process will be created with the default table storage engine set in your MySQL server. In MySQL 5.5 the new default type is InnoDB. If existing tables, e.g. "users", have the table storage engine, e.g. MyISAM, then an error will be displayed when creating the foreign key constraints.
ja: ノート: MySQL UPGRADINGプロセスで作成された新しいテーブルは、MySQLサーバーで設定されたデフォルト・テーブル・ストレージ・エンジンで作成されます。MySQL 5.5では、新しいデフォルト・タイプはInnoDBです。既存のテーブル(例えば「ユーザ」)にテーブル・ストレージ・エンジンがある場合（例えばMyISAM）外部キー制約を作成するとエラーが表示されます。

source: You have two options: (1) you can change the default storage engine of MySQL back to MyISAM so that new tables will have the same engine as the existing tables, or (2) change the existing tables to use InnoDB as storage engine.
ja: 2つのオプションがあります: (1) 新規テーブルが既存テーブルと同じエンジンを持つように、MySQLのデフォルトのストレージ・エンジンをMyISAMに変更できます。あるいは (2) ストレージ・エンジンとしてInnoDBを使用する既存テーブルを変更します。

source: Any problems with regards to the storage engine will be reported by the otrs.CheckDB.pl script, so please run it to check for possible issues.
ja: otrs.CheckDB.plスクリプトは、ストレージ・エンジンに関するどんな問題も報告するので、可能な問題をチェックするためにそれを実行してください。

source: Note: If you use PostgreSQL 8.1 or earlier, you need to activate the new legacy driver for these older versions. Do this by adding a new line to your <filename>Kernel/Config.pm</filename> like this: <placeholder type="screen" id="0"/>
ja: ノート:PostgreSQL 8.1以前を使用する場合は、これらのより古いバージョン用の新しいレガシー・ドライバーを活性化する必要があります。そのためには、新規の１行を<placeholder type="screen" id="0"/>のような<filename>Kernel/Config.pm</filename>に追加します。

source: Run the migration script (as user 'otrs', NOT as root):
ja: 統合スクリプト（「root」としてではなくユーザ「otrs」として）を走らせます。

source: <placeholder type="screen" id="0"/> Do not continue the upgrading process if this script does not work properly for you. Otherwise data loss may occur.
ja: <placeholder type="screen" id="0"/> このスクリプトが適切に動かない場合はアップグレードプロセスを継続しないで下さい。そうでなければデータを失いかねません。

source: Refresh the configuration and delete caches. Please run (as user 'otrs', NOT as 'root'):
ja: 構成をリフレッシュしてキャッシュを削除します。（「root」としてではなくユーザ「otrs」として）

source: Restart your services.
ja: サービスの再起動

source: e. g. (depends on used services): <placeholder type="screen" id="0"/> Now you can log into your system.
ja: 例えば（ご使用中のサービスによりますが）<placeholder type="screen" id="0"/>今、システムにログインできます。
ru: в т.ч. (зависящие от использующихся услуг): <placeholder type="screen" id="0"/> Теперь вы можете войти в систему.
sw: mf. (inategemeana na huduma zilizotumika): <placeholder type="screen" id="0"/> Sasa unaweza kuingia kwenye mfumo wako.

source: Check installed packages
ja: インストール済のパッケージをチェック

source: In the package manager, check if all packages are still marked as correctly installed or if any require reinstallation or even a package upgrade.
ja: パッケージ・マネージャでは全てのパッケージが正しくインストールされたとしてマークされているか、あるいはなんらかの再インストレーションあるいはパッケージ・アップグレードでさえ必要であるかをチェックします。

source: The following packages are automatically uninstalled after the upgrade process (if they where installed before):
ja: 以下のパッケージはアップグレード・プロセス後。自動的にアンインストールされます（先にインストール済ならば）
ru: Следующие пакеты будут автоматически деинсталлированы после процесса обновления (если были установлены ранее):
sw: Vifurushi vifuatavyo vinasakinushwa kiotomatiki baada ya mchakato wa uboreshaji (kama zilisakinishwa kabla):

source: OTRSEventBasedTicketActions
ja: OTRSDynamicFieldMultiLevelSelection

source: Check config settings of OTRSFreeTextFromCustomerUser
ja: OTRSFreeTextFromCustomerUserの構成設定をチェックします。

source: Note: This only applies if you used the package OTRSFreeTextFromCustomerUser previously.
ja: ノート: これは以前にOTRSFreeTextFromCustomerUser パッケージを使用した場合にだけ適用されます。

source: If you used this module previously, you need to reconfigure it. The module is automatically uninstalled by the upgrading script as it is now a part of the OTRS framework.
ja: このモジュールを以前に使用したならば、それを再構成する必要がああります。それが今OTRSフレームワークの一部であるように、モジュールはアップグレードするスクリプトによって自動的にアンインストールされます。

source: If you want to keep using it, please enable the setting "Ticket::EventModulePost###930-DynamicFieldFromCustomerUser" to activate this feature and configure the mapping in the setting "DynamicFieldFromCustomerUser::Mapping".
ja: それを使用し続けたい場合は、この機能を活性化するために、設定 "Ticket::EventModulePost###930-DynamicFieldFromCustomerUser" を有効にして下さい。そして設定 "DynamicFieldFromCustomerUser::Mapping"でマッピングを構成して下さい。

source: Import your ACLs to the new ACL editor (optional)
ja: ACLを新規ALCエディタ（オプション）へインポートします。

source: In OTRS 3.3, there is a graphical editor for ACLs in the administration interface. You will need to import your existing ACLs (e.g. in Config.pm or additional files) to the editor by using bin/otrs.ImportACLsFromConfig.pl in order to make them available in the editor. Please make sure to delete any ACLs from Config.pm (or other files) after successfully finishing the import procedure. Also you will need to use the deploy button in the ACL administration frontend in order to re-deploy the imported ACLs to your system.
ja: OTRS 3.3では、管理インターフェースにACL用グラフィカルなエディタがあります。エディタに既存のACLを利用可能にするために、それらを（例えばConfig.pmあるいは追加ファイル）をbin/otrs.ImportACLsFromConfig.pl を使用することによりエディタにインポートする必要があります。インポート手続きをうまく終了させた後では、必ずConfig.pm(または他のファイル)からいかなるACLも削除して下さい。さらに、システムにインポートしたACLを再度展開させるためにACL管理フロント・エンドの中で展開ボタンを使用する必要もあります。

source: Update your web server configuration
ja: ウェブサーバ構成のアップデート

source: Note: this applies only if you use the Apache web server, and do not use the configuration file directly from the OTRS installation directory (e. g. with a symlink from the Apache configuration directory).
ja: ノート: Apacheウェブサーバを使用し、OTRSインストール・ディレクトリ(例えばApache 構成ディレクトリからのシンボリックリンクで)から設定ファイルを直接使用しない場合のみ、これは当てはまります。

source: Please update the the Apache configuration file for OTRS as there have been several changes (see <filename>scripts/apache2-httpd.include.conf</filename>).
ja: いくつかの変更をした時は、OTRS用Apache設定ファイルをアップデートして下さい。( <filename>scripts/apache2-httpd.include.conf</filename>を御覧ください)。

source: Update and activate cronjobs
ja: 活性化しているcronジョブのアップデート

source: shell> cd var/cron shell> for foo in *.dist; do cp $foo `basename $foo .dist`; done
ja: shell&gt; cd var/cron shell&gt; for foo in *.dist; do cp $foo `basename $foo .dist`; done

source: There are several OTRS default cronjobs in $OTRS_HOME/var/cron/*.dist. They can be activated by copying them without the ".dist" filename extension. Do this to make sure you get the latest versions of the cronjobs and new cronjobs as well. <placeholder type="screen" id="0"/>
ja: $OTRS_HOME/var/cron/*.distにいくつかのOTRSデフォルトのcronジョブがあります。それらは ".dist" のファイル拡張子なしでそれらをコピーすることで活性化することができますこれを実行する際は、新規cronjobsおよびcronjobsの最新バージョンの入手をご確認下さい。 <placeholder type="screen" id="0"/>

source: Please check the copied files and re-apply any customizations that you might have made.
ja: コピーされたファイルをチェックして、カスタマイゼーション済ならすべて再適用してください。

source: shell> /opt/otrs/bin/Cron.sh start
ja: shell&gt; /opt/otrs/bin/Cron.sh start

source: To schedule these cronjobs on your system, you can use the script Cron.sh. Make sure to execute it as the OTRS system user! <placeholder type="screen" id="0"/>
ja: システム上のこれらのcronジョブを予定するために、スクリプトCron.shを使用することができます。必ずOTRSシステム・ユーザとしてそれを実行してください!<placeholder type="screen" id="0"/>

source: Well done!
ja: お疲れ様でした！

source: The simple way - Installation of pre-built packages
ja: シンプルな方法 - あらかじめ構築されたパッケージのインストレーション
ru: Самый простой способ - установка из готовых бинарных пакетов
sw: Njia rahisi - Usakinishaji wa vifurushi vilivyojengwa tayari

source: If available for your platform you should use pre-built packages to install OTRS, since it is the simplest and most convenient method. You can find them in the download area at <ulink url="http://www.otrs.com"> <citetitle>http://www.otrs.com</citetitle> </ulink> . The following sections describe the installation of OTRS with a pre-built or binary package on SUSE, Red Hat and Microsoft Windows systems. Only if you are unable to use the pre-built packages for some reason should you follow the manual process.
ja: ご利用のプラットフォームで利用可能な場合、OTRSをインストールするためにあらかじめ構築されたパッケージを使用するべきです。それが最も簡便な方法ですから。ダウンロード・エリア<ulink url="http://www.otrs.com"><citetitle>http://www.otrs.com</citetitle> </ulink>でそれらを見つけることができます。次のセクションは、SUSE、Red Hatおよびマイクロソフト・ウィンドウズ・システムの上のあらかじめ構築された、あるいは、バイナリ・パッケージによるOTRSのインストールについて記述します。なんらかの理由であらかじめ構築されたパッケージを使用することができない場合のみ、手動のプロセスに従うべきです。

source: Installing the RPM on a SUSE Linux server
ja: SUSE Linuxサーバ上でのRPMのインストール
ru: Установка из rpm-пакетов на сервер под управлением Suse Linux
sw: Kusakinisha RPM katika seva ya Linux ya SUSE

source: This section describes the installation of our RPM package on a SUSE Linux server. We have tested against all recent SLES and openSUSE versions. Before you start the installation, please visit <ulink url="http://www.otrs.com/downloads"> <citetitle>http://www.otrs.com/downloads</citetitle> </ulink> and make sure you use the latest OTRS RPM package available.
ja: このセクションは、SUSEリナックス・サーバーの私たちのRPMのパッケージの設置について記述します。私たちはすべての最近のSLESおよびopenSUSEバージョンに対してテストしました。インストレーションを始める前に<ulink url="http://www.otrs.com/downloads"><citetitle>http://www.otrs.com/downloads</citetitle> </ulink>を訪ね、利用可能な最新のOTRS RPMのパッケージを使用しているかをご確認下さい。
ru: В этом разделе описывается установка встроенных RPM пакетов на дистрибутив SUSE Linux. Мы протестировали все SLES и OpenSUSE релизы, доступные на данный момент. Перед началом установки перейдите по адресу <ulink url="http://www.otrs.com/downloads"> <citetitle>http://www.otrs.com/downloads</citetitle> </ulink> и убедитесь нет ли новых OTRS RPM пакетов, доступных для скачивания. Всегда старайтесь использовать только самые новые RPM пакеты.
sw: Hiki kifungu kinaelezea usakinishaji wa kifurushi chetu cha RPM katika seva ya SUSE Linux. Tumeijaribisha katika matoleo yote ya hivi karibuni ya SLES na openSUSE. Kabla hujaanza usakinishaji, tafadhali tembelea <ulink url="http://www.otrs.com/downloads"> <citetitle>http://www.otrs.com/downloads</citetitle> </ulink> na hakikisha unatumia kifurushi cha hivi karibuni cha OTRS RPM kinachopatikana.

source: Preparing the database for OTRS
ja: OTRS用データベースの準備
ru: Подготовка базы данных для OTRS
sw: Kuandaa hifadhidata kwa ajili ya OTRS

source: You can use OTRS using different database back-ends: <application>MySQL</application>, <application>PostgreSQL</application>, <application>Oracle</application> or <application>Microsoft SQL Server</application>. The most popular database to deploy OTRS on is MySQL. This chapter shows the steps you need to take to configure MySQL on a SUSE-based server. Of course you can install the database on a dedicated database server if needed for scalability or other purposes.
ja: 異なるデータベース・バックエンドを使用して、OTRSを使用することができます:<application>MySQL</application>、<application>PostgreSQL</application>、<application>オラクル</application>あるいは<application>Microsoft SQL Server</application>。OTRS上に展開させる最もポピュラーなデータベースはMySQLです。本章は、SUSEベースのサーバ上のMySQLを形成するために取る必要のあるステップを示します。もちろん、もし拡張性あるいは他の目的で必要ならば、データベースを専用データベース・サーバにインストールすることができます。
ru: В качестве базы данных, можно использовать <application>MySQL</application>, <application>PostgreSQL</application>, <application>Oracle</application> or <application>Microsoft SQL Server</application>. Наиболее распостраненной СУБД для использования с OTRS является MySQL. Эта глава описывает шаги необходимые для настройки MySQL на сервер с ОС SUSE. Конечно, вы можете установить СУБД на выделенных сервер баз данных, если это необходимо для масштабируемости или других целей.
sw: Unaweza kutumia OTRS katika mazingira ya nyuma tofauti ya hifadhidata: <application>MySQL</application>, <application>PostgreSQL</application>, <application>Oracle</application> au <application>Microsoft SQL Server</application>. Hifadhi data maarufu sana ya kuweka OTRS ni MySQL. Hii sura inaonyesha hatua unazotakiwa kuchukua kusanidi MySQL katika seva inayojikita kwenye SUSE. Bila shaka unaweza kusakinisha hifadhidata kwenye seva ya hifadhidata iliyojitolea kama ikihitajika kwa ajili ya mabadiliko kufanyika kiurahisi na sababu nyingine.

source: If you follow this chapter on openSUSE 12.3 and up you'll actually not install <application>MySQL</application> but <application>MariaDB</application> instead, a MySQL compatible fork of the MySQL code. This is no problem, it will work just as well (and even a little better at some points).
ja: openSUSE 12.3以上に関する本章に従って、実際に<application>MySQL</application>ではなく<application>MariaDB</application>（MySQLコードのMySQL互換フォーク）を代わりにインストールする場合。これは問題ではありません。かえって都合がよく作動するでしょう。(しかもいくつかの点で多少より良いです)
ru: Если вы следуете описанному в этой главе на openSUSE 12.3 и еще не установили <application>MySQL</application> но вместо нее можно установить <application>MariaDB</application> , известный форк/ветку MySQL. Проблем не будет, все будет работать нормально (даже немного лучше в некоторых аспектах).
sw: Kama ukifwatat sura hii katika openSUSE 12.3 na kuendelea hutaweza kusakinisha <application>MySQL</application> lakini <application>MariaDB</application> badala yake, uma wa MySQL tangamanifu wakanuni za MySQL. Hili sio tatizo, itafanya kazi vizuri tuu (na hata vizuri zaidi wakati mwingine).

source: Install MySQL by executing the following command as root:
ja: rootとして次のコマンドを実行しMySQLをインストールします：
ru: Установите MySQL с использованием следующей команды с правами пользователя root:
sw: Sakinisha MySQL kwa kutekeleza amri ifuatayo kama mzizi:

source: This will install MySQL with the default options on your system. You'll need to change the defaults in order to make it suitable for OTRS. With a text editor open the file <filename>/etc/my.cnf</filename> and change the line with <command>max_allowed_packet</command> on it, and add a line below, like this:
ja: デフォルト・オプションが付属したMySQLをシステムにインストールします。それをOTRSに適するようにデフォルトを変更する必要があるでしょう。テキストエディターで、ファイル<filename>/etc/my.cnf</filename>を開き、コマンド<command>max_allowed_packet</command>で行を変更し、以下のように一行追加しまう:
ru: Будет установлена MySQL со стандартными настройками. Необходимо сделать некоторые изменения, для лучшей совместимости с OTRS. С помощью текстового редактора откройте файл <filename>/etc/my.cnf</filename> и измените строку с <command>max_allowed_packet</command> в нем, а также добавьте строку ниже следующим образом:
sw: Hii itasakinisha MySQL na machaguo-msingi kwenye mfumo wako. Utahitaji kubadili machaguo-msingi ili kufanya iwe kwa ajili ya OTRS yako. Kwa kutumia kihariri nakala fungua faili <filename>/etc/my.cnf</filename> na badili mstari wenye <command>max_allowed_packet</command> ndani yake, na ongeza mstari hapa chini, kama hivi:

source: Now execute <command>rcmysql restart</command> to re-start the database server and activate these changes. Then run <command>/usr/bin/mysql_secure_installation</command> and follow the on-screen instructions to set a database root password, remove anonymous access and remove the test database. Lastly, run <command>chkconfig -a mysql</command> in order to make sure mysql is automatically started at server startup time.
ja: まず、データベース・サーバを再起動し、かつこれらの変更を活性化するために<command>rcmysql restart</command>を実行します。次に、<command>/usr/bin/mysql_secure_installation</command>を実行して、データベースrootパスワードをセットし、匿名のアクセスを削除し、テスト・データベースを削除し、スクリーン上の指示に従ってください。最後に、mysqlがサーバ起動時に自動的に開始されることを確かめるために<command>chkconfig -a mysql</command>を実行してください。
ru: Теперь выполните <command>rcmysql restart</command> для рестарта сервера баз данных и включения сделанных изменений. Затем выполните <command>/usr/bin/mysql_secure_installation</command> и следуйте инструкцим на экране для установки пароля для пользователя root СУБД, удаления анонимного доступа и удаления тестовой базы данных. Наконец, исполните <command>chkconfig -a mysql</command> для проверки настройки автоматического запуска mysql одновременно со стартом сервера.
sw: Sasa tekeleza <command>rcmysql restart</command> kuanzisha upya seva ya hifadhi data na kuamilisha mabadiliko haya. Kisha anzisha <command>/usr/bin/mysql_secure_installation</command> na fuata maelekezo ya kwenye skrini kuseti nywila mzizi ya hifadhidata, ondoa ufikivu bila jina na ondoa hifadhidata ya majaribio. Mwisho, anzisha <command>chkconfig -a mysql</command> ili kuhakikisha mysql inaanzishwa kiotomatiki muda seva inapoanza.

source: Installing OTRS
ja: OTRSのインストール
ru: Установка OTRS
sw: Kusakinisha OTRS

source: Install OTRS with via the command line using <command>zypper</command>. This will also pull in some dependencies such as the apache web server and some Perl modules. Make sure you copied the OTRS RPM file to the current directory.
ja: コマンド<command>zypper</command>を使用するコマンドラインでOTRSをインストールします。これはApacheのウェブサーバおよびいくつかのパール・モジュールのようないくつかの依存性も誘起します。カレント・ディレクトリにOTRS RPMのファイルをコピーしたことを確かめてください。
ru: Установите OTRS с использованием <command>zypper</command> из командной строки. При этом будут выполнены связанные задачи, такие как установка веб-сервера Apache и ряд модулей Perl. Убедитесь, что OTRS RPM файл скопирован в текущий каталог.
sw: Sakinisha OTRS kupitia tungo amri kwa kutumia <command>zypper</command>. Hii pia itavuta utegemezi kama seva ya wavuti ya apache na baadhi ya moduli za Perl. Hakikisha umenakili faili la OTRS RPM kwenda kwenye mpangilio orodha wa sasa.

source: <emphasis>Script: Command to install OTRS.</emphasis>
ja: <emphasis>図：OTRSをインストールするコマンド</emphasis>
ru: <emphasis>Сценарий: Команда для установки OTRS.</emphasis>
sw: <emphasis>Hati: Amri ya kusakinisha OTRS.</emphasis>

source: The OTRS installation is done. Start your web server to load the OTRS specific changes in its configuration, as shown in the script below. Also run <command>chkconfig</command> to make sure OTRS is automatically started when the server reboots.
ja: OTRS設置は完了しました。以下のスクリプト中で示されるように、その構成中のOTRS特有の変更をロードするためにウェブサーバを開始してください。さらにサーバのリブート時OTRSが自動的に開始されることを確認するために<command>chkconfig</command>を実行してください。
ru: Установка OTRS завершена. Чтобы новые изменения, касающиеся конфигурации OTRS, вступили в силу - перезагрузите веб-сервер используя команду из Сценария приведенного ниже. Также выполните <command>chkconfig</command> для уверенности в том, что OTRS автоматически стартует при перезагрузке сервера.
sw: Usakinishaji wa OTRS umekamilika. Anzisha seva yako ya wavuti kupakia mabadiliko maalumu ya OTRS katika usanidi wake, kama ilivyoonyeshwa kwenye hati chini. Pia anzisha <command>chkconfig</command> kuhakikisha OTRS inaanzishwa kiotomatiki seva inapojiwasha upya.

source: <emphasis>Script: Starting the web server.</emphasis>
ja: <emphasis>スクリプト：ウェブサーバの開始</emphasis>
ru: <emphasis>Скрипт: Запуск веб сервера.</emphasis>
sw: <emphasis>Hati: Kuanzisha seva ya wavuti.</emphasis>

source: Installation of additional perl modules
ja: 追加perlモジュールのインストレーション
ru: Установка дополнительных perl модулей
sw: Kusakinisha moduli za perl za ziada.
