Repository: DSigmund/doc-admin
Catalog: i18n/doc-admin.*.po
Languages: ja, ru, sw

source: Max decides to restructure his support system, and adds two new queues. So now three queues are being used. New messages arriving at the ticket system are stored into the old queue titled "raw". Of the two new queues, one titled "video recorder" is exclusively for video recorder requests, while the other one titled "dvd recorder" is exclusively for dvd recorder requests.
ja: マックスは、サポート・システムを再構成することを決定し、2つの新しいキューを追加します。したがって、これで3つのキューが使用されていることになります。チケットシステムに到着する新しいメッセージは、古いキュー「未対応(raw)」へ格納されます。2つの新しいキューのうち、1つ「ビデオテープレコーダー」はもっぱらビデオテープレコーダーのリクエスト用、もう一方の「dvdレコーダー」はもっぱらdvdレコーダーのリクエスト用です。
ru: Однажды Максим принимает решение немного оптимизировать структуру системы поддержки и добавляет две новых очереди. Таким образом в системе используется уже три очереди. Новые заявки, только поступившие в систему хранятся в очереди "raw". Две новые очереди: одна для хранения заявок касающихся видеомагнитофонов и другая - для dvd-магнитофонов.
sw: Max anaamua kuunda upya mfumo wake wa usaidizi, na kuongeza foleni mpya mbili. Kwa hiyo sasa foleni tatu zinatumika. Ujumbe mpya unaoingia katika mfumo wa tiketi unahifadhiwa kwenye foleni ya zamani iitwayo "mbichi". Kati ya foleni mpya mbili,moja inaitwa "rekoda ya video" ni kwa ajili ya maombi ya rekoda za video tu, wakati nyingine "rekoda ya dvd" ni kwa ajili ya maombi ya rekoda za dvd tu.

source: Max asks Sandra to watch the "raw" queue and sort (dispatch) the messages either into "video recorder" or "dvd recorder" queue, depending on the customer request. John only has access to the "video recorder" queue, while Joe can only answer tickets in the "dvd recorder" queue. Max is able to edit tickets in all queues.
ja: マックスはサンドラに未対応キューを注視し、顧客の要求に応じてメッセージを「ビデオレコーダ」キューまたは「dvdレコーダ」キューにソート（送る）します。
ru: Максим просит Сандру просматривать очередь "raw" и сортировать (распределять) емейлы либо в очередь "видеомагнитофоны" или в "dvd-магнитофоны", в зависимости от того, что запросил клиент. Джон имеет доступ только к очереди "видеомагнитофоны", а Джо может отвечать на заявки из очереди "dvd-магнитофоны". Максим имеет возможность редактировать заявки, находящиеся во всех очередях.
sw: Max anamuomba Sandra kuangalia foleni "mbichi" na kupanga (kupeleka) ujumbe aidha kwenda kwenye foleni ya "rekoda za video" au "rekoda za dvd", kutegemeana na maombi ya mteja. John ana ufikivu kwa foleni ya "rekoda za video" tu, wakati Joe anaweza kujibu tiketi katika foleni ya "rekoda ya dvd" tu. Max anaweza kuhariri tiketi katika foleni zote.

source: OTRS supports access management for users, groups, and roles, and it is easy to setup queues that are accessible only to some user accounts. Max could also use another way to get his requests into the different queues, with filter rules. Otherwise, if two different mail addresses are used, Sandra only has to dispatch those emails into the two other queues, which can't be dispatched automatically.
ja: OTRSは、ユーザ、グループおよび役割のためのアクセス管理をサポートします。いくつかのユーザアカウントにのみアクセス可能なキューを設定することも簡単です。マックスは、さらにフィルタ・ルールで、リクエストを異なるキューに入れる別の方法を使用することができました。そうでなければ、2つの異なるメールアドレスが使用される場合、サンドラは単に自動的に送信できない2つの他のキューへそれらの電子メールを送信しなければなりません。
ru: OTRS поддерживает управление доступом для пользователей, групп и ролей, таким образом можно очень легко настроить очереди, которые доступны только для некторых учетных записей. Чтобы все запросы приходили в различные очереди, Максим может использовать правила фильтрации. Иначе, если используются два различных email-адреса, Сандра будет сортировать и направлять в другие очереди только те заявки, которые не были отсортированы автоматически.
sw: OTRS ina msaada kwa usimamizi wa ufikivu kwa watumiaji, makundi, na majukumu, na ni rahisi kuseti foleni ambazo zinaweza kufikiwa na baadhi ya akaunti za watumiaji. Max angeweza pia kutumia njia nyingine kufikisha maombi yake kwenye foleni tofauti, kwa sheria za kuchuja. Vinginevyo, kama anwani mbili tofauti za barua pepe zimetumika, Sandra anaweza kutuma zile barua pepe kwenye foleni nyingine mbili, ambazo haziwezi kutumwa kiotomatiki.

source: Sorting your incoming messages into different queues helps you to keep the support system structured and tidy. Because your agents are arranged into different groups with different access rights on queues, the system can be optimized even further. Queues can be used to define work flow processes or to create the structure of a company. Max could implement, for example, another queue called "sales", which could contain the sub queues "requests", "offers", "orders", "billing", etc. Such a queue structure could help Max to optimize his order transactions.
ja: 異なるキューへの受信メッセージをソートすることは、サポート・システムを組み立てて、かつ整然としていておくのを助けます。担当者はキュー上の異なるアクセス権を持つ異なるグループへ配置されるので、システムはさらに最適化することができます。キューは、ワークフロー・プロセスを定義するかあるいは会社の構造を作るために使用することができます。マックスは例えば、「要求、オファー、注文、請求」等を含む「販売」と呼ばれる別のキューを実行することができました。マックスにとってそのようなキュー構造は、注文処理を最適化するのを助けることができました。
ru: Сортировка входящих сообщений в различные очереди позволяет сохранять систему поддержки в структурированном и аккуратном виде. Поскольку ваши агенты находятся в разных группах и имеют различные права для доступа к очередям, система может быть оптимизирована еще больше. Очереди могут быть использованы для определения структуры всей компании а также для определения рабочего потока процессов. Максим может к примеру создать еще одну очередь и назвать ее "продажи", которая будет содержать подочереди "запросы", "предложения", "заказы", "оплаты" и т.д. Такой подход поможет Максиму структурировать и оптимизировать процесс работы с транзакциями.
sw: Kupanga ujumbe wako unaoingia kwenye foleni tofauti inakusaidia kufanya mfumo wa msaada kuwa msafi na wenye mpangilio. Kwa sababu mawakalawako wamepangwa katika makundi tofauti wakiwa na haki tofauti za ufikivu kwenye tiketi, mfumo unaweza kusadifishwa zaidi. Foleni zinaweza kutumika kufafanua michakato ya mtiririko wa kazi au kutengeneza muundo a kampuni. Max anaweza kutengeneza kwa mfano, foleni nyingine iitwayo "mauzo", ambayo inaweza kuwa na foleni ndogo "maombi", "ofa","oda", "bili", na kadh. Muundo kama huu wa foleni unaweza kumsaidia Max kusadifisha mpangilio wa miamala yake.

source: Improved system structures, such as through the proper design of queues, can lead to significant time and cost savings. Queues can help to optimize the processes in your company.
ja: キューの適切なデザインを通してのような改善されたシステム構造により、重要な時間および原価の削減につなげることができます。キューは、会社の中のプロセスを最適化するのを支援することができる。
ru: Чем лучше структурированна система поддержки, тем меньше времени требуется для различных задач. Это приводит к уменьшению рабочего времени, соответственно и к уменьшению денежных затрат. Очереди могут помочь оптимизировать бизнес-процесы вашей компании.
sw: Muundo wa mfumo ulioboreshwa, kama kupitia usanifu mzuri wa foleni, inaweza kupelekea kuokowa muda na pesa nyingi. Foleni zinasaidia kusadifisha michakato kwenye kampuni yako.

source: What is the queue overview?
ja: キュー概要とは何か？
ru: Что такое просмотр очередей?
sw: Nini maana ya mapitio ya foleni?

source: The queue overview offers a view of all queues in which tickets are present, and for which the user has RW permissions.
ja: キュー概要は（チケットが表示され、読み書き権限を持つユーザに対する）全てのキューの一覧を提供します。
ru: Просмотр очередей дает возможность видеть все очереди, в которых есть заявки, и в которых агент имеет права RW.
sw: Mapitio ya foleni yanatoa muonekano wa foleni zote ambamo tiketi zipo, na ambamo mtumiaji ana haki za kusoma na kuandika.

source: Queue View (Default) for Agents
ja: 担当者用キュー・ビュー（デフォルト）
ru: Обзор очередей (по умолчанию) для агентов
sw: Muonekano wa Foleni kwa Mawakala (Chaguo-msingi)

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="index.pl - screenshot" scale="40" fileref="screenshots/agent-queue-view.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="index.pl - スクリーンショット" scale="40" fileref="screenshots/agent-queue-view.png"></graphic>
sw: <placeholder type="screeninfo" id="0"/> <graphic srccredit="Dashboard settings" scale="40" fileref="screenshots/edit-settings.png"></graphic>

source: The queue overview offers a variaty of options for daily work with OTRS. The first of theese is the My Queue. In the Agent Preferences, or when administering agents, a set of queuse can be defined for which the agent has been assigned to work within. All the tickets will appear in this default view, when accessing the Ticket -> Queue View menu.
ja: キュー概要は、OTRSの日常業務に対して様々なオプションを提供します。まずはじめに、マイキューです。担当者選択（選好）であるいは担当者を管理する場合、内部で作業するために指定された担当者のためにキューのセットは定義可能です。Ticket -> Queue View メニューにアクセスする時、すべてのチケットがこのデフォルト・ビューに表示されます。
ru: Обзор очередей предлагает различные возможности для повседневной работы в OTRS. Первая из них это "Мои очереди". В личных настройках агента или при администрировании агентов может быть задан перечень очередей, которые предназначены агенту для работы. Все заявки этих очередей будут появляться по умолчанию при переходе к Заявки -> Обзор очередей в меню.
sw: Mapitio ya foleni yanatoa machaguo mbali mbali kwa kazi za kila siku na OTRS. Ya kwanza ni Foleni Yangu. Kwenye Mapendeleo ya Wakala, au wakati wa usimamizi wa mawakala, seti ya foleni zinaweza kufafanuliwa ambazo wakala anafanya kazi ndani yake. Tiketi zote zitatokea katika huu muonekano wa kawaida, wakati wakufikia Tiketi -> Foleni Ona Menyu.

source: The second option offered by the Queue View is a drill down navigation into individual queues and sub-queues containing tickets to be worked upon.
ja: キュー・ビューによって提供される２番目のオプションは、個別のキューと作業すべきチケット含むサブ・キューにドリルダウンするナビゲーションです。
ru: Другой возможностью предлагаемой в Обзоре очередей является навигация по отдельным очередям и подочередям через их раскрытие/drill down с которыми надо работать.
sw: Chaguo la pili linalotolewa na Muonekano wa Foleni ni kuchimba hini uabiri kwenda kwenye foleni binafsi na foleni ndogo zenye tiketi za kufanyiwa kazi.

source: In both of the view types, the user also has the added ability to see either all unlocked tickets (this is the default filter), or the user can then chooose to view all available tickets. Tickets must be in one of the viewable state types to be shown in the queue view. Per default, these are 'open, new, pending reminder, pending auto'.
ja: 両方のビュータイプでユーザはさらに追加の能力を持ちます。全てのアンロック・チケット、あるいは利用可能なチケットを見ることを選択できます。チケットは、キュー・ビューで見える可視状態タイプの一つでなければなりません。デフォルトでは「対応中、新規、保留、リマインダ、保留-自動」があります。
ru: В обоих типах просмотра пользователь имеет дополнительную возможность смотреть либо только разблокированные заявки (фильтр по умолчанию), либо можно выбрать показ всех доступных заявок. Заявки должны быть в одном из доступных для просмотра состоянии. По умолчанию это 'open, new, pending reminder, pending auto'.
sw: Katika aina zote mbili za muonekano, mtumiaji pia ana uwezo ulioongezwa wa kuona aidha tiketi zote zilizofunguliwa (hiki ni kichujio chaguo-msingi), au mtumiaji anaweza kuchagua kuona tiketi zote zinazopatikana. Tiketi lazima ziwe katika moja ya hali zinazo onekana ili kuonyeshwa katika muonekano wa foleni. Kwa chaguo-msingi hizi ni 'wazi, mpya, kikumbusho kinachosubiri, inayosubiri kiotomatiki'.

source: There are visual alarms, to aid the user.
ja: ユーザ補助のための視覚アラームがあります。
ru: Для помощи пользователю имеются визуальные оповещения.
sw: Kuna kengele zinazoonekana, kumsaidia mtumiaji.

source: Agent Queue View visual alarms.
ja: 担当者キュー・ビュー視覚アラーム
ru: Визуальные предупреждения для обзора очередей.
sw: Wakala Foleni Ona kengele zinazoonekana.

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="index.pl - screenshot" scale="40" fileref="screenshots/agent-queue-overview-visual-alarms.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="index.pl - スクリーンショット" scale="40" fileref="screenshots/agent-queue-overview-visual-alarms.png"></graphic>

source: Visual Alarms
ja: 視覚アラーム
ru: Визуальные Оповещения
sw: Kengele Zinazoonekana

source: Highlight Age 1: Sets the age in minutes (first level) for highlighting queues that contain untouched tickets. Seen in above in the "Raw" queue.
ja: ハイライト 時間 1 : 未対応のチケットを含んでいるハイライトされたキューに対して、数分(第1のレベル)の時間をセットします。「未対応」キューの中で上部に表示されます。
ru: Highlight Age 1: Устанавливает возраст в минутах (первый уровень) для подсветки очередей, содержащих непросмотренные заявки. Смотрите выше для очереди "Raw".
sw: Angaza Umri 1: Inaseti umri katika dakika (ngazi ya kwanza) kwa ajili ya kuangaza foleni zenye tiketi ambazo hazijaguswa. Imeonekana juu kwenye foleni "Mbichi" .

source: Highlight Age 2: Sets the age in minutes (second level) for highlighting queues that contain untouched tickets. Seen in above in the "Postmaster" queue.
ja: ハイライト 時間 2 : 未対応のチケットを含んでいるハイライトされたキューに対して、数分(第2のレベル)の時間をセットします。「ポストマスター」キューの中で上部に表示されます。
ru: Highlight Age 2: Устанавливает возраст в минутах (второй уровень) для подсветки очередей, содержащих непросмотренные заявки. Смотрите выше для очереди "Postmaster".
sw: Angaza Umri 2: Inaseti umri katika dakika (ngazi ya pili) kwa ajili ya kuangaza foleni zenye tiketi ambazo hazijaguswa. Imeonekana juu katika foleni ya "Mkuu wa posta".

source: Blink: Activates a blinking mechanism of the queue that contains the oldest ticket. Not supported in all browsers. In that case it will appear red, as seen in above in the "Junk" queue.
ja: 点滅 : 最も古いチケットを含んでいるキューの明滅するメカニズムを活性化します。すべてのブラウザでサポートされているわけではありません。その場合「ジャンク」キューの上部に赤色で見えます。
ru: Blink: Включает механизм мерцания для очереди содержащей наиболее старые заявки. Поддерживается не всеми браузерами. В данном случае они выглядят красными, как это видно для очереди "Junk".
sw: Konyeza: Ina amilisha utaratibu wa kukonyeza wa foleni ambayo ina tiketi ya zamani kuzidi zote. Haina msaada kwa vivinjari vyote. Kwa hali hii itaonekana nyekundu, kama inavyoonekana juu katika foneni "Taka".

source: Bold: The current queue will be bolded, as seen above in the "My Queues".
ja: 太字：現在のキューは「マイキュー」の上部に太字で見えます。
ru: Bold: Текущая очередь будет выделена жирным шрифтом, как это видно для "Мои очереди/My Queues".
sw: Kwa herufi nzito: Foleni ya sasa itakuwa na herufi nzito, kama inavyoonekana juu kwenye "Foleni Zangu".

source: User preferences
ja: ユーザ選択（選好）
ru: Пользовательские настройки
sw: Mapendeleo ya Mtumiaji

source: OTRS users such as customers, agents and the OTRS administrator can configure their account preferences as per their needs. Agent can access the configuration screen by clicking on their login name at the top right corner of the web interface (see Figure below), and customers must click on the "Preferences" link (see Figure below).
ja: OTRSユーザ（顧客、担当者、OTRS管理者としての）は、必要に応じて自身のアカウントの選択（選好）を構成できます。担当者はウェブインターフェイスの上部右隅にあるログイン名をクリックして構成画面にアクセスできます。顧客は「選択（選好）」リンクをクリックしなければなりません（下図参照）。
ru: Пользователи OTRS, такие как: клиенты, агенты и OTRS-администраторы могут настроить свои учетные записи в соответствии с их потребностями. Агенты могут открыть страницу с настройками аккаунта кликнув ссылку с именем пользователя, которая находится в верхнем правом углу веб-интерфейса (см. Рисунок ниже), а клиенты должны нажать ссылку "Предпочтения" (см. Рисунок ниже).
sw: Watumiaji wa OTRS kama wateja, mawakala na msimamizi wa OTRS wanaweza kusanidi mapendeleo ya akaunti zao kwa mahitaji yao. Wakala anaweza kufikia skrini ya usanidi kwa kubofya kwenye majina yao ya kuingia kwenye mfumo katika kona ya juu ya kulia ya kiolesura cha wavuti (ona Kielelezo chini), na wateja lazima wabofye kwenye kiungo cha "Mapendeleo" (ona Kielelezo chini).

source: Account Preference screen for Agents
ja: 担当者用アカウント選択（選好）画面
ru: Страница "Настройки Аккаунта" для Агентов
sw: Skrini ya Mapendeleo ya Akaunti kwa ajili ya Mawakala.

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="index.pl - screenshot" scale="40" fileref="screenshots/agent-preferences.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="index.pl - スクリーンショット" scale="40" fileref="screenshots/agent-preferences.png"></graphic>

source: <emphasis>Figure: Agent's personal preferences.</emphasis>
ja: <emphasis>図：担当者の個人選択（選好）</emphasis>
ru: <emphasis>Рисунок: Личные предпочтения Агентов.</emphasis>
sw: <emphasis>Kielelezo: Mapendeleo binafsi ya wakala</emphasis>

source: An agent can configure 3 different categories of preferences: user profile, email settings, and other settings. The default posibilities are:
ja: 担当者は選択（選好）から３つの異なるカテゴリーを構成できます。ユーザプロファイル、Eメール設定及びその他設定です。デフォルトの可能性は：
ru: Агент может менять 3 различных категории настроек: профиль пользователя, настройки электронной почты и другие параметры. Возможности по умолчанию:
sw: Wakala anaweza kusanidi kategori 3 za mapendeleo: umbo wa mtumiaji, mipanhgilio ya barua pepe, na mipangilio mingine. Vinavyowezekana kwa kawaida ni:

source: User Profile
ja: ユーザ・プロファイル
ru: Профиль пользователя
sw: Umbo wa Mtumiaji

source: Change the current password.
ja: 現在のパスワードを変更
ru: Изменение текущего пароля.
sw: Badili nywila ya sasa.

source: Adjust the interface language.
ja: インターフェイス言語を変更
ru: Выбор языка интерфейса.
sw: Rekebisha lugha ya kiolesura.

source: Switch the frontend skin.
ja: フロントエンド・スキンを変更
ru: Переключение между темами интерфейса.
sw: Badili gamba la mazingira ya mbele.

source: Shift the frontend theme.
ja: フロントエンド・テーマを変更
ru: Изменение темы веб-интерфейса.
sw: Hamisha mandhari ya mazingira ya mbele.

source: Activate and configure the out-of-office time.
ja: 業務外時間を活性化し構成
ru: Активация и настройка функции "время вне оффиса".
sw: Amilisha na kusanidi muda wa nje ya ofisi.

source: Email Settings
ja: Eメール設定
ru: Настройки электронной почты
sw: Mipangilio ya barua pepe

source: Select events that trigger email notifications to the agent.
ja: 担当者へEメール通知をきっかけとするイベントを選択
ru: Выберите события, при наступлении которых, система должна отсылать уведомления агентам на их емейлы.
sw: Chagua matukio yanayochochea taarifa kupitia barua pepe kwenda kwa wakala

source: Select the queues you want to monitor in "My Queues".
ja: 「マイキュー」でモニターしたいキューを選択
ru: В меню "Мои Очереди" выберите те очедеди, которые хотите отслеживать более внимательно.
sw: Chagua foleni unazotaka kufuatilia katika "Foleni Zangu".

source: Set the refresh period for the queue view.
ja: キュー・ビュー用更新期間を設定

source: Set the screen to be displayed after a ticket is created.
ja: チケット作成後表示する画面を設定
ru: Выберите страницу, которая должна отображатся после создания заявки.
sw: Seti skrini ya kuonyeshwa baada ya tiketi kutengenezwa.

source: Account preferences screen for customers
ja: 顧客用アカウント選択（選好）画面
ru: Личные настройки пользовательского аккаунта клиентов.
sw: Skrini y amapendeleo ya akaunti kwa ajili ya wateja

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="customer.pl - screenshot" scale="40" fileref="screenshots/customer-preferences.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="customer.pl - スクリーンショット" scale="40" fileref="screenshots/customer-preferences.png"></graphic>

source: <emphasis>Figure: Customer's personal preferences.</emphasis>
ja: <emphasis>図：顧客の個人選択（選好）</emphasis>
ru: <emphasis>Рисунок: Личные предпочтения Клиента.</emphasis>
sw: <emphasis>Kielelezo: Mapendeleo binafsi ya mteja.</emphasis>

source: A customer can select the web interface language, set the refresh interval for the ticket overview, and choose the maximum amount of shown tickets. It is also possible to set a new password.
ja: 顧客はウェブ・インターフェース言語を選択し、チケット概要用の更新間隔をセットし、表示するチケット最大数を選択できます。また新しいパスワードをセットすることも可能です。
ru: Клиент может выбрать язык веб-интерфейса системы, изменять время обновления страницы в шаблоне просмотра очередей, выбирать максимальное количество отображаемых заявок. Кроме этого также можно установить новый пароль.
sw: Mteja anaweza kuchagua lugha ya kiolesura cha tovuti, kuseti muda wa kuonesha upya mapitio ya tiketi, na kuchagua kikomo cha idadi ya tiketi zinazoonyeshwa. Pia inawezekana kuseti nywila mpya.

source: Credits
ja: 敬意と賞賛

source: OTRS is an open source project, and we would like to thank many people for their help and support. The following list is surely incomplete, and we apologize for that! Just drop us a note if you are not on this list.
ja: OTRSは、オープンソース・プロジェクトです。多くの方々の援助やサポートに感謝します。次の挙げる人名リストは不完全に違いないことをお詫びします。もしこのリストにお名前がないようでしたらお知らせ下さい。

source: The following persons have especially pushed the project or are still active supporters:
ja: 以下の方々は特にプロジェクトを推進してくれ現在もなおアクティブなサポーターです。

source: Robert Kehl, who created the Win32-installer for the 1.x releases. Thanks a lot, Robert!
ja: Robert Kehl（以下敬称略）は、Win32-installer for the 1.x releasesを作成してくれました。Robertに感謝！

source: Torsten Werner, who maintains the Debian-installer for OTRS. Thanks a lot, Torsten, by making OTRS also available for the Debian community.
ja: Torsten Wernerは、Debian-installer for OTRSをメンテナンスしてくれています。OTRSをDebianコミュニティでも利用できるようにしてくれてありがとう、Torsten！

source: Nils Jeppe (mirror Hamburg, Germany), Bryan Fullerton (mirror Toronto, Canada), Eberhard Mönkeberg (mirror Göttingen, Germany), Timo Dreger (mirror Düsseldorf, Germany) and Netmonic (mirror Vienna, Austria), who are mirroring our FTP server. Thanks a lot, with your help it is always possible to download OTRS quickly!
ja: Nils Jeppe (mirror Hamburg, Germany), Bryan Fullerton (mirror Toronto, Canada), Eberhard Mönkeberg (mirror Göttingen, Germany), Timo Dreger (mirror Düsseldorf, Germany) and Netmonic (mirror Vienna, Austria)は、FTPサーバのミラーリングをしています。常にOTRSを即座にダウンロードできるように支援してくれてありがとう！

source: Anja Schneider, who is helping with the translation of this manual and with the correction and revision of the German texts. Many thanks for your help and patience, Anja!
ja: Anja Schneiderはマニュアルの翻訳、ドイツ語テキストの訂正や改訂を支援してくれています。Anja、あなたの支援と忍耐に感謝します！

source: We receive many ideas via the OTRS mailing lists for system improvements, patches or bugfixes. Great support for all users is always available there. Thanks a lot to all people on the mailing lists for your active assistance!
ja: 私達はOTRSのシステム改善、パッチあるいはバグフィックス用のメーリングリストから多くのアイデアを頂いています。そこでは常に全てのユーザが素晴らしいサポートを享受できます。メーリングリストご利用の全ての方々の活発なご支援に深く感謝します。

source: Also we would like to extend a big thank you to the following persons:
ja: また次の方々にも深く感謝します。

source: Upgrading the OTRS Framework
ja: OTRSフレームワークのアップグレード

source: These instructions are for people upgrading OTRS from version <emphasis>3.2</emphasis> to <emphasis>3.3</emphasis>, and apply both for RPM and source code (tarball) upgrades.
ja: これらは、OTRSをバージョン<emphasis>3.2</emphasis>から<emphasis>3.3</emphasis>へアップグレードする方々のための指示書です。RPMとソースコード（tarball)アップグレードの両方に適用されます。

source: Please note that OTRS 3.3 requires at least perl version 5.10.0. Make sure before you plan your upgrade that your server runs this version. You can check the version with the command <command>perl -v</command> on the command line.The only known Linux distribution that uses perl 5.8 and is still supported by its vendor is Red Hat Enterprise Linux (RHEL) 5 and its community supported derivative CentOS 5. If you're on any of these platforms and you plan to upgrade to OTRS 3.3 you should also plan migrating your operating system to a version with a supported perl, such as RHEL 6 or CentOS 6.
ja: OTRS 3.3は少なくともperlバージョン5.10.0を必要とすることに注意してください。このバージョンを稼働するサーバアップグレードする計画する前にご確認ください。コマンドラインからコマンド<command>perl -v</command>でバージョンをチェックすることができます。perl 5.8を使用し、まだベンダーにサポートされている既知のLinuxディストリビューションは、ed Hat Enterprise Linux (RHEL) 5です。また、そのコミュニティーは派生的なCentOS 5をサポートしました。これらのプラットフォームのうちのどの上にもいて、OTRS 3.3にアップグレードすることを計画すれば、さらに、RHEL 6あるいはCentOS 6のような支援されたperlを備えたバージョンへのオペレーティング・システムを移動させて計画するべきです。

source: If you are running a lower version of OTRS you have to follow the upgrade path to 3.1 first (1.1->1.2->1.3->2.0->2.1->2.2->2.3->2.4->3.0->3.1->3.2->3.3 ...)! You need to perform a full upgrade to every version in between, including database changes and the upgrading perl script.
ja: OTRSの旧バージョンをご利用の場合は、まず3.1までアップグレード順に従わなければなりません。 (1.1-&gt;1.2-&gt;1.3-&gt; 2.0-&gt; 2.1-&gt; 2.2-&gt; 2.3-&gt; 2.4-&gt; 3.0-&gt; 3.1-&gt; 3.2-&gt; 3.3 ...)!データベース変更およびperlスクリプトのアップグレードを含めて、すべてのバージョンへの十分なアップグレードを実行する必要があります。
