Repository: DSigmund/doc-admin
Catalog: i18n/doc-admin.*.po
Languages: ja, ru, sw

source: 'QueueID' specifies the internal ID of the target queue.
ja: 「QueueID」は、対象のキューの内部IDを指定します。
ru: "QueueID" задает внутренний ID для очереди для перемещения.
sw: 'Kitambulisho cha Foleni' inaweka bayana kitambulisho cha ndani cha foleni lengwa.

source: Changes the responsible of a process ticket. Example:
ja: プロセス・チケットの責任者を変更します。
ru: Изменяет владельца процессной заявки. Пример:
sw: Inabadilisha tiketi ya mchakato inayohusika. Mfano:

source: 'Responsible' specifies the login name of the new responsible.
ja: 「Responsible」は、新しい責任者のログイン名を指定します。
ru: "Responsible" задает логин нового ответственного.
sw: 'Mhusika' inaweka bayana jina la kuingia la mhusika mpya.

source: 'ResponsibleID' specifies the internal ID of the new responsible.
ja: 「ResponsibleID」は新しい責任者の内部IDを指定します。
ru: "ResponsibleID" задает внутренний ID нового ответственного.
sw: 'Kitambulisho cha Mhusika' inaweka bayana kitambulisho cha ndani cha mhusika mpya.

source: Assigns a service to a process ticket. The ticket requires to have a customer and the service must be assigned to that customer. Example:
ja: プロセス・チケットにサービスを割り当てます。チケットは顧客を持つことを要求します。そしてそのサービスは、顧客に割り当てなければいけません。例:
ru: Назначает сервис процессной заявке. Заявка должна иметь клиента и сервис должен быть назначен этому клиенту. Пример:
sw: Inagawia huduma kwa tiketi ya mchakato. Tiketi inahitaji kuwa na mteja na huduma lazima iwe imegawiwa kwa huyo mteja. Mfano:

source: 'Service' defines the new service of the process ticket. The full name is required (e.g. GramdFatherService::FatherService::SonService ).
ja: 「Service」は、プロセス・チケットの新しいサービスを定義します。姓名は必要です(例えばGramdFatherService::FatherService::SonService)。
ru: "Service" задает новый сервис для процессной заявки. Требуется задать полное имя сервиса (например, GrandFatherService::FatherService::SonService ).
sw: 'Huduma' inafafanua huduma mpya ya tiketi ya mchakato. Jina kamili linahitajika (mf. HudumaBabu::HudumaBaba::HudumaMtoto ).

source: 'ServiceID' defines the internal ID of the new service.
ja: 「ServiceID」は、新しいサービスの内部IDを定義します。
ru: "ServiceID" задает внутренний ID нового сервиса.
sw: 'Kitambulisho cha Huduma' inafafanua kitambulisho cha ndani cha huduma mpya.

source: Assigns a service level agreement to a process ticket. The ticket requires to have a service and the SLA must be assigned to that service. Example:
ja: プロセス・チケットにサービスレベル合意を割り当てます。チケットはサービスを持つために要求します。また、SLAはそのサービスに割り当てられなければいけません。例:
ru: Задает SLA для процессной заявки. Заявке должен быть уже назначен сервис и SLA должен быть привязан к этому сервису. Пример:
sw: Inagawia makubaliano ya ngazi ya huduma kwa tiketi ya mchakato. Tiketi inahitaji kuwa na huduma na SLA lazima igawiwe kwa hiyo huduma. Mfano:

source: 'SLA' defines the new service level agreement of the process ticket.
ja: 「SLA」は、プロセス・チケットの新しいサービスレベル合意を定義します。
ru: "SLA" задает новое соглашение об уровне сервиса для процессной заявки.
sw: 'SLA' inafafanua makubaliano ya ngazi ya huduma mpya ya mchakato wa tiketi.

source: 'SLAID' defines the internal ID of the new SLA.
ja: 「SLAID」は、新しいSLAの内部IDを定義します。
ru: "SLAID" задает внутренний ID новогоSLA.
sw: 'Kitambulisho cha SLA' inafafanua kitambulisho cha ndani cha SLA mpya.

source: Changes the state of a process ticket. Example:
ja: プロセス・チケットの状態を変更します。
ru: Изменяет состояние процессной заявки. Пример:
sw: Inabadilisha hali ya mchakato wa tiketi. Mfano:

source: 'State' defines the new state of the process ticket.
ja: 「State」は、プロセス・チケットの新しい状態を定義します。
ru: "State" задает новое состояние процессной заявки.
sw: 'Hali' inafafanua hali mpya ya tiketi ya mchakato.

source: 'StateID' defines the internal ID of the new state.
ja: 「StateID」は、新しい状態の内部IDを定義します。
ru: "StateID" задает внутренний ID нового состояния.
sw: 'Kitanbulisho cha Hali' inafafanua kitambulisho cha ndani cha hali mpya.

source: 'PendingTimeDiff' used only for pending type states, defines the time difference in seconds relative (relative to the Transition Action execution time) to set ticket pending time (e.g. 3600 means that the pending time is 1hr after the Transition Action is executed).
ja: Typeの状態が保留の時のみ使用する「PendingTimeDiff」は、チケットのの保留時間を設定するために（例えば保留時間3600は、推移アクションの実行後、一時間を意味します）、秒単位での時差（推移アクション実行時間に関連して）を定義します。
ru: "PendingTimeDiff" используется только для состояний с ожиданием, задает относительную разность в секундах (относительно заданного времени выполнения Действия Перехода) для установки времени ожидания для заявки (например, 3600 означает что устанавливается ожидание в 1 час после заданного времени выполнения Действия Перехода).
sw: 'MudaKusubiriTofauti' inatumika kwa ajili ya aina za hali za kusubiri tu, inafafanua utofauti wa muda katika sekunde yenye uhusiano (yenye uhusiano na muda wa utekelezaji wa Kitendo cha Mpito) na muda wa kusubiri wa tiketi uliosetiwa (mf. 3600 inamaanisha muda wa kusubiri ni lisaa 1 baada ya Kitendo cha Mpito kutekelezwa).

source: Sets the ticket title of a process ticket. Example:
ja: プロセス・チケットのチケット・タイトルをセットします。例:
ru: Задает Тему процессной заявки. Пример:
sw: Inaseti kichwa cha habari cha tiketi ya mchakato. Mfano:

source: 'Title' specifies the new title of the ticket.
ja: 「Title」は、チケットの新しいタイトルを指定します。
ru: "Title" задает новую тему заявки.
sw: "Kichwa cha Habari" kinaweka bayana kichwa cha habari kipya cha tiketi.

source: Sets the ticket type of a process ticket. Example:
ja: チケット・タイプのプロセス・チケットをセットします。例:
ru: Задает Тип процессной заявки. Пример:
sw: Inaseti aina ya tiketi ya mchakato. Mfano:

source: 'Type' specifies the name of the ticket type.
ja: 「Type」は、チケット・タイプの名前を指定します。
ru: "Type"/"Тип" - задает название типа заявки.
sw: 'Aina' inaweka bayana jina la aina ya tiketi.

source: 'TypeID' specifies the internal ID of the ticket type.
ja: 「TypeID」は、チケット・タイプの内部IDを指定します。
ru: "TypeID" задает внутренний ID для типа заявки.
sw: 'Kitambulisho cha Aina' inaweka bayana kitambulisho cha ndani cha aina ya tiketi.

source: Access Control Lists (ACLs)
ja: アクセス・コントロール・リスト(ACL)
ru: Списки Контроля Доступа (ACLs)
sw: Orodha Dhibiti Sikivu

source: With the help of ACLs, you can limit selectable values in process tickets. Please also see the <link linkend="acl-reference">ACL reference</link> for a description of the full ticket ACL syntax.
ja: ACLの支援によって、プロセス・チケット中の選択可能な値を制限することができます。チケットACLシンタックスの詳細記述については、さらに<link linkend="acl-reference">ACLリファレンス</link>を参照ください。
ru: С помощью ACL, вы можете ограничить выбор значений в процессной заявке. Смотрите также <link linkend="acl-reference">ACL reference</link> для обзора полного синтаксиса ACL для заявок.
sw: Kwa usaidizi kutoka ACLs, unaweza kuweka kikomo cha vitu vya kuchaguliwa kwenye tiketi za mchakato. Tafadhali ona pia <link linkend="acl-reference">rejea ya ACL</link> kwa maelezo kamili ya sintaksi ya ACL.

source: ACL configuration
ja: ACL構成
ru: Настройка ACL
sw: Usanidi wa ACL

source: ACLs can only be defined in <filename>Kernel/Config.pm</filename>. Example:
ja: ACLは単に<filename>Kernel/Config.pm</filename>に定義することができます。例:
ru: ACL могут быть заданы только в <filename>Kernel/Config.pm</filename>. /Правильнее с помощью редактора ACL в SysConfig/. Пример:
sw: ACL zinaweza kufafanuliwa kwenye <filename>Kernel/Config.pm</filename> tu. Mfano:

source: Name of the ACL rule. For further information on ACL rules in general, please consult <link linkend="acl">the ACL manual</link>.
ja: ACL規則の名前。ACL規則一般についてのさらに詳しい情報については、<link linkend="acl">ACLマニュアル</link>を調べてください:
ru: Имя правила ACL. Для более полной информации обратитесь к <link linkend="acl">the ACL manual</link>.
sw: Jina la sheria ya ACL. Kwa maelezo zaidi kuhusu sheria za ACL kwa ujumla, tafadhali nenda <link linkend="acl">mwongozo wa ACL</link>.

source: This is the section that is used to check if an ACL must be applied. If it has the specified values, the rule is applied. The following values can be used:
ja: これはACLが適用されなければいけないかどうかをチェックするために使用されるセクションです。それが指定された値を持っている場合、規則が適用されます。次の値は使用することができます:
ru: Эта секция предназначена для проверки может ли правило ACL быть применено. Если параметр имеет заданное значение, правило применяется. Могут быть использованы следующие значения:
sw: Hii sehemu inatumika lulagua kama ACL laizma itumike. Kama ina thamani zilizowekwa bayana, sheria itatumika. Thamani zifuatazo zinaweza kutumika:

source: The ID of a process that the process. Matches if the ticket is assigned to this process.
ja: プロセスのID、プロセス。チケットがこのプロセスに割り当てられる場合マッチします。
ru: ID процесса для текущего процесса. Совпадает, если заявка назначена этому процессу.
sw: Kitambulisho cha mchakato ambacho mchakato. Unafanania kama tiketi ikigawiwa kwa huu mchakato.

source: The ID of the Activity that the process ticket currently is assigned to.
ja: プロセス・チケットが現在割り当てられるアクティビティのID。
ru: ID Активности, которой назначена процессная заявка в текущий момент.
sw: Kitambulisho cha Shughuli ambayo tiketi ya mchakato imegawiwa kwa sasa.

source: The ID of the Activity Dialog that is currently open for a process ticket.
ja: プロセス・チケットには現在開いているアクティビティ・ダイアログのID。
ru: ID Диалога Активности открытого в настоящий момент для процессной заявки.
sw: Kitambulisho cha Maongezi ya Shughuli ambayo yako wazi kwa tiketi ya mchakato kwa sasa.

source: Possible/PossibleNot Activity Dialog
ja: 「可能」(Possible)/ 「不可能」(PossibleNot) アクティビティ・ダイアログ
ru: Possible/PossibleNot Activity Dialog/Диалог Активности
sw: Ynayowezekana/Yasiyowezekana Maongezi ya Shughuli

source: Here you can specify a list of Activity Dialog IDs. This list will limit the possible Activity Dialogs that are offered to the user in the ticket zoom mask.
ja: ここでは、アクティビティ・ダイアログIDのリストを指定することができます。このリストは、チケット・ズーム・マスク中のユーザに提示される可能なアクティビティ・ダイアログを制限するでしょう。
ru: Здесь вы можете задать список ID'ов Диалогов Активности. Этот список ограничивает Диалоги Активности, которые могут быть предложены пользователю при просмотре заявки.
sw: Hapa unaweza kuweka bayana orodha ya Vitambulisho vya Maongezi ya Shughuli. Hii orodha itaweka ukomo wa Maongezi ya Shughuli ambayo yanaweza kugawiwa kwa mtumijai katika barakoa ya kuza tiketi.

source: 'Possible' lists the Activity Dialogs that are allowed. The setting above will only allow 'AD1' and 'AD3' of the list of configured Activity Dialogs.
ja: 「Possible（可能）」は、許可されるアクティビティ・ダイアログをリストします。上記のセッティングは、設定されたアクティビティ・ダイアログのリストの「AD1」および「AD3」のみを許可するでしょう。
ru: "Possible" показывает список допустимых Диалогов Активности. Установка выше, допускает только 'AD1' и 'AD3' из списка заданных Диалогов Активности.
sw: 'Inawezekana' inaorodhesha Maongezi ya Shughuli ambayo yanaruhusiwa. Mpangilio hapo juu utaruhusu 'AD1' na 'AD3' tu kati ya orodha ya Maongezi ya Shughuli yaliyosanidiwa.

source: 'PossibleNot' lists the Activity Dialogs that are not allowed. In the example above, the setting will remove 'AD3' from the list of configured Activity Dialogs.
ja: 「PossibleNot（不可能）」は、許可されないアクティビティ・ダイアログをリストします。上記の例において、セッティングは設定されたアクティビティ・ダイアログのリストから「AD3」を取り除くでしょう。
ru: 'PossibleNot' отображает список недозволенных Диалогов Активности. В примере выше, настройка удаляет 'AD3' из списка заданных Диалогов Активности.
sw: 'InawezekanaHapana' inaorodhesha Maongezi ya Shughuli ambayo hayaruhusiwi. Katika mfano hapo juu, mpangilio utaondoa 'AD3' kutoka kwenye orodha ya Maongezi ya Shughuli yaliyosanidiwa.

source: If both 'Possible' and 'PossibleNot' are specified, the list of configured Activity Dialogs will first be filtered by 'Possible', leaving only 'AD1' and 'AD3' in our example. Then 'PossibleNot' will be applied and filter out 'AD3', so that only 'AD1' remains and is shown as a possible Activity Dialog that the user can use.
ja: 「可能」と「不可能」の両方が指定されれば、設定されたアクティビティ・ダイアログのリストはまず「可能」でフィルタされます。サンプルではAD1とAD3のみそのまま残してあります。つぎに「不可能」が適用されます。「AD3」はフィルタで除外され、それゆえに「AD1」のみが残り、ユーザが使える可能なアクティビティ・ダイアログとして表示されます。
ru: Если оба 'Possible' и 'PossibleNot' заданы, список заданных Диалогов Активности сначала фильтруется используя 'Possible', оставляя 'AD1' и 'AD3' в нашем примере. Затем применяется фильтр 'PossibleNot', который удаляет 'AD3', оставляя таким образом только 'AD1', как доступный пользователю для использования Диалог Активности.
sw: Kama zote 'Inawezekana' na 'InawezekanaHapana' zimewekwa bayana, orodha ya Maongezi ya Shughuli yatachujwa kwanza na 'Inawezekana', na kuacha 'AD1' na 'AD3' tu katika mfano wetu. Kisha 'InawezekanaHapana' itafanyika na kuchuja 'AD3', ili 'AD1' pekee ibaki na inaonyeshwa kama Maongezi ya Shughuli yanayowezekana ambayo mtumiaji anaweza kutumia.

source: If multiple ACL rules match, the intersection of all matching rules will be calculated to determine the possible Activity Dialogs. Example:
ja: 複数のACL規則がマッチすればしたら、すべてのマッチング規則の共通部分は可能なアクティビティ・ダイアログを決定するために計算されます。例:
ru: Если множество правил ACL удовлетворяются, их пересечение будет вычислено для определения доступных Диалогов Активности. Пример:
sw: Kama sheria zaidi ya moja za ACL zimefanana, muunganiko wa sheria zote zinazofanana utatafutwa kutengeneza Maongezi ya Shughuli yanayowezekana. Mfano:

source: Configured Activity Dialogs: 'AD1', 'AD2', 'AD3', 'AD4', 'AD5', 'AD6', 'AD7'. <placeholder type="screen" id="0"/>
ja: 設定されたアクティビティ・ダイアログ:「AD1」、「AD2」、「AD3」、「AD4」、「AD5」、「AD6」、「AD7」<placeholder type="screen" id="0"/>
ru: Заданные Диалоги Активности: 'AD1', 'AD2', 'AD3', 'AD4', 'AD5', 'AD6', 'AD7'. <placeholder type="screen" id="0"/>
sw: Maongezi ya Shughuli Yaliyosanidiwa: 'AD1', 'AD2', 'AD3', 'AD4', 'AD5', 'AD6', 'AD7'. <placeholder type="screen" id="0"/>

source: If a process ticket has the state 'new', is in the 'Raw' queue and has a priority '3 normal', then all three ACL rules will match.
ja: プロセス・チケットが状態「new」を持ち、それが「未対応」キューにあり優先度「3 普通」を持つならば、その後、すべてのACL規則がマッチします。
ru: Если заявка имеет состояние 'new', находится в очереди 'Raw' и имеет приоритет '3 normal', то все три правила ACL будут удовлетворяться.
sw: Kama tiketi ya mchakato ina hali 'mpya', iko kwenye foleni 'Mbichi' na ina kipaumbele '3 kawaida', basi sheria zote tatu za ACL zitafanana nayo.

source: The first rule reduces the Activity Dialogs from 'AD1', 'AD2', 'AD3', 'AD4', 'AD5', 'AD6', 'AD7' to 'AD1', 'AD2', 'AD3', 'AD6', 'AD7' and forbids 'AD4' and 'AD5'.
ja: 第一のルールはアクティビティ・ダイアログを 'AD1', 'AD2', 'AD3', 'AD4', 'AD5', 'AD6', 'AD7'から'AD1', 'AD2', 'AD3', 'AD6', 'AD7' に減らし、'AD4' and 'AD5'を禁止します。
ru: Первое правило сокращает список Диалогов Активности с 'AD1', 'AD2', 'AD3', 'AD4', 'AD5', 'AD6', 'AD7' до 'AD1', 'AD2', 'AD3', 'AD6', 'AD7' и запрещает 'AD4' and 'AD5'.
sw: Sheria ya kwanza inapunguza Maongezi ya Shughuli kutoka 'AD1', 'AD2', 'AD3', 'AD4', 'AD5', 'AD6', 'AD7' to 'AD1', 'AD2', 'AD3', 'AD6', 'AD7' na inakataza 'AD4' na 'AD5'.

source: The second rule will now further reduce the remaining Activity Dialogs. In our example, 'AD2', 'AD3', 'AD7' will remain.
ja: 第二のルールはさらに残っているアクティビティ・ダイアログを減らし、ここでの例の'AD2','AD3', 'AD7'が残ります。。
ru: Второе правило еще сокращает список оставшихся Диалогов Активности. В нашем примере, остаются 'AD2', 'AD3', 'AD7'.
sw: Sheria ya pili itapunguza zaidi Maongezi ya Shughuli yaliyobaki. Katika mfano wetu, 'AD2', 'AD3', 'AD7' zitabaki.

source: Now the third rule will further reduce the list by 'PossibleNot'. 'AD3' is removed from the list. 'AD4' is not removed, since it was not on the list in the first place. At the end, 'AD2' and 'AD7' remain as possible Activity Dialogs that the user can utilize.
ja: 3番目の規則は、さらに「不可能」によってリストを縮小するでしょう。「AD3」はリストから取り除かれます。それがリストの第一位に載っていなかったので、「AD4」は削除されません。最後に、「AD2」および「AD7」は、ユーザが利用することができる可能なアクティビティ・ダイアログとして残ります。
ru: Третье правило еще более сокращает список с помощью 'PossibleNot'. 'AD3' удаляется из списка. 'AD4' не будет удален, т.к. он не на первом месте в списке. И, наконец, 'AD2' и 'AD7' останутся, как доступные для выбора пользователем Диалоги Активности.
sw: Sasa sheria ya tatu itapunguza zaidi orodha kwa 'InawezekanaHapana'. 'AD3' inaondolewa kutoka kwenye orodha. 'AD4' haiondolewi, kwa kuwa haikuwa kwenye orodha tangu mwanzo. Mwishoni, 'AD2' na 'AD7' zitabaki kama Maongezi ya Shughuli yanayowezekana ambayo mtumiaji anaweza kutumia.

source: It is also possible to limit the processes that can be displayed in the "New process ticket" screen, the functionality is similar to limiting the ActivityDialogs with one exception: The ACLs could only be based on Users.
ja: 「新規プロセス・チケット」画面で表示可能なプロセスを限定することは可能です。その機能は、ACLは単にユーザに基づくことができるという唯一の例外をもってActivitiyDialogs（アクティビティ・ダイアログ）を限定することに似ています。
ru: Также, можно ограничить список Процессов, которые будут отображаться на экране "Новая процессная заявка", способ аналогичен ограничению списка Диалогов Активности, за одним исключением: ACL должны базироваться на данных пользователя. Т.е. список привязывается к пользователю, создающему заявку.
sw: Pia inawezekana kuweka ukomo wa michakato ambayo inaweza kuonyeshwa katika skrini ya "Tiketi mpya ya mchakato", hii sifa ni sawa na kuweka ukomo wa MaongeziYaShughuli kwa ubaguzi mmoja: ACL zinaweza kujikita kwa watumiaji tu.

source: See examples below:
ja: 以下のサンプルを御覧ください。
ru: Смотрите примеры ниже:
sw: Ona mifano chini:

source: Localization of the OTRS frontend
ja: OTRSフロント・エンドのローカライゼーション
ru: Локализация интерфейса OTRS
sw: Ujanibishaji wa mazingira ya mbele ya OTRS

source: OTRS offers multi-language support for its web interface.
ja: OTRSはそのウェブ・インターフェースのために多重言語サポートを提供します。
ru: OTRS предлагает многоязычную поддержку для своего веб-интерфейса.
sw: OTRS inatoa msaada kwa lugha nyingi kutoka kwenye kiolesura chake cha wavuti

source: Procedures for localization for the OTRS framework, steps to be followed to create a new language translation, as well as procedures for translation customizations, can be found in the <ulink url="http://otrs.github.io/doc/manual/developer/3.3/en/html/contributing.html#translate">"Language Translations"</ulink> chapter from the developer manual on <ulink url="http://otrs.github.io/doc">http://otrs.github.io/doc</ulink>.
ja: OTRSフレームワーク用ローカライゼーションのための手続き、新しい言語変換を作成するために続くステップ、と同様に、翻訳カスタマイズのための手続き、開発者マニュアル<ulink url="http://otrs.github.io/doc">http://otrs.github.io/doc</ulink> の <ulink url="http://otrs.github.io/doc/manual/developer/3.3/en/html/contributing.html#translate">"Language Translations（言語変換）"</ulink>章で見つけることができます。
ru: Информацию о том, как локализировать OTRS-фреймворк, какие шаги нужно выполнить чтобы создать перевод для нового языка, или как можно создать настройки для перевода можете найти, перейдя по ссылке <ulink url="http://otrs.github.io/doc/manual/developer/3.3/en/html/contributing.html#translate">"Локализация"</ulink>раздел в руководстве разработчика на <ulink url="http://otrs.github.io/doc">http://otrs.github.io/doc</ulink>.
sw: Utaratibu wa ujanibishaji kwa ajili ya kiunzi cha OTRS, hatua za kufwatwa kutengeneza lugha mpya ya tafsiri, na pia taratibu za kugeuza kukufaa tafsiri, zinaweza kupatikana kwenye <ulink url="http://otrs.github.io/doc/manual/developer/3.3/en/html/contributing.html#translate">"Tafsiri za Lugha"</ulink> sura ya kwenye mwongozo wa muundaji <ulink url="http://otrs.github.io/doc">http://otrs.github.io/doc</ulink>.

source: Creating your own themes
ja: 自分のテーマの作成
ru: Создание своих собственных тем (шаблонов)
sw: Kutengeneza mandhari yako

source: You can create your own themes so as to use the layout you like in the OTRS web frontend. To create own themes, you should customize the output templates to your needs.
ja: OTRSウェブ・フロント・エンドの中で好きなレイアウトを使用するように自分のテーマを作成することができます。自分のテーマを作成するために、必要に応じた出力テンプレートをカスタマイズできます。
ru: Для OTRS можно создавать свои собственные темы и использовать в качестве веб-интерфейса тот шаблон, который вам нравится больше всего. Для создания собственной темы нужно настроить шаблоны вывода под свои нужды.
sw: Unaweza kutengeneza mandhari yako mwenyewe ili kutumia muonekano unaoupenda katika mazingira ya mbele ya tovuti ya OTRS. Kutengeneza mandhari yako, unatakiwa kugeuza matokeo ya violeza kwa mahitaji yako.

source: More information on the syntax and structure of output templates can be found in the Developer Manual at <ulink url="http://otrs.github.io/doc"><citetitle>http://otrs.github.io/doc</citetitle></ulink>, especialy in the chapter on <ulink url="http://otrs.github.io/doc/manual/developer/3.3/en/html/TemplatingMechanism.html"><citetitle>templates</citetitle></ulink>.
ja: 出力テンプレートのシンタックスおよび構造についてはディベロッパー・マニュアル<ulink url="http://otrs.github.io/doc"><citetitle>http://otrs.github.io/doc</citetitle></ulink>でより多くの情報をご覧いただけます。（特に<ulink url="http://otrs.github.io/doc/manual/developer/3.3/en/html/TemplatingMechanism.html"><citetitle>テンプレート</citetitle></ulink>についての章の中で）
ru: Более подробную информацию о синтаксисе и структуре шаблонов вывода можно найти в Руководстве Разработчика по ссылке <ulink url="http://otrs.github.io/doc"><citetitle>http://otrs.github.io/doc</citetitle></ulink>, особенно в разделе <ulink url="http://otrs.github.io/doc/manual/developer/3.3/en/html/TemplatingMechanism.html"><citetitle>Шаблоны</citetitle></ulink>.
sw: Taarifa zaidi kuhusu sintaksi na muundo wa violezo vinavyotoka zinapatikana katika Mwongozo wa Msanifu <ulink url="http://otrs.github.io/doc"><citetitle>http://otrs.github.io/doc</citetitle></ulink>, hasa katika sura inayohusu <ulink url="http://otrs.github.io/doc/manual/developer/3.3/en/html/TemplatingMechanism.html"><citetitle>violezo</citetitle></ulink>.

source: As an example, perform the following steps to create a new theme called "Company":
ja: 例として、「Company」と呼ばれる新しいテーマを作成する次のステップを行なってください:
ru: В качестве примера, выполните следующие шаги для создания новой темы, которая называется "Компания":
sw: Kama mfano, fuata hatua zifuatazo kutengeneza mandhari mapya yanayoitwa "Kampuni":

source: Create a directory called <filename>Kernel/Output/HTML/Company</filename> and copy all files that you like to change, from <filename>Kernel/Output/HTML/Standard</filename> into the new folder.
ja: <filename>Kernel/Output/HTML/Company</filename> と呼ばれるディレクトリーを作成して <filename>Kernel/Output/HTML/Standard</filename> から 新規フォルダへあなたが変えたいと思う全てのファイルをコピーします。
ru: Создайте директорию и назовите ее <filename>Kernel/Output/HTML/Company</filename> и скопируйте все файлы, которые хотите изменить, из <filename>Kernel/Output/HTML/Standard</filename> в новую директорию.
sw: Tengeneza mpangilio orodha uitwao <filename>Kernel/Output/HTML/Company</filename> na nakili mafaili yote ambayo ungependa kubadilisha, kutoka <filename>Kernel/Output/HTML/Standard</filename> kwenda kwenye kabrasha jipya.

source: Only copy over the files you actually change. OTRS will automatically get the missing files from the Standard theme. This will make upgrading at a later stage much easier.
ja: 実際に変更するファイルを上書きコピーしてください。OTRSは、自動的にスタンダード・テーマから見当たらないファイルを得るでしょう。これは後半の段階でアップグレードすることをより簡単にするでしょう。
ru: Копируйте только те файлы, которые вы действительно планируете изменять. OTRS автоматически получит недостающие файлы из Стандартной темы. На более позних этапах такой подход позволит сделать модернизацию более простой.
sw: Nakili mafaili yale tu utakayobadilisha. OTRS itapata kiotomatiki mafaili yasiyokuwepo kutoka kwenye maudhui ya Kawaida. Hii itafanya uboreshaji katika ngazi ya baadaye rahisi zaidi.

source: Customize the files in the directory <filename>Kernel/Output/HTML/Company</filename>, and change the layout to your needs.
ja: <filename>Kernel/Output/HTML/Company</filename> にファイルをカスタマイズします。お好きなようにレイアウトを変更します。
ru: Настройте файлы в директории <filename>Kernel/Output/HTML/Company</filename> и изментите шаблоны по своему вкусу.
sw: Geuza kukufaa mafaili kwenye mpangilio orodha <filename>Kernel/Output/HTML/Company</filename>, na badilish amuonekano kwa mahitaji yako.
