Repository: DSigmund/doc-admin
Catalog: i18n/doc-admin.*.po
Languages: ja, ru, sw

source: Activate Field1 in Ticket Overview Small Screens.
ja: チケット概要小画面の中のField1を活性化
ru: Активировать поле Field1 на странице просмотра обобщенной информации о Заявке.
sw: Amilisha Sehemu1 katika Mapitio ya Skrini Ndogo za Tiketi.

source: <emphasis>Sub-group:</emphasis> Frontend::Agent::TicketOverview
ja: <emphasis>サブグループ:</emphasis> Frontend::Agent::TicketOverview
ru: <emphasis>Подгруппа:</emphasis> Frontend::Agent::TicketOverview
sw: <emphasis>Kudni-dogo:</emphasis> Mazingira ya mbele::Wakala::TiketiMapitio

source: <emphasis>Setting:</emphasis> Ticket::Frontend::OverviewSmall###DynamicField
ja: <emphasis>設定:</emphasis> Ticket::Frontend::OverviewSmall###DynamicField
ru: <emphasis>Настройка:</emphasis> Ticket::Frontend::OverviewSmall###DynamicField
sw: <emphasis>Mpangilio:</emphasis> Tiketi::Mazingira ya mbele::MapitioMadogo###SehemuInayobadilika

source: Field1 in Ticket Overview Small Screen.
ja: チケット概要小画面中のフィールド１
ru: Field1 на странице просмотра обобщенной информации о Заявке.
sw: Sehemu1 katika Mapitio ya Skrini Ndogo za Tiketi.

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="dynamicfields - screenshot" scale="40" fileref="screenshots/dynamicfields-ticketoverviewsmall-field1.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="dynamicfields（動的フィールド） - スクリーンショット" scale="40" fileref="screenshots/dynamicfields-ticketoverviewsmall-field1.png"></graphic>

source: <emphasis>Figure: Field1 in Ticket Overview Small Screen.</emphasis>
ja: <emphasis>図:チケット概要小画面中のフィールド１</emphasis>
ru: <emphasis>Рисунок: Поле1 на экране просмотра обобщенной/small информации о Заявке.</emphasis>
sw: <emphasis>Kielelezo: Sehemu1 katika Mapitio ya Skrini Ndogo za Tiketi.</emphasis>

source: This setting affects: Escalation View, Locked View, Queue View, Responsible View, Status View and Watch View screens.
ja: このセッティングは、次のものに影響します: エスカレーションビュー、ロックされたビュー、キュービュー、信頼できるビュー、ステータスビューおよび監視ビュー画面。

source: Setting a Default Value by a Ticket Event Module
ja: チケット・イベント・モジュールによってデフォルト値を設定
ru: Установка Значения по Умолчанию с помощью модуля Ticket Event
sw: Kuweka Thamani Chaguo-msingi kwa kutumia Moduli ya Tukio la Tiketi

source: A ticket event (e.g. TicketCreate) can trigger a value set for a certain field, if the field does not have a value yet.
ja: フィールドが値をまだ持っていない場合、チケット・イベント(例えば、チケット作成)は、あるフィールド用の値セットを引き起こすことができます。
ru: Событие Заявки (например TicketCreate) может вызывать множество значений для определенного поля, если его значение еще до сих пор не установлено.
sw: Tukio la tiketi (mf. TengenezaTiketi) linaweza kuchochea thamani kusetiwa kwa sehemu fulani, kama sehemu bado haina thamani.

source: By using this method this default value, is not seen in the edit screen (e.g. New Phone Ticket) since the value is set after the creation of the ticket.
ja: この方法の使用によって、値がチケットの生成の後にセットされるので、このデフォルト値は編集画面(例えば新規電話チケット)で見られません。
ru: При использовании этого способа, это значение по умолчанию не отображается на экране (например, Новая заявка по телефону) и будет присвоено после создания заявки.
sw: Kwa kutumia njia hii thamani chaguo-msingi, haionekani katika skrini za kuhariri (mf. Simu Mpya Tiketi) kwa kuwa thamani imesetiwa baada ya utengenezaji wa tiketi.

source: To activate this feature it is necessary to enable the following setting: "Ticket::EventModulePost###TicketDynamicFieldDefault".
ja: この特徴を活性化するために、次のセッティングを可能にすることが必要です:"Ticket::EventModulePost###TicketDynamicFieldDefault".
ru: Для активации этой возможности необходимо включить параметр: "Ticket::EventModulePost###TicketDynamicFieldDefault".
sw: Kuamilisha hiki kipengele ni muhimu kuwezesha mpangilio ufwatao: "Tiketi::TukioModuliTuma###TiketiSehemuInayobadilikaChaguo-msingi".

source: Activate Field1 in TicketCreate event.
ja: チケット作成イベントのフィールド１を活性化
ru: Активировать Field1 в событии TicketCreate.
sw: Amilisha Sehemu1 katika kitendo cha TengenezaTiketi.

source: <emphasis>Sub-group:</emphasis> Core::TicketDynamicFieldDefault
ja: <emphasis>サブグループ:</emphasis> Core::TicketDynamicFieldDefault
ru: <emphasis>Подгруппа:</emphasis> Core::TicketDynamicFieldDefault
sw: <emphasis>Kundi-dogo:</emphasis> Kiini::TiketiSehemuInayobadilikaChaguo-msingi

source: <emphasis>Setting:</emphasis> Ticket::TicketDynamicFieldDefault###Element1
ja: <emphasis>設定:</emphasis> Ticket::TicketDynamicFieldDefault###Element1
ru: <emphasis>Настройка:</emphasis> Ticket::TicketDynamicFieldDefault###Element1
sw: <emphasis>Mpangilio:</emphasis> Tiketi::TiketiSehemuInayobadilikaChaguo-msingi###Elementi1

source: This configuration can be set in any of the 16 Ticket::TicketDynamicFieldDefault###Element settings.
ja: この構成は、16のTicket::TicketDynamicFieldDefault###Element セッティングのうちのどの中でもセットすることができます。
ru: Эта настройка может быть установлена в любую из 16 Ticket::TicketDynamicFieldDefault###Element.
sw: Huu usanidi unaweza kusetiwa katika moja ya tiketi 16::TiketiSehemuInayobadilikaChaguo-msingi###Mipangilio ya elementi.

source: If more that 16 fields needs to be set up a custom XML file must be places in $OTRS_HOME/Kernel/Config/files directory to extend this feature.
ja: 16フィールド以上をセットアップする必要があるなら、$OTRS_HOME/Kernel/Config/files ディレクトリにあるXMLファイルは置き換えてこの機能を拡張します。
ru: Если необходимо задать более 16 полей, пользовательский XML файл должен быть помещен в папку $OTRS_HOME/Kernel/Config/files для расширения этой возможности.
sw: Kama zaidi ya sehemu 16 zinahitajika kuaanzishwa faili la XML klililogeuzwa kukufaa lazima liwekwe kwenye mpangilio orodha $OTRS_HOME/Kernel/Config/files kuendeleza kipengele hiki.

source: Event
ja: イベント
ru: Событие
sw: Kitendo

source: TicketCreate
ja: チケット作成
sw: TengenezaTiketi

source: Value
ja: 値
ru: Значение
sw: Thamani

source: a new value
ja: 新しい値
ru: новое значение
sw: thamani mpya

source: Set a Default Value by User Preferences
ja: ユーザー選択によってデフォルト値をセット
ru: Установить значение по умолчанию для Пользовательских Настроек
sw: Seti thamani ya chaguo-msingi kwa Upendeleo wa mtumiaji

source: The dynamic field default value can be overwritten with a user defined value stored in the user preferences.
ja: 動的フィールドデフォルト値は、ユーザー選択に格納されたユーザに定義された値で上書きすることができます。
ru: Значение по умолчанию для динамического поля может быть перезаписано значением, определенным пользователем, которое хранится в пользовательских настройках.
sw: Chaguo-msingi la sehemu inayobadilika inaweza kubadilishwa na thamani ziliyofafanuliwa na mtumiaji zilizohifadhiwa kwenye mapendeleo ya mtumiaji.

source: Using this method, the default value of the field will be shown on any screen where the field is activated (if the field does not have already a different value).
ja: この方法を使用して、フィールドのデフォルト値は、フィールドが活性化されている画面に表示されます。(フィールドが異なる値をまだ持っていない場合)
ru: При использовании этого способа, значение поля по умолчанию будет показываться на всех экранах, для которых оно активировано (если оно уже не получило другого значения).
sw: Kutumia njia hii, thamani ya chaguo-msingi la hiyo sehemu litaonyeshwa kwenye skrini yoyote ambapo sehemu hiyo imeamilishwa (kama sehemu tayari haina thaamani nyingine).

source: The "sysconfig" setting "PreferencesGroups###DynamicField" located in the "Frontend::Agent::Preferences" Sub-group. This setting is an example of how to create an entry in the User Preferences screen to set an exclusive dynamic field default value for the selected user. The limitation of this setting is that it only permits the use of one dynamic field. If two or more fields will use this feature, it is necessary to create a custom XML configuration file to add more settings similar to this one.
ja: 「Sysconfig」設定は、サブグループ「Frontend::Agent::Preferences」の「PreferencesGroups###DynamicField」に存在します。この設定は、選ばれたユーザのために排他的な動的フィールドデフォルト値をセットするために、ユーザー選択画面でエントリーを作る方法の例です。この設定の制限は、単にそれが1つの動的フィールドの使用を許すということです。2つ以上のフィールドがこの特徴を使用する場合、これに似ているより多くの設定を加える、カスタムXML設定ファイルを作成することが必要です。
ru: Параметр "sysconfig" - "PreferencesGroups###DynamicField" расположен в подгруппе "Frontend::Agent::Preferences". В этом параметре задан пример того, как создать запись для экрана личных настройкек агента специального значения по умолчанию для динамичекского поля, для избранного пользователя. Этот параметр имеет ограниечение - он разрешает задать значение только для одного динамического поля. Если это требуется сделать для двух и более полей, необходимо создать собственный XML файл конфигурации для добавления дополнительных настроек, аналогичных этой.
sw: Mipangilio ya "sysconfig" ya "MapendeleoMakundi###SehemuInayobadilika" inayopatikana katika Kundi dogo la "Mazingira ya mbele::Wakala::Mapendeleo". Huu mpangilio ni mfano wa jinsi ya kutengeneza ingizo katika skrini ya Mapendeleo ya Mtumiaji kuseti thamani ya chaguo-msingi la sehemu inayobadilika pweke kwa ajili ya mtumiaji aliyechaguliwa. Kiwango cha juu cha huu mpangilio ni inaruhusu matumizi ya sehemu moja tu inayobadilika. Kama sehemu mbili au zaidi zitatumia hiki kipengele, ni muhimu kutengeneza usanidi wa faili la XML uliogeuzwa kukufaa kuongeza mipangilio zaidi inayofanana na huu.

source: Remember, if more settings are added in a new XML each setting name needs to be unique in the system and different than "PreferencesGroups###DynamicField". for example: PreferencesGroups###101-DynamicField-Field1, PreferencesGroups###102-DynamicField-Field2, PreferencesGroups###My-Field1, PreferencesGroups###My-Field2, etc.
ja: より多くのセッティングが新規XMLに追加され、各設定名がシステムの中でユニークかつ、"PreferencesGroups###DynamicField"と異なっていなければならないならば、覚えておいて下さい。例えば、PreferencesGroups###101-DynamicField-Field1, PreferencesGroups###102-DynamicField-Field2, PreferencesGroups###My-Field1, PreferencesGroups###My-Field2,等。
ru: Необходимо помнить, что если добавляются эти настройки в XML файл, каждое имя праметра должно быть уникальным в системе и отличаться от "PreferencesGroups###DynamicField". Например, PreferencesGroups###101-DynamicField-Поле1, PreferencesGroups###102-DynamicField-Поле2, PreferencesGroups###Мое-Поле1, PreferencesGroups###Мое-Поле2, и т.д..
sw: Kumbuka, kama mipangilio zaidi imeongezwa katika XML mpya kila jina la mpangilio linahitaji kuwa la kipekee kwenye mfumo na tofauti na "MapendeleoMakundi###SehemuInayobadilika". kwa mfano: MapendeleoMakundi###101-SehemuInayobadilika-Sehemu1, MapendeleoMakundi###102-SehemuInayobadilika-Sehemu2, MapendeleoMakundi###Sehemu-yangu1, MapendeleoMakundi###Sehemu-yangu2, na kadh.

source: Activate Field1 in the User preferences.
ja: ユーザー選択でのField1を活性化
ru: Активировать поле Field1 на странице Пользовательские Настройки.
sw: Amilisha Sehemu1 katika mapendeleo ya Mtumiaji.

source: <emphasis>Sub-group:</emphasis> Frontend::Agent::Preferences
ja: <emphasis>サブグループ:</emphasis> Frontend::Agent::Preferences
ru: <emphasis>Подгрупа:</emphasis> Frontend::Agent::Preferences
sw: <emphasis>Kundi-dogo:</emphasis> Mazingira ya mbele::Wakala::Mapendeleo

source: <emphasis>Setting:</emphasis> PreferencesGroups###101-DynamicField-Field1
ja: <emphasis>設定:</emphasis> PreferencesGroups###101-DynamicField-Field1
ru: <emphasis>Настройка:</emphasis> PreferencesGroups###101-DynamicField-Field1
sw: <emphasis>Mpangilio:</emphasis> MakundiMapendeleo###101-SehemuInayobadilika-Sehemu1

source: Input
ja: 入力
sw: Ingizo

source: Other Settings
ja: その他の設定
ru: Другие настройки
sw: Mipangilio mingine

source: Default value for: My Field 1
ja: My Field 1用のデフォルト値
ru: Значение по умолчанию для: My Field 1
sw: Chaguo-msingi kwa: Sehemu yangu 1

source: Field1 in User preferences screen.
ja: ユーザー選択画面中のField1
ru: Field1 экран с Пользовательскими настройками.
sw: Sehemu1 katika Skrini ya mapendeleo ya mtumiaji.

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="dynamicfields - screenshot" scale="40" fileref="screenshots/dynamicfields-userpreferences.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="dynamicfields（動的フィールド） - スクリーンショット" scale="40" fileref="screenshots/dynamicfields-userpreferences.png"></graphic>

source: <emphasis>Figure: Field1 in User preferences screen.</emphasis>
ja: <emphasis>図:ユーザー選択画面中のField1</emphasis>
ru: <emphasis>Рисунок: Field1 в окне с пользовательских настроек агентов.</emphasis>
sw: <emphasis>Kielelezo: Sehemu1 katika Skrini ya mapendeleo ya mtumiaji.</emphasis>

source: A dynamic field is a special kind of field in OTRS, created to extend the information stored on a ticket or article. These fields are not fixed in the system and they can appear only in specific screens, they can be mandatory or not, and their representation in the screens depends on the field type defined at their creation time according to the data to be held by the field. For example, there are fields to hold a text, a date, a selection of items, etc.
ja: 動的フィールドは、チケットか記事上に格納された情報を拡張するために作られて、OTRSの中の特別の種類のフィールドです。これらのフィールドはシステムに固定されません。 そして、それらは特定の画面にのみ現われる場合があります。それらが必須であれ、そうでなかれ、それらの画面上の表現はそれらの作成時間に定義されたフィールドタイプに依存します。その作成時間はフィールドによって保持されるデータよります。例えば、テキスト、日付、アイテムの選択を保持するフィールドがあります。
ru: Динамические поля - это специальный видполей в OTRS, создаваемых для раширения перечня информации, хранимой в заявке или сообщении/заметке. Эти поля не являются фиксированными в системе и они появляются иолько на определенных экранах, они могут быть обязательными или нет, и их представление на экране зависит от типа поля, заданного при их создании. Например, поля могут содержать текст, даты, набор из нескольких выбранных значений и т.д.
sw: Sehemu inayobadilika ni sehemu ya aina maalumu katika OTRS, iliyotengenezwa kupanua taarifa iliyohifadhiwa katika makala au tiketi. Hizi makala si funge kwenye mfumo na zinaweza kutokea kwenye skrini maalumu tu, zinaweza kuwa za lazima au si za lazima, na uwasilishwaji wake kwenye skrini unategemeana na aina ya sehemu iliyofafanuliwa wakati wa utengenezaji wake kulingana na data inayoshikiliwa na sehemu. Kwa mfano, kuna sehemu za kushikilia nakala, tarehe, chaguo la vitu, na kadh.

source: Dynamic fields are the evolution of TicketFreeText TicketFreeKey TicketFreeTime, ArticleFreeText and ArticleFreeKey fields that where commonly used in OTRS 3.0 and before. The limitation of these "Free Fields" was that they can be defined up to 16 (text or dropdown) fields and 6 time fields for a ticket and 3 (text or dropdown) fields for each article only, not more.
ja: 動的フィールドは、TicketFreeText TicketFreeKey TicketFreeTime、ArticleFreeTextおよびArticleFreeKeyフィールドの発展形です。それらは以前もそしてOTRS 3.0の中でも一般に使用されます。これらの「自由フィールド」には以下の制限がありました。1.) 16の(テキストまたはdropdown)フィールドまで定義可能。2.) １チケットにつき6回のフィールドまで定義可能。3.) １記事につき３フィールド(テキストまたはdropdown)まで定義可能。
ru: Динамические поля являются развитием свободных полей TicketFreeText TicketFreeKey TicketFreeTime, ArticleFreeText и ArticleFreeKey, ранее использовавшихся в OTRS 3.0 и предыдущих версиях. Ограничением этих "Свободных полей" состояло в том, что можно было задать до 16 (текстовых или выбираемых из списка) полей и 6 полей, содержащих значение времени для заявки и 3 (текстовых или выбираемых из списка) полей для каждого сообщения/заметки, не более.
sw: Sehemu zinazobadilika ni mageuko ya spishi ya sehemu TiketiHuruNakala TiketiHuruFunguo TiketiHuruMuda, MakalaHuruNakala na MakalaHuruFunguo ambazo zilkuwa zikitumiwa sana katika OTRS 3.0 na kabla. Kikomo cha hizi "Sehemu Huru" ilikuwa ni zinaweza kufafanuliwa mpaka sehemu 16 (nakala au kunjuzi) na sehemu 6 za muda kwa ajili ya tiketi na sehemu 3 (nakala au kunjuzi) kwa kila nakala tu, sio zaidi.

source: Now with dynamic fields the limitation in the number of fields per ticket or article is removed, you can create as many dynamic fields you like either for ticket or articles. And beyond that, the framework behind the dynamic fields is prepared to handle custom fields for other objects rather than just ticket and articles.
ja: 今、動的フィールドで、チケットまたは記事についてフィールドの数の中の制限は撤去される、チケットか記事のいずれかのために希望する数だけ動的フィールドとして作成することができます。また、それを越えて、動的フィールドの背後のフレームワークは、単なるチケットや記事だけはなく、他のオブジェクト用カスタム・フィールドを扱う準備ができています。
ru: Теперь, с появлением динамических полей, эти ограничения сняты, вы можете создавать любое количество динамических полей для заявок и сообщений. И, кроме того, интерфейс для управления ими, готов к расширению дальнейшего использования таких полей не только для заявок и сообщений, но и других объектов системы, например, для управления изменениями и пр.
sw: Sasa kwa kutumia sehemu zinazobadilika kikomo katika nambari ya sehemu kwa tiketi au makala kimeondolewa, unaweza kutengeneza sehemu nyingi zinazobadilika unazotaka aidha kwa tiketi au makala. Na zaidi ya hapo, kiunzi nyuma ya sehemu zinazobadilika kinaandaliwa kushughulikia sehemu zilizogeuzwa kukufaa kwa ajili ya vitu vingine kuachana na tiketi na makala tu.

source: This new framework that handles the dynamic fields is build using a modular approach, where each kind of dynamic field can be seen as a plug-in module for the framework. This means that the variety of dynamic fields can be easily extended by public OTRS modules, OTRS Feature Add-ons, OTRS custom developments, and other custom developments.
ja: 動的フィールドを扱うこの新規フレームワークは、モジュール的アプローチを使用して、構成されている。ここでの各種類の動的フィールドは、フレームワーク用のプラグインモジュールと見なすことができます。このことは、公開されているOTRSモジュール、OTRSアドオン、OTRSカスタム開発および他のカスタム開発によって容易に動的フィールドの種類を拡張することができることを意味します。
ru: Этот новый интерфейс описания и управления динамическими полями, использует модульную структуру, в которой каждый тип динамических полей может рассматриваться как дополнительный модуль для интерфейса. Это означает, что все множество динамических полей может быть просто расширено для публичных модулей OTRS, OTRS Feature Add-ons, пользовательских разработок и пр.
sw: Kiunzi hiki ambacho kinashughulikia sehemu zinazobadilika kimetengenezwa kwa kutumia mbinu ya moduli, ambapo kila aina ya sehemu inayobadilika inaweza kuonekana kama moduli ya programu-jalizi kwa ajili ya kiunzi. Hii inamaanisha aina mbali mbali ya sehemu zinazobadilika zinaweza kupanuliwa kirahisi kwa kutumia moduli za umma za OTRS, vifaa vya nyongeza vya vipengele vya OTRS, maendeleo yaliyogeuzwa kukufaa ya OTRS, na maendeleo mengine yaliyogeuzwa kukufaa.

source: The following dynamic field types are included with this release:
ja: 次の動的フィールド・タイプがこのリリースで含まれている:
ru: В этом релизе доступны следующие типы динамических полей:
sw: Aina zifuatazo za sehemu zinazobadilika zimejumuishwa kwenye toleo hili:

source: Text (one line of text)
ja: テキスト(テキストの1行のライン)
ru: Text (одна строка текста)
sw: Nakala (nakala ya mstari mmoja)

source: Textarea (multiple lines of text)
ja: テキスト領域(テキストの多数の行)
ru: Textarea (несколько строк текста)
sw: Eneo la nakala (nakala za mistari mingi)

source: Dropdown (single choice, multiple values)
ja: ドロップダウン(単一の選択、複数の値)
ru: Выпадающий список (единственный выбор, несколько значений)
sw: Kunjuzi (chaguo moja, thamani nyingi)

source: Multiselect (multiple choice, multiple values)
ja: マルチ選択(多項式選択の多数の値)
ru: Multiselect (множественный выбор, несколько значений)
sw: Uchaguzi anuwai (uchaguzi nyingi, thamani nyingi)

source: Backing up the system
ja: システムのバックアップ
ru: Резервное копирование системы
sw: Kuweka nakala za dharura ya mfumo

source: This chapter describes the backup and restore of the OTRS data.
ja: 本章はバックアップとOTRSデータのリストアについて記述します。
ru: В этой главе описывается резервное копирование и восстановление данных OTRS.
sw: Hii sura inaelezea chelezo na urejeshaji wa data za OTRS.

source: Backup
ja: バックアップ
ru: Резервное копирование
sw: Chelezo

source: There are two types of data to backup: application files (e.g. the files in <filename>/opt/otrs</filename>), and the data stored in the database.
ja: バックアップする2つのタイプのデータがあります:ひとつはアプリケーションファイル(例えば <filename>/opt/otrs</filename> の中のファイル)、もうひとつはデータベースに格納されたデータです。
ru: Есть два типа данных для резервного копирования: файлы приложения (например, файлы в <filename>/opt/otrs</filename>) и данные, хранящиеся в базе данных.
sw: Kuna aina mbili za data za kuweka kwenye chelezo: mafaili ya programu-tumizi (mf. mafaili ya kwenye <filename>/opt/otrs</filename>), na data zilizohifadhiwa kwenye hifadhidata.

source: To simplify backups, the script <filename>scripts/backup.pl</filename> is included with every OTRS installation. It can be run to backup all important data (see Script below).
ja: バックアップを単純化するために、スクリプト <filename>scripts/backup.pl</filename> はOTRSのインストレーションで含まれています。それは全てのインポートデータをバックアップするように走らせることができます。(下記のスクリプトを参照)。
ru: Для упрощения создния резервных копий, сценарий <filename>scripts/backup.pl</filename> включен в каждую инсталяцию OTRS. Он позволяет создавать резервную копию всех важных данных (см. Сценарий ниже).
sw: Kurahisisa chelezo, hati <filename>scripts/backup.pl</filename> imejumuishwa katika kila usakinishaji wa OTRS. Inaweza kuanzishwa ili kuweka chelezo la kila data muhimu (ona Hati chini).

source: <emphasis>Script: Getting help about the OTRS backup mechanism.</emphasis>
ja: <emphasis>スクリプト：OTRSバックアップメカニズムに関するヘルプ</emphasis>
ru: <emphasis>Сценарий: Получене помощи о механизме резервного копированиия OTRS.</emphasis>
sw: <emphasis>Hati: Kupata usaidizi wa utaratibu wa chelezo la OTRS.</emphasis>

source: Execute the command specified in the script below to create a backup:
ja: バックアップを作成するために以下のスクリプトで指定したコマンドを実行します：
ru: Для создания резервной копии выполните команду, приведенную в Сценарии ниже:
sw: Tekeleza amri zilizowekwa bayana kwenye hati hapo chini kutengeneza chelezo:

source: <emphasis>Script: Creating a backup.</emphasis>
ja: <emphasis>スクリプト:バックアップの作成</emphasis>
ru: <emphasis>Сценарий:Создание резервной копии.</emphasis>
sw: <emphasis>Hati: Kutengeneza chelezo.</emphasis>

source: All data was stored in the directory <filename>/backup/2010-09-07_14-28/</filename> (see Script below). Additionally, the data was saved into a .tar.gz file.
ja: 全てのデータはディレクトリ <filename>/backup/2010-09-07_14-28/</filename> に格納されます。（下図参照）それに加えてデータはa .tar.gz fileに保存されます。
ru: Все данные хранятся в директории <filename>/backup/2010-09-07_14-28/</filename> (см. Сценарий ниже). Кроме того данные сохранены в файле с расширением .tar.gz.
sw: Data zote zimehifadhiwa kwenye mpangilio orodha <filename>/chelezo/2010-09-07_14-28/</filename> (ona hati hapo chini). Kwa zaidi, data zilihifadhiwa kwenye faili la .tar.gz

source: <emphasis>Script: Checking the backup files.</emphasis>
ja: <emphasis>スクリプト:バックアップ・ファイルのチェック。</emphasis>
ru: <emphasis>Сценарий: Проверка файлов резервной копии.</emphasis>
sw: <emphasis>Hati: Kukagua mafaili ya chelezo.</emphasis>

source: Restore
ja: リストア
ru: Восстановление
sw: Rejesha

source: To restore a backup, the saved application data has to be written back into the installation directory, e.g. <filename>/opt/otrs</filename>. Also the database has to be restored.
ja: バックアップをリストアするために、保存されたアプリケーション・データはインストレーション・ディレクトリ（例えば、<filename>/opt/otrs</filename> ）に書き戻されなければいけません。さらに、データベースをリストアしなければなりません。
ru: Для восстановления резервной копии, сохраненные данные приложения должны быть записаны обратно в каталог установки, например <filename>/opt/otrs</filename>. База данных также должна быть восстановлена.
sw: Kurejesha chelezo, data zilizohifadhiwa za programu-tumizi zina andikwa upya kwenye mpangilio orodha wa usanikishaji, mf. <filename>/opt/otrs</filename>. Pia hifadhidata inabidi irejeshwe.

source: A script <filename>scripts/restore.pl</filename> (see Script below), which simplifies the restore process, is shipped with every OTRS installation. It supports MySQL and PostgreSQL.
ja: リストア・プロセスを簡素化するスクリプト <filename>scripts/restore.pl</filename> (下記のスクリプトを参照)は、OTRSの全ての出荷時に同梱され、MySQLとPostgreSQLをサポートします。
ru: Сценарий <filename>scripts/restore.pl</filename> (см. Сценарий ниже), который упрощает процесс восстановления и поставляется с каждой install-версией OTRS. Поддерживаются СУБД MySQL и PostgreSQL.
sw: Hati <filename>hati/rejesha.pl</filename> (ona hati chini), ambayo inarahisisha mchakato wa kurejesha, inasambazwa na kila usanikishaji wa OTRS. Ina usaidizi kwa MySQL na PostgreSQL.
