Repository: DSigmund/doc-admin
Catalog: i18n/doc-admin.*.po
Languages: ja, ru, sw

source: Now you should edit the file Kernel/Config.pm to provide ORACLE_HOME. The next step is to configure OTRS using the web installer, as described <link linkend="web-installer">in this section</link>.
ja: ここで、ORACLE_HOMEを提供するファイル Kernel/Config.pmを編集するべきです。次のステップは<link linkend="web-installer">このセクションで</link>記述されるように、ウェブ・インストーラを使用して、OTRSを構成することです。
ru: Теперь, надо отредактировать файл Kernel/Config.pm для установки параметра ORACLE_HOME. Следующим шагом является настройка OTRS с помощью веб - установщика, как описано в <link linkend="web-installer">в этом разделе</link>.
sw: Sasa unatakiwa kuhariri faili Kernel/Config.pm kutoa ORACLE_HOME. Hatua inayofuata ni kusanidi OTRS kwa kutumia kisakinishi cha tovuti, kama ilivyoelezewa <link linkend="web-installer">katika hiki kifungu </link>.

source: Installing OTRS on a Debian or Ubuntu system
ja: Debian または Ubuntuシステム上でのOTRSのインストール
ru: Установка OTRS на системы Debian или Ubuntu
sw: Kusakinisha OTRS kwenye mfumo wa Debian au Ubuntu

source: Please install OTRS <link linkend="manual-installation-of-otrs">from source</link>, and do not use the OTRS packages that Debian/Ubuntu provides.
ja: OTRSは<link linkend="manual-installation-of-otrs">ソースから</link>インストールして下さい。Debain/Ubuntuが提供するOTRSパッケージを使用しないで下さい。
ru: Установите OTRS <link linkend="manual-installation-of-otrs"> из исходного кода</link>, и не используйте предоставленные Debian/Ubuntu пакеты для OTRS.
sw: Tafadhali sakinisha OTRS <link linkend="manual-installation-of-otrs">kutoka kwenye chanzo</link>, na usitumie vifurushi vya OTRS ambavyo vinatolewa na Debian/Ubuntu.

source: The installation of required Perl modules is easier if you use the available packages: <placeholder type="screen" id="0"/>
ja: 利用可能なパッケージを使用すれば、必要なPerlモジュールのインストールはより容易です: <placeholder type="screen" id="0"/>
ru: Установка требуемых модулей Perl будет легче, если использовать доступные пакеты: <placeholder type="screen" id="0"/>
sw: Usakinishaji wa moduli za Perl zinazotakiwa ni rahisi zaidi kama ukitumia vifurushi vilivyopo: <placeholder type="screen" id="0"/>

source: Installing OTRS on Microsoft Windows systems
ja: Microsoft Windows システム上でのOTRSのインストール

source: Using the Windows Installer
ja: Windowsインストーラの使用

source: Installing OTRS on a Microsoft Windows system is very easy. Download the latest installer for Win32 from <ulink url="http://www.otrs.com/try/"> <citetitle>http://www.otrs.com/try/</citetitle> </ulink> and save the file to your local file system. Then simply double-click on the file to execute the installer, and follow the few installation steps to setup the system. The installation wizard will take care of installing all components for OTRS. The next step is to configure OTRS using the web installer, as described <link linkend="web-installer">in this section</link>.
ja: OTRSをMicrosoft Windowsシステムにインストールすることは非常に容易です。Win32のための最新のインストーラを<ulink url="http://www.otrs.com/try/"> <citetitle>http://www.otrs.com/try/</citetitle> </ulink>からダウンロードし、ファイルをローカルのファイルシステムへ保存します。次にダブルクリックするだけでインストーラを実行し、システムをセットアップするためにインストレーションのわずかなステップを踏みます。インストレーション・ウィザードは、OTRSのためのすべてのコンポーネントをインストールしてくれます。次のステップは<link linkend="web-installer">このセクションで</link>記述されるように、ウェブ・インストーラを使用して、OTRSを構成することです。

source: The Windows installer for OTRS contains all needed components for OTRS, i.e. the <application>Apache</application> web server, the <application>MySQL</application> database server, <application>Perl</application> (with all needed modules) and <application>cron</application> for Windows. However you can also use it to set up OTRS on the Microsoft IIS Web Server instead of on Apache. Also you can choose to not let it install the bundled MySQL, for instance if you want to deploy on a central MySQL database; a PostgreSQL database, on Microsoft SQL Server or on Oracle.
ja: OTRSのためのウィンドウズのインストーラは、OTRS(つまり<application>Apache</application>ウェブサーバ、<application>MySQL</application>データベース・サーバ、<application>Perl</application>(すべての必要とされるモジュールで)、ウィンドウズ用の<application>cron</application>）のための必要とされるすべてのコンポーネントを含んでいます。しかし、OTRSのセットアップは、Apacheの代わりにMicrosoft IISウェブサーバー上でもできます。また、例えば中枢のデータベース（MySQL、PostgreSQL、Microsoft SQL ServerあるいはOralce）上で展開したくないならば、バンドルされたMySQLをインストールさせない選択も可能です。

source: Installation of Oracle database driver on Windows
ja: Windows上でのOracleデータベースのインストレーション

source: If you install OTRS using the Windows Installer, it will automatically configure all Perl modules you will typically need. There is one exception to this: if you need to deploy OTRS on an Oracle database, you'll need to post-install the Oracle driver. This is needed because there is no open source driver for Oracle available; we are not allowed to redistribute it in the OTRS package. There are two different perls you can use on Windows; you can choose the bundled Strawberry Perl, which is the default option and is recommended for proof-of-concept setups; or you can choose Active State perl which is a separate download and install. This last option is recommended for production setups.
ja: Windowsインストーラを使用して、OTRSをインストールすれば、それは典型的に必要なすべてのPerlモジュールを自動的に構成します。1つだけ例外があります:Oracleデータベース上でOTRSを展開させる必要があれば、Oracleドライバを後からインストールする必要があります。利用可能なオラクルのためのオープン・ソース・ドライバがないので、これは必要です;私たちは、OTRSパッケージ中でそれを再分配することを認められません。Windows上で使用することができる2つの異なるperlがあります;バンドルされたStrawberry Perlを選ぶことができます。それはデフォルト・オプションで、概念実証のセットアップ用に推奨されます;あるいは、個別のダウンロードであるActive State perlを選びインストールすることができます。この後者のオプションは製品セットアップに推薦されます。

source: If you have installed ActiveState Perl it already comes with the Perl database driver <application>DBD::Oracle</application> only this should be linked to the Oracle C client. OTRS only works on 32-bit ActiveState Perl. This means you should also download the 32-bit Oracle client. Navigate to the Oracle client web site <ulink url="http://www.oracle.com/technetwork/topics/winsoft-085727.html"> <citetitle>Instant Client Downloads for Microsoft Windows (32-bit)</citetitle></ulink> and choose 'Instant Client Package - Basic'. You'll need to sign up for a free Oracle Web account in order to download the software. Extract the download, a zip file, to the root of your drive, for instance <filename>C:\instantclient_11_2</filename>.
ja: ActiveStatePerlをインストールしたら、既にPerlデータベース・ドライバ<application>DBD::Oracle</application>が付属しており、これだけはOracle Cクライアントにリンクされるべきです。OTRSは32ビットのActiveStatePerlのみで稼働します。これはさらに、32ビットのOracleクライアントをダウンロードするべきであることも意味します。Oracleクライアントのウェブサイト<ulink url="http://www.oracle.com/technetwork/topics/winsoft-085727.html"> <citetitle>Instant Client Downloads for Microsoft Windows (32-bit)</citetitle></ulink>そして、'Instant Client Package - Basic'を選択します。ソフトウェアをダウンロードするために無料のオラクル・ウェブ・アカウントにサインアップする必要があります。ドライブ(例えば<filename>C:\instantclient_11_2</filename>)のrootにzipファイルをダウンロードしてください。

source: Now you should add the client libraries to your path and set an environment variable; 'ORACLE_HOME'. Navigate to Control Panel &gt; System and Security &gt; System, choose 'Advanced System Settings', click on 'New' under 'System variables', enter 'ORACLE_HOME' as Variable Name and use 'C:\instantclient_11_2' as the Variable Value. Select the 'PATH' variable, and append the directory 'C:\instantclient_11_2' to the path. If you now start a new <application>cmd.exe</application> session and run the <application>otrs.CheckModules.pl</application> script located in the <application>OTRS</application> directory, you should see that the DBD::Oracle driver is successfully installed. After this, you should restart the system in order for the other applications to detect the new environment variables.
ja: ここで、パスにクライアント・ライブラリを追加し、環境変数'ORACLE_HOME'をセットしなければなりません。コントロールパネル&gt; システムとセキュリティ&gt; システムにナビゲーションして、「システム詳細設定」を選び、「システム変数」下の「新規」をクリックし、変数名として'ORACLE_HOME' を入力し、変数値として「C:\instantclient_11_2」を使ってください。「PATH」変数を選んでください、そして、パスにディレクトリ「C:\instantclient_11_2」を追加してください。ここで新しい<application>cmd.exe</application> セッションを開始し、<application>OTRS</application>ディレクトリにある<application>otrs.CheckModules.pl</application>スクリプトを走らせればDBD::Oracle driverがうまくインストールされたことがわかるでしょう。この後に、他のアプリケーションが新しい環境変数を検知するために、システムを再開しなければなりません。

source: Installation of DBD::Oracle on Strawberry Perl
ja: Strawberry Perl上でのDBD::Oracle のインストレーション

source: In order to compile the DBD::Oracle module, you need to have installed the components of the OTRS web installer in a path without spaces. It should NOT be in <filename>C:\Program Files\OTRS</filename> but it should rather be in <filename>C:\OTRSComponents</filename> or similar.
ja: DBD::Oracleモジュールをコンパイルするために、OTRSウェブ・インストーラのコンポーネントをスペースを含まないパスにインストールする必要があります。そのパスは<filename>C:\Program Files\OTRS</filename>ではだめで、<filename>C:\OTRSComponents</filename>の中か、あるいはそれに近いパスであるべきです。

source: On Strawberry Perl you should compile the Oracle driver manually. The OTRS Windows Installer bundles 32-bit Strawberry Perl. This means you should also download the 32-bit Oracle client. Navigate to the Oracle client web site <ulink url="http://www.oracle.com/technetwork/topics/winsoft-085727.html"> <citetitle>Instant Client Downloads for Microsoft Windows (32-bit)</citetitle></ulink> and download the packages 'Instant Client Package - Basic', 'Instant Client Package - SQL*Plus', and 'Instant Client Package - SDK'. You'll need to sign up for a free Oracle Web account in order to download the software. Extract the downloads, all zip files, to the root of your drive, for instance <filename>C:\instantclient_11_2</filename>.
ja: Strawberry Perl では、オラクル・ドライバを手動でコンパイルするべきです。OTRS Windowsインストーラは32ビットのStrawberry Perlをバンドルします。これは、32ビットのオラクル・クライアントをダウンロードするべきであることを意味します。オラクル・クライアントのウェブサイト<ulink url="http://www.oracle.com/technetwork/topics/winsoft-085727.html"> <citetitle>Instant Client Downloads for Microsoft Windows (32-bit)</citetitle></ulink>へナビゲートし、パッケージ 'Instant Client Package - Basic'、'Instant Client Package - SQL*Plus'と'Instant Client Package - SDK'といったパッケージをダウンロードします。ソフトウェアをダウンロードするために無料のオラクル・ウェブ用アカウントにサインアップする必要があります。ダウンロードした全てのzipファイルを、ドライブのroot (例えば<filename>C:\instantclient_11_2</filename>) に抽出します。

source: Now you should add the client libraries to your path and set an environment variable; 'ORACLE_HOME'. Navigate to Control Panel &gt; System and Security &gt; System, choose 'Advanced System Settings', click on 'New' under 'System variables', enter 'ORACLE_HOME' as Variable Name and use 'C:\instantclient_11_2' as the Variable Value. Select the 'PATH' variable, and append the directory 'C:\instantclient_11_2' to the path. After this, you should restart the system in order for the other applications to detect the new environment variables.
ja: ここで、クライアント・ライブラリをパスに追加し、環境変数'ORACLE_HOME'をセットするべきです。コントロール・パネル&gt; システム&gt; セキュリティ&gt;にナビゲートし、「システム詳細設定」を選び、「システム変数」下の「新規」をクリックし、変数名として'ORACLE_HOME' を入力し、変数値として「C:\instantclient_11_2」を使ってください。「PATH」変数を選択して、パスにディレクトリ「C:\instantclient_11_2」を追加してください。この後、新しい環境変数を検知するために他のアプリケーションのためにシステムを再開するべきです。

source: Now you can compile and install the DBD::Oracle module. For this, open a <application>cmd.exe</application> window, and start the cpan client. Download and extract DBD::Oracle via <command>look DBD::Oracle</command>, then type <command>perl Makefile.PL</command>, <command>dmake</command> and <command>dmake install</command>. Sample output is below.
ja: ここで、DBD::Oracleモジュールをコンパイルしインストールすることができます。これについては、<application>cmd.exe</application>ウィンドウを開けて、cpanクライアントを開始してください。<command>look DBD::Oracle</command>経由でをDBD::Oracleダウンロードし抽出すします。その後<command>perl Makefile.PL</command>, <command>dmake</command> と <command>dmake install</command>をタイプします。サンプル出力は以下にあります。

source: Configure OTRS using the Web Installer
ja: ウェブインターフェイスを使用したOTRSの構成

source: Upgrading Windows Installer
ja: Windowsインストーラのアップグレード

source: If you installed OTRS on Windows, it is possible to upgrade seamlessly by downloading the new Windows Installer and running it. The installer will automatically detect the OTRS installation and perform an upgrade on it. The installer will stop the OTRS services and start them after the installation is complete, so your users will experience downtime. Make sure you plan some time for the upgrade. Always make sure you have a backup of your server before you start the upgrade procedure!
ja: OTRSをWindowsにインストールしたならば、新しいWindowsインストーラのダウンロードしそれの実行することでシームレスにアップグレードすることが可能です。インストーラは自動的にOTRSのインストレーションを検知し、その上でアップグレードを行ないます。インストーラはOTRSサービスを停止しインストレーションが完了後、それらを開始します。そのためユーザにダウンタイムが発生するでしょう。必ずいつかアップグレードの計画を立ててださい。アップグレード手続きを始める前に必ず常にサーバのバックアップを保持していることを確認ください!

source: Performing patch level upgrades on Windows
ja: Windows上でパッチ・レベルのアップグレードを実施します。

source: If you need to install a 'patch level' upgrade (i.e. from OTRS 3.3.1 to OTRS 3.3.2) on Windows all you need to do is to download and run the new installer. Of course you should make sure you have a backup in place before you start the upgrade!
ja: Windows にパッチ・レベル・アップグレード(つまりOTRS 3.3.1からOTRS 3.3.2まで)をインストールする必要があれば、新規インストーラーをダウンロードし実行するだけです。もちろん、アップグレードを開始する前に必ずバックアップを保持していることを確認して下さい!

source: Performing minor level upgrades on Windows
ja: Windows上でのマイナー・レベルのアップグレードの実施

source: Minor upgrades (from OTRS 3.2 to OTRS 3.3) take a little more time as there is also a database upgrade step involved. The installer will detect this and will automatically perform the upgrade for you. After installation you should still perform steps 12, 13 and 14 of the 'regular' <link linkend="upgrading">upgrading section</link>.
ja: マイナー・アップグレード(OTRS 3.2からOTRS 3.3まで)は、データベース・アップグレードのステップも含むので多少時間がかかります。インストーラーはこれを検知し、自動的にアップグレードを行います。インストレーション後、さらに「正常系(regular)」<link linkend="upgrading">upgrading section</link>のステップ12、13および14を行なうべきです。

source: Please note that if you have any additional packages such as Feature Add-Ons installed on your OTRS system, you'll need to upgrade these as well. Make sure you obtain these before you start the upgrade. After upgrade is complete you can upgrade these packages via the Package Installer Web GUI. Packages from the 'standard' repositories such as Survey, FAQ and ITSM can be upgraded from the Package Manager after the framework upgrade is complete.
ja: OTRSシステムにインストールした機能アドオンのようないかなる追加のパッケージでも持っていれば、同様にこれらをアップグレードする必要があることに注意してください。アップグレードを始める前にこれらの入手を確かめてください。アップグレード完了後、パッケージ・インストーラー・ウェブGUIによってこれらのパッケージをアップグレードできます。フレームワークアップグレードが完了していた後、サーベイ、FAQおよびITSMのような「標準」リポジトリからのパッケージは、パッケージ・マネージャーからアップグレードすることができます。

source: Additional applications
ja: 追加のアプリケーション
ru: Дополнительные приложения
sw: Programu-tumizi za ziada

source: You can install additional application packages to extend the functionality of the OTRS framework. This can be done via the package manager from the Admin page, which downloads the applications from an online repository and manages package dependencies. It is also possible to install packages from local files.
ja: OTRSフレームワークの機能性を拡張するために追加出願パッケージをインストールすることができます。これは、管理者ページからのパッケージ・マネージャーによって行うことができます。それはオンライン・リポジトリから適用をダウンロードし、パッケージ依存性を管理します。また、ローカル・ファイルからパッケージをインストールすることも可能です。
ru: Для разширения функциональности OTRS-фреймворка, можно также установить дополнительные пакеты приложений. Это можно сделать с помощью менеджера пакетов из Панели Администрирования, который загружает приложения из онлайн репозитория и управляет зависимостями между этими пакетами. Также приложения можно установить из локальных файлов.
sw: Unaweza kusakinisha vifurushi vya ziada vya programu tumizi kupanua sifa za kiunzi cha OTRS. Hii inaweza kufanyika kupitia meneja vifurushi kutoka kwenye kurasa ya Msimamizi, ambayo inapakua programu tumizi kutoka kwenye hifadhi ya mtandaoni na kusimamia utegemezi wa vifurushi. Pia inawezekana kusakinisha vifurushi kutoka kwenye mafaili ya ndani.

source: FAQ
ja: FAQ（よくある質問）
ru: FAQ (Часто Задаваемые Вопросы)
sw: Maswali yanasoulizwa mara kwa mara

source: The FAQ is the Knowledge Base component. It supports editing and viewing of FAQ articles. Articles can be viewed and restricted to agents, customer users, or anonymous users. These can also be structured into groups, and be read in different languages.
ja: FAQは知識ベース・コンポーネントです。それは、FAQ記事の閲覧と編集をサポートします。記事は閲覧され、担当者、顧客ユーザあるいは匿名ユーザーを制限することができます。これらもグループへ組み立てて、異なる言語で読むことができます。
ru: FAQ - это компонент Базы Знаний. Он позволяет редактировать и просматривать статьи FAQ . Статьи можно просматривать и ограничивать к ним доступ для агентов, клиентов и анонимных пользователей. Также они могут быть структурированы по группам и быть прочитаны на различных языках.
sw: Maswali Yanayoulizwa Mara kwa Mara ni kijenzi cha msingi wa maarifa. Inaruhusu kuhariri na kuona makala za Maswali Yanayoulizwa Mara kwa Mara. Makala yanaweza kuonwa na kuzuiwa kwa wakala, wateja watumiaji, au watumiaji wasiojulikana. Hizi pia zinaweza kupangwa katika makundi, na kusomwa katika lugha tofauti.

source: Installation from source (Linux, Unix)
ja: ソース（Linux,Unix)からのインストレーション
ru: Установка из исходных кодов (Linux, Unix)
sw: Usaninishaji kutoka kwenye chanzo (Linux, Unix)

source: Preparing the installation from source
ja: ソースからのインストレーションの準備

source: If you want to install OTRS from source, first download the source archive as .tar.gz, .tar.bz2, or .zip file from <ulink url="http://www.otrs.com/try/"> <citetitle>http://www.otrs.com/try/</citetitle> </ulink>
ja: ソースからOTRSをインストールしたければ、まず.tar.gz, .tar.bz2, or .zip file <ulink url="http://www.otrs.com/try/"> <citetitle>http://www.otrs.com/try/</citetitle> </ulink>といったソース・アーカイブからダウンロードして下さい。

source: Unpack the archive (for example, using <command>tar</command>) into the directory <filename>/opt</filename>, and rename the directory from otrs-x.x.x to otrs (see Script below).
ja: アーカイブをディレクトリー<filename>/opt</filename>へ解凍して(例えば、<command>tar</command>を使用して)、ディレクトリーを otrs-x.x.x から otrs へ改名してください(下記のスクリプトを参照)。
ru: Распакуйте архив (например с помощью команды <command>tar</command>) в каталог <filename>/opt</filename> а затем переименуйте каталог otrs-x.x.x на otrs (см. ниже Сценарий ниже).
sw: Pakua nyaraka (kwa mfano, kwa kutumia <command>tar</command>) kwenda kwenye mpangilio orodha <filename>/opt</filename>, na upa mpangilio orodha jina jipya kutoka otrs-x.x.x kuwa otrs (ona Hati chini).

source: <emphasis>Script: First steps to install OTRS.</emphasis>
ja: <emphasis>スクリプト：OTRSをインストールするファースト・ステップ</emphasis>

source: OTRS should NOT be run with root rights. Next you should add a new user for OTRS. The home directory of this new user should be <filename>/opt/otrs</filename>. If your web server is not running with the same user rights as the new 'otrs' user, which is the case on most systems, you will need to add the new 'otrs' user to the group of the web server user (see Script below).
ja: OTRSは、root権限で実行されるべきではありません。今直ぐOTRSのための新規のユーザを追加すべきです。この新規ユーザのホームディレクトリーは<filename>/opt/otrs</filename>にあるべきです。ウェブサーバが新規の「otrs」ユーザ(それはほとんどのシステム上の場合である)と同じユーザー権利で作動していなければ、新規の「otrs」ユーザをウェブサーバ・ユーザのグループに追加する必要があります(下記のスクリプトを参照)。

source: <emphasis>Script: Adding a new user 'otrs', and adding it to a group.</emphasis>
ja: <emphasis>スクリプト：新規 'OTRS' ユーザの追加とグループへの追加</emphasis>

source: Next, you have to copy some sample configuration files. The system will later use the copied files. The files are located in <filename>/opt/otrs/Kernel</filename> and <filename>/opt/otrs/Kernel/Config</filename> and have the suffix .dist (see Script below).
ja: 次に、いくつかのサンプル構成ファイルをコピーしなければなりません。システムは後でコピーされたファイルを使用します。ファイルは、<filename>/opt/otrs/Kernel</filename> and <filename>/opt/otrs/Kernel/Config</filename> にあり、接尾辞.distがあります(下記のスクリプトを参照)。

source: <emphasis>Script: Copying some sample files.</emphasis>
ja: <emphasis>スクリプト：いくつかのサンプルファイルのコピー</emphasis>

source: The last step to prepare the installation of OTRS is to set the proper access rights for the files. You can use the script <command>otrs.SetPermissions.pl</command>, which is located in the <filename>bin</filename> directory, in the home directory of the 'otrs' user. You can execute the script with the following parameters:
ja: OTRSのインストレーションを準備する最後のステップは、ファイル用に適切なアクセス権を設定することです。「otrs」ユーザのホームディレクトリーの中で、スクリプト<command>otrs.SetPermissions.pl</command>(それは<filename>bin</filename>ディレクトリーに位置する)を使用することができます。次のパラメーターを備えたスクリプトを実行することができます:

source: If your web server is running with the same user rights as user 'otrs', the command to set the proper access rights is <command>otrs.SetPermissions.pl /opt/otrs --otrs-user=otrs --web-user=otrs</command>. On SUSE systems the web server is running with the user rights of 'wwwrun'. On Debian-based systems this is 'www-data'. You would use the command <command>otrs.SetPermissions.pl /opt/otrs --otrs-user=otrs --web-user=wwwrun --otrs-group=nogroup --web-group=www</command> to set the proper access rights.
ja: ウェブサーバがユーザ「otrs」と同じユーザー権限で作動している場合、適切なアクセス権を設定するコマンドは<command>otrs.SetPermissions.pl /opt/otrs --otrs-user=otrs --web-user=otrs</command>。SUSEシステムにおいては、ウェブサーバが「wwwrun」のユーザー権限で作動しています。Debianベースのシステムにおいては、これが「www-data」です。適切なアクセス権限を設定するためにコマンド<command>otrs.SetPermissions.pl /opt/otrs --otrs-user=otrs --web-user=wwwrun --otrs-group=nogroup --web-group=www</command>を使います。

source: Installation of Perl modules
ja: Perlモジュールのインストレーション

source: OTRS requires some additional Perl modules, as described in Table 3-1. If you install OTRS from source, you will need to install these modules manually. This can be done either with the package manager of your Linux distribution (<application>yast</application>, <application>apt-get</application>) or, as described in this section, through the Perl shell and CPAN. If you're using ActiveState Perl, for instance on Windows, you could use PPM, the built-in Perl Package Manager. We recommend using your package manager if possible.
ja: テーブル3-1に述べられているように、OTRSはいくつかの追加のパール・モジュールを必要とします。ソースからOTRSをインストールすれば、これらのモジュールを手動でインストールする必要があります。これは、Linuxディストリビューション<application>yast</application>、<application>apt-get</application>)のパッケージ・マネージャーを、あるいはPerlシェルおよびCPANによって(このセクションに述べられていたように)やめることができます。ActiveState Perlを使用していれば、例えば、ウィンドウズにおいては、PPM(内蔵のPerl・パッケージ・マネージャー)を使用するかもしれませんが、私たちはできればパッケージ・マネージャーを使用することを推奨します。

source: You can verify which modules you need to install with <command>otrs.CheckModules.pl</command>. This script is located in the <filename>bin</filename> directory, in the home directory of the 'otrs' user (see Script below). Please note that some modules are optional. <placeholder type="screen" id="0"/>
ja: <command>otrs.CheckModules.pl</command>でどのモジュールをインストールする必要があるか確認することができます。このスクリプトは「otrs」ユーザのホームディレクトリーに、<filename>bin</filename>ディレクトリーに位置します(下記のスクリプトを参照)。いくつかのモジュールはオプションであることに注意してください。<placeholder type="screen" id="0"/>

source: <emphasis>Script: Checking needed modules.</emphasis>
ja: <emphasis>スクリプト：必要なモジュールのチェック</emphasis>

source: You should strive to install the missing modules from your Linux distribution's package management system. By doing so, the packages will be automatically updated when new versions are available or when security issues are found. Please refer to your distribution's documentation on how to install additional packages. If the (correct version of) the module is not available from the package repositories, you can also install from CPAN, the Comprehensive Perl Archive Network.
ja: Linuxディストリビューションのパッケージ管理システムから不足しているモジュールをインストールするために努力するべきです。そうすることによって、新バージョンが利用可能な場合、あるいはセキュリティ問題が見つかった時、パッケージは自動的に更新されます。追加のパッケージをインストールする方法についての配布ドキュメンテーションを参照してください。（正しいバージョンの）モジュールがパッケージ・リポジトリから利用可能でない場合、CPAN、包括的なPerl・アーカイブ・ネットワークからもインストールすることができます。
