Repository: DSigmund/doc-admin
Catalog: i18n/doc-admin.*.po
Languages: ja, ru, sw

source: Example job for the filter module Kernel::System::PostMaster::Filter::ExternalTicketNumberRecognition
ja: フィルター・モジュールのためのサンプル・ジョブKernel::System::PostMaster::Filter::ExternalTicketNumberRecognition
ru: Пример задания для модуля фильтрации Kernel::System::PostMaster::Filter::ExternalTicketNumberRecognition
sw: Kazi za mfano kwa moduli ya kuchuja Kiini::Mfumo::MkuuWaPosta::Chuja::UtambuziTiketiNambariNje

source: # Job Name: ExternalNumber # External Ticket Number Reconition, check for Incident-<number> in incoming mails subject and # body from the addeesses <sender>@externalticket.com, if number is found it will be stored in # the dynamic field 'ExternalNumber' (that need to be setup in the Admin Panel). $Self->{'PostMaster::PreFilterModule'}->{'000-ExternalTicketNumberRecognition5'} = { 'FromAddressRegExp' => '\\s*@externalticket.com', 'NumberRegExp' => 'Incident-(\\d.*)', 'SearchInSubject' => '1', 'SearchInBody' => '1', 'TicketStateTypes' => 'new;open' 'DynamicFieldName' => 'ExternalNumber', 'Module' => 'Kernel::System::PostMaster::Filter::ExternalTicketNumberRecognition', 'Name' => 'Test External Ticket Number', 'SenderType' => 'system', };
ja: # Job Name: ExternalNumber # 外部チケット番号の認識では、<送信者>@externalticket.comのアドレス # からの入信Eメールの中の件名と本文インシデント<番号>をチェックします。 # <番号>が見つかればそれは動的フィールド「ExternalNumber(外部番号)」 # に保存されます。（管理者バネルで設定が必要） $Self->{'PostMaster::PreFilterModule'}->{'000-ExternalTicketNumberRecognition5'} = { 'FromAddressRegExp' => '\\s*@externalticket.com', 'NumberRegExp' => 'Incident-(\\d.*)', 'SearchInSubject' => '1', 'SearchInBody' => '1', 'TicketStateTypes' => 'new;open' 'DynamicFieldName' => 'ExternalNumber', 'Module' => 'Kernel::System::PostMaster::Filter::ExternalTicketNumberRecognition', 'Name' => 'Test External Ticket Number', 'SenderType' => 'system', };

source: <emphasis>Configuration Options</emphasis>
ja: <emphasis>構成オプション</emphasis>
ru: <emphasis>Параметры конфигурации</emphasis>
sw: <emphasis>Machaguo ya Usanidi</emphasis>

source: This is an optional setting. Only mails matching this "From:" address will be considered for this filter. You can adjust this setting to the sender address your external system uses for outgoing mails. In case this address can differ, you can set this option to empty. OTRS will in that case not check the sender address.
ja: これはオプションの設定です。この「From:」アドレスと一致しているメールだけがこのフィルターで考慮されます。この設定を調整して、送信メール用外部システム利用を、送信者アドレスにすることができます。このアドレスが異なる場合、このオプションを空にすることができます。この場合、OTRSは送信者アドレスをチェックしません。
ru: Это настройка необязательна. Только писма с заданным значением поля "From:" будут рассмотрены этим фильтром. Вы можете изменить эту настройку на адрес отправителя вашей внешней системы, используемой для исходящей почты. В случае, если адреса различны, вы можете оставить этот параметр пустым. Тогда OTRS не будет проверять адрес отправителя.
sw: Huu ni mpangilio wa hiari. Barua zinazofanana na hii anwani "Kutoka:" ndiyo zitatumika kwa kichujio hiki. Unaweza kubadilisha huu mpangilio kuwa anwani ya mtumaji mfumo wako wa nje inayotumia kwa ujumbe unaotoka. Ikiwa hii anwani ianatofautiana, unaweza kuseti hili chaguo kuwa tupu. OTRS kwa kesi hii haitakagua anwani ya mtumaji.

source: This is a mandatory setting. This setting contains the regular expression OTRS will use to extract the ticket number out of the subject and/or ticket body. The default regular expression will match occurrences of for example 'Incident-12354' and will put the part between parentheses in the dynamic field field, in this case '12354'.
ja: これは必須設定項目です。この設定は 件名またはチケットの本文からチケット番号を抽出するためにOTRSが使う正規表現を含みます。デフォルトの正規表現は 以下のような例の発生と一致するでしょう。例えば「Incident-12354」そしてその部分を動的フィールド中に括弧で挟む部分を置きます（ここでは「12354」）
ru: Этщт параметр обязателен. Он содержит регулярное выражение, которое OTRS будет использовать для извлечения номера заявки из темы и/или тела письма. Выражение по умолчанию будет проверять соответствие, например, 'Incident-12354' и помещать часть значения между скобками в динамическое поле, в данном случае '12354'.
sw: Huu ni mpangilio wa lazma. Huu mpangilio una semi za kawaida ambazo OTRS itatumia kupata nambari ya tiketi kutoka kwenye somo na/au kiini cha tiketi. Usemi wa kawaida utafanana na matukio ya kwa mfano 'Tukio-12354' na itaweka sehemu iliyo kwenye mabano katika sehemu inayobadilika, kwa kesi hii '12354'.

source: If this is set to '1', the email subject is searched for a ticket number.
ja: これが「1」にセットされる場合、Eメール件名はチケット番号を求めて検索されます。
ru: Если установлено в '1', в поле Тема письма будет осуществляться поиск номера заявки.
sw: Kama hii imesetiwa kuwa '1', mada ya barua pepe inatafutwa kwa ajili ya nambari ya tiketi.

source: If this is set to '1', the email body is searched for a ticket number.
ja: これが「1」にセットされる場合、Eメール本文はチケット番号を求めて検索されます。
ru: Если установлено в '1', поиск номера заявки будет осуществляться в тексте письма.
sw: Kama hii imesetiwa kuwa '1', kiini cha barua pepe kinatafutwa kwa ajili ya nambari ya tiketi.

source: TicketStateTypes
ja: TicketStateTypes（チケット・状態・タイプ）
sw: TiketiHaliAina

source: This is an optional setting. If given, it will search OTRS only for open external tickets of given state types. The state types are separated with semicolons.
ja: これはオプションの設定です。もし与えられれば、それは与えられた状態タイプの開いた外部チケットのみOTRSを検索するでしょう。状態タイプはセミコロンで分離されます。
ru: Это необязательный параметр. Если задан, OTRS будет искать отерытые внешние заявки с заданными типами состояний. Типы состояний в списке разделяются точкой с запятой.
sw: Huu ni mpangilio wa hiari. Kama imetolewa, itatafuta OTRS kwa ajili ya tiketi za nje zilizo wazi tu kwa aina fulani ya hali. Aina za hali zinagawanywa na nukta mkato.

source: This is a required setting. It defines the dynamic filed that is used to store the external number (the field name must exist in the system and has to be valid).
ja: これは必須の設定で、外部番号を保存するために使われている動的フィールドを定義します。(フィールド名はシステムに存在しなければいけないしかつ有効でなければなりません)
ru: Обязательный параметр. Задает динамическое поле, используемое для хранения внешнего номера заявки (имя поля должно существовать в системе и быть действительным).
sw: Huu ni mpangilio unaohitajika. Unafafanua sehemu inayobadilika ambayo inatumika kuhifadhi nambari ya nje (jina la sehemu lazima liwepo kwenye mfumo na inabidi liwe halali).

source: This defines the sender type used for the articles created in OTRS.
ja: これは、OTRSで記事作成に使用される送信者タイプを定義します。
ru: Этот параметр задает тип отправителя и используется при создании сообщений/заметок в OTRS.
sw: Hii inafafanua aina ya mtumaji wa makala zilizotengenezwa katika OTRS.

source: Of course it's also possible to develop your own PostMaster filter modules.
ja: もちろん、自分のPostMasterフィルタ・モジュールを開発することも可能です。
ru: Конечно, также есть возможность разработки своих собственных PostMaster-модулей фильтрации.
sw: Pia inawezekana kutengeneza moduli zako za kuchuja za MkuuWaPosta.

source: Secure email with PGP
ja: PGP鍵を備えた安全なEメール
ru: Безопасность электронной почты с PGP
sw: Linda barua pepe na PGP

source: OTRS has the capability to sign or encrypt outgoing messages with PGP. Furthermore, encrypted incoming messages can be decrypted. Encryption and decryption are done with the GPL tool GnuPG. To setup GnuPG for OTRS, the following steps have to be performed:
ja: OTRSは、PGP鍵を備えた送信メッセージに署名するか暗号化する能力を持っています。更に、暗号化された受信メッセージは解読することができます。暗号化と解読はGPLツールGnuPGで実施されます。OTRSのためのセットアップGnuPGに、次のステップを行なわなければなりません。
ru: OTRS емеет возможность подписывать или шифровать исходящие сообщения с помощью PGP. Также, могут быть расшифрованы входящие зашифрованные сообщения. Шифрование и дешифрование осуществляется с помощью GPL-инструмента GnuPG. Чтобы установить GnuPG для OTRS, нужно проделать следующие действия:
sw: OTRS ina uwezo wa kusaini au kusimba fiche ujumbe unaotoka kwa PGP. Zaidi, ujumbe unaoingia ulio simbwa fiche unaweza kusimbua fiche. Kusimba na kusimbua fiche unafanyika na kifaa cha GPL GnuPG. Kuseti GnuPG kwa ajili ya OTRS, hatua zifwatazo inabidi zifanyike:

source: Install GnuPG, via the package manager of your operating system.
ja: オペレーティング・システムのパッケージ・マネージャーによるGnuPGのインストール
ru: Установка GnuPG с помощью менеджера пакетов вашей операционной системы.
sw: Sakinisha GnuPG, kupitia meneja kifurushi wa mfumo endeshi wako.

source: Configure GnuPG for use with OTRS. The necessary directories for GnuPG and a private key have to be created. The command shown in the script below has to be executed as user 'otrs' from a shell.
ja: OTRSで使うGnuPGを構成してください。GnuPGと秘密鍵のための必要なディレクトリを作成しなければなりません。シェルからユーザ「otrs」としてスクリプト中で下に示されるコマンドを実行しなければなりません。
ru: Настройте GnuPG для использования с OTRS. Для GnuPG и приватного ключа нужно создать необходимые директории. В командной строки для пользователя 'otrs' нужно выполнить команду из нижеприведенного сценирия.
sw: Sanidi GnuPG ili utumie pamoja na OTRS. Mipangilio orodha ya lazima ya GnuPG na ufunguo binafsi lazima vitengenezwe. Amri iliyoonyeshwa chini lazima itekelezwe kama mtumiaji 'otrs' kutoka kwenye sheli.

source: <emphasis>Script: Configuring GnuPG.</emphasis>
ja: <emphasis>スクリプト: GnuPGの構成</emphasis>
ru: <emphasis>Сценарий: Настройка GnuPG.</emphasis>
sw: <emphasis>Hati: Kusanidi GnuPG.</emphasis>

source: As shown in the script below, the default settings can be applied for most of the required parameters. Only the values for the key owner have to be entered correctly, with a proper password specified for the key.
ja: スクリプトの中で下に示されるように、デフォルト構成は、ほとんどの要求されるパラメタのために適用することができます。キーに指定された適切なパスワードで、key所有者に対する値だけを正確に入力しなければなりません。
ru: Как показано в нижеприведенном сценарии, настройки по умолчанию могут быть применены для большинства из необходимых параметров. Правильно должны быть указаны только пароль и значения для владельца ключа.
sw: Kama ilivyoonyeshwa kwenye hati chini, mipangilio chaguo-msingi inaweza kutumika kwa parameta nyingi zinazotakiwa. Thamani za mmiliki wa ufunguo tu ndio zinatakiwa kuingizwa kwa usahihi, na nywila sahihi kuwekwa kwa ajili ya funguo.

source: In the screen for the <link linkend="ConfigReference_Framework:Crypt::PGP">PGP</link> settings, PGP should be activated for OTRS (first option). Also, the path to the gpg program should be set and checked.
ja: <link linkend="ConfigReference_Framework:Crypt::PGP">PGP</link> の設定画面では、PGPはOTRSで有効になっており(一つ目のオプション)、また、PGPプログラムへのパスが設定され、有効になっている必要があります
ru: На странице с PGP-настройками <link linkend="ConfigReference_Framework:Crypt::PGP">PGP</link>, PGP должен быть активирован для OTRS (первая опция). Также нужно задать и проверить путь к gpg-программе.
sw: Kwenye skrini kwa ajili ya mipangilio ya <link linkend="ConfigReference_Framework:Crypt::PGP">PGP</link>, PGP lazima iamilishwe kwa ajili ya OTRS (chaguo la kwanza). Pia, njia ya kwenda kwenye programu ya gpg lazima isetiwe na kukaguliwa.

source: The next config setting (PGP::Options) may also require changing. Via this config setting, the parameters that are used for every execution of gpg by the 'otrs' user can be specified. In particular, the directory of the config files for GnuPG of the 'otrs' user is important. In the example <filename>/opt/otrs/.gnupg</filename> is used. This directory was created earlier during the PGP configuration.
ja: 次の構成設定(PGP::Options)はさらに変わることを要求するかもしれません。このコンフィグ・セッティングによって、「otrs」ユーザによってgpgのすべての実行に使用されるパラメタは指定することができます。特に「otrs」ユーザのGnuPGのための構成ファイルのディレクトリは重要です。例<filename>/opt/otrs/.gnupg</filename>の中で、使用されます。このディレクトリは、PGP鍵構成以前に作成されました。
ru: Следующим нужно изменить конфигурационный параметр (PGP::Options). Используя эти конфигурационные настройки можно определить параметры, которые будут использоваться для каждого вызова gpg пользователем 'otrs'. Каталог с конфигурационными файлами для GnuPG является очень важным. В примере используется <filename>/opt/otrs/.gnupg</filename>. Эта директоиря была создана на первом шаге конфигурации PGP.
sw: Mpangilio unaofwata wa config (PGP::Options) unaweza kuhitaji mabadiliko pia. Kupitia mpangilio huu wa config, parameta ambazo zinatumika kwa kila utekelezaji wa gpg kwa mtumiaji wa 'otrs' unaweza kuwekwa bayana. Hasa, mpangilio orodha wa mafaili ya config ya GnuPG ya mtumiaji wa 'otrs' ni muhimu. Kwenye mfano <filename>/opt/otrs/.gnupg</filename> imetumika. Huu mpangilio orodha ulitengenezwa mapema wakati wa usanidi wa PGP.

source: Via the next config option (PGP::Key::Password) it is possible to specify the pairs of key IDs and their passwords for own private keys. Because communication partners from outside write to the ticket system with their messages encrypted with your public key, OTRS can decrypt these messages with the ID/passwords specified here.
ja: 次の構成オプション(PGP::Key::Password)によって、キーIDのペアおよび自身の秘密鍵のパスワードを指定することは可能です、なぜなら、外部からのコミュニケーションパートナーチケットシステムに彼らのメッセージを暗号化と秘密鍵で書き込み、OTRSはそれらのメッセージをIDとパスワードをここで指定して解読するからです。
ru: Используя следующий конфигурационный параметр (PGP::Key::Password), можно указать пары для ключей ID и их пароли для собственных закрытых ключей. Поскольку партнеры извне пишут зашифрованные сообщения в систему заявок используя ваш публичный ключ, OTRS может расшифровать эти сообщения с помощью ID/паролей указаных здесь.
sw: Kwa kupitia chaguo linalofwata la usanidi (PGP::Ufunguo::Nywila) inawezekana kubainisha jozi ya Vitambulisho vya funguo na nywila zake kwa ajili ya funguo binafsi. Kwa sababu mawasiliano ya wabia kutoka nje wanaandika kwenye mfumo wa tiketi na ujumbe wao kufanyiwa usimbaji fiche kwa kutumia funguo zako za umma, OTRS inaweza kusimbua fiche huu ujumbe kwa kutumia Kitambulisho/nywila zilizobainishwa hapa.

source: How to get the id of your own private key? The ID of your own private key is already shown during the key generation (see step 1 from above). It is also possible to get the ID if the command specified in the following script is executed as user 'otrs':
ja: どのようにしてあなた自身の秘密鍵のIDを得ることができますか？あなた自身の秘密鍵のIDはすでにキー生成時に表示されています。（上記ステップ１をご覧ください）さらに、次のスクリプト中で指定されたコマンドがユーザ「otrs」として実行される場合、IDを得ることが可能です:
ru: Как получить идентификатор вашего собственного закрытого ключа? ID вашего собственного закрытого идентификатора отображается во время генерации (см. выше шаг 1). Также есть возможность получить ID, указав команду из нижеприведенного сценария вызванную с правами пользователя 'otrs':
sw: Jinsi ya kupata kitambulisho cha ufunguo wako binafsi? Kitambulisho cha ufunguo wako binafsi tayari kinaonyeshwa wakati wa uzalishaji funguo (ona hatua 1 hapo juu). Pia inawezekana kupata Kitambulisho kama amri itakayoonyeshwa kwenye hati ifuatayo itatekelezwa kama mtumiaji 'otrs':

source: <emphasis>Script: Getting the ID of your own private key.</emphasis>
ja: <emphasis>スクリプト:自分の秘密鍵のIDを得ること。</emphasis>
ru: <emphasis>Сценарий: Получение ID вашего собственного приватного ключа.</emphasis>
sw: <emphasis>Hati: Kupata Kitambulisho cha ufunguo wako binafsi.</emphasis>

source: The ID of the private key can be found in the line that starts with "sub". It is a hexadecimal string that is eight characters long, in the example above it is "52B97069". The password you have to specify for this key in the ticket system is the same that was given during key generation.
ja: 秘密鍵のIDは、「サブ」で始まるラインで見つけることができます。それは長さ8文字で16進法の文字列で上の例では「52B97069」です。チケットシステムでこのキー用に指定しなければならないパスワードは、キー生成中に与えられたのと同じです。
ru: Идентификатор (ID) закрытого ключа можно найти в строке, которая начинается с "sub". Это шестнадцатеричное представление строки, длиной в восемь символов, например "52B97069". Пароль, который нужно указать для этого ключа в системе обработки заявок такой же как данные при генерации ключей.
sw: Kitambulisho cha ufunguo binafsi kinaweza kupatikana katika mstari uanoanza na "sub". Ni tungo iliyo katika hexadecimal ambayo ina urefu wa herufi nane, katika mfano juu ni "52B97069". Nywila unayotakiwa kuweka bayana kwa ajili ya huu ufunguo katika mfumo wa tiketi ni sawa na uliotolewa wakati wa uzalishaji ufunguo.

source: After this data is inserted, the "Update" button can be used to save the settings. OTRS is ready to receive and decrypt encoded messages now.
ja: このデータが挿入された後、「アップデート」ボタンはセッティングを保存するために使用することができます。これでOTRSは暗号化されたメッセージを受け取り解読する準備ができています。
ru: После того, как эти данные были введены, нажмите кнопку "Обновить" чтобы сохранить настройки. Теперь OTRS готов принимать и расшифровывать зашифрованные сообщения.
sw: Baada ya hii data kuingizwa, kitufe cha ku "sasisha" kinaweza kutumika kuhifadhi mipangilio. OTRS iko tayari kupokea na kusimbua fiche ujumbe uliofanyiwa usimbaji.

source: Finally, import a customer's public key. This ensures that encrypted messages can be sent out to this customer. There are two ways to import a public key of a customer.
ja: このデータが挿入された後、「アップデート」ボタンはセッティングを保存するために使用することができます。これでOTRSは暗号化されたメッセージを受け取り解読する準備ができています。
ru: И наконец, нужно импортировать открытый ключ клиента. Это гарантирует, что зашифрованные сообщения могут быть отправлены этому клиенту. Есть два способа импортировать открытый ключ клиента.
sw: Hatimaye, agiza ufunguo wa umma wa mteja. Hii inahakikisha kwamba ujumbe uliofanyiwa usimbaji fiche unaweza kutumwa nje kwa huyu mteja. Kuna njia mbili za kuagiza ufunguo wa umma wa mteja.

source: The first way is to specify the public key of a customer in the customer management interface.
ja: 最初の方法は、顧客管理インターフェースで顧客の公開鍵を指定することです。
ru: Первый способ - указать открытый ключ клиента в веб-интерфейсе управления клиентами.
sw: Njia ya kwanza ni kubainisha ufunguo wa umma wa mteja katika kiolesura cha usimamizi wa mteja.

source: The second way is to specify the key via the PGP settings, reachable from the Admin page. On the right section of this screen, all already imported public keys of customers are displayed. After PGP has been activated and configured for OTRS, your own public key should also be listed there. In the left area of the PGP setting screen it is possible to search for keys. Also, a new public key can be uploaded into the system from a file.
ja: 第2の方法は、PGP鍵設定(管理者ページから到達可能)によってキーを指定することです。この画面の右側のセクションにおいては、すでにインポート済の顧客の公開鍵が全て表示されます。PGP鍵がOTRSのために活性化され構成されたら、自分の公開鍵もそこにリストされるべきです。PGP鍵設定画面の左のエリアでキーを探せます。さらに、新規公開鍵はファイルからシステムへアップロードすることができます。
ru: Вторая возможность заключается в определении ключей посредством настройки PGP, которая доступна через Панель Администрирования. В правой стороне этой страницы отображаются все импортированные открытые ключи клиентов. После того как PGP активирован и сконфигурирован, здесь также должен отображатся ваш собственный открытый ключ. В левой части страницы настроек PGP можно производить поиск по ключам. Также, новый открытый ключ может быть загружен в систему из файла.
sw: Njia ya pili ni kuweka bayana ufunguo kupitia mipangilio ya PGP, inafikika kutoka kwenye kurasa ya Msimamizi. Katika upande wa kulia wa hii skrini, funguo za umma za wateja zilizoagizwa kutoka nje zinaonyeshwa. Baada ya PGP kuamilishwa na kusanidiwa kwa ajili ya OTRS, funguo yako mwenyewe ya umma itaorodheshwa hapa. Kwenye upande wa kushoto wa skrini ya mipangilio ya PGP inawezekana kutafuta funguo. Pia ufunguo mpya wa umma unaweza kupakiwa kwenye mfumo kutoka kwenye faili.

source: The files with the public key that need to be imported into OTRS have to be GnuPGP compatible key files. In most cases, the key stored in a file is an "ASCII armored key". OTRS can deal with this format.
ja: OTRSへインポートされる必要のある公開鍵を備えたファイルはGnuPGP互換性をもつキー・ファイルでなければなりません。ほとんどの場合、ファイルに格納されたキーは「ASCII armored key」です。OTRSはこのフォーマットを取り扱えます。
ru: Файлы с открытым ключем, которые нужно импортировать в OTRS должны соответствовать файлам ключей GnuPGP. В большинстве случаев, ключ сохраняется в файле как "ASCII armored key". OTRS позволяет работать с этим форматом.
sw: Mafaili yenye ufunguo wa umma ambayo yanahitaji kuagizwa kwenye OTRS inabidi yawe tangamanifu na mafaili ya ufunguo ya GnuPGP. Katika kesi nyingi, ufunguo uliohifadhiwa katika faili ni "ufunguo unaolindwa na ASCII". OTRS inaweza kushughulika na umbizo hili.

source: Secure email with S/MIME
ja: S/MIMEを備えた安全なEメール
ru: Безопасность электронной почты с S/MIME
sw: Linda barua pepe na S/MIME

source: At first glance, encryption with S/MIME seems a little more complicated than with PGP. First, you have to establish a Certification Authority (CA) for the OTRS system. The subsequent steps are very much like those needed with PGP: configure OTRS, install your own certificate, import other public certificates as needed, etc.
ja: 一見、S/MIMEを備えた暗号化はPGP鍵を備えた暗号化より少し複雑に見えます。最初に、OTRSシステムのために認証局(CA)を設立しなければなりません。後のステップは、PGP鍵で必要とされるものに非常に似ています:OTRSの構成、自身の証明書のインストール、必要な他の証明書のインポート等。
ru: На первый взгляд, S/MIME-шифрование кажется более сложным чем PGP. Прежде всего для OTRS нужно создать Центр Сертификации - Certification Authority (CA). Последующие процедуры очень похожи на те, которые вы выполняли для PGP: настроить OTRS, установить собственные сертификаты, импортировать другие открытые сертификаты, если необходимо, и т. д.
sw: Kwa muonekano wa kwanza, usimbaji fiche kwa S/MIME unaonekana mgumu kulinganisha na PGP. Kwanza inabidi uanzishe Mamlaka ya Uhalalishaji (CA) kwa ajili ya mfumo wa OTRS. Hatua zinazofuata ni kama zile zinazohitajika na PGP: sanidi OTRS, sakinisha hati yako mwenyewe, agiza hati nyingine za umma kama zinavyohitajika, na kadh.

source: The S/MIME configuration is conducted outside the OTRS web interface for the most part, and should be carried out in a shell by the 'otrs' user. The MIME configuration under Linux is based on SSL (OpenSSL). Therefore, check first of all whether the OpenSSL package is installed on your system. The OpenSSL package includes a script called CA.pl, with which the most important steps of certificate creation can be performed. To simplify the procedure, find out where in the filesystem the CA.pl script is stored and enter the location temporarily into the PATH variable of the shell (see Script below).
ja: S/MIME構成は、大部分はOTRSウェブインターフェースの外部で行われ、「otrs」ユーザによってシェルの中で実行されるべきです。Linux下のMIME構成SSL(OpenSSL)に基づきます。したがって、あなたのシステムにOpenSSLパッケージがインストールされるかどうかを第一にチェックしてください。OpenSSLパッケージは、CA.pl(証明書生成の最も重要なステップはそれで行なうことができます)と呼ばれるスクリプトを含んでいます。手続きを単純化するために、ファイルシステムでCA.plスクリプトが保存され、シェルのパス変数に一時的に位置を入力する場所を見つけます。(下記のスクリプトを参照)
ru: В большинстве случаев настройка S/MIME производится за пределами веб-интерфейса OTRS, и должана осуществлятся в оболочке операционной системы с правами пользователя 'otrs'. MIME конфигурация под Linux основана yа SSL (OpenSSL). Поэтому, сначала проверьте установлен ли в вашей системе пакет OpenSSL. OpenSSL-пакет содержит скрипт, который называется CA.pl, для создания сертификата, все наиболее важные шаги, нужно проделать именно с ним. Для упрощения процедуры узнайте, где в файловой системе находится сценарий CA.pl и введите путь к его местоположению в переменную путей оболочки (см. нижеприведенный сценарий).
sw: Usanidi wa S/MIME unafanyika nje ya kiolesura cha tovuti cha OTRS kwa asilimia kubwa, na unatakiwa ufanyike kwenye sheli na mtumiaji wa 'otrs'. Usanidi wa MIME chini ya Linux unajikita katika SSL (OpenSSL). Kwahiyo kwanza kabisa kagua kama kifurudhi cha OpenSSL kimesakinishwa kwenye mfumo wako. Kifurushi cha OpenSSL kinajumuisha hati iitwayo CA.pl, ambamo ndani yake hatua za muhimu za utengenezaji wa hati zinaweza kufanyika. Kurahisisha mchakato, tafuta wapi kwenye mfumo wa mafaili hati ya CA.pl imehifadhiwa na ingiza mahali inapopatikana katika kishika nafasi NJIA cha sheli (ona Hati chini).

source: <emphasis>Script: Configuring S/MIME.</emphasis>
ja: <emphasis>スクリプト:S/MIMEの構成</emphasis>
ru: <emphasis>Сценарий: Настройка S/MIME.</emphasis>
sw: <emphasis>Hati: Usanidi wa S/MIME.</emphasis>

source: The script above shows that a new temporary directory ~/tmp has been created, in which the certificate is to be generated.
ja: 上記のスクリプトは、新規一時ディレクトリ~/tmpが作成されたことを表示しています。証明書はその中で生成されることになっています。
ru: Сценарий выше показывает, что была создана нова временная директория ~/tmp, в которой хранятся сгенерированные сертификаты.
sw: Hati hapo juu inaonyesha kwamba mpangilio orodha mpya wa muda ~/tmp umetengenezwa, ambapo ndani yake hati itazalishwa.
