Repository: DSigmund/doc-admin
Catalog: i18n/doc-admin.*.po
Languages: ja, ru, sw

source: Right to update the owner of tickets or entries in queues or areas that belong to this group.
ja: このグループのエリアまたはキュー間におけるエントリーあるいはチケットのオーナーの更新権限
ru: Права для изменения владельца заявок или записей в очередях принадлежащих этой группе.
sw: Haki za kusasisha mmiliki wa tiketi au maingizo katika foleni au maeneo ambayo yapo kwenye hili kundi.

source: priority
ja: 優先度（priority）
sw: kipaumbele

source: Right to change the priority of tickets or entries in queues or areas that belong to this group.
ja: このグループのエリアまたはキュー間におけるエントリーあるいはチケットの優先度の変更権限
ru: Права для изменения приоритета заявок или записей в очереди или области, принадлежащей этой группе.
sw: Haki ya kubadilisha kipaumbele cha tiketi au maingizo au maeneo yaliyo kwenye hili kundi.

source: Full read and write access on tickets or entries in the queues or areas that belong to this group.
ja: このグループのエリアまたはキュー間におけるエントリーあるいはチケットのフルのRead/Write権限
ru: Полный доступ к заявкам или записям в очереди или области, принадлежащей к этой группе.
sw: Haki kamili ya kusoma na kuandika kwa tiketi au maingizo ya foleni au maeneo yaliyopo kwenye hili kundi.

source: Not all available permissions are shown by default. These additional permissions can be added.
ja: すべての利用可能なパーミションはデフォルトで表示されるとは限りません。これらの追加のパーミションは加えることができます。
ru: Не все доступные права отображаются по умолчанию. Эти дополнительные права могут быть добавлены.
sw: Sio ruhusa zote zinazopatikana zinaonyeshwa kwa chaguo-msingi. Hizi ruhusa za ziada zinaweza kuongezwa.

source: Additional permission groups
ja: 追加の許可グループ
ru: Дополнительные группы прав
sw: Makundi ya ruhusa ya ziada

source: Gives access to the stats page.
ja: stats(統計)ページにアクセス権を与えます。
ru: Предоставляет доступ к странице отчетов.
sw: Kupewa ruhusa ya kurasa ya takwimu.

source: bounce
ja: bounce（返送）
ru: Перенаправить
sw: dunda

source: The right to bounce an email message (with bounce button in ticketZoom).
ja: Eメールメッセージを送り返す権限（チケットズームの返送ボタンで）。
ru: Право перенаправить/bounce почтовое сообщение (ссылка перенаправить/bounce в ticketZoom).
sw: Haki ya kudundisha ujumbe wa barua pepe (na kitufe cha kudunda katika Kuzatiketi).

source: compose
ja: compose（作成）
ru: Создать
sw: tunga

source: The right to compose an answer for a ticket.
ja: チケットに対する回答を作成する権限。
ru: Право составления ответа на заявку.
sw: Haki ya ku tunga jibu la tiketi.

source: customer
ja: customer（顧客）
ru: клиент
sw: mteja

source: The right to change the customer of a ticket.
ja: チケットの顧客を変更する権限。
ru: Право изменить клиента для этой заявки
sw: Haki y a kubadilisha mteja wa tiketi.

source: forward
ja: forward （転送）
ru: Переслать
sw: tuma mbele

source: The right to forward a messages (with the forward button).
ja: メッセージを転送する権限(転送ボタンで)。
ru: Право пересылать сообщения (с помощью кнопки Переслать).
sw: Haki ya kutuma mbele messeji (kwa kitufe cha kutuma mbele).

source: pending
ja: pending （保留）
ru: в ожидании
sw: inasubiri

source: The right to set a ticket to pending.
ja: チケットを保留にする権限。
ru: Право перевести заявку в ожидание.
sw: Haki ya kuseti tiketi isubirie.

source: phone
ja: phone （電話）
ru: телефон
sw: simu

source: The right to add a phonecall to a ticket.
ja: チケットに通話を追加する権限。
ru: Право добавить содержание звонка клиента к заявке. В виде сообщения/заметки.
sw: Haki ya kuongeza kupiga simu kwa tiketi.

source: responsible
ja: responsible （責任者）
ru: ответственный
sw: wajibika

source: The right to change the responsible agent for a ticket.
ja: チケットに対する責任担当者を変更する権限。
ru: Право изменить ответственного за заявку.
sw: Haki ya kubadilisha wakala anayewajibika kwa tiketi.

source: These permissions can be added by changing the <link linkend="ConfigReference_Ticket:Core::Ticket:System::Permission">System::Permission</link>
ja: 権限の変更は<link linkend="ConfigReference_Ticket:Core::Ticket:System::Permission">System::Permission</link>から変更可能です
ru: Эти права могут быть добавлены изменением параметра <link linkend="ConfigReference_Ticket:Core::Ticket:System::Permission">System::Permission</link>
sw: Hizi ruhusa zinaweza kuongezwa kwa kubadilisha <link linkend="ConfigReference_Ticket:Core::Ticket:System::Permission">Mfumo::Ruhusa</link>

source: Roles
ja: 役割
ru: Роли
sw: Jukumu

source: Roles are a powerful feature to manage the access rights of many agents in a very simple and quick manner. They are particularly useful for large, complex support systems with a lot of agents, groups and queues. An example below explains when they should be used.
ja: Roles:"役割"は、強力な機能で、それにより非常にシンプルかつ迅速に多くの担当者のアクセス権を管理できます。それらは、多くの担当者、グループおよびキューを抱える大きく複雑なサポート・システムで特に役立ちます。下記の例でどのようなケースでご利用いただけば良いかを説明します。
ru: Роли являются мощным средством для простого и быстрого управления правами доступа множества агентов. Они особенно полезны для больших и сложных систем поддержки, с большим количеством агентов, групп и очередей. В приведенном ниже примере обьясняется как и когда они могут использоваться.
sw: Majukumu ni kiengele chenye nguvu cha kusimamia haki za ufikivu za mawakala wengi katika njia rahisi na ya haraka. Zina manufaa zaidi kwa mifumo mikubwa na changamano yenye mawakala wengi, makundi na foleni. Mfano chini unaelezea wakati gani zitumike.

source: Suppose that you have a system with 100 agents, 90 of them with access to a single queue called "support" where all support requests are handled. The "support" queue contains multiple sub queues. The other 10 agents have permission to access all queues of the system. These 10 agents dispatch tickets, watch the raw queue and move spam messages into the "junk" queue.
ja: あなたのシステムが100人の担当者を持つと仮定します。90 of them with access to a single queue called "support" where all support requests are handled. 単一のキューにアクセスを持つ100人中90人は、全てのサポート依頼を取り扱う「サポート」と呼ばれるます。「サポート」キューは複数の副キューを含みます。残りの10人の担当者は、システムの全てのキューへアクセスする許可を持っています。この10人の担当者は、チケットを発行し、未対応のキューを見て、「ジャンク」キューへスパム・メッセージを移動させます。
ru: Давайте представим, что у нас есть система, в которой зарегистрированно 100 агентов, 90 из них имеют доступ только к очереди "поддержка", в которой хранятся все запросы о поддержке. Очередь "поддержка" содержит несколько под очередей. Остальные 10 агентов имеют права доступа ко всем очередям, существующим в системе. Эти 10 агентов работают с заявками, просматривают "raw"-очередь и перемещают спам-сообщения в очередь "junk".
sw: Tuseme una mfumo wenye mawakala 100, 90 kati yao na wana ufikivu kwenye foleni moja iitwayo "msaada" ambapo maombi yote ya msaada yanashughulikiwa. Foleni "msaada" ina foleni ndogo nyingi ndani yake. Mawakala wengine 10 wana ruhusa ya kufikia foleni zote za mfumo. Hawa mawakala 10 wanatoa tiketi, wanaangalia foleni mbichi na kuhamisha ujumbe taka kwenda kwenye foleni "taka".

source: The company now opens a new department that sells some products. Order request and acceptance, order confirmation, bills, etc. must be processed, and some of the company's agents are supposed to do this using OTRS. The different agents have to get access to the new queues that must be created.
ja: その会社は、何らかの製品を販売する新規部署を開設します。注文依頼、受注、注文確認あるいは支払などの処理が必要となるでしょう。そして、会社の担当者のうちの数人は、OTRSを使用して、これをすることになります。異なる担当者は、生成される新規のキューへのアクセスを得なければいけません。
ru: В один день компания открывает новый отдел для продажи товаров. Запрос/принятие заказа, подтверждение, счета и т.д. должны быть обработаны, и некоторые из агентов компании должны делать это используя OTRS. Разным агентам нужно предоставить доступ к очередям, которые планируется создать.
sw: Kampuni sasa inafungua idara mpya inayouza bidhaa. Maombi na mapokezi ya oda, uthibitishaji wa oda, bili, na kadh. lazima zichakatishwe, na baadhi ya mawakala wa kampuni wanatakiwa kufanya hivi kwa kutumia OTRS. Mawakala tofauti wanatakiwa waweze kufikia kwenye foleni mpya ambazo lazima zitengenezwe.

source: Because it would take a long time to change the access rights for the individual agents manually, roles that define the different access levels can be created. The agents can then be added to one or more roles, with their access rights being modified automatically. If a new agent account is created, it is also possible to add this account to one or more roles.
ja: 個々の担当者のためにアクセス権を手動で変更するのに長い時間がかかるので、異なるアクセスレベルを定義する”役割”を作成することができます。その後、担当者は、自動的に修正済のアクセス権を持つことにより、1つ以上の役割に加えることができます。新規担当者アカウントが作成される場合、さらに、このアカウントを1つ以上の役割に加えることは可能です。
ru: Поскольку изменения вручную прав доступа для разных агентов займет много времени, то для определения различных уровней доступа можно создать роли. Затем, агенты могут быть добавлены к одной или нескольким ролям, таким образом их права будут изменены автоматически. Если будет создана новая учетная запись агента, ее также можно с легкостью добавить к одной или нескольким ролям.
sw: Kwa sababu itatumia muda mwingi kubadilisha haki za ufikivu za kila wakala mmoja kwa mikono, majukumu ambayo yanafafanua ngazi tofauti za ufikivu yanaweza kutengenezwa. Kisha mawakala wanaweza kuongezwa kwenye jukumu moja au zaidi, na haki zao za ufikivu zitabadilika kiotomatiki. Kama akaunti mpya ya wakala itatengenezwa, pia inawezekana kuongeza akaunti hii kwa jukumu moja au zaidi.

source: You can access the role management section (see Figure below ) by clicking the <emphasis>Roles</emphasis> link on the Admin page.
ja: 管理ページにある <emphasis>役割</emphasis> リンクをクリックすることで、役割管理セクション(下図参照)にアクセスできます。
ru: Для управления ролями перейдите по ссылке <emphasis>Роли</emphasis> в Панели Администрирования (см. нижеприведенный Рисунок).
sw: Unaweza kufikia kifungu cha usimamizi wa majukumu (ona Kielelezo chini) kwa kubofya kiungo cha <emphasis>Majukumu</emphasis> kwenye kurasa ya Msimamizi.

source: Role management
ja: 役割管理
ru: Управление Ролями
sw: Usimamizi wa jukumu

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="Adminarea roles - screenshot" scale="40" fileref="screenshots/admin-roles.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="管理者エリア 役割 - スクリーンショット" scale="40" fileref="screenshots/admin-roles.png"></graphic>

source: <emphasis>Figure: Role management.</emphasis>
ja: <emphasis>図: 役割管理。</emphasis>
ru: <emphasis>Рисуно: Управление Ролями.</emphasis>
sw: <emphasis>Kielelezo: Usimamizi wa jukumu.</emphasis>

source: As with agent and groups, roles once created can be deactivated but not deleted. To deactivate, set the Valid option to <emphasis>invalid</emphasis> or <emphasis>invalid-temporarily</emphasis>.
ja: 担当者とグループでそうであったように、いったん作成された役割は、非活性化することができるが削除することができません。非活性化するためには、有効オプションで<emphasis>「無効」</emphasis>あるいは<emphasis>「無効-暫定」</emphasis>にセットするします。
ru: Как в случае с агентом и группами, однажды созданные роли могут быть деактивированы, но не удалены. Чтобы отключить, установите опцию Действительный в значение <emphasis>не действительный</emphasis> или <emphasis>не действительный-временно</emphasis>.
sw: Kama ilivyo kwa wakala na makundi, majukumu yakishatengenezwa yanaweza kulemazwa na si kufutwa. Kulemaza, seti chaguo Halali kuwa <emphasis>batili</emphasis> au <emphasis>batili-kwa muda</emphasis>.

source: An overview of all roles in the system is displayed. To edit a role's settings, click on the role's name. In a fresh new OTRS installation, there are no roles defined by default. To register one, click on the "Add role" button, provide the needed data and submit it (see Figure below).
ja: システムでのすべての役割の概要が表示されます。役割設定を編集するためには、役割の名前をクリックしてください。新規のOTRSインストレーションでは、デフォルトで定義された役割はありません。役割を登録するためには、「役割追加」ボタンをクリックして、必要とされるデータを入力し、それを送信(Submit)して下さい(下記の図を参照)。
ru: Приведен обзор всех ролей в системе. Нажмите на имя роли, чтобы отредактировать ее настройки. По умолчанию, в новой, только что установленной системе OTRS нету предопределенных ролей. Чтобы создать новую, нажмите кнопку "Добавить роль", введите все необходимые данные и нажмите кнопку Отправить (см. нижеприведенный Рисунок).
sw: Mapitio ya majukumu yote kwenye mfumo yanaonyeshwa. Kuhariri mipangilio ya jukumu, bofya jina la jukumu. Kwenye usakinishaji mpya wa OTRS, hakuna majukumu yaliyofafanuliwa kama chaguo-msingi. KUsajili moja, bofya kitufe cha "Ongeza jukumu", toa data zinazotakiwa kisha wasilisha. (ona Kielelezo chini).

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="Adminarea roles - screenshot" scale="40" fileref="screenshots/add-role.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="管理者エリア 役割 - スクリーンショット" scale="40" fileref="screenshots/add-role.png"></graphic>

source: <emphasis>Figure: Adding a new role.</emphasis>
ja: <emphasis> 図:役割の新規追加。</emphasis>
ru: <emphasis>Рисунок: Добавление новой роли.</emphasis>
sw: <emphasis>Kielelezo: Kuongeza jukumu jipya.</emphasis>

source: To get an overview of all roles and agents in the system, click on the link Roles &lt;-&gt; Agents on the Admin page. You can also use filters to find a specific element. If you want to change the roles associated with an agent, just click on the agent's name (see Figure below). To change the agents associated with a role, click on the role you want to edit (see Figure below).
ja: システムですべての役割および担当者の概要を得るためには、管理者ページの役割リンク&lt;-&gt; 担当者をクリックして下さい。さらに、特定の要素を見つけるためにフィルタを使用することができます。担当者に関連付けられた役割を変更したい場合は、担当者の名前をクリックしてください(下記の図を参照)。役割に関連付けられた担当者を変更するためには、あなたが編集したい役割をクリックしてください(下記の図を参照)。
ru: Чтобы получить список всех ролей и агентов в системе, перейдите по ссылке Роли &lt;-&gt; Агенты в Панели Администрирования. Также, для поиска конкретного элемента можно использовать фильтры. Если необходимо изменить роли связанные с определенным агентом, просто кликните на имя агента (см. нижеприведенный Рисунок). Чтобы изменить агентов, связанных с ролью, нажмите на роль, которую нужно отредактировать (см. нижеприведенный Рисунок).
sw: Kupata mapitio ya majukumu yote na mawakala katika mfumo, bofya kwenye kitufe Majukumu &lt;-&gt; Mawakala kwenye kurasa ya Msimamizi. Pia unaweza kutumia vichujio kutafuta elementi maalumu. Ukitaka kubadilisha majukumu ya wakala husika, bofya kwenye jina la wakala (ona Kielelezo chini). Kubadilisha mawakala wanaohusika na jukumu, bofya kwenye jukumu unalotaka kuhariri (ona Kielelezo chini).

source: Agent Role management
ja: 担当者役割管理
ru: Управления Ролями Агентов
sw: Usimamizi wa jukumu la wakala

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="Adminarea roles and agents - screenshot" scale="40" fileref="screenshots/admin-roles-agents-relation.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="管理者エリア 役割と担当者 - スクリーンショット" scale="40" fileref="screenshots/admin-roles-agents-relation.png"></graphic>

source: <emphasis>Figure: Change the Roles associated with an Agent.</emphasis>
ja: <emphasis>図：担当者と関連付けられた役割の変更</emphasis>
ru: <emphasis>Figure: Изменение Ролей, связанных с Агентом.</emphasis>
sw: <emphasis>Kielelezo: Badilisha majukumu yanayomhusu wakala.</emphasis>

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="Adminarea groups and agents - screenshot" scale="40" fileref="screenshots/admin-roles-agents-relation2.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="管理者エリア グループと担当者 - スクリーンショット" scale="40" fileref="screenshots/admin-roles-agents-relation2.png"></graphic>

source: <emphasis>Figure: Change the Agents associated with a specific Role.</emphasis>
ja: <emphasis>図：特別な役割と関連付けられた担当者の変更</emphasis>
ru: <emphasis>Figure: Изменение Агентов, связанных с конкретной Ролью.</emphasis>
sw: <emphasis>Kielelezo: Badilisha mawakala wanaohusika na jukumu maalumu.</emphasis>

source: To get an overview of all roles and groups in the system, click on the link Roles &lt;-&gt; Groups on the Admin page. You will see a similar screen as the one shown in the Figure. You can also use filters to find a specific entity.
ja: システムでのすべての役割およびグループの概要を得るためには、管理者ページのリンク・役割&lt;-&gt;グループをクリックしてください。図で表示されたと同様の画面が見えることでしょう。さらに、特定のエンティティ（実体）を見つけるためにフィルタを使用することができます。
ru: Чтобы получить список всех ролей и групп системы, перейдите по ссылке Роли &lt;-&gt; Группы на Панели Управления. На экране появится страница, приведенная ниже на Рисунке. Для поиска конкретного элемента также можно использовать фильтры.
sw: Kupata mapitio ya majukumu yote na makundi kwenye mfumo, bofya kwenye Majukumu &lt;-&gt; Makundi kwenye ukurasa wa Msimamizi. Utaona skrini inayofanana na iliyoonyeshwa kwenye Kielelezo. Unaweza pia kutumia vichujio kutafuta chombo fulani.

source: Role Group management
ja: 役割グループの管理
ru: Управление связью Роль Группа
sw: Usimamizi wa kundi la majukumu

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="Adminarea roles and groups - screenshot" scale="40" fileref="screenshots/admin-roles-groups.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="管理者エリア 役割とグループ - スクリーンショット" scale="40" fileref="screenshots/admin-roles-groups.png"></graphic>

source: <emphasis>Figure: Manage Roles-Groups relations.</emphasis>
ja: <emphasis>役割グループ関係の管理</emphasis>
ru: <emphasis>Figure: Управление отношениями Роли-Группы.</emphasis>
sw: <emphasis>Kielelezo: Simamia mahusiano ya Makundi-Majukumu.</emphasis>

source: To define the different access rights for a role, click on the name of a role or a group (see below the Figures 5.13 and 5.14, respectively).
ja: 役割用の異なるアクセス権を定義するためには、役割またはグループの名前をクリックしてください(図5.13および5.14以下にそれぞれ参照)。
ru: Чтобы определить различные права доступа для роли, нажмите на имя роли или группы (см. ниже Рисунок 5.13 и 5.14, соответственно).
sw: Kufafanua haki tofauti za ufikivu kwa jukumu, bofya kwenye jina la jukumu au kundi (ona chini Vielelezo 5.13 na 5.14, kwa mtiririko).

source: Change Group relations for a Role
ja: 役割のためのグループ関係の変更
ru: Изменение связи между Группой и Ролью
sw: Badilisha mahusiano ya Makundi kwa Jukumu

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="Adminarea roles and groups - screenshot" scale="40" fileref="screenshots/groups-roles-relations.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="管理者エリア 役割とグループ - スクリーンショット" scale="40" fileref="screenshots/groups-roles-relations.png"></graphic>

source: <emphasis>Figure: Change Group relations for a Role.</emphasis>
ja: <emphasis>図: 役割のためのグループ関係の変更</emphasis>
ru: <emphasis>Рисунок: Изменение связти между Группой и Ролью.</emphasis>
sw: <emphasis>Kielelezo: Badilisha mahusiano ya Makundi kwa Jukumu.</emphasis>

source: Change Role relations for a Group
ja: グループ用役割関係の変更
ru: Изменение отношения Роли к Группе
sw: Badilisha mahusiano ya Majukumu kwa Kundi

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="Adminarea roles and groups - screenshot" scale="40" fileref="screenshots/groups-roles-relations2.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="管理者エリア 役割とグループ - スクリーンショット" scale="40" fileref="screenshots/groups-roles-relations2.png"></graphic>

source: <emphasis>Figure: Change Role relations for a Group.</emphasis>
ja: <emphasis>図: グループ用役割関係の変更</emphasis>
ru: <emphasis>Рисунок: Изменение отношения Роли к Группе.</emphasis>
sw: <emphasis>Kielelezo: Badilisha mahusiano ya Majukumu kwa Kundi.</emphasis>

source: Customers and Customer Groups
ja: 顧客および顧客グループ
ru: Клиенты и Группы Клиентов
sw: Wateja na Makundi ya Wateja

source: Customers
ja: 顧客
ru: Клиенты
sw: Wateja

source: OTRS supports different types of users. Using the link "Customers" (via the navigation bar, or the Admin page), you can manage the accounts of your customers (see Figure below), who can log into the system via the Customers interface (customer.pl). Through this interface, your customers can not only create tickets but also review their past tickets for new updates. It is important to know that a customer is needed for the ticket history in the system.
ja: OTRSは、異なるタイプのユーザをサポートします。顧客リンク(ナビゲーション・バー、あるいは管理者ページから)を使用すると、顧客(下記の図を参照)のアカウントを管理することができます。顧客・インターフェース(customer.pl)経由でシステムにログインすることができます。このインターフェースを通って、あなたの顧客はチケットを作成することができるだけでなく、更新するために過去のチケットをレビューすることもできます。顧客はシステムでのチケット履歴を必要としていることを知ることは重要です。
ru: OTRS поддерживает различные типы пользователей. Используя ссылку "Клиенты" (с помощью навигационной панели, или на странице Панели Администратора), можно управлять учетными записями клиентов (см. нижеприведенный Рисунок), которые могут войти в систему используя Пользовательский веб-интерфейс (customer.pl). Используя этот интерфейс клиенты могут создавать и просматривать состояние своих заявок и изменений в них. Важно помнить что клиенты необходимы в системе для истории заявок.
sw: OTRS ina msaada kwa watumiaji wa aina nyingi. Kwa kutumia kiungo "Wateja" (kupitia mwambaa wa uabiri, au kurasa ya Msimamizi), unaweza kusimamia akaunti za wateja (ona Kielelezo chini), ambao wanaweza kuingia kwenye mfumo kupitia kiolesura cha Wateja (mteja.pl). Kupitia kiolesura hiki, wateja wako hawataweza tu kutengeneza tiketi lakini pia kupitia tiketi zao za nyuma kwa usasisho mpya. Ni muhimu kujua kwamba mteja anahitajika kwa ajili ya historia ya tiketi kwenye mfumo.

source: Customer management
ja: 顧客管理
ru: Управления Клиентами
sw: Usimamizi wa Mteja

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="Adminarea customer - screenshot" scale="40" fileref="screenshots/admin-customer.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="「管理者エリア 顧客 - スクリーンショット」" scale="40" fileref="screenshots/admin-customer.png"></graphic>

source: <emphasis>Figure: Customer management.</emphasis>
ja: <emphasis>図: 顧客管理</emphasis>
ru: <emphasis>Рисунок: Управление клиентами.</emphasis>
sw: <emphasis>Kielelezo: Usimamizi wa Mteja.</emphasis>

source: You can search for a registered customer, or edit their settings by clicking on their name. You also have the possibility to change the customer back-end, for further information please refer to the chapter about <link linkend="external-backends">external back-ends</link>.
ja: 登録した顧客を検索し顧客名をクリックすることで設定を編集できます。顧客のバックエンドを変更することもできます。詳細は<link linkend="external-backends">外部バックエンド</link>の章を参照下さい。
ru: Нажав на имя клиента, по зарегистрированным клиентам можно производить поиск, редактировать их данные. Также есть возможность изменить клиентский back-end, за более подробной информацией обращайтесь к главе <link linkend="external-backends">внешние хранилища данных</link>.
sw: Unaweza kutafuta mteja aliyesajiliwa, au kuhariri miangilio yake kwa kubofya jina lake. Pia una uwezo wa kubadilisha mazingira ya nyuma ya mteja, kwa maelezo zaidi tafadhali rejea kwenye sura kuhusu <link linkend="external-backends">mazingira ya nyuma ya nje</link>.

source: To create a new customer account, click on the "Add customer" button (see Figure below). Some of the fields are mandatory, i.e., they have to contain values, so if you leave one of those empty, it will be highlighted in red.
ja: 新規顧客アカウントを作成するためには、「顧客追加」ボタンをクリックしてください(下記の図を参照)。フィールドのうちのいくつかは入力必須項目です。つまり、フィールドには値の入力が必要です。したがって、必須入力項目に入力漏れがあれば、赤でハイライトされます。
ru: Чтобы создать новую учетную запись клиента, нажмите кнопку "Добавить клиента" (см. нижеприведенный Рисунок). Некоторые поля являются обязательными, т.е они должи содержать данные, поэтому если вы оставите их пустыми, они будут выделены красным цветом.
sw: Kutengeneza akaunti mpya ya mteja, bofya kitufe cha "Ongeza mteja" (Ona kielelezo chini). Baadhi ya maeneo ni ya lazima, mf. inabidi ziwe na thamani, kwahiyo ukiziacha bila kujaza zitaonyeshwa kwa rangi nyekundu.

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="Adminarea customer - screenshot" scale="40" fileref="screenshots/add-customer.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="管理者エリア 顧客 - スクリーンショット" scale="40" fileref="screenshots/add-customer.png"></graphic>

source: <emphasis>Figure: Adding a customer.</emphasis>
ja: <emphasis>図: 顧客追加</emphasis>
ru: <emphasis>Рисунок: Добавление клиента.</emphasis>
sw: <emphasis>Kielelezo: Kuongeza mteja.</emphasis>
