Repository: DSigmund/doc-admin
Catalog: i18n/doc-admin.*.po
Languages: ja, ru, sw

source: Connect Activities using Transitions
ja: 推移を使用して、アクティビティを接続します。
ru: Связать Активности используя Переходы
sw: Unganisha shughuli kwa kutumia Mapito

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="process-management - screenshot" scale='40' fileref="screenshots/pm-canvas-drag-transition2.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="プロセス - 管理 - スクリーンショット" scale='40' fileref="screenshots/pm-canvas-drag-transition2.png"></graphic>

source: <emphasis>Figure: Connect Activities using Transitions.</emphasis>
ja: <emphasis>図:推移を使用して、アクティビティを接続します</emphasis>
ru: <emphasis>Рисунок: Связать Активности используя Переходы.</emphasis>
sw: <emphasis>Kielelezo: Unganisha shughuli kwa kutumia Mapito.</emphasis>

source: Drag the needed Transition Actions from Available Transition Actions pool and drop them into the Assigned Transition Actions pool and click on submit button.
ja: 必要な推移アクションを利用可能な推移アクションプールからドラッグし、それらを割り当てした推移アクションプールにドロップし、送信ボタンをクリックします。
ru: Захватите мышью требуемые Активности Перехода из списка Доступных Активностей Перехода и перетащите в список Назначенных Активностей Перехода и затем нажмите кнопку Отправить.
sw: Kokota Vitendo vya Mpito vinavyotakiwa kutoka bwawa la Vitendo vya Mpito Vinavyopatikana na dondosha katika bwawa la Vitendo vya Mpito Vilivyogawiwa kisha bofya kitufe cha kuwasilisha.

source: Assign Transition Actions
ja: 推移アクションを割り当てます。
ru: Назначить Действия Перехода
sw: Vitendo vya mpito vilivyogawiwa

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="process-management - screenshot" scale='40' fileref="screenshots/pm-edit-path.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="プロセス - 管理 - スクリーンショット" scale='40' fileref="screenshots/pm-edit-path.png"></graphic>

source: <emphasis>Figure: Assign Transition Actions.</emphasis>
ja: <emphasis>図:推移アクションを割り当てます</emphasis>
ru: <emphasis>Рисунок: Назначение Действий Перехода.</emphasis>
sw: <emphasis>kielelezo: Vitendo vya mpito vilivyogawiwa.</emphasis>

source: Then back in the main process edit screen click on save button below the canvas to save all other changes.
ja: メインプロセス編集画面に戻って（キャンバス下にある他のすべての変更を保存するための）保存ボタンをクリックします。
ru: Затем, вернитесь к главному окну редактирования Процесса и нажмите кнопку Сохранить под схемой и сохраните все сделанные изменения.
sw: Kisha tukirudi kwenye skrini ya kuhariri mchakato wa msingi bofya kwenye kitufe cha kuhifadhi chini ya turubai kuhifadhi mabadiliko mengine yote.

source: Complete the "path"" adding the following Activities, Transitions and Transition Actions:
ja: 次のアクティビティ、推移、推移アクションを追加することで「パス」を完成します。
ru: Завершите "путь" добавляя следующие Активности, Переходы и Действия Переходов:
sw: Kamilisha "Njia" kwa kuongeza Shughuli zifuatazo, Mapito na Vitendo vya Mpito:

source: Recording the demand until "Approval"
ja: 「承認」まで依頼・要求を記録すること
ru: Запись спроса до значения "Approval"
sw: Mahitaji yanarekodiwa mpaka "Kibali"

source: Starting point: Activity: Recording the demand (A1)
ja: 出発点:アクティビティ:依頼・要求の記録(A1)
ru: Начальная точка: Activity: Запись запроса (A1)
sw: Pointi ya kuanza: Shughuli: Mahitaji yanarekodiwa (A1)

source: Possible Transition: Approval (T1)
ja: 可能な推移:承認(T1)
ru: Возможный Переход: Утверждение (T1)
sw: Mpito uwezekanao: Kibali (T1)

source: If the condition of this activity is fulfilled, the ticket will move to Activity: Approval (A2)
ja: この活動の条件が満たされれば、チケットはアクティビティに移ります:承認(A2)
ru: Если условие этой Активности выполняется, заявка будет перемещена к Активность: Утверждение (A2)
sw: Kama masharti ya hii shughuli yamekamilishwa, tiketi itapelekwa kwa Shughuli: Kibali (A2)

source: Additionally, the following TransitionActions are executed:
ja: さらに、次の推移アクションが実行されます:
ru: Кроме того выполнится следующее действие TransitionActions:
sw: Kwa nyongeza, VitendoVyaMpito vifwatavyo vina tekelezeka

source: "Moving the ticket into the 'Management' Queue" (TA1)
ja: 「「管理 」キューへチケットを移動させる」(TA1)
ru: "Переместить заявку в очередь 'Менеджмент' " (TA1)
sw: "Kuhamisha tiketi kwenda kwenye foleni ya 'Usimamizi'" (TA1)

source: "Set ticket responsible to 'manager'" (TA2)
ja: 「チケットの責任者を「マネージャー」に設定する」(TA2)
ru: "Назначить ответственным за заявку 'manager'" (TA2)
sw: "Seti tiketi iwe jukumu la 'Meneja'" (TA2)

source: The Activity: "Recording the demand" (A1) is a defined step of the process ticket, where there is the possibility for the Transition: "Approval" (T1). If this applies, the ticket will move to the next Activity: "Approval" (A2), and the Transition Actions: "Moving the ticket into the 'Management' Queue" (TA1) and "Set ticket responsible to 'manager'" (TA2) are executed. In the Activity: "Approval" (A2), the Activity Dialogs: "Approval denied" (AD2) and "Approved" (AD3) are available.
ja: アクティビティ:「依頼・要求を記録する」（A1）が プロセス・チケットの定義されたステップです。そのステップでは、推移：「承認」（T1)の可能性があります。これが適用されれば、チケットは次のアクティビティ:「承認」(A2)に移ります。 そして推移アクション:「「管理」キューへチケットを移動させる」(TA1)こと、及び「チケットの責任者として「マネージャー」を設定する」(TA2)が実行されます。アクティビティの中で:「承認」(A2)(アクティビティ・ダイアログ)、「承認拒否」(AD2)そして、「承認済」(AD3)が利用可能です。
ru: Активность: "Запись запроса" (A1) это определенный этап процессной заявки, который имеет возможные Переходы: "Approval/Утверждение" (T1). После выполнения, заявка переходит к следующей Активности: "Approval/Утверждение" (A2), и Действия Перехода: "Moving the ticket into the 'Management' Queue/Перемещение заявки в очередь 'Management' " (TA1) и "Set ticket responsible to 'manager'/Назначение ответственным 'manager'" (TA2) выполняются. В Активности: "Approval" (A2), доступны Диалоги: "Approval denied/Отказано" (AD2) and "Approved/Согласовано" (AD3).
sw: Shughuli: "Kurekodi mahitaji" (A1) ni hatua iliyofafanuliwa ya mchakato wa tiketi, ambapo kuna uwezekano wa mpito: "Kibali" (T1). Kama hii itakubali tiketi itapelekwa kwenye shughuli inayofuata: "Kibali" (A2), na Vitendo vya Mpito: "Kupeleka tiketi kwenye foleni ya 'Usimamizi'" (TA1) na "Seti tiketi iwe jukumu la'Meneja'" (TA2) zinatekelezeka. Kwenye Shughuli: "Approval" (A2), Maongezi ya Shughuli: "Kibali kimekataliwa" (AD2) na "Kubaliwa" (AD3) zinapatikana.

source: Starting Point: Activity "Approval" (A2)
ja: 出発点:アクティビティ：「承認」(A2)
ru: Начальная точка: Activity/Активность "Approval/Утверждение" (A2)
sw: Pointi ya Kuanza: Shughuli "Kibali" (A2)

source: Possible Transitions:
ja: 可能な推移:
ru: Возможные Транзакции:
sw: Mapito yawezekanayo:

source: If this matches, the process ticket will move to Activity:"Process complete" (A5).
ja: これが一致すれば、プロセス・チケットはアクティビティに移ります:「プロセス完了」(A5)
ru: Если верно, процессная заявка перейдет к Activity/Действию:"Process complete/Процесс завершен" (A5).
sw: Kama hii inalingana, tiketi ya mchakato itapelekwa kwa Shughuli: "Mchakato umekamilika" (A5).

source: Additionally, the following Transition Actions are executed:
ja: さらに、次の推移アクションが実行されます:
ru: Кроме того выполнится следующее TransitionActions/Действия Перехода:
sw: Kwa nyongeza, Vitendo Vya Mpito vifwatavyo vina tekelezeka:

source: "Move process ticket to the 'Employees' Queue" (TA3)
ja: 「「従業員」キューへプロセス・チケットを移動」(TA3)
ru: "Переместить процессную заявку в очередь 'Employees'" (TA3)
sw: "Peleka tiketi ya mchakato kwenye Foleni ya 'Wateja'" (TA3)

source: "Set ticket responsible to 'Employee'" (TA4)
ja: 「チケットの責任者を「従業員」設定」(TA4)
ru: "Установить ответственного за заявку в 'Employee'" (TA4)
sw: "Seti tiketi yenye jukumu kwa 'Mteja'" (TA4)

source: If this matches, the process ticket will move to Activity: "Order" (A3).
ja: これが一致すれば、プロセス・チケットはアクティビティ：「注文」に移ります（A3）
ru: Если верно, процессная заявка перейдет к Activity/Действию: "Order/Заказ" (A3).
sw: Kama hii inalingana, tiketi ya mchakato itapelekwa kwa Shughuli: "Oda" (A3).

source: Additionally, the following Transition Action is executed:
ja: さらに次の推移アクションが実行されます
ru: Дополнительно, следующие Transition Action/Действия Перехода будут выполнены:
sw: Kwa nyongeza, Kitendo cha Mpito kifwatacho kitatekelezwa.

source: "Move process ticket to 'Purchasing' Queue" (TA5)
ja: 「プロセス・チケットを「購入」キューに移動します。」（TA5)
ru: "Переместить процессную заявку в очередь 'Purchasing'" (TA5)
sw: "Peleka tiketi ya mchakato kwa Foleni ya 'Manunuzi'" (TA5)

source: We can see that from the current Activity, which defines a step of the process ticket, there are one or more possibilities for Transition which have exactly one target Activity (and possibly one or more Transition Actions).
ja: プロセスチケットのステップを定義する現在のアクティビティを見ればわかることがあります。推移には1個以上の可能性があり、それはまさにひとつのターゲット・アクティビティです。（そしておそらく1個以上の推移アクションです。）
ru: Можно видеть, что текущая Activity/Активность, которая определяет шаг процессной заявки имеет одну или более возможностей для Transition/Перехода, который, в свою очередь, имеет одну единственную целевую Activity/Активность (и, возможно, одно или более Transition Actions/Действие Перехода).
sw: Tunaweza kuona kutoka kwenye shughuli za sasa, ambayo inafafanua hatua katika mchakato wa tiketi, kuna uwezekano mmoja au zaidi wa mpito ambao una lengo moja la shughuli (na ikiwezekana Kitendo kimoja au zaidi cha mpito)

source: Starting Point: Activity "Order" (A3)
ja: 開始点：アクティビティ「注文」（A3)
ru: Начальная точка: Activity/Активность "Order/Заказ" (A3)
sw: Pointi ya kuanza: Shughuli "Oda" (A3)

source: If this matches, the process ticket will move to Activity: "Incoming" (A5).
ja: これが一致すれば、プロセス・チケットはアクティビティに移るでしょう:「入信」(A5)
ru: Если верно, процессная заявка перейдет к Activity/Действию: "Incoming/Поступление" (A5).
sw: Kama hii inalingana, tiketi ya mchakato itapelekwa kwa Shughuli: "zinazoingia" (A5).

source: "Move process ticket to 'Post office' Queue" (TA6)
ja: 「「郵便局」キューにプロセス・チケットを移動させてください」(TA6)
ru: "Переместить процессную заявку в очередь 'Post office' " (TA6)
sw: "Peleka tiketi za mchakato kwa Foleni ya 'Ofisi ya posta'" (TA6)

source: Incoming
ja: Incoming（入信）
ru: Входящие
sw: "Zinazoingia"

source: Starting Point: Activity "Incoming" (A4)
ja: 出発点：アクティビティ「入信」A4
ru: Начальная точка: Activity/Действие: "Incoming/Поступление" (A4).
sw: Pointi ya Kuanza: Shughuli "Zinazoingia" (A4)

source: The complete Path for the book ordering Process will then look like this:
ja: 本の注文プロセスの完全なパスはこのように見えるでしょう。
ru: Полный путь к Процессу покупкпи книги будет иметь следующий вид:
sw: Njia kamili ya mchakato wa kuoda vitabu itaonekana kama hivi:

source: Book ordering complete process path
ja: 本の注文の完全なプロセス・パス
ru: Законченная/полная схема процесса заказа книги.
sw: Njia kamili ya mchakato wa kuoda vitabu

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="process-management - screenshot" scale='40' fileref="screenshots/pm-edit-process.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="プロセス - 管理 - スクリーンショット" scale='40' fileref="screenshots/pm-edit-process.png"></graphic>

source: <emphasis>Figure: Book ordering complete process path.</emphasis>
ja: <emphasis>図：本の注文の完全なプロセス・パス</emphasis>
ru: <emphasis>Рисунок: Полная схема процесса заказа книги.</emphasis>
sw: <emphasis>Kielelezo: Njia kamili ya mchakato wa kuoda vitabu.</emphasis>

source: After you finish the process path please click on "Save" button in the lower part of the canvas and then click on "Synchronize All Processes" button. This will gather all processes information form the Database and create a cache file (in Perl language). This cache file is acctually the processes configuration that the system will use to create or use process tickets.
ja: プロセス・パスを終了した後、キャンバスの下方部分中の「セーブする」ボタンをクリックして、次に、「全てのプロセスを同期」ボタンをクリックしてください。これはデータベースからすべてのプロセス情報を収集しキャッシュ・ファイル(Perl言語で)を作成します。このキャッシュ・ファイルは実際、プロセス・チケットを作成するか使用するためにシステムが使用するプロセス・構成です。
ru: Псоле окончания прорисовки Процесса нажмите кнопку "Сохранить", в нижней части схемы и затем, нажмите "Синхронизировать все процессы". При этом вся информация по процессам будет собрана из базы данных и будет создан кэш-файл (на языке Perl). Этот файл содержит конфигурацию процессов, которая будет использоваться для создания и обработки процессных заявок.
sw: Baada ya kumaliza njia ya mchakato tafadhali bonyeza kitufe cha "hifadhi" upande wa chini wa turubai kisha bonyeza kitufe "Landanisha Michakato yote". Hii itakusanya taarifa zote za michakato kutoka kwenye hifadhidata na kutengeneza faili la hifadhi muda (kwa lugha ya Perl). Hii hifadhi muda ni sanidi za michakato ambazo mfumo utatumia kutengeneza au kutumia tiketi za michakato.

source: Any change that is made of the process (in the GUI) will require to re-synchronize the cache file in order to get the change reflected in the system.
ja: プロセス(GUIの中の)に行なわれるどんな変更も、システムで変更を反映するために再度キャッシュ・ファイルを同期させる必要があります。
ru: Все изменения сделанные в Процессе (в интерфейсе админа) потребуют пересинхронизации файла кэша, чтобы изменения были отражены в системе.
sw: Mabadiliko yeyote yaliyofanyika kwenye michakato (katika kiolesura michoro cha mtumiaji) yatahitaji kurudia kulandanisha faili la hifadhi muda ili mabadiliko yawepo kwenye mfumo.

source: It is also possible to import the whole process from a YAML file, but it is still necessary to create all Dynamic Fields, Users, Queues, etc that are needed by each process before the import.
ja: さらに、YAMLファイルから全工程をインポートすることは可能です。しかし、インポートの前に各プロセスによって必要な動的フィールド、ユーザ、キューなどをすべて作ることがまだ必要です。
ru: Также, возможно импортировать процесс целиком из YAML файла, но обязательно до этого создать все динамические поля, пользователей, очереди и пр. необходимые для каждого процесса.
sw: Pia inawezekana kuagiza mchakato mzima kutoka faili la YAML, lakini ni muhimu kutengeneza Sehemu zote Zinazobadilika, Watumiaji, Foleni, na kadh. ambazo zinahitajika na kila mchakato kabla ya kuagiza.

source: Notice that if the process requires the use of ACLs those are also needed to be set manually.
ja: プロセスがACLの使用を要求する場合、手動でセットされることも必要であることに注目してください。
ru: Обратите внимание, что если процесс требует использования ACL, они также должны быть созданы вручную.
sw: Tambua kwamba kama mchakato unahitaji utumiaji wa ACL hizo zinahitaji pia kusetiwa kwa mikono.

source: The follwing is the complete YAML file for the book ordering process example:
ja: 以下は本の注文の処理例のための完全なYAMLファイルです:
ru: Ниже приведен полный текст YAML файла для процесса заказа книги из примера:
sw: Lifwatalo ni faili kamili la YAML kwa ajili ya mfano wa mchakato wa kuoda kitabu:

source: Process configuration reference
ja: プロセス構成リファレンス
ru: Эталонная последовательность настройки процесса
sw: Rejea ya sanidi ya mchakato

source: Process
ja: プロセス
ru: Процесс
sw: Mchakato

source: A Process models the path of a workflow/process. The waypoints on this path can be Activities or Transitions, we'll talk about these later.
ja: 1つのプロセスはワークフロー/プロセスのパスを形成します。このパス上の中間地点はアクティビティまたは推移になりえます。これらについては後程お話します。
ru: Процесс моделирует путь прохождения задач процесса. Путевыми точками на этом пути могут быть Активности или Переходы, мы расскажем об этом позже.
sw: Mchakato unatengeneza njia ya mtiririko wa kazi/mchakato. Pointi za njia katika mwelekeo huu zinaweza kuwa Shughuli au Mapito, tutaongelea haya baadaye.

source: Process configuration
ja: プロセス構成
ru: Настройка Процесса
sw: Sanidi ya mchakato

source: The Process configuration can be done in the file <filename>Kernel/Config.pm</filename> but it is strongly recommended to create new files like <filename>Kernel/Config/Files/MyProcess.pm</filename>. notice that the GUI generates the file <filename>Kernel/Config/File/ZZZProcessManagement</filename> please avoid to use that filename, otherwise it will be overwritten when you sync processes. Let's see an example process configuration (from process cache file):
ja: プロセス構成は、ファイル <filename>Kernel/Config.pm</filename>中で行われます。しかし <filename>Kernel/Config/Files/MyProcess.pm</filename> のような新しいファイルを作成することが強く推奨されます。GUIがファイル <filename>Kernel/Config/File/ZZZProcessManagement</filename> を生成することに気づいて下さい。そのファイル名を使用することは回避してください。そうでなければ、同期プロセスの際ににそれは上書きされるでしょう。例：プロセス構成(プロセス・キャッシュ・ファイルからの)を見ましょう:
ru: Конфигурация процесса может быть выполнена в файле <filename>Kernel/Config.pm</filename>, но мы настоятельно рекомендуем создать новый файл <filename>Kernel/Config/Files/MyProcess.pm</filename>. Заметьте, что генератор процессов в GUI создает файл <filename>Kernel/Config/File/ZZZProcessManagement</filename> , поэтому избегайте использование этого имени, иначе он будет перезаписан при синхронизации процессов. Рассмотрим пример конфигурации процесса (из кэш файла):
sw: Usanidi wa mchakato unaweza kufanyika kkwenye faili <filename>Kernel/Config.pm</filename> lakini inashauriwa kutengeneza mafaili mapya kama <filename>Kernel/Config/Files/MyProcess.pm</filename>. Ona kwamba GUI inatengeneza faili <filename>Kernel/Config/File/ZZZProcessManagement</filename> tafadhali usitumie jina hilo la faili, la sivyo litaandikwa juu yake ukifanya ulandanishi wa michakato. Tuone mfano wa mchakato wa usanidi (kutoka kwenye faili la hifadhi muda ya mchakato):

source: $Self->{'Process'} = { 'P1' => { Name => 'Book order', CreateTime => '16-02-2012 13:37:00', CreateBy => '1', ChangeTime => '17-02-2012 13:37:00', ChangeBy => '1', State => 'Active', StartActivity => 'A1', StartActivityDialog => 'AD1', Path => { 'A1' => { 'T1' => { ActivityEntityID => 'A2', }, }, 'A2' => { 'T2' => { ActivityEntityID => 'A3', }, }, }, }, 'P2' => { Name => 'IT order', CreateTime => '26-02-2012 13:37:00', CreateBy => '1', ChangeTime => '27-02-2012 13:37:00', ChangeBy => '1', State => 'Active', StartActivity => 'A2', StartActivityDialog => 'AD2', Path => { 'A2' => { 'T3' => { ActivityEntityID => 'A4', }, }, }, } };
ja: $Self->{'Process'} = { 'P1' => { Name => '本の注文', CreateTime => '16-02-2012 13:37:00', CreateBy => '1', ChangeTime => '17-02-2012 13:37:00', ChangeBy => '1', State => 'Active', StartActivity => 'A1', StartActivityDialog => 'AD1', Path => { 'A1' => { 'T1' => { ActivityEntityID => 'A2', }, }, 'A2' => { 'T2' => { ActivityEntityID => 'A3', }, }, }, }, 'P2' => { Name => 'IT 注文', CreateTime => '26-02-2012 13:37:00', CreateBy => '1', ChangeTime => '27-02-2012 13:37:00', ChangeBy => '1', State => 'Active', StartActivity => 'A2', StartActivityDialog => 'AD2', Path => { 'A2' => { 'T3' => { ActivityEntityID => 'A4', }, }, }, } };

source: The name of the process, this can be selected by the agent when creating a new process ticket.
ja: プロセスの名前、新しいプロセス・チケットを作成する場合、担当者はこれを選択することができます。
ru: Имя Процесса, оно может быть выбрано агентом при создании новой процессной заявки.
sw: Jina la mchakato, hii inaweza kuchaguliwa na wakala wakati wa kutengeneza tiketi ya mchakato mpya.

source: The time when the process was created.
ja: プロセスの作成時刻。
ru: Время, когда процесс был создан.
sw: Muda ambao mchakato ulitengenezwa.

source: The UID of the user creating the process.
ja: プロセスを作成するユーザのUID
ru: UID пользователя, создавшего этот Процесс
sw: UID ya mtumiaji anayetengeneza mchakato.

source: The time when the process was changed.
ja: プロセスの変更時刻
ru: Время, когда процесс был изменен.
sw: Muda ambao mchakato ulibadilishwa.

source: The UID of the user who made the last change to the process.
ja: プロセスの最終変更ユーザのUID
ru: UID пользователя, который вносил последние изменения в процесс.
sw: UID ya mtumiaji aliyeweka mabadiliko ya mwisho.

source: Defines the state of a process. Possible values:
ja: プロセスの状態を定義します。可能な値:
ru: Задает состояние процесса. Возможные значения:
sw: Inafafanua hali ya mchakato. Thamani ziwezekanazo:

source: 'Active' are all processes which can be used in new process tickets.
ja: 「Active（アクティブ）」は、新しいプロセス・チケットの中で使用することができる全てのプロセスです。
ru: 'Active' / Активный - все процессы, которые могут быть использованы в новых процессных заявках.
sw: 'Amilifu' ni michakato yote ambayo inaweza kutumika katika tiketi mpya za mchakato.

source: 'FadeAway' are processes which cannot be selected any more for new tickets, but existing tickets still can use the process.
ja: 「FadeAway（消失）」は、 もはやさらなる新規チケットを選択できないプロセスです。既存チケットはまだプロセスを使用可能です。
ru: 'FadeAway' / Исчезающие - это процессы, которые нельзя выбрать более для новых заявок, но существующие заявки могут продолжать их использовать.
sw: 'KwanjukaMbali' ni michakato ambayo haiwezi kuchaguliwa tena kwa tiketi mpya, lakini tiketi zilizopo zinaweza kutumia huo mchakato.

source: 'Inactive' processes are deactivated and cannot be used for new or existing tickets.
ja: 「Inactive」（インアクティブ）は、不活性化されたプロセスです。新規も既存チケットも使用できません。
ru: 'Inactive' / Неактивные - деактивированные процессы. Они не могут быть более использованы ни в новых, ни в существующих заявках.
sw: 'Isiyo Amilifu' michakato inalemazwa na haiwezi kutumika kwa tiketi mpya au zizlizopo.

source: When creating a new process ticket, a StartActivity must be defined. As soon as the ticket is created, this Activity will be set and used as the base for the first transition checks.
ja: 新しいプロセス・チケットを作成する場合、StartActivityを定義しなければいけません。チケットが作成されるとすぐに、このアクティビティは最初の推移チェック用の基礎としてセットされ使用されるでしょう。
ru: При создании новой процессной заявки, StartActivity / Начальная Активность должна быть задана.Как только заявка будет создана, эта Активность будет инициирована и использована как начальная точка для первых проверок переходов.
sw: Wakati wa kutengeneza mchakato mpya wa tiketi, lazima ufafanue ki AnzaShughuli. Mara tu tiketi itakapotengenezwa, hiishughuli ita setiwa na kutumika kama msingi wa kaguzi za kwanza za mpito.

source: For new process tickets, a StartActivityDialog must be defined. This will be shown when creating a new process ticket (after the process was selected). At this point, the ticket does not exist yet, it will be created after submitting the StartActivityDialog.
ja: 新しいプロセス・チケットでは、StartActivityDialogは定義されなければいけません。新しいプロセス・チケット(プロセスが選択された後)を作成する時、これが示されるでしょう。このポイントでは、チケットはまだ存在しません、それはStartActivityDialogを提出した後に作成されるでしょう。
ru: Для новой процессной заявки должен быть задан StartActivityDialog/Начальный Диалог Активности. Он будет показан при создании новой процессной заявки (после выбора процесс). В этот момент заявка еще не существует, она будет создана после выполнения StartActivityDialog.
sw: Kwa tiketi mpya, ki AnzaShughuliMaongezi lazima kifafanuliwe. Hii itaonyeshwa wakati wa kutengeneza mchakato mpya wa tiketi (baada ya mchakato kuchaguliwa). Hapa tiketi bado haipo, itatengenezwa baada ya kuwasilisha ki AnzaShughuliMaongezi.

source: Path
ja: パス
ru: Путь
sw: Njia

source: The Path contains the structure of the Activities, and the possible Transitions between them, for the current process. And also the Transition Actions that happens when transitioning . This controls the way that a process ticket can take. Example:
ja: パスは、現在のプロセスのために、アクティビティの構造およびそれらの間の可能な推移を含みます。そしてさらに発生する推移アクションは移行時に起こります。これは、プロセス・チケットがとることができる方法をコントロールします。
ru: Схема отображает структуру Активностей и возможных Переходов между ними для текущего процесса. А также Действия Переходов/Transition Actions возможные при переходах. Она показывает пути выполнения процессной заявки. Например:
sw: Njia ina muundo wa Shughuli, na Mapito yanayowezekana kati yao, kwa ajili ya mchakato wa sasa. Na pia Vitendo vya Mpito ambavyo vinatokea wakati wa Mpito. Hii inadhibiti mwelekeo ambao tiketi ya mchakato itachukua. Mfano:

source: If a process ticket is in Activity 'A1', it has three possible ways to get to another Activity. In the Transitions 'T1' to 'T3', conditions are defined, that a process ticket must fulfill to move (transit) to another Activity.
ja: プロセス・チケットがアクティビティ('A1')にある場合、それには別の活動に到着する3つの可能な方法がある。推移(「T1」)に、「T3」に、条件は定義され、プロセス・チケットは別のアクティビティへの遷移を完了しなければならない。
ru: Если процессная заявка в состоянии Activity 'A1', она имеет три возможных пути перехода к другой Активности. Для Переходов от 'T1' до 'T3' заданы условия, которые процессная заявка должна выполнить для перехода (transit) к следующей Активности.
sw: Kama tiketi ya mchakato iko kwenye shughuli 'A1', ina njia tatu zinazowezekana kwenda kwenye Shughuli nyingine. Kwenye Mapito 'T1' kwenda 'T3', masharti yamefafanuliwa, ambayo tiketi ya mchakato inabidi iyatimize ili ihamie kwenye Shughuli nyingine.
