Repository: DSigmund/doc-admin
Catalog: i18n/doc-admin.*.po
Languages: ja, ru, sw

source: Now add the new column to the MAP array in <filename>Kernel/Config.pm</filename>, as shown in the following script.
ja: 次のスクリプトで示されるように、さて、新規カラムを<filename>Kernel/Config.pm</filename>中のMAP配列に追加してください。
ru: Теперь добавьте новый столбец в MAP-масив в <filename>Kernel/Config.pm</filename>, как это показано в нижеприведенном сценарии.
sw: Sasa ongeza safuwima mpya kwenye mkusanyiko wa RAMANI katika <filename>Kernel/Config.pm</filename>, kama inavyoonyeshwa katika hati inayofuata.

source: <emphasis>Script: Adding a room field to the Kernel/Config.pm file.</emphasis>
ja: <emphasis>スクリプト:roomフィールドのKernel/Config.pmファイルへの追加。</emphasis>
ru: <emphasis>Сценарий: Добавление поля "комната" в файл Kernel/Config.pm file.</emphasis>
sw: <emphasis>Hati: Kuongeza sehemu ya chumba kweye faili Kernel/Config.pm.</emphasis>

source: It is also possible to edit all of this customer information via the Customers link in the Agent interface.
ja: 担当者インターフェースの顧客リンクによってこの顧客情報をすべて編集することも可能です。
ru: Всю эту информацию о клиенте можно также отредактировать воспользовавшись ссылкой Клиенты в интерфейсе агента.
sw: Pia inawezekana kuhariri taarifa zote za mteja kupitia kiungo cha mteja kwenye kiolesura cha Wakala.

source: Customer with multiple IDs (Company tickets)
ja: 多数のID(会社チケット)を持った顧客
ru: Клиент с несколькими идентификаторами (Заявки Компании)
sw: Mteja mwenye vitambulisho vya mteja vingi (Tiketi za Kampuni)

source: It is possible to assign more than one customer ID to a customer. This can be useful if a customer must access tickets of other customers, e.g. a supervisor wants to watch the tickets of his assistants. If a customer can access the tickets of another customer, the company ticket feature of OTRS is used. Company tickets can be accessed via the "Company Tickets" link in the customer panel.
ja: 顧客に1つを超える顧客IDを割り当てることは可能です。顧客が他の顧客のチケットへアクセスしなければならないならばこれは役立ちます。（例えば、スーパーバイザはアシスタントのチケットを見たい。）顧客が他の顧客のチケットへアクセスできるならば、OTRSの会社チケット機能が使われます。会社チケットは、顧客パネル中の「会社チケット」リンクによってアクセスすることができます。
ru: Одному клиенту можно назначить больше одного клиентского идентификатора (Customer ID). Это может быть полезно, если клиенту необходимо получить доступ к заявкам других клиентов, например, руководитель хочет посмотреть заявки своих помощников. Если клиент может получить доступ к заявкам другого клиента, то используется особенность OTRS "заявки компании". Заявки компании могут быть доступны перейдя по ссылке "Заявки Компании" в клиентской панели управления.
sw: Inawezekana kugawia zaidi ya kitambulisho cha mteja kimoja kwa mteja. Hii inakuwa na manufaa kama mteja anatakiwa kufikia tiketi za wateja wengine, mf. msimamizi anataka kuangalia tiketi za wasaidizi wake. Kama mteja anaweza kufikia tiketi za mteja mwingine, kipengele cha tiketi za kampuni cha OTRS kinatumika. Tiketi za kampuni zinaweza kufikiwa kupitia kiungo "Tiketi za Kampuni" katika paneli ya wateja.

source: To use company tickets, a new column with the IDs that should be accessible for a customer, has to be added to the customer_user table in the OTRS database (see Script below).
ja: 会社チケットを使用するために、顧客にとってアクセス可能であるべきIDを備えた新規カラムをOTRSデータベース中のcustomer_userテーブルに加えなければなりません(下記のスクリプトを参照)。
ru: Для использованя заявок компании, новый столбец с идентификатором (IDs), который должен быть доступен для клиента, должен быть добавлен в таблицу customer_user базы данных OTRS (см. Сценарий ниже).
sw: Kutumia tiketi za kampuni, safuwima mpya yenye Vitambulisho ambavyo vinaweza kufikiwa na mteja, inabidi viongezwe kwenye jedwali la mteja_mtumiaji katika hifadhidata ya OTRS (ona Hati chini).

source: <emphasis>Script: Adding a customer_ids field to the customer_user table.</emphasis>
ja: <emphasis>スクリプト: customer_idsフィールドのcustomer_userテーブルへの追加。</emphasis>
ru: <emphasis>Сценарий: Добавление поля customer_ids в таблицу customer_user.</emphasis>
sw: <emphasis>Hati: Kuongeza sehemu ya mteja_vitambulisho kwenye jedwali la mteja_mtumiaji.</emphasis>

source: Now the new column has to be added to the MAP array in <filename>Kernel/Config.pm</filename>, as shown in the script below.
ja: スクリプトの中で下に示されるように、新規カラムを<filename>Kernel/Config.pm</filename>中のMAP配列に加えなければなりません。
ru: Теперь новый столбец должен быть добавлен в MAP-массив в <filename>Kernel/Config.pm</filename>, как это показано в нижеприведенном Сценарии.
sw: Sasa safuwima mpya inabidi iongezwe kwenye mkusanyiko wa RAMANI katika <filename>Kernel/Config.pm</filename>, kama ilivyoonyeshwa kwenye hati chini.

source: <emphasis>Script: Adding a UserCustomerIDs field to the Kernel/Config.pm file.</emphasis>
ja: <emphasis>スクリプト: UserCustomerIDsフィールドの Kernel/Config.pmファイル への追加。</emphasis>
ru: <emphasis>Сценарий: Добавление поля UserCustomerIDs в Kernel/Config.pm</emphasis>
sw: <emphasis>Hati: Kuongeza sehemu ya Vitambulisho vya MtumiajiMteja kwenye faili Kernel/Config.pm.</emphasis>

source: Now, the new column for the multiple customer IDs can be edited via the Agent interface, in the section for the customer management.
ja: ここで、多数の顧客IDのための新規カラムは、顧客管理のためのセクションの中で担当者・インターフェース経由で編集することができます。
ru: Теперь, новый столбец для мульти-идентификатора ( IDs) клиента можно редактировать с помощью веб-интерфейса Агента, в разделе управления клиентами.
sw: Sasa safuwima mpya kwa ajili ya Vitambulisho vingi vya mteja inaweza kuhaririwa kupitia kiolesura cha Wakala, katika kifungu cha usimamizi wa mteja.

source: To ensure that one customer can access the tickets of other customers, add the IDs of these other users into the new field for the multiple customer IDs. Each ID has to be separated by a semicolon (see Example 11-2 below).
ja: 顧客が他の顧客のチケットにアクセスすることを確実にするために、多数の顧客IDのための新規フィールドの中へのこれらの他のユーザのIDを追加します。セミコロンによって各IDを区切って下さい(下記の例11-2を参照)。
ru: Для того, чтобы убедится что один клиент имеет доступ к заявкам других клиентов нужно добавить идентификаторы (IDs) этих пользователей в новое поле для нескольких идентификаторов клиента. Каждый идентификатор (ID) должен быть отделен точкой с запятой (см. ниже Пример 11-2).
sw: Kuhakikisha mteja mmoja anaweza kufikia tiketi za wateja wengine, ongeza vitambulisho vya hawa watumiaji wengine katika sehemu mpya kwa ajili ya vitambulisho vingi vya mteja. Kila kitambulisho lazima kitenganishwe na alama yanuktamkato (ona Mfano 11-2 chini).

source: Using company tickets with a DB backend
ja: DBバックエンドを備えた会社チケットの使用
ru: Хранение Заявок Компании в базе данных DB
sw: Kutumia tiketi za kampuni na mazingira ya nyuma ya DB

source: The customers A, B and C exist in your system, and A wants to have access to the tickets of B and C via the customer panel. B and C should have no access to the tickets of other users.
ja: 顧客A、BおよびCはあなたのシステムに存在します。また、Aは顧客パネルからBとCのチケットにアクセスしたい。BとCは他のユーザのチケットにアクセスするべきではありません。
ru: Клиенты А, Б и Ц созданы в вашей системе и А хочет иметь доступ к заявкам Б и Ц используя клиентскую панель. Б и Ц не должны иметь доступа к заявкам других пользователей.
sw: Wateja A,B na C wapo kwenye mfumo wako, na A anataka kufikia tiketi za B na C kupitia paneli ya mteja. B na C hawatakiwi kufikia tiketi za watumiaji wengine.

source: To realize this setup, change the customer_user table and the mapping in <filename>Kernel/Config.pm</filename> as described above. Then load the settings for customer A via the Customers link in the Agent interface or via the Admin page. If the settings are displayed, add into the field for CustomerIDs the values "B;C;".
ja: このセットアップを実現するためには、上に記述されるような<filename>Kernel/Config.pm</filename>中のcustomer_userテーブルおよびMappingを変更してください。次に、担当者インターフェースあるいは管理者ページの顧客リンクから、顧客Aのための設定をロードしてください。設定が表示される場合、CustomerIDsのためのフィールドへ値「B;C;」を追加して下さい。
ru: Для реализации этой структуры, измените таблицу customer_user и маппинг (преобразование) в <filename>Kernel/Config.pm</filename> как это показано выше. С помощью Панели Администрирования или используя ссылку Клиенты в веб-интерфейсе Агента загрузите настройки пользователя А. Если настройки отображаются, добавьте значения "Б;Ц;" в поле для CustomerIDs.
sw: Kutambua mpangilio huu, badilisha jedwali la mteja_mtumiaji na miunganiko katika <filename>Kernel/Config.pm</filename> kama ilivyoelezwa hapo juu. Kisha pakia mipangilio ya mteja A kupitia kiungo cha Mteja katika kiolesura cha Wakala au kupitia kurasa ya Msimamizi. Kama mipangilio imeonyeshwa, ongeza kwenye sehemu ya Vitambulisho vya Wateja thamani "B;C".

source: If you have a LDAP directory with your customer data, you can use it as the customer backend with OTRS, as shown in Example 11-3.
ja: 顧客情報を備えたLDAPディレクトリーを持っているならば、例11-3において示されるように、OTRSを備えた顧客バックエンドとしてそれを使用することができます。
ru: Если у вас есть LDAP­-каталог, в котором хранятся данные о клиентах, его можно использовать в OTRS, в качестве хранилища данных о клиентах, как это показано в Примере 11-3.
sw: Kama una mpangilio orodha wa LDAP na data za mteja wako, unaweza kuitumia kama mazingira ya nyuma ya mteja na OTRS, kama ilivyo onyeshwa kwenye mfano 11-3.

source: Configuring an LDAP customer backend
ja: LDAP顧客バックエンドの構成
ru: Настройка LDAP в качестве клиентского бэк-енда
sw: Usanidi wa LDAP ya mazingira yanyuma ya mteja

source: # CustomerUser # (customer ldap backend and settings) $Self->{CustomerUser} = { Name => 'LDAP Data Source', Module => 'Kernel::System::CustomerUser::LDAP', Params => { # ldap host Host => 'bay.csuhayward.edu', # ldap base dn BaseDN => 'ou=seas,o=csuh', # search scope (one|sub) SSCOPE => 'sub', # The following is valid but would only be necessary if the # anonymous user does NOT have permission to read from the LDAP tree UserDN => '', UserPw => '', # in case you want to add always one filter to each ldap query, use # this option. e. g. AlwaysFilter => '(mail=*)' or AlwaysFilter => '(objectclass=user)' AlwaysFilter => '', # if both your frontend and your LDAP are unicode, use this: SourceCharset => 'utf-8', DestCharset => 'utf-8', # if your frontend is unicode and the charset of your # ldap server is iso-8859-1, use these options. # SourceCharset => 'iso-8859-1', # DestCharset => 'utf-8', # Net::LDAP new params (if needed - for more info see perldoc Net::LDAP) Params => { port => 389, timeout => 120, async => 0, version => 3, }, }, # customer unique id CustomerKey => 'uid', # customer # CustomerID => 'mail', CustomerUserListFields => ['cn', 'mail'], CustomerUserSearchFields => ['uid', 'cn', 'mail'], CustomerUserSearchPrefix => '', CustomerUserSearchSuffix => '*', CustomerUserSearchListLimit => 250, CustomerUserPostMasterSearchFields => ['mail'], CustomerUserNameFields => ['givenname', 'sn'], # show not own tickets in customer panel, CompanyTickets CustomerUserExcludePrimaryCustomerID => 0, # add an ldap filter for valid users (expert setting) # CustomerUserValidFilter => '(!(description=locked))', # administrator can't change customer preferences AdminSetPreferences => 0, # # cache time to live in sec. - cache any database queries # CacheTTL => 0, Map => [ # note: Login, Email and CustomerID are mandatory! # var, frontend, storage, shown (1=always,2=lite), required, storage-type, http-link, readonly [ 'UserTitle', 'Title', 'title', 1, 0, 'var', '', 0 ], [ 'UserFirstname', 'Firstname', 'givenname', 1, 1, 'var', '', 0 ], [ 'UserLastname', 'Lastname', 'sn', 1, 1, 'var', '', 0 ], [ 'UserLogin', 'Username', 'uid', 1, 1, 'var', '', 0 ], [ 'UserEmail', 'Email', 'mail', 1, 1, 'var', '', 0 ], [ 'UserCustomerID', 'CustomerID', 'mail', 0, 1, 'var', '', 0 ], # [ 'UserCustomerIDs', 'CustomerIDs', 'second_customer_ids', 1, 0, 'var', '', 0 ], [ 'UserPhone', 'Phone', 'telephonenumber', 1, 0, 'var', '', 0 ], [ 'UserAddress', 'Address', 'postaladdress', 1, 0, 'var', '', 0 ], [ 'UserComment', 'Comment', 'description', 1, 0, 'var', '', 0 ], ], };
ja: # CustomerUser # (顧客LDAPバックエンドとその設定) $Self->{CustomerUser} = { Name => 'LDAP Data Source', Module => 'Kernel::System::CustomerUser::LDAP', Params => { # ldap host Host => 'bay.csuhayward.edu', # ldap base dn BaseDN => 'ou=seas,o=csuh', # search scope (one|sub) SSCOPE => 'sub', # 次の記述は有効です。しかし、単に、匿名ユーザが # LDAPツリーから読み込み許可を持っていない場合のみに必要です。 UserDN => '', UserPw => '', # 常にあるフィルタを各LDAPクエリに追加したい場合このオプションを使います。 # このオプション、例えば AlwaysFilter => '(mail=*)' or AlwaysFilter => '(objectclass=user)' AlwaysFilter => '', # フロントエンドとLDAPの両方がunicodeなら、これを使います: SourceCharset => 'utf-8', DestCharset => 'utf-8', # フロントエンドがunicodeでLDAPサーバが # iso-8859-1ならば、このオプションを使います。 # SourceCharset => 'iso-8859-1', # DestCharset => 'utf-8', # Net::LDAP new params (必要なら詳細はperldoc Net::LDAPを参照) Params => { port => 389, timeout => 120, async => 0, version => 3, }, }, # 顧客識別ID CustomerKey => 'uid', # 顧客 # CustomerID => 'mail', CustomerUserListFields => ['cn', 'mail'], CustomerUserSearchFields => ['uid', 'cn', 'mail'], CustomerUserSearchPrefix => '', CustomerUserSearchSuffix => '*', CustomerUserSearchListLimit => 250, CustomerUserPostMasterSearchFields => ['mail'], CustomerUserNameFields => ['givenname', 'sn'], # 顧客パネルに自身のチケットを非表示, CompanyTickets CustomerUserExcludePrimaryCustomerID => 0, # 有効なユーザー用にLDAPフィルタを追加 (上級者向け設定) # CustomerUserValidFilter => '(!(description=locked))', # administrator は顧客選択（選好）を変更できません。 AdminSetPreferences => 0, # # キャッシュ生存時間（秒） - cache any database queries # CacheTTL => 0, Map => [ # ノート：ログイン、Eメールと顧客IDは必須! # var, frontend, storage, shown (1=always,2=lite), required, storage-type, http-link, readonly [ 'UserTitle', 'Title', 'title', 1, 0, 'var', '', 0 ], [ 'UserFirstname', 'Firstname', 'givenname', 1, 1, 'var', '', 0 ], [ 'UserLastname', 'Lastname', 'sn', 1, 1, 'var', '', 0 ], [ 'UserLogin', 'Username', 'uid', 1, 1, 'var', '', 0 ], [ 'UserEmail', 'Email', 'mail', 1, 1, 'var', '', 0 ], [ 'UserCustomerID', 'CustomerID', 'mail', 0, 1, 'var', '', 0 ], # [ 'UserCustomerIDs', 'CustomerIDs', 'second_customer_ids', 1, 0, 'var', '', 0 ], [ 'UserPhone', 'Phone', 'telephonenumber', 1, 0, 'var', '', 0 ], [ 'UserAddress', 'Address', 'postaladdress', 1, 0, 'var', '', 0 ], [ 'UserComment', 'Comment', 'description', 1, 0, 'var', '', 0 ], ], };

source: If additional customer attributes are stored in your LDAP directory, such as a manager's name, a mobile phone number, or a department, and if you want to display this information in OTRS, just expand the MAP array in <filename>Kernel/Config.pm</filename> with the entries for these attributes, as shown in the following script.
ja: 追加の顧客属性（マネージャーの名前、携帯電話番号あるいは部署のような）が、あなたのLDAPディレクトリーに格納されていて、この情報をOTRSに表示したいならば、次のスクリプトの中で示されるように、これらの属性へのエントリーを備えた<filename>Kernel/Config.pm</filename> 中のMAP配列をただ拡張してください。
ru: Если дополнительные атрибуты клиента хранятся в LDAP-каталоге, например, имя руководителя, номер мобильного телефона, или отдела, и если эту информацию нужно отобразить в OTRS, просто расширьте MAP-массив в файле <filename>Kernel/Config.pm</filename> записями для этих атрибутов, как показано в нижеприведенном сценарии.
sw: Kama sifa za ziada za mteja zimehifadhiwa kwenye mpangilio orodha wa LDAP yako, kwa mfano jina la meneja, namba ya simu ya mkononi, au idara, na kama unataka kuonyesha taarifa hizi kwenye OTRS, panua mkusanyiko wa RAMANI kwenye <filename>Kernel/Config.pm</filename> na maingizo kwa sifa hizi, kama ilivyoonyeshwa kwenye hati ifuatayo.

source: <emphasis>Script: Adding new fields to the Kernel/Config.pm file.</emphasis>
ja: <emphasis>スクリプト:新規フィールドのKernel/Config.pmファイルへの追加</emphasis>
ru: <emphasis>Сценарий: Добавление нового поля в файл Kernel/Config.pm.</emphasis>
sw: <emphasis>Hati: Kuongeza sehemu mpya kwenye Kernel/Config.pm file.</emphasis>

source: It is possible to assign more than one Customer ID to a customer, when using an LDAP backend. To use company tickets, a new field has to be added to the LDAP directory that contains the IDs accessible by the customer.
ja: LDAPバックエンドを使用する場合、顧客にひとつ以上の顧客IDを割り当てることが可能です。会社チケットを使用するために、新規フィールドを顧客によってアクセス可能なIDを含んでいるLDAPディレクトリーに加えなければなりません。
ru: При использовании LDAP-бэкэнда клиенту можно присвоить больше одного клиентского айди (Customer ID). Для использования заявок компании, в LDAP-директорию нужно добавить новое поле, которое содержит доступные агенту идентификаторы (IDs).
sw: Inawezekana kugawia zaidi ya Kitambulisho kimoja cha Mteja kwa mteja, ukiwa unatumia mazingira ya nyuma ya LDAP. Kutumia tiketi za kampuni, sehemu mpya inabidi iongezwe kwenye mpangilio orodha wa LDAP ambayo ina vitambulisho vinavyofikika na mteja.

source: If the new field in the LDAP directory has been created, the new entry has to be added to the MAP array in <filename>Kernel/Config.pm</filename>, as shown in the script below.
ja: LDAPディレクトリーの新規フィールドが作成されている場合、スクリプトの中で下に示されるように、新規エントリーを<filename>Kernel/Config.pm</filename>中のMAP配列に加えなければなりません。
ru: Если в LDAP-каталоге было созадно новое поле, его также нужно добавить в MAP-массив в <filename>Kernel/Config.pm</filename>, как это показано в нижеприведенном сценарии.
sw: Kama sehemu mpya kwenye mpangilio orodha wa LDAP imetengenezwa, ingizo jipya inabidi liongezwe kwenye mkusanyiko wa RAMANI katika <filename>Kernel/Config.pm</filename>, kama ilivyoonyeshwa kwenye hati chini.

source: <emphasis>Script: Maping new fields to the Kernel/Config.pm file.</emphasis>
ja: <emphasis>スクリプト: 新規フィールドのKernel/Config.pmファイルへのMaping</emphasis>
ru: <emphasis>Сценарий: Подстановка новых полей в Kernel/Config.pm file.</emphasis>
sw: <emphasis>Hati: Kuunganisha sehemu mpya kwenye Kernel/Config.pm file.</emphasis>

source: The field for the multiple customer IDs has to be edited directly in the LDAP directory. OTRS can only read from LDAP, not write to it.
ja: 複数の顧客IDのためのフィールドをLDAPディレクトリーで直接編集しなければなりません。OTRSはLDAPから単に読み込むだけで書き込むことはできません。
ru: Клиентские идентификаторы (IDs) можно редактировать напрямую в LDAP-директории. OTRS может только считать информацию из LDAP, но не записывать.
sw: Sehemu kwa ajili ya vitambulisho vingi vya mteja inabidi kuhaririwa moja kwa moja katika mpangilio orodha wa LDAP. OTRS inaweza kusoma tu kutoka kwenye LDAp, sio kuandika.

source: To ensure access by a customer to the tickets of other customers, add the customer IDs of the customers whose tickets should be accessed to the new field in your LDAP directory. Each ID has to be separated by a semicolon (see Example 11-4 below).
ja: 顧客によって他の顧客のチケットにアクセスを保証するためには、そのチケットがあなたのLDAPディレクトリーの新規フィールドにアクセスされるべき顧客の顧客IDを加えてください。各IDはセミコロンで区切って下さい(下記の例11-4を参照)。
ru: Чтобы убедтися что клиент имеет доступ к заявкам других клиентов, добавьте идентификаторы (IDs) клиентов, к заявкам которых нужен доступ, к новому полю вашей LDAP-директории. Каждый идентификатор ID должен быть отделен точнкой с запятой (см. ниже Рисунок 11-4).
sw: Kuhakikisha ufikivu wa mteja kwenye tiketi za wateja wengine, ongeza Vitambulisho vya wateja ambao tiketi zao zinatakiwa kufikiwa kwenye sehemu mpya katika mpangilio orodha wako wa LDAP. Kila kitambulisho lazima kigawanywe kwa alama nuktamkato (ona Mfano 11-4 chini) .

source: Using Company tickets with an LDAP backend
ja: LDAPバックエンドを備えた会社チケットの使用
ru: Использование заявок Компании с LDAP-бэкэндом
sw: Kutumia tiketi za Kampuni na mazingira ya nyuma ya LDAP

source: The customers A, B and C exist in your system and A wants to have access to the tickets of B and C via the customer panel. B and C should have no access to tickets of other users.
ja: 顧客A、BおよびCはあなたのシステムに存在します。また、Aは顧客パネルからBとCのチケットにアクセスしたい。BとCは他のユーザのチケットにアクセスするべきではありません。
ru: Клиенты А, Б и Ц созданны в вашей системе и А хочет иметь доступ к заявкам Б и Ц через панель клиента. Б и Ц не должны иметь доступа к другим пользователям.
sw: Wateja A, B na C wapo kwenye mfumo wako na A anataka kuwa na ufikivu wa tiketi za B na C kupitia paneli ya mteja. B na C hawatakiwi kuwa na ufikivu wa tiketi za wateja wengine.

source: To realize this setup, change the LDAP directory and the mapping in <filename>Kernel/Config.pm</filename> as described above. Then add into the field for CustomerIDs the values "B;C;" for customer A in your LDAP directory.
ja: このセットアップを実現するためには、上に記述されるような<filename>Kernel/Config.pm</filename>中のLDAPディレクトリーおよびMappingを変更してください。その後、CustomerIDsのためのフィールドへ値「B; C;」をあなたのLDAPディレクトリーの顧客Aのために追加して下さい。
ru: Для реализации этой установки измените LDAP-директорию и маппинг (mapping) в <filename>Kernel/Config.pm</filename>, как это показано выше. Затем добавьте в вашей LDAP-директории значения "Б;Ц;" в поле для CustomerIDs, для клиента "А".
sw: Kutambua mpangilio huu, badilisha mpangilio orodha wa LDAP na miunganiko katika <filename>Kernel/Config.pm</filename> kama ilivyoelezwa juu. Kisha ongeza kwenye sehemu ya Vitambulisho vya wateja thamani "B;C" kwa mteja A katika mpangilio orodha wa LDAP.

source: Using more than one customer backend with OTRS
ja: OTRSでひとつ以上の顧客バックエンドを使用する
ru: Использование больше чем одного пользовательского хранилища данных с OTRS
sw: Kutumia zaidi ya mazingira ya nyuma ya mteja ya aina moja na OTRS

source: If you want to utilize more than one customer data source used with OTRS (e.g. an LDAP and a database backend), the CustomerUser config parameter should be expanded with a number, e.g. "CustomerUser1", "CustomerUser2" (see Example 11-5 below).
ja: あなたがOTRS(例えばLDAPおよびデータベース・バックエンド)と共に使用されるひとつ以上の顧客情報ソースを利用したければ、CustomerUser構成パラメタを「数」で(例えば「CustomerUser1」、「CustomerUser2」)拡張するべきです。(下記の例11-5を参照)。
ru: Если в OTRS нужно использовать больше одного источника данных о клиентах (например LDAP и базу данных), конфигурационный параметр CustomerUser должен быть расширен числом, например "CustomerUser1", "CustomerUser2" (см. ниже Пример 11-5).
sw: Kama ukitaka kutumia zaidi ya chanzo kimoja cha data za mteja zinazotumika na OTRS (mf. mazingira ya nyuma ya LDAP na hifadhidata), parameta ya usanidi ya MtejaMtumiaji lazima ipanuliwe na nambari, mf. "MtejaMtumiaji 1", "MtejaMtumiaji2" (ona Mfano 11-5 chini).

source: The following configuration example shows usage of both an LDAP and a database customer backend with OTRS.
ja: 以下は、OTRSでLDAPとデータベース顧客バックエンドの両方を使用する構成例です。
ru: В следующем примере показано применение конфигурации как для LDAP так и для базы данных клиентского бэкэнда с OTRS.
sw: Mfano unaofuata wa usanidi unaonyesha matumizi ya mazingira ya nyuma ya mteja ya LDAP na hifadhidata katika OTRS.
