Repository: DSigmund/doc-admin
Catalog: i18n/doc-admin.*.po
Languages: ja, ru, sw

source: When testing a field with 'ID' (like SLAID), the database ID of the field will be used for testing, for other fields (like SLA) the actual value is used for testing.
ja: 「ID」(SLAIDのように)を備えたフィールドをテストする時、フィールドのデータベースIDは、実際の値がそのために使用される他のフィールド(SLAのような)のための試験に使用されます。
ru: Когда проверяются поля с ID в имени (такие как SLAID), используется ID поля из базы данных, для других поле (таких как SLA), используется его текущее значение.
sw: Wakati wa kujaribisha sehemu kwa 'Kitambulisho' (kama Kitambulisho cha SLA), Kitambulisho cha hifadhidata ya sehemu kitatumika kwa ajili ya majaribio, kwa sehemu nyingine (kama SLA) thamani halisi inatumika kwa ajili ya majaribio.

source: Determines the kind of field testing. Possible values:
ja: フィールド試験の種類を決定します。可能な値:
ru: Определяет тип проверяемого поля. Возможные значения:
sw: Inaamua aina ya kipimo cha eneo. Thamani ziwezekanazo:

source: 'String': Compares the field value with the string specified in 'Match'. Matches if they are exactly the same.
ja: 「String」: フィールド値を「Match」で指定されたStringと比較します。それらが正確に同じである場合マッチします。
ru: 'String/Строка': Сравнивает значение поля со строкой заданной в 'Match'. Верно, если их значения полностью совпадают.
sw: 'Tungo': Inalinganisha thamani ya sehemu na tungo iliyobainishwa katika 'Lingana'. Zinalingana kama ziko sawa kabisa.

source: 'Hash': Compares the field value (hash) with the hash specified in 'Match'. All hash values must be the same.
ja: 「ハッシュ(Hush)」:フィールド値(ハッシュ)を「Match」で指定されたハッシュと比較します。ハッシュ値はすべて同じでなければいけない。
ru: 'Hash': Сравнивает значение поля (hash) со значением hash заданным в 'Match'. Все значения должны совпадать.
sw: 'Hash': Inafananisha thamani ya sehemu (hash) na hash iliyobainishwa kwenye 'Fananisha'. Thamani zote za hash lazima ziwe sawa.

source: 'Array': Compares the field value (array) with the array specified in 'Match'. Both lists must be the same.
ja: 「配列(array)」:フィールド値(配列)を「Match」で指定された配列と比較します。両方のリストは同じでなければならない。
ru: 'Array/Список': Сравнивает значение поля (array) со списком, заданным в 'Match'. Оба списка должны быть одинаковы.
sw: 'Mkusanyiko': Inalinganisha thamani ya sehemu (mkusanyiko) na mkusanyiko uliobainishwa kwenye 'Lingana'. Orodha zote mbili lazima ziwe sawa.

source: 'Regex': The field value can be tested with a regular expression. It is important that 'Match' contains <emphasis>qr{}xms</emphasis> as a base condition. Between the braces the actual regular expression can be noted.
ja: 「Regex:」:フィールド値は正規表現でテストすることができます。「Match」が基本的条件として<emphasis>qr{}xms</emphasis>を含むことは重要です。{}間に、実際の正規表現を記述することができます。
ru: 'Regex': Значение поля проверяется с помощью регулярного выражения. Важным является, что 'Match' содержит <emphasis>qr{}xms</emphasis> как базовое условие. Между скобками может быть записано реальное регулярное выражение.
sw: 'Regex': Thamani ya sehemu inaweza kujaribiwa na usemi wa kawaida. Nimuhimu kwamba 'Fanana' ina <emphasis>qr{}xms</emphasis> kama sharti la msingi. Katikati ya mabano semi ya kawaida halisi inaweza kuandikwa.

source: 'Module': Allows you to use a perl module for condition checking. If it returns 1, the check was positive. You can find an example module in <filename>Kernel/System/ProcessManagement/TransitionValidation/ValidateDemo.pm</filename>.
ja: 「モジュール:」:条件チェックのためにperlモジュールを使用することができます。チェックが1を返すならば、チェックは成功です。<filename>Kernel/System/ProcessManagement/TransitionValidation/ValidateDemo.pm</filename>. でサンプル・モジュールを見つけることができます。
ru: 'Module': Позволяет использовать perl модуль для проверки условия. Он возвращает, в качестве результата 1, результат проверки верен. Пример модуля можно найти в <filename>Kernel/System/ProcessManagement/TransitionValidation/ValidateDemo.pm</filename>.
sw: 'Moduli': Inakuruhusu kutumia moduli ya Perl kwa ajili ya kukagua masharti. Kama ikirudisha 1, ukaguzi ulikua chanya. Unaweza kupata moduli ya mfano kwenye <filename>Kernel/System/ProcessManagement/TransitionValidation/ValidateDemo.pm</filename>.

source: Transition Actions are actions which can be triggered after successfully applied transitions (when a process ticket moves from one activity to another). These Transition Actions can be used to perform different changes on the ticket, e. g. change the Queue or the Owner of the ticket, and you can also create your own Transition Actions to perform other complex changes.
ja: 推移アクションは、推移がうまく適用された後で、きっかけとなるアクションです。（プロセス・チケットがひとつのアクティビティから別のアクティビティへ移る場合）これらの推移アクションはチケットで異なる変更を実施するために使われます。（例えば、キューまたはチケットのオーナーの変更）そうすれば、さらに、他の複雑な変更を行なうために自分の推移アクションを作成することができます。
ru: Действия Перехода это действия которые могут быть выполнены после успешного Перехода (когда процессная заявка переходит от одной Активности к другой). Эти Дествия Перехода могут быть использованы для выполнения различных изменений в заявке, например, изменить Очередь или Владельца заявки, и вы можете создать свои собственные Действия Переходов для осуществления других сложных изменений.
sw: Vitendo vya Mpito ni vitendo ambavyo vinaweza kuchochewa baada ya mapito yaliyofanyika kikamilifu (pale tiketi ya mchakato inapohama kutoka shughuli moja hadi nyingine). Vitendo hivi vya Mpito vinaweza kutumika kufanya mabadiliko mengi kwenye tiketi, mf. badilisha Foleni au Mmiliki wa tiketi, na pia unaweza kutengeneza Vitendo vyako vya Mpito kufanya mabadiliko mengine magumu.

source: Transition Action configuration
ja: 推移アクション構成
ru: Настройка Действий Перехода
sw: Usanidi wa Vitendo vya Mpito

source: Let's see an example: <placeholder type="screen" id="0"/>
ja: 例を見ましょう:: <placeholder type="screen" id="0"/>
ru: Рассмотрим пример: <placeholder type="screen" id="0"/>
sw: Tuone mfano: <placeholder type="screen" id="0"/>

source: The name of the Transition Action.
ja: 推移アクションの名前。
ru: Имя Действия Перехода
sw: Jina la Kitendo cha Mpito.

source: Module
ja: Module（モジュール）
ru: Модуль
sw: Moduli

source: Specifies the Perl module to be used.
ja: 使用されるパール・モジュールを指定します。
ru: Задает используемый Perl модуль.
sw: Inaweka bayana moduli ya Perl itakayotumika.

source: Config
ja: Config（構成）
sw: Usanidi

source: This parameter contains all settings which are required for the module. Its content depends on the particular Transition Action module which is used. Please see the documentation of the individual modules for details. In our example, only the Queue must be specified, Nevertheless we are also sending UserID parameter, by using the UserID parameter, the transition action will be executed impersonating the user with the given UserID.
ja: このパラメーターは、モジュールに必要なセッティングをすべて含んでいます。その内容は、使用される特定の推移アクション・モジュールに依存します。詳細については、個々のモジュールのドキュメンテーションを参照してください。私たちの例において、キューだけが指定されねばなりません。
ru: Этот параметр содержит все настройки, требуемые для модуля. Их содержание зависит от конкретного используемого модуля Действия Перехода. Детали по конкрентным модулям смотрите в документации. В нашем примере, только Очередь должна быть задана. Тем не менее мы также передаем UserID. Используя параметр UserID действие перехода будет выполняться от имени пользователя с этим UserID.
sw: Parameta hii ina mipangilio yote inayohitajika na moduli. Maudhui yake yanategemea moduli maalumu ya Kitendo cha Mpito inayotumika. Tafadhali pitia nyaraka za moduli moja moja kwa undani zaidi. Katika mfano wetu, Foleni tu lazima iwekwe bayana, Hata hivyo tunatuma pia parameta ya Kitambulisho cha mtumiaji, kwa kutumia parameta ya kitambulisho cha mtumiaji, kitendo cha mpito kitatekelezwa na kumfanya mtumiaji kuwa mwenye kitambulisho cha mtumiji hicho.

source: The use of UserID inside the "Config" parameter of a Transition Action is accepted by all Transition Actions (since OTRS 3.2.4), in this example it could be particularly important if the user that triggers the Transition does not have permissions to move the ticket to the queue 'Junk', while the user with the UserID 123 might have.
ja: 推移アクションの「構成」パラメタ内部のUserIDの使用は、全ての推移アクション(OTRS 3.2.4以来の)によって認めてられています。この例では、推移を引き起こすユーザーが、チケットを「ジャンク」キューへ移動する権限を持っているかどうかが、特に重要になりえます。ユーザーID 123を持つユーザーが持っているかもしれませんが。。
ru: Использование UserID внутри параметра "Config" для Действия Перехода премлема для всех Действий Перехода (начиная с OTRS 3.2.4), в этом примереэто может быть в частности важным, если пользователь, выполняющий Переход, не имеет прав для передачи заявки в очередь "Junk", тогда как пользователь с UserID = 123, может их иметь.
sw: Matumizi ya Kitambulisho cha Mtumiaji ndani ya parameta "Config" ya Kitendo cha Mpito inakubalika na Vitendo vyote vya Mpito (tangu OTRS 3.2.4), katika huu mfano inaweza kuwa muhimu zaidi kama mtumiaji anayesababisha Mpito hana ruhusa za kuhamisha tiketi kwenda kwenye foleni 'Taka', wakati mtumiaji mwenye Kitambulisho cha mtumiaji 123 anaweza kuwa nayo.

source: Reusing Transition Action modules
ja: 推移アクション・モジュールの再使用
ru: Повторное использование модулей Действий Переходов.
sw: Kutumia Moduli za Vitendo vya Mpito kwa kurudia

source: To use Transition Action modules multiple times, just specify several TransitionActions in your configuration. Example: <placeholder type="screen" id="0"/>
ja: 推移アクション・モジュールを複数回使用するためには、単に構成中でいくつかTransitionActionsを指定してください。例:<placeholder type="screen" id="0"/>
ru: Для многократного использования модулей Действий Переходов, достаточно задать несколько Действий Переходов в ваших настройках. Пример: <placeholder type="screen" id="0"/>
sw: Ili kutumia moduli za Kitendo cha Mpito zaidi ya mara moja, weka bayana VitendoVyaMpito mbali mbali kwenye usanidi wako. Mfano: <placeholder type="screen" id="0"/>

source: Here the same module is used to move a process ticket into the 'Raw' queue, and another time to move it into the junk queue. The Transition Action which must be used for a particular Transition is determined from the 'Path' setting of the Process configuration.
ja: ここで、同じモジュールは、「未対応」キューにプロセス・チケット移動するために、そしてある時はジャンクキューへそれを移動するために、使用されます。特別の推移に使用されることが求められる推移アクションは、プロセス構成の「パス」設定から決定されます。
ru: Здесь, один и тот же модуль используется для передачи процессной заявки в очередь "Raw", и в другой раз для перемещения в очередь "junk". Действие Перехода, используемое для конкретного Перехода определяется в параметре "Path" настроек Процесса.
sw: Hapa moduli ile ile inatumika kuhamisha tiketi ya mchakato kwenda kwenye foleni 'Mbichi', na wakati mwingine kuhamisha kwenda kwenye foleni taka. Kitendo cha Mpito ambacho lazima kitumike kwa Mpito fulani kinajulikana kutoka kwenye mpangilio wa 'Njia' ya usanidi wa Mchakato.

source: Available Transition Actions
ja: 利用可能な推移アクション
ru: Доступные Действия Перехода
sw: Vitendo vya Mpito vilivyopo.

source: OTRS comes with several Transition Actions that can be used in your processes. Here you can find their documentation and how they need to be configured.
ja: OTRSは、あなたのプロセスで使用できるいくつかの推移アクションを搭載しています。ここでは、それらのドキュメンテーション、およびどのようにしてそれらを設定する必要があるかを見つけることができます。
ru: OTRS стандартно имеет в составе несколько Действий Перехода, которые могут быть использованы в ваших процессах. Здесь вы можете найти их описание и способ настройки.
sw: OTRS inakuja na Vitendo vya Mpito vingi unavyoweza kutumia katika michakato yako. Hapa utapata nyaraka zake na jinsi zilivyo sanidiwa.

source: Sets one or more dynamic fields at a process ticket. Example:
ja: プロセス・チケットで1つ以上の動的フィールドをセットします。
ru: Задает одно или несколько динамических полей в процессной заявке. Пример:
sw: Ina seti sehemu zinazobadilika moja au zaidi katika mchakato wa tiketi. mfano:

source: 'Name' specifies the name of the configured TransitionAction.
ja: 「Name」は、設定された推移アクション名前を指定します。
ru: "Имя" задает имя конфигурируемого Действия Перехода.
sw: 'Jina' inaweka bayana jina la KitendoChaMpito kilicho sanidiwa.

source: 'MasterSlave' and 'Approved' are given as examples of DynamicField names. The values of the fields ('Master' and '1') will be set by this TransitionAction.
ja: 「MasterSlave」と「Approved：承認済」は DynamicField名のサンプルを付与されます。フィールド値 (「Master'」and 「1」) はこの推移アクションによってセットされます。
ru: 'Главный/Подчиненный' и 'Утверждение' даны как пример имен динамических полей. Значения полей ("Главный" и "1") будут установлены этим Действием Перехода.
sw: 'MkuuMtumwa' na 'Kubaliwa' inatolewa kama mifano ya majina ya SehemuZinazobadilika. Thamani za sehemu ('Mkuu' na '1') itasetiwa na KitendoChaMpito hiki.

source: Creates an article and can be used to create notes or email replies. Example:
ja: 記事を作成し、ノートあるいは電子メール返答を作成するために使用することができます。例:
ru: Создает сообщение/заметку и может быть использован для создания заметок или почтовых ответов. Пример:
sw: Inatengeneza Makala na inaweza kutumika kutengeneza dokezo au majibu ya barua pepe. Mfano:

source: 'Name' specifies the name of the configured TransitionAction. It can be freely chosen, but should reflect the purpose of the configured action.
ja: 「Name」は、設定された推移アクション名前を指定します。それは自由に選ぶことができますが、設定されたアクションの目的を反映するべきです。
ru: "Имя" задает имя настраиваемого Действия Перехода. Его можно выбрать произвольно, но желательно, чтобы оно отражало цель действия.
sw: 'Jina' inaweka bayana jina la KitendoChaMpito kilicho sanidiwa. Inachaguliwa kwa uhuru, lakini inatakiwa kuakisi maana ya kitendo kilicho sanidiwa.

source: 'ArticleType' defines the type of the article to be created. Possible values: phone, fax, sms, webrequest, note-internal, note-external and note-report.
ja: 「ArticleType」は、作成される記事のタイプを定義します。可能な値:電話、ファックス、sms、webrequest、ノート内部、ノート外部およびノート報告書。
ru: "Тип заметки/сообщения" задает тип создаваемой заметки. Возможные значения: phone, fax, sms, webrequest, note-internal, note-external and note-report.
sw: 'Aina ya Makala' inafafanua aina ya makala itakayotengenezwa. Thamani ziwezekanazo: simu, faksi, ujumbe mfupi wa maneno, notisi-ndani, notisi-nje, na notisi-ripoti.

source: SenderType defines the sender type of the article. Possible values: agent, system, customer.
ja: 「SenderType」は送り手タイプの記事を定義します。可能な値:担当者、システム、顧客。
ru: Тип отправителя задает тип отправителя для заметки/сообщения. Возможные значения: агент, система, клиент.
sw: Aina Ya Mtumaji inafafanua aina ya mtumaji wa makala. Thamani ziwezekanazo: wakala, mfumo, mteja.

source: 'ContentType' defines the content type of the article. Possible values: 'text/plain; charset=ISO-8859-15' or any other valid charset and mime type.
ja: 「ContentType」は、記事のコンテンツ・タイプを定義します。可能な値:'プレインテキスト;charset=ISO-8859-15'又は他の有効なcharsetとMIMEタイプ。
ru: "ContentType"/"Тип содержания" задает тип содержимого заметки/сообщения. Возможные значения: 'text/plain; charset=ISO-8859-15' или любой другая допустимая кодировка или mime тип.
sw: 'AinaMaudhui' inafafanua aina ya maudhui ya makala. Thamani ziwezekanazo: 'nakala/ghafi; seti kibambo=ISO-8859-15' au seti kibambo nyingine yoyote halali na aina ya mime.

source: 'Subject' defines the article title. Mandatory.
ja: 「Subject」は記事タイトルを定義します。必須項目。
ru: Тема - задает заголовок сообщения/заметки. Обязательна.
sw: 'Somo' inafafanua mada ya makala. Lazima.

source: 'Body' defines the article content. Mandatory.
ja: 「Body」は記事内容を定義します。必須項目。
ru: "Тело" - задает содержимое сообщения/заметки. Указывать обязательно.
sw: 'Kiini' inafafanua maudhui ya makala. Lazima.

source: HistoryType defines the type of the history entry. Possible values: AddNote, ArchiveFlagUpdate, Bounce, CustomerUpdate, EmailAgent, EmailCustomer, EscalationResponseTimeNotifyBefore, EscalationResponseTimeStart, EscalationResponseTimeStop, EscalationSolutionTimeNotifyBefore, EscalationSolutionTimeStart, EscalationSolutionTimeStop, EscalationUpdateTimeNotifyBefore, EscalationUpdateTimeStart, EscalationUpdateTimeStop, FollowUp, Forward, Lock, LoopProtection, Merged, Misc, Move, NewTicket, OwnerUpdate, PhoneCallAgent, PhoneCallCustomer, PriorityUpdate, Remove, ResponsibleUpdate, SendAgentNotification, SendAnswer, SendAutoFollowUp, SendAutoReject, SendAutoReply, SendCustomerNotification, ServiceUpdate, SetPendingTime, SLAUpdate, StateUpdate, Subscribe, SystemRequest, TicketDynamicFieldUpdate, TicketLinkAdd, TicketLinkDelete, TimeAccounting, TypeUpdate, Unlock, Unsubscribe, WebRequestCustomer.
ja: 「HistoryType」は、履歴エントリーのタイプを定義します。可能な値：AddNote, ArchiveFlagUpdate, Bounce, CustomerUpdate, EmailAgent,EmailCustomer, EscalationResponseTimeNotifyBefore, EscalationResponseTimeStart,EscalationResponseTimeStop,EscalationSolutionTimeNotifyBefore,EscalationSolutionTimeStart, EscalationSolutionTimeStop,EscalationUpdateTimeNotifyBefore,EscalationUpdateTimeStart, EscalationUpdateTimeStop,FollowUp, Forward, Lock, LoopProtection, Merged, Misc, Move, NewTicket, OwnerUpdate,PhoneCallAgent, PhoneCallCustomer,PriorityUpdate, Remove, ResponsibleUpdate,SendAgentNotification, SendAnswer, SendAutoFollowUp, SendAutoReject, SendAutoReply,SendCustomerNotification, ServiceUpdate, SetPendingTime, SLAUpdate, StateUpdate,Subscribe, SystemRequest, TicketDynamicFieldUpdate, TicketLinkAdd, TicketLinkDelete,TimeAccounting, TypeUpdate, Unlock, Unsubscribe, WebRequestCustomer.
ru: HistoryType - задает тип записи истории. Возможные значения: AddNote, ArchiveFlagUpdate, Bounce, CustomerUpdate, EmailAgent, EmailCustomer, EscalationResponseTimeNotifyBefore, EscalationResponseTimeStart, EscalationResponseTimeStop, EscalationSolutionTimeNotifyBefore, EscalationSolutionTimeStart, EscalationSolutionTimeStop, EscalationUpdateTimeNotifyBefore, EscalationUpdateTimeStart, EscalationUpdateTimeStop, FollowUp, Forward, Lock, LoopProtection, Merged, Misc, Move, NewTicket, OwnerUpdate, PhoneCallAgent, PhoneCallCustomer, PriorityUpdate, Remove, ResponsibleUpdate, SendAgentNotification, SendAnswer, SendAutoFollowUp, SendAutoReject, SendAutoReply, SendCustomerNotification, ServiceUpdate, SetPendingTime, SLAUpdate, StateUpdate, Subscribe, SystemRequest, TicketDynamicFieldUpdate, TicketLinkAdd, TicketLinkDelete, TimeAccounting, TypeUpdate, Unlock, Unsubscribe, WebRequestCustomer.
sw: AinaYaHistoria inafafanua aina ya ingizo la hitoria. Thamani ziwezekanazo: OngezaNotisi, NyarakaAlamaSasisha, Dunda, SasishaMteja, WakalaWaBaruapepe, MtejaWaBaruapepe, MudaWaKupandaMajibuTaarifuKabla, MudaWaKupandaMajibuAnza, MudaWaKupandaMajibuSitisha, MudaWaKupandaUsuluhishiTaarifuKabla, MudaWaKupandaUsuluhishiAnza, MudaWaKupandaUsuluhishiSitisha, MudaWaKupandaSasishaTaarifaKabla, MudaWaKupandaSasishaAnza, MudaWaKupandaSasishaSitisha, Ufwatiliaji, PelekaMbele, Funga, KitanziUlinzi, Unganishwa, Misc, Hamisha, TiketiMpya, MmilikiSasisha, PigaSimuWakala, PigaSimuMteja, KipaumbeleSasisha, Ondoa, JukumuSasisha, TumaTaarifaWakala, TumaJibu, TumaUfwatiliajiOtomatiki, TumaKataaKiotomatiki, TumaJibuKiotomatiki, TumaTaarifaMteja, SasishaHuduma, SetiMudaKusubiri, SasishaSLA, SasishaHali, Jiunge, MaombiYaMfumo, SasishaSehemuInayobadilikaTiketi, TiketiOngezaKiungo, TiketiFutaKiungo, MahesabuYaMuda, SasishaAina, Fungua, Jiondoe, MaombiYaTocutiMteja.

source: 'HistoryComment' defines the content of the history entry.
ja: 「HistoryComment」は、履歴エントリーの内容を定義します。
ru: "HistoryComment" описывает содержимое записи истории.
sw: 'HistoriaMaoni' inafafanua maudhui ya ingizo la historia.

source: 'From', 'To', 'Cc' and 'ReplyTo' take email addresses in the notation specified above.
ja: 上で指定した表記法で'From', 'To', 'Cc' and 'ReplyTo'はEメール・アドレスをとります。
ru: "От", "Кому", "Копия" и "Ответить" задает адреса электронной почты с учетом правил, указанных выше.
sw: 'Kutoka','Kwa','Nakala' na 'JibuKwa' peleka anuani za barua pepe kwenye nukuu zilizobainishwa juu.

source: 'InReplyTo' and 'References' take email message IDs.
ja: 「InReplyTo」および「References」はEメール・メッセージIDをとります。
ru: 'InReplyTo' и 'References' получает идентификаторы/IDs сообщений.
sw: 'KatikaMajibuKwa' na 'Marejeo' chukua Vitambulisho vya ujumbe wa barua pepe.

source: 'NoAgentNotify' - if set to 1, the email notification of the Agent will not be sent.
ja: 「NoAgentNotify」-1にセットされれば、担当者への電子メール通知は送られません。
ru: "NoAgentNotify"/Не иформировать агента - если установлено в "1", уведомление агенту посылаться не будет.
sw: 'HakunaWakalaArifu'-kama imesetiwa kuwa 1, taarifa ya barua pepe ya Wakala haitatumwa.

source: 'AutoResponseType' can take the following values: auto follow up, auto reject, auto remove, auto reply, auto reply/new ticket.
ja: 「AutoResponseType」は次の値をとることができます:自動フォローアップ、自動拒否、自動削除、自動応答、自動返答/新規チケット。
ru: "AutoResponseType"/"Тип автоответа" - может принимать следующие значения: auto follow up/автоотклик, auto reject/автоотказ, auto remove/автоудаление, auto reply/автоответ, auto reply/new ticket/автоответ-новая заявка.
sw: 'MajibuAinaOtomatiki' inaweza kuchukua thamani zifuatazo: ufwatiliaji otomatiki, ukataaji otomatiki, uondoaji otomatiki, majibu otomatiki, majibu otomatiki/tiketi mpya.

source: 'ForceNotificationToUserID', 'ExcludeNotificationToUserID', 'ExcludeMuteNotificationToUserID' can take a list of UserIDs that are either always notified, not notified or listed as notified but not actually sent a notification email.
ja: 'ForceNotificationToUserID', 'ExcludeNotificationToUserID','ExcludeMuteNotificationToUserID' は、ユーザーIDのリストをとることができます。そのリストとは、「常に通知」、「非通知」、または「通知されるが実際には通知メールを送らない、です。
ru: 'ForceNotificationToUserID', 'ExcludeNotificationToUserID', 'ExcludeMuteNotificationToUserID' может содержать список UserIDs, которые либо всегда оповешаются, не оповещаются, либо помечаются как оповещенные, но на самом деле им не отправлено уведомление по электронной почте.
sw: 'LazimishaTaarifaKwaKitambulichoChaMtumiaji', 'TenganishaTaarifaKwaKitambulishoChamtumiaji', 'TenganishaNyamazishaTaarifaKwaKitambulishoChaMtumiaji' zinaweza kuchukua orodha ya Vitambulisho vya Watumiaji ambao aidha wanapata taarifa kila wakati, hawapati taarifa au wanawekwa kwenye orodha kama wanapata taarifa lakini hawapati barua pepe ya taarifa.

source: Sets the customer of a process ticket. Example:
ja: 顧客にプロセス・チケットをセットします。例：
ru: Задает клиента процессной заявки. Пример:
sw: Inaseti mteja wa tiketi ya mchakato. Mfano:

source: No or CustomerID set the Customer ID of the customer.
ja: No あるいは、CustomerIDは、顧客の顧客IDをセットします。
ru: Пусто или CustomerID, задающий Customer ID клиента.
sw: Hakuna au Kitambulisho cha Mteja inaseti kitambulisho cha Mteja.

source: User or CustomerUserID set the Username of the customer.
ja: ユーザまたはCustomerUserIDは、顧客のユーザー名をセットします。
ru: User/Пользователь или CustomerUserID/ID учетной записи - задает Имя клиента.
sw: Mtumiaji au KitambulishoChaMtumiajiMteja anaseti jina la mtumiaji la mteja.

source: Changes the lock of a process ticket. Example:
ja: プロセス・チケットのロックを変更します。例:
ru: Устанавливает состояние блокирования процессной заявки. Пример:
sw: Inabadilisha ufunguo wa tiketi ya mchakato, Mfano:

source: 'Lock' defines the new lock of the process ticket.
ja: 「Lock」は、プロセス・チケットの新しいロックを定義します。
ru: 'Lock/Блокировка' - задает новый статус блокировки для процессной заявки.
sw: 'Funga' inafafanua ufungaji mpya wa tiketi ya mchakato.

source: 'LockID' defines the internal ID of the new lock.
ja: 「LockID」は、新しいロックの内部IDを定義します。
ru: 'LockID' задает внутренний ID нового статуса блокировки.
sw: 'Kitambulisho cha Funga' inafafanua kitambulisho cha ndani cha ufungaji mpya.

source: Changes the owner of a process ticket. Example:
ja: プロセス・チケットの所有者を変更します。
ru: Изменяет владельца этой процессной заявки. Пример:
sw: Inabadilisha mmiliki wa tiketi ya nchakato. Mfano:

source: 'Owner' specifies the login name of the new owner.
ja: 「Owner」は、新しい所有者のログイン名を指定します。
ru: "Owner"/"Владелец" - задает логин нового владельца.
sw: 'Mmiliki' inaweka bayana jina la kuingia la mmiliki mpya.

source: 'OwnerID' specifies the internal ID of the new owner.
ja: 「OwnerID」は、新しい所有者の内部IDを指定します。
ru: "OwnerID" задает внутренний ID нового владельца.
sw: 'Kitambulisho cha Mmiliki' inaweka bayana kitambulisho cha ndani cha mmiliki mpya.

source: Moves the ticket into a target queue. Example:
ja: ターゲット・キューにチケットを移動します。
ru: Перемещает заявку в указанную очередь. Пример:
sw: Inapeleka tiketi kwenye foleni lengwa. Mfano:

source: 'Queue' specifies the name of the target queue.
ja: 「Queue」は、対象のキューの名前を指定します。
ru: "Queue" задает имя очереди для перемещения.
sw: 'Foleni' inaweka bayana jina la foleni lengwa.
