Repository: DSigmund/doc-admin
Catalog: i18n/doc-admin.*.po
Languages: ja, ru, sw

source: <emphasis>Figure: Pop-up dialog to change a ticket's responsibility.</emphasis>
ja: <emphasis>図：チケット責任者を変更するポップアップ・ダイアログ</emphasis>
ru: <emphasis>Рисунок: Всплывающий диалог для изменения ответственного за заявку.</emphasis>
sw: <emphasis>Kielelezo: Maongezi ibukizi ya kubadilisha jukumu la tiketi.</emphasis>

source: The list of all tickets for which an agent is responsible, can be accessed through the Responsible view of the OTRS agent interface, as soon as the ticket responsibility feature gets activated.
ja: チケット責任者機能が活性化されるとすぐに、担当者が責任を負う全チケットのリストは、OTRS担当者インターフェイスの責任者ビューを通してアクセスできます。
ru: Если активирована функция ответственности за заявку, то в шаблоне Ответственность, агентского веб-интерфейса OTRS можно просмотреть список всех заявок, за которые агент несет ответственность.
sw: Orodha ya tiketi zote ambazo wakala anawajibika, zinaweza kufikiwa kupitia muonekaano wa Majukumu wa kiolesura cha wakala wa OTRS, baada tu ya kipengele cha jukumu la tiketi kuamilishwa.

source: Ticket watching
ja: チケットの監視
ru: Просмотр Заявок
sw: Uangalizi wa tiketi

source: From OTRS 2.1 on, select agents such as supervisors can watch certain tickets within the system without processing them, by using the TicketWatcher feature.
ja: OTRS2.1から 「チケット監視」機能を使えば スーパバイザのような担当者を選ぶことにより、システム内の特定のチケットを処理することなく監視することができます。
ru: Начиная с OTRS 2.1 и выше с помощью функции TicketWatcher, выбранные агенты, такие как, например, руководители могут просматривать определенные заявки без их обработки.
sw: Kutoka OTRS 2.1 na kuendelea, chagua mawakala kama wasimamizi wanaweza kuangalia baadhi ya tiketi ndani ya mfumo bila kuzichakatisha, kwa kutumia kipengele TiketiMwangalizi.

source: In order to watch a ticket, go to its zoomed view and click on the "Subscribe" link in the ticket activities menu (see Figure below).
ja: チケットを見るためには、ズーム・ビューに行って、チケット活動メニュー中の「購読」リンクをクリックしてください(下記の図を参照)。
ru: Для того чтобы смотреть заявку, перейдите к шаблону просмотра подробной информации о заявке и нажмите ссылку "Подписатся" в меню заявки (см. нижеприведенный Рисунок).
sw: Ili kuangalia tiketi, nenda kwenye muonekano wake uliokuzwa na bofya kwenye kiungo "Jiunge" katika menyu ya shughuli za tiketi (ona Kielelezo chini).

source: Subscribe link on ticket zoom
ja: チケットズーム画面上の購読リンク
ru: Ссылка "Подписатся" в шаблоне просмотра подробной информации о заявке
sw: Kiungo cha kujiunga kwenye kuza tiketi

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="index.pl - screenshot" scale="40" fileref="screenshots/ticket-subscribe.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="index.pl - スクリーンショット" scale="40" fileref="screenshots/ticket-subscribe.png"></graphic>

source: <emphasis>Figure: Subscribing to watching a ticket in its zoomed view.</emphasis>
ja: <emphasis>図:ズーム・ビューでチケットを監視するために購読する</emphasis>
ru: <emphasis>Figure: Подписка на просмотр подробной информации о заявке.</emphasis>
sw: <emphasis>Kielelezo: Kujiunga kuona tiketi katika muonekano uliokuzwa.</emphasis>

source: If you no longer want to watch a specific ticket, go to its zoomed view and click on the "Unsubscribe" link in the ticket activities menu (see Figure below).
ja: もう特定のチケットを見たくない場合は、ズーム・ビューへ行き、チケット活動メニュー中の「購読しない」リンクをクリックします(下記の図を参照)。
ru: Если вы больше не хотите просматривать определенную заявку, перейдите к шаблону просмотра подробной информации заявки и нажмите кнопку "Отменить подписку" в меню заявки (см. нижеприведенный рисунок).
sw: Kama hutaki tena kuangalia tiketi fulani, nenda kwenye muonekano wake uliokuzwa na bofya kwenye kiungo "Jiondoe" katika menyu ya shughuli za tiketi (ona Kielelezo chini).

source: Unsubscribe link on ticket zoom
ja: ズーム・ビューでチケットの監視の登録解除
ru: Ссылка "Отказатся от подписки" в шаблоне просмотра подробной информации о заявке
sw: Kiungo cha kujiondoa kwenye kuza tiketi

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="index.pl - screenshot" scale="40" fileref="screenshots/ticket-unsubscribe.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="index.pl - スクリーンショット" scale="40" fileref="screenshots/ticket-unsubscribe.png"></graphic>

source: <emphasis>Figure: Unsubscribing from watching a ticket in its zoomed view.</emphasis>
ja: <emphasis>図:ズーム・ビューでチケットの監視の登録解除</emphasis>
ru: <emphasis>Рисунок: Отказ от подписи на заявку в шаблоне просмотра подробной информации о заявке.</emphasis>
sw: <emphasis>Kielelezo: Kujiondoa kwenye uangalizi wa tiketi katika muonekano wake uliokuzwa.</emphasis>

source: The list of all watched tickets can be accessed through the Watched view of the OTRS agent interface (see Figure below), as soon as the ticket watcher feature gets activated.
ja: 監視中のすべてのチケットのリストは、チケット監視者機能が活性化されるとすぐに、OTRS担当者インターフェイス（下図参照）の監視ビュー経由でアクセス可能になりました
ru: Как только активирована функция "просмотр заявок", то список всех просматриваемых заявок будет доступен в шаблоне Watched View (см. нижеприведенный Рисунок).
sw: Orodha ya tiketi zote zinazoangaliwa inaweza kupatikana kupitia muonekano wa Zilizoangaliwa wa wakala wa OTRS (ona Kielelezo chini), baada tu ya mwangalizi wa tiketi kuamilishwa.

source: Mailbox: Watched tickets
ja: メールボックス：監視チケット
ru: Почтовый ящик: Просматриваемые заявки
sw: Sanduku la Posta: Tiketi zilizoangaliwa

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="index.pl - screenshot" scale="40" fileref="screenshots/ticket-subscribe-mailbox.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="index.pl - スクリーンショット" scale="40" fileref="screenshots/ticket-subscribe-mailbox.png"></graphic>

source: <emphasis>Figure: Watched tickets view.</emphasis>
ja: <emphasis>図:監視チケットビュー</emphasis>
ru: <emphasis>Рисунок: Шаблон для просматриваемых заявок.</emphasis>
sw: <emphasis>Kielelezo: Muonekano wa tiketi zilizoangaliwa.</emphasis>

source: The ADMIN area of OTRS
ja: OTRSの管理者エリア
ru: Панель управления OTRS
sw: Eneo la MSIMAMIZI wa OTRS

source: The following system configuration settings are available to OTRS administrators by accessing the Admin page of the OTRS web interface - adding agents, customers and queues, ticket and mail settings, installing additional packages such as FAQ and ITSM, and much more.
ja: 次のシステム構成セッティングは、OTRS管理者が、OTRSウェブインターフェースの管理者ページへのアクセスをすることで利用可能です。それにより可能なことは、担当者、顧客、そしてキューの追加。チケットとEメールの構成、FAQやITSMなどさらに多くの追加のパッケージをインストールすることです。
ru: Администраторы используют страницу администрирования веб-интерфейса OTRS для настройки системы - добавления агентов, клиентов и очередей, заявок и настройки почты, установки дополнительных пакетов, таких как FAQ и ITSM и многое другое.
sw: Mipangilio ifuatayo ya usanidi wa mfumo inapatikana kwa wasimamizi wa OTRS kwa kufikia kurasa ya Msimamizi ya kiolesura cha tovuti cha OTRS - kuongeza mawakala, wateja na foleni, tiketi na mipangilio ya barua, kusakinisha vifurushi vya ziada kama FAQ na ITSM na nyingine nyingi.

source: Agents who are members of the <emphasis>admin</emphasis> group can access the Admin area by clicking the <emphasis>Admin</emphasis> link in the navigation bar (see Figure below). Agents without sufficiently elevated access rights will not be able to access this link.
ja: <emphasis>管理者</emphasis>グループのメンバーである担当者は、ナビゲーション・バー中の<emphasis>管理者</emphasis>リンクのクリックにより管理者エリアにアクセスすることができます(下記の図を参照)。十分に高いアクセス権のない担当者はこのリンクにアクセスすることができません。
ru: Агенты, входящие в группу <emphasis>admin</emphasis> могут получить доступ к админке, нажав на кнопку <emphasis>Администрирование</emphasis> на панели навигации (см. нижеприведенный Рисунок). Остальные агенты не будут видеть эту ссылку.
sw: Mawakala ambao ni wanachama wa kundi la <emphasis>msimamizi</emphasis> wanaweza kufikia eneo la Msimamizi kwa kubofya kiungo cha <emphasis>msimamizi</emphasis> katika mwambaa wa uabiri (ona Kielelezo chini). Mawakala bila haki za ufikivu za juu hawataweza kufikia kiungo hiki.

source: The OTRS Admin screen
ja: OTRS管理者画面
ru: Страница OTRS-Администратора
sw: Skrini ya Msimaizi wa OTRS

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="Adminarea - screenshot" scale="40" fileref="screenshots/adminarea.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="管理者エリア - スクリーンショット" scale="40" fileref="screenshots/adminarea.png"></graphic>

source: <emphasis>Figure: OTRS Admin screen.</emphasis>
ja: <emphasis>図: OTRS管理者画面。</emphasis>
ru: <emphasis>Рисунок: Страница OTRS-администратора.</emphasis>
sw: <emphasis>Kielelezo: Skrini ya Msimaizi wa OTRS.</emphasis>

source: Agents, Groups and Roles
ja: 担当者、グループおよび役割
ru: Агенты, Группы и Роли
sw: Mawakala, Makundi na Majukumu

source: Agents
ja: 担当者
ru: Агенты
sw: Mawakala

source: By clicking the link <emphasis>Agents</emphasis>, you get access to the agent management screen of OTRS (see Figure below). Administrators can add, change or deactivate agent accounts. Furthermore they can also manage agent preferences, including the language and notification settings for the individual agent's interface.
ja: <emphasis>担当者</emphasis>のリンクをクリックし、OTRSの担当者管理画面にアクセスします(下記の図を参照)。管理者は担当者アカウントを追加、変更、非活性化することができます。更に、管理者は個々の担当者のインターフェースのための言語と通知に関する構成を含む担当者選好を管理することができます。
ru: Нажав на ссылку <emphasis>Агенты</emphasis> вы получите доступ к странице управления агентами OTRS (см. нижеприведенный Рисунок). Администраторы могут добавлять, изменять или деактивировать аккаунты агентов. Администраторы также могут управлять личными настройками агентов, например изменять язык их веб-интерфейса, настройки уведомлений.
sw: Kwa kubofya kiungo <emphasis>Mawakala</emphasis>, unapata ufikivu kwenye skrini ya OTRS ya usimamizi wa wakala (ona Kielelezo chini). Wasimamizi wanaweza kuongeza, kubadilisha au kulemaza akaunti za wakala. Kwa zaidi wanaweza kusimamia mapendeleo ya wakala, ikijumuisha lugha na mipangilio ya taarifa kwa kila kiolesura cha wakala.

source: An OTRS agent account may be deactivated but not deleted. Deactivation is done by setting the Valid flag to <emphasis>invalid</emphasis> or <emphasis>invalid-temporarily</emphasis>.
ja: OTRSの担当者アカウントは非活性化されますが、ここでは削除はされません。非活性化は<emphasis>無効</emphasis>または<emphasis>無効-暫定</emphasis>のフラグを有効にセットするで実施されます。
ru: Учетная запись (аккаунт) агента может быть деактивирована, но не удалена. Деактивация осуществляется путем установки параметра Действительный в значение <emphasis>не действительный</emphasis> или <emphasis>не действительный-временно</emphasis>.
sw: Akaunti ya wakala wa OTRS inaweza kulemazwa lakini sio kufutwa. Kulemaza kunafanywa kwa kuseti alma ya Halali kuwa <emphasis>batili</emphasis> au <emphasis>batili-kwa muda</emphasis>.

source: Agent management
ja: 担当者管理
ru: Управление Агентами
sw: Usimamizi wa wakala

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="Adminarea Agent management - screenshot" scale="40" fileref="screenshots/admin-agents.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="管理者エリア 担当者管理 - スクリーンショット" scale="40" fileref="screenshots/admin-agents.png"></graphic>

source: <emphasis>Figure: Agent management.</emphasis>
ja: <emphasis>図:担当者管理。</emphasis>
ru: <emphasis>Рисунок: Управление Агентами.</emphasis>
sw: <emphasis>Kielelezo: Usimamizi wa wakala.</emphasis>

source: To register an agent, click on the "Add agent" button, enter the required data and press the Submit button at the bottom of the screen, as shown in Figure.
ja: 担当者を登録するには図の中で示されるように、「担当者追加」ボタン上のクリックし、必要なデータを入力し、画面の最下部の送信（Submit）ボタンを押します。
ru: Чтобы создать агента, нажмите на кнопку "Добавить агента", введите все необходимые данные и нажмите кнопку Отправить, которая находится в нижней части экрана, как это показано на нижеприведенном Рисунке.
sw: Kusajili wakala, bofya kwenye kitufe cha "Ongeza wakala", ingiza data inayotakiwa na bonyeza kitufe cha Wasilisha upande wa chini wa skrini, kama ilivyoonyeshwa kwenye Kielelezo.

source: Adding an agent
ja: 担当者の追加
ru: Добавление агента
sw: Kuongeza wakala

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="Adminarea agent management - screenshot" scale="40" fileref="screenshots/add-agent.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="管理者エリア 担当者管理 - スクリーンショット" scale="40" fileref="screenshots/add-agent.png"></graphic>

source: <emphasis>Figure: Adding a new agent.</emphasis>
ja: <emphasis>図:新規担当者の追加。</emphasis>
ru: <emphasis>Рисунок: Добавление нового агента.</emphasis>
sw: <emphasis>Kielelezo: Kuongeza wakala mpya.</emphasis>

source: After the new agent account has been created, you should make the agent a member of one or more groups or roles. Information about groups and roles is available in the <link linkend="adminarea-groups">Groups</link> and <link linkend="adminarea-roles">Roles</link> sections of this chapter.
ja: 新規担当者アカウントが作成された後、担当者に1つ以上のグループあるいは役割のメンバーを作るべきです。グループと役割に関する情報は本章の<link linkend="adminarea-groups">グループ</link> と<link linkend="adminarea-roles">役割</link>のセクションにおいて利用可能です。
ru: После того, как новая учетная запись агента создана, его нужно сделать членом одной или нескольких груп или ролей. За дополнительной информацией о группах и ролях обращайтесь к разделу <link linkend="adminarea-groups">Группы</link> и <link linkend="adminarea-roles">Роли</link> данной главы.
sw: Baada ya akaunti mpya ya wakala kutengenezwa, unatakiwa kumfanya wakala mwanachama wa kundi moja au zaidi au majukumu. Taarifa kuhusu majukumu au makundi zinapatikana katika vifungu<link linkend="adminarea-groups">Makundi</link> na <link linkend="adminarea-roles">Majukumu</link> vya sura hii.

source: Groups
ja: グループ
ru: Группы
sw: Makundi

source: Every agent's account should belong to at least one group or role. In a brand new installation, there are three pre-defined groups available, as shown in Table 5-1.
ja: すべての担当者アカウントは少なくとも1つのグループあるいは役割に属するべきです。新規インストールでは、テーブル5-1に示されるように、利用可能な3つの事前定義されたグループがあります。
ru: Каждая учетная запись агента должна принадлежать по крайней мере к одной группе или роли. После установки системы есть три предопределенных групы, которые приведены в Таблице 5-1.
sw: Kila akaunti ya wakala inatakiwa iwe kwenye japo kundi moja au jukumu. Katika usakinishaji mpya, kuna makundi matatu yanapatikana yaliyofafanuliwa tayari, kama ilivyoonyeshwa kwenye Jedwali 5-1.

source: Default groups available on a fresh OTRS installation
ja: デフォルト・グループは新規のOTRSインストールで利用可能です
ru: Предопределенные групы, доступны для новой (только что) установленной системы OTRS
sw: Makundi chaguo-msingi yanayopatikana katika usakinishaji mpya wa OTRS

source: Group
ja: グループ
ru: Группа
sw: Kundi

source: Description
ja: 摘要
ru: Описание
sw: Maelezo

source: Allowed to perform administrative tasks in the system.
ja: システムで管理業務を実行することができます。
ru: Допускается для выполнения административных задач в системе.
sw: Ruhusa ya kufanya kazi za usimamizi wa mfumo.

source: Qualified to access the stats module of OTRS and generate statistics.
ja: OTRSのstatsモジュールにアクセスし、統計を生成する資格があります。
ru: Компетентные для генерации статистики и доступа к модулю статистики OTRS.
sw: Fuzu kufikia kwenye moduli ya takwimu ya OTRS na kutengeneza takwimu.

source: Agents should belong to this group, with read and write permissions. They can then access all functions of the ticket system.
ja: 担当者は読み書きの権限を持って、このグループに属し、チケットシステムのすべての機能にアクセスすることができます
ru: Агенты должны входить в эту группу с правами для чтения и записи. Тогда они смогут получить доступ ко всем функциям системы обработки заявок.
sw: Mawakala wapo kwenye hili kundi, wakiwa na ruhusa za kusoma na kuandika. Wanaweza kufikia programu-tumizi zote za mfumo wa tiketi.

source: In a brand new OTRS installation, the <emphasis>users</emphasis> group initially does not have any members. The agent 'root@localhost' belongs by default to the admin and stats groups.
ja: 新規OTERSインストレーションでは、最初は<emphasis>ユーザ</emphasis>グループにメンバーは存在しません。担当者'root@localhost'はデフォルトでは管理者及び状態グループに属します。
ru: В новой установке OTRS, группа <emphasis>users</emphasis> изначально пуста. Агент 'root@localhost' по умолчанию является членом групп admin и stats.
sw: Katika usakinishaji mpya wa OTRS, kundi la <emphasis>watumiaji</emphasis> halina mwanachama yoyote mwanzoni . Wakala 'root@localhost' ni mwanachama wa makundi msimaizi na takwimu kwa chaguo-msingi.

source: You can access the group management page (see Figure below) by clicking the <emphasis>Groups</emphasis> link in the admin area.
ja: 管理者エリアの<emphasis>グループ</emphasis>リンクをクリックするとグループ管理ページ(下記の図を参照)にアクセスすることができます。
ru: Чтобы перейти на страницу управления группами, нажмите в панели администрирования ссылку <emphasis>Группы</emphasis> (см. нижеприведенный Рисунок).
sw: Unaweza kufikia kurasa ya usimamizi wa kundi (ona Kielelezo chini) kwa kubofya kiungo <emphasis>Makundi</emphasis> katika eneo la msimamizi.

source: Group management
ja: グループ管理
ru: Управление Группами
sw: Usimamizi wa kundi

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="Adminarea group management - screenshot" scale="40" fileref="screenshots/admin-groups.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="管理者エリア グループ管理 - スクリーンショット" scale="40" fileref="screenshots/admin-groups.png"></graphic>

source: <emphasis>Figure: Group management.</emphasis>
ja: <emphasis>図:グループ管理。</emphasis>
ru: <emphasis>Рисунок: Управление групами.</emphasis>
sw: <emphasis>Kielelezo: Usimamizi wa kundi.</emphasis>

source: As with agents, an OTRS group may be deactivated but not deleted. Deactivation is done by setting the Valid flag to <emphasis>invalid</emphasis> or <emphasis>invalid-temporarily</emphasis>.
ja: 担当者でそうであるように、OTRSグループは非活性化することができますが削除はできません。非活性化は<emphasis>無効</emphasis>または<emphasis>無効-暫定</emphasis>のフラグを有効にセットするで実施されます。
ru: Как в случае с агентами, группа в OTRS может быть только деактивирована, но не удалена. Деактивация осуществляется путем установки флага Действительный в значение <emphasis>не действительный</emphasis> или <emphasis>не действительный-временно</emphasis>.
sw: Kama ilivyo kwa mawakala, kundi la OTRS linaweza kulemazwa lakini si kufutwa. Kulemazwa kunafanywa kwa kuseti alama Halali kuwa <emphasis>batili</emphasis> au <emphasis>batili-kwa muda</emphasis>.

source: To add an agent to a group, or to change the agents who belong to a group, you can use the link <emphasis>Agents &lt;-&gt; Groups</emphasis> from the Admin page (see Figure below).
ja: 担当者をグループに加えるかあるいはグループに属する担当者を変更するために、管理者ページから<emphasis>担当者リンク&lt;-&gt; グループ</emphasis>を使用することができます(下記の図を参照)。
ru: Чтобы добавить агента в группу, или изменить приналежность агентов к группе, используйте ссылку на Панели Управления <emphasis>Агенты &lt;-&gt; Группы</emphasis> (см. нижеприведенный Рисунок).
sw: Kuongeza wakala kwenye kundi, au kubadilisha mawakala ambao wapo kwenye kundi, unaweza kutumia kiungo <emphasis>Mawakala&lt;-&gt; Makundi</emphasis> kutoka kwenye kurasa ya Msimamizi (ona Kielelezo chini).

source: Agent Group management
ja: 担当者グループ管理
ru: Управление Группой Агента
sw: Usimamizi wa Kundi la Wakala

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="Adminarea groups and agents - screenshot" scale="40" fileref="screenshots/admin-agents-and-groups.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="管理者エリア グループと担当者 - スクリーンショット" scale="40" fileref="screenshots/admin-agents-and-groups.png"></graphic>

source: An overview of all groups and agents in the system is displayed on this page. You can also use the available filters to find a specific entity. If you want to change the groups that an agent is a member of, just click on the agent's name (see Figure below). To change the agents associated with a group, just click on the group you want to edit (see Figure below).
ja: システムでのすべてのグループおよび担当者の概要はこのページに表示されます。さらに、特定のエンティティ（実体）を検索するために利用可能なフィルタを使用することができます。担当者がメンバーであるグループを変更したい場合は、担当者の名前をクリックしてください(下記の図を参照)。グループに関連付けされた担当者を変更するためには、編集したいグループをクリックしてください(下記の図を参照)。
ru: На этой странице приводится обзор всех групп и агентов. Для поиска той или иной сущности можно использовать фильтры. Если вы хотите изменить группы, в которые входит определенный агент, просто нажмите на его имя (см. нижеприведенный Рисунок). Для изменениия агентов, связанных с группой просто нажмите на название нужной группы (см. нижеприведенный Рисунок).
sw: Mapitio ya makundi yote na mawakala wote wa mfumo yanaonyeshwa katika ukurasa huu. Pia unaweza kutumia vichujio vilivyopo kutafuta chombo fulani maalumu. Kama ukitaka kubadilisha makundi ambayo wakala ni mwanachama, bofya kwenye jina la wakala (ona Kielelezo chini). Kubadilisha mawakala wanaohusika na kundi fulani, bofya kwenye kundi unalotaka kuhariri (ona Kielelezo chini).

source: Agent-Group management
ja: 担当者グループ管理
ru: Управление Группами Агентов
sw: Usimaizi wa Kundi-Wakala

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="Adminarea groups and agents - screenshot" scale="40" fileref="screenshots/agent-group-relations.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="管理者エリア グループと担当者 - スクリーンショット" scale="40" fileref="screenshots/agent-group-relations.png"></graphic>

source: <emphasis>Figure: Change the groups an agent belongs to.</emphasis>
ja: <emphasis>図:担当者が属するグループを変更。</emphasis>
ru: <emphasis>Рисунок: Изменение группы, к которой принадлежит агент.</emphasis>
sw: <emphasis>Kielelezo: Badilisha kundi alilopo wakala.</emphasis>

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="Adminarea groups and agents - screenshot" scale="40" fileref="screenshots/agent-group-relations2.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="管理者エリア グループと担当者 - スクリーンショット" scale="40" fileref="screenshots/agent-group-relations2.png"></graphic>

source: <emphasis>Figure: Change the agents that belong to a specific group.</emphasis>
ja: <emphasis>図:特定のグループに属する担当者を変更。</emphasis>
ru: <emphasis>Рисунок: Изменение агентов, входящих в определенную группу.</emphasis>
sw: <emphasis>Kielelezo: Badilisha mawakala waliopo kwenye makundi maalumu.</emphasis>

source: Each group has a set of rights associated with it, and each group member (agent) may have some combination of these rights for themselves. A list of the permissions / rights is shown in Table 5-2.
ja: 各グループはそれに関連した権限のセットを保持しています。そして各グループメンバー(担当者)は各々自分のためにこれらの権限の組み合わせを持つことができます。許可/権限のリストはテーブル5-2を御覧ください。
ru: Каждая группа имеет набор прав, связанный с ней и, каждый член этой группы (агент) может иметь некоторую собственную комбинацию прав. Список разрешений/прав приведен в Таблице 5-2.
sw: Kila kundi lina seti ya haki zinazohusishwa nalo, na kila mwanachama (wakala) wa kundi anaweza kuwa na mjumuisho wa haki hizi kwa ajili yake mwenyewe. Orodha ya haki / ruhusa imeonyeshwa kwenye Jedwali 5-2.

source: Rights associated with OTRS Groups
ja: OTRSグループと関連した権限
ru: Права, связанные с OTRS-группами
sw: Haki zinazohusishwa na makundi ya OTRS

source: Right
ja: 権限
ru: Права
sw: Haki

source: Read only access to the tickets, entries and queues of this group.
ja: このグループのチケット、エントリー、キューへのRead onlyのアクセス
ru: Права "только для чтения" заявок, записей и очередей этой группы.
sw: Uwezo wa kusoma tiketi, maingizo na foleni tu kwa hili kundi.

source: Right to move tickets or entries between queues or areas that belong to this group.
ja: このグループのエリア、キュー間におけるエントリーあるいはチケットの移動権限
ru: Права для перемещения заявок или записей между очередями или для области, принадлежащей группе.
sw: Haki ya kuhamisha tiketi au maingizo katikati ya foleni au maeneo yaliyo kwenye hili kundi.

source: Right to create tickets or entries in the queues or areas of this group.
ja: このグループのエリアまたはキュー間におけるエントリーあるいはチケットの作成権限
ru: Права для создания заявок или записей в очередях или области группы.
sw: Haki ya kutengeneza tiketi au maingizo kwenye foleni au maeneo ya hili kundi.
