Repository: DSigmund/doc-admin
Catalog: i18n/doc-admin.*.po
Languages: ja, ru, sw

source: Access the login screen as described in the section <link linkend="agent-interface">Agent web interface </link>. Enter a user name and password. Since the system has just been installed and no users have yet been created, login as OTRS administrator first, using 'root@localhost' for username and 'root' for password.
ja: セクション<link linkend="agent-interface">Agent web interface </link>に記載のようにログイン画面へアクセスします。ユーザ名とパスワードを入力します。システムはインストールされたばかりでユーザはまだ作成されていませんので、まず、ユーザ名として'root@localhost' をパスワードとして'root'を使用してOTRS管理者としてログインします。
ru: Перейдите к странице входа, как это описано в разделе <link linkend="agent-interface">Агентский веб-интерфейс </link>. Введите имя пользователя и пароль. Ввиду того что после новой установки в системе нет ни одного зарегистрированного пользователя, войдите в первый раз с правами OTRS-администратора, используя для этого имя пользователя 'root@localhost' и пароль 'root'.
sw: Fikia kwenye skrini ya kuingia kama ilivyoelezewa katika kifungu <link linkend="agent-interface">Kiolesura cha tovuti cha wakala</link>. Ingiza jina ka mtumiaji na nywila. Kwa kuwa mfumo ndio kwanza umesakinishwa na hakuna mtumiaji aliyetengenezwa, ingia kama msimamizi wa OTRS kwanza, kwa kutumia 'root@localhost' kama jina la mtumiaji na 'root' kama nywila.

source: This account data is valid on every newly installed OTRS system. You should change the password for the OTRS administrator as soon as possible! This can be done via the <link linkend="user-preferences">preferences</link> screen for the OTRS administrator account.
ja: このアカウントデータは どの新規にインストールされたOTRSシステムでも有効です。OTRS管理者パスワードはできるだけ早く変更すべきです。OTRS管理者用画面<link linkend="user-preferences">preferences</link>から実行できます。
ru: Данные доступа этого аккаунта действительны для каждой копии новоустановленной системы OTRS. Именно по этой причине пароль OTRS-администратора необходимо изменить как можно быстрее. Это можно сделать после входа в систему с правами администратора перейдя по ссылке <link linkend="user-preferences">preferences</link>.
sw: Hii data ya akaunti ni halali kwa kila usakinishaji mpya wa mfumo wa OTRS. Unatakiwa kubadilisha nywila ya msimamizi wa OTRS mapema iwezekanavyo! Hii inaweza kufanyika kupitia skrini ya <link linkend="user-preferences">mapendeleo</link> kwa ajili ya akaunti ya msimamizi wa OTRS.

source: If you don't want to login as OTRS administrator, just enter the user name and password for your normal agent account.
ja: OTRS管理者としてログインしたくなければ、あなたの通常の担当者アカウント用のユーザ名とパスワードを入力してもいいです
ru: Если не хотите входить в систему с правами OTRS-администратора, просто введите имя и пароль своего обычного агентского аккаунта.
sw: Kama hutaki kuingia kama msimamizi wa OTRS, ingiza jina la mtumiaji na nywila za akaunti yako ya kawaida ya wakala.

source: In case you have forgotten your password, you can request the system for a new password. Simply press the link below the Login button, enter the mail address that is registered for your OTRS account into the input field, and press the Submit button (see Figure).
ja: パスワードをお忘れの場合、新規パスワードをシステムに要求することができます。単にログインボタンの下のリンクを押すだけです。OTRSアカウント用の入力フィールドに登録されたEメールアドレスを入力します。送信ボタンを押します（下図参照）。
ru: В случае, если вы забыли пароль всегда можно отправить запрос в систему для получения нового. Для этого просто нажмите на ссылку, которая находится под кнопкой Вход, введите адрес своей электронной почты, который вы указали в настройках своего OTRS-аккаунта и нажмите кнопку Отправить (см. Рисунок).
sw: Ikitokea umesahau nywila yako, unaweza kuuomba mfumo nywila mpya. Bonyeza kirahisi kiungo chini ya kitufe cha kuingia, ingiza anuani yako ya barua pepe iliyosajiliwa kwenye akaunti yako ya OTRS kwenye sehemu ya maingizo, na kisha bonyeza kitufe cha kuwasilisha. (ona Kielelezo).

source: login.pl - Request new password
ja: login.pl - 新規パスワードの要求
ru: login.pl - Забыли пароль?
sw: login.pl - Omba nywila mpya

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="login.pl - screenshot" scale="40" fileref="screenshots/request-new-password.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="login.pl - スクリーンショット" scale="40" fileref="screenshots/request-new-password.png"></graphic>

source: <emphasis>Figure: Request new password.</emphasis>
ja: <emphasis>図：新規パスワードの要求</emphasis>
ru: <emphasis>Рисунок: Запрос на восстановление пароля.</emphasis>
sw: <emphasis>Kielelezo: Omba nywila mpya</emphasis>

source: The web interface - an overview
ja: ウェブインターフェイス - 概要
ru: Веб-интерфейс - обзор
sw: Kiolesura cha tovuti - mapitio

source: Upon successfully logging into the system, you are presented with the Dashboard page (see Figure below). It shows your locked tickets, allows direct access through menus to the queue, status and escalation views, and also holds options for creation of new phone and e-mail tickets. It also presents a quick summary of the tickets using different criteria.
ja: システムへログイン成功時、ダッシュボード・ページが表示されます(下記の図を参照)。ロックされたチケットを表示し、キュー、ステータスおよびエスカレーション・ビューへのメニューから直接アクセスを許可し、さらに、新規の電話および電子メール・チケットの生成に対するオプションも保持します。さらに様々な基準を使用して、チケットのクイックサマリも表示します。
ru: После успешного входа в систему, вы попадаете на страницу Дайджеста (см. рисунок ниже) и получаете доступ к меню системы и иконкам быстрого доступа. В ней отображаются ваши заблокированные заявки, с нее можно быстро перейти к просматру: очередей, статусов и эскалаций, созданию новых заявок, на основе телефонных звонков и электронных писем. Также она предоставляет краткую сводку по новым, ожидающим, эскалированым и открытым заявкам.
sw: Baada ya kuingia kwa mafanikio kwenye mfumo, unakutana na kurasa ya Dashi bodi (ona Kielelezo chini). Inaonyesha tiketi zako zilizofungwa, inaruhusu ufikivu wa moja kwa moja kupitia menyu kwenda kwenye foleni, hali na muonekano wa kupanda, na pia inashikilia uchaguzi wa kutengeneza simu mpya na tiketi za barua pepe. Pia inatoa ufupisho wa haraka wa tiketi kwa kutumia vigezo tofauti.

source: Screen after first successfull login
ja: 初めてのログイン成功後の画面
ru: Страница, которая отображается после входа в систему
sw: Skrini baada ya kuingia kwa mafanikio

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="First screen - screenshot" scale="40" fileref="screenshots/first-screen.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="初期画面 - スクリーンショット" scale="40" fileref="screenshots/first-screen.png"></graphic>

source: <emphasis>Figure: Dashboard of the agent interface.</emphasis>
ja: <emphasis>図：初めてのログイン成功後の画面</emphasis>
ru: <emphasis>Рисунок: Панель управления веб-интерфейса агентов </emphasis>
sw: <emphasis>Kielelezo: Dashibodi ya kiolesura cha wakala.</emphasis>

source: To improve clarity, the general web interface is separated into different areas. The top row of each page shows some general information such the current username, the logout button, icons listing the number of locked tickets with direct access to them, links to create a new phone/e-mail ticket, etc. There are also icons to go to the queue, status, and escalation views.
ja: わかりやすさを改善するために、一般的ウェブ・インターフェースは異なるエリアへ分離されています。各ページのトップの列は以下のようないくつかの一般情報を示します。現在のユーザー名、ログアウト・ボタン、ダイレクトアクセスを備えたロックされたチケットの数のリストアイコン、新しい電話/電子メール・チケットなどを作成するリンク。さらにキュー、ステータスおよびエスカレーション・ビューに行くアイコンがあります。
ru: Для большей ясности, общий веб-интерфейс разделен на несколько частей /областей. В верхней части окна отображается строка с общей информацией: имя пользователя, кнопка выхода, иконки, отображающие количество заблокированных заявок и позволяют прямой доступ к ним, ссылки для создания новой заявки на основе телефонного звонка или сообщения электронной почты. Также есть иконки для просмотра информации об очередях, статусах и эскалациях.
sw: Kuboresha uwazi, kiolesura cha wavuti cha ujumla kimegawanywa katika sehemu tofauti. Safu mlalo ya juu ya kila kurasa inaonyesha baadhi ya taarifa za ujumla kama jina la mtumiaji la sasa, kitufe cha kutoka, ikoni zinazoorodhesha nambari ya tiketi zilizofungwa zenye ufikivu kamili kwao, viungo vya kutengeneza simu/tiketi za barua pepe mpya, na kadh. Pia kuna ikoni za kwenda kwenye foleni, hali, na muonekano wa upandaji.

source: Below the icons row is the navigation bar. It shows a menu that enables you to navigate to different areas or modules of the system, letting you execute some global actions. Clicking on the Dashboard button takes you to the dashboard. If you click on the Tickets button, you will get a submenu with options to change the ticket's view, create a new ticket (phone/e-mail) or search for a specific ticket. The Statistics button presents a menu that allows you to choose from an overview of the registered statistics, creating a new one or importing an existing one. The Customers button leads you to the Customer Management screen. By clicking the Admin button, you can access all of the administrator modules, which allows you to create new agents, queues, etc. There is also a Search button to make ticket searches.
ja: アイコンの下の行はナビゲーション・バーです。システムのモジュールや異なるエリアへナビゲートしてくれるメニューを表示し、いくつかの全体的アクションを実行させてくれます。ダッシュボード・ボタンをクリックすることでダッシュボード行けます。チケット・ボタンをクリックすれば、チケット・ビューを変更したり、新しいチケット(電話/Eメール)を作成したり、あるいは特定のチケットを探索したりするオプションを備えたサブメニューを使えます。統計ボタンは、新しいものを作成し、既存のものを輸入して、登記済みの統計の概観からあなたが選ぶことを可能にするメニューを表示します。顧客ボタンはあなたを顧客管理スクリーンヘ導きます。管理者ボタンのクリックによって、管理者モジュールすべてにアクセスすることができます、それは新しい代理人、キューなどを作ることを可能にします。さらにチケット探索をするサーチ・ボタンもあります。
ru: Под иконками находится навигационная строка. Она показывает меню, позволяющие переходить к разным модулям системы и позволяет выполнять некоторые глобальные действия. При нажатии на кнопку Панель Управления вы перейдете на страницу Панели Инструментов, которая по умолчанию отображается после входа в сисетму. Если нажать ссылку меню Заявки, откроется подменю, предлагающее различные действия, допустимые над заявками: создание новой заявки (на основе телефонного звонка или сообщения электронной почты), поиск конкретных заявок. Кнопка Отчеты также является частью меню и позволяет просматривать существующую статистическую информацию, создать новую а также производить импорт существующей статистики. Кнопка Клиенты позволяет перейти на страницу Управления Клиентами. Для администрирования системы нажмите кнопку Администрирование. На этой странице можно создавать аккаунты для других агентов, очереди и т.д. Для поиска заявок используйте кнопку Поиск.
sw: Chini ya safu mlalo za ikoni kuna mwambaa wa uabiri. Inaonyesha menyu ambayo inakuwezesha kwenda sehemu tofauti au kuona moduli tofauti za mfumo, ikikuruhusu kutekeleza baadhi ya vitendo vya ujumla. Kubofya kwenye kitufe cha Dashibodi inakupeleka kwenye dashibodi. Kama ukibofya kwenye kitufe cha Tiketi utapata menyu ndogo yenye machaguo ya kubadilisha muonekano wa tiketi, tengeneza tiketi mpya (simu/barua pepe) au tafuta tiketi fulani. Kitufe cha Takwimu kinakupa menyu inayokuruhusu kuchagua kutoka kwenye mapitio ya takwimu zilizosajiliwa, kutengeneza mpya au kuagiza iliyopo. Kitufe cha Wateja kinakupeleka kwenye skrini ya Usimamizi wa Mteja. Kwa kubofya kitufe cha Msimamizi, unaweza kufikia moduli zote za msimamizi, ambazo zinakuruhusu kutengeneza mawakala wapya, foleni na kadh. Pia kuna kitufe cha kutafuta tiketi.

source: If any associated applications are also installed, e.g. the FAQ or the Survey, buttons to reach these applications are also displayed.
ja: 関連するアプリケーションがインストールされている場合、例えばFAQ、サーベイ、これらのアプリケーションを起動するボタンも表示されます。
ru: Если установлены дополнительные приложения, такие как, например, FAQ или Опросы, кнопки в меню для перехода к ним также отображаются.
sw: Kama programu-tumizi zozote zinazohusika zimesakinishwa pia, mf. maswali yanayoulizwa mara kwa mara au Utafiti, vitufe kufikia hizi programu-tumizi pia vinaonyeshwa.

source: The red bar below the navigation bar shows different system messages. If you are logged in as OTRS administrator, you get a message warning you not to work using this system account.
ja: ナビゲーション・バー下の赤いバーは様々なシステム・メッセージを表示します。OTRS管理者としてログインすると、このシステム・アカウントを使用して作業しない旨の警告メッセージを受けます。
ru: Красная полоса, которая находится под панелью навигации предназначена для отображения различных системных сообщений. Если войти в систему с правами OTRS-администратора, будет выведено сообщение о том, что в системе не следует работать с правами администратора.
sw: Mwambaa mwekundu chini ya mwambaa wa uabiri unaonyesha ujumbe tofauti wa mfumo. Kama umeingia kama msimamizi wa OTRS, utapata ujumbe wa tahadhari ya kutofanya kazi kwa kutumia akaunti ya mfumo.

source: Below the title of the section you are currently in, there are several subsections containing relevant information about the screen you are working on, each one in a separate box.
ja: 現在表示しているセクションのタイトルの下に、いくつかのサブセクションがあります。別々のボックスに各１つづつ、作業中の画面に関する関連情報を含んでいます。
ru: Под названиями разделов, каждый из них находится в отдельном блоке есть несколько подразделов, содержащих ссылки и пояснения об их содержании и использовании.
sw: Chini ya kichwa cha habari cha kifungu ulichopo sasa, kuna vifungu vidogo tofauti vyenye taarifa husika kuhusu skrini unayofanya kazi, kila moja katika kisanduku tofauti.

source: These boxes contains the main part of each screen, usually they are displayed in one or several columns, each box can store relevant information about the current screen like for example instructions, advises, overviews, etc. Also is displayed the form or tool necessary for performing the action associated to each screen, like for example, add, update or delete records, check the log, change configuration settings, etc.
ja: これらのボックスは各スクリーンの主要部分を含んでいます。それらは常に1つあるいはいくつかのカラムで表示されます。ボックスはそれぞれ、現在のスクリーンに関する関連情報（例えば指示、アドバイス、概観など）を格納することができます。さらに、各画面に関連するアクションを実行するために必要なフォームあるいはツールも表示されます。例えば、レコードの追加、更新、削除、ログのチェック、構成設定の変更等のアクションです。
ru: Эти блоки содержат ссылки, они могут отображаться в одной или нескольких колонках, на определенные страницы с формами или инструментарием для выполнения определенных действий, например, добавление, изменение или удаление записей, проверку журнала сисмы, изменение конфигурации и т.д.
sw: Haya maboksi yana sehemu muhimu ya kila skrini, kwa kawaida yanaonyeshwa katika safuwima moja au tofauti, kila boksi linaweza kuhifadhi taarifa husika kuhusu skrini ya sasa kwa mfano maelekezo, ushauri, mapitio, na kadh. Pia inaonyeshwa fomu au kifaa muhimu cha kutekeleza kitendo kinachohusika kwa kila skrini, kama kwa mfano, ongeza, sasisha au futa rekodi, kagua batli, badilisha mipangilio ya mabadiliko, na kadh.

source: Finally at the bottom of the page, the site footer is displayed (see Figure below). It contains links to directly access the OTRS official web site, or go to the Top of the page.
ja: 最後に、ページの最下部に、サイト・フッタが表示されます(下図参照)。それは、直接OTRS公式ウェブサイトにアクセスするかあるいはページのトップへ行くリンクを含んでいます。
ru: В нижней части экрана отображается "подвал" сайта (см. Рисунок ниже). Он содержит прямые ссылки на официальный сайт OTRS или ссылку для перехода на начало страницы. Также, может отображаться версия OTRS.
sw: Mwisho katika upande wa chini wa ukurasa, kijachini cha tovuti kinaonyeshwa (ona Kielelezo chini). Ina viungo ili kufikia moja kwa moja tovuti rasmi ya OTRS, au kwenda upande wa juu wa kurasa.

source: Normally the icon row, navigation bar and footer are the same in all the screens over the web interface.
ja: 通常は、アイコン列、ナビゲーション・バーおよびフッタはウェブ・インターフェース上のすべての画面の中で同じに存在します。
ru: Обычно, строка иконок, меню и "подвал" - одинаковы на всех экранах веб-интерфейса.
sw: Kwa kawaida safu mlalo ya ikoni, mwambaa wa uabiri na kijachini ziko hivyo hivyo katika skrini zote kwenye kiolesura cha tovuti.

source: Footer
ja: フッター
ru: Нижний колонтитул/"подвал"
sw: Kijachini

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="Footer" scale="40" fileref="screenshots/footer.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="フッター" scale="40" fileref="screenshots/footer.png"></graphic>

source: <emphasis>Figure: Footer.</emphasis>
ja: <emphasis>図：フッター</emphasis>
ru: <emphasis>Рисунок: Нижний колонтитул.</emphasis>
sw: <emphasis>Kielelezo: Kijachini.</emphasis>

source: The Dashboard
ja: ダッシュボード
ru: Панель Управления/Дайджест
sw: Dashibodi

source: The Dashboard is the main page of the system, here you can get an overview about the tickets and other stuff related to the ticket activity. It's thinking to be the starting point for the daily work of an agent, by default it presents a quick summary of the tickets which are pending, escalated, new, and open, among other information.
ja: ダッシュボードはシステムのメインページです。ここでチケット・アクティビティに関連する他のスタッフやチケットに関する概要を得ることができます。それは担当者にとっての日常業務のための出発点であると言えます。それはデフォルトでチケットの即時サマリーを表示します。サマリーには他の情報の中で保留、エスカレーション、新規および対応中の情報があります。
ru: Экран Дайджеста это главная страница системы, здесь вы можете увидеть информацию о заявках и других данных, связанных с работой над ними. Это должно быть начальной точкой повседневной работы агента, по умолчанию на ней представлен краткий обзор заявок, которые отложены, эскалированы, новых и открытых заявках и некоторая другая, полезная информация.
sw: Dashi bodi ndiyo kurasa kuu ya mfumo, hapa unaweza kupata kitufe cha mapitio ya tiketi na vitu vingine vyenye uhusiano na shughuli za tiketi. Inafikiria kuwa sehemu ya kuanzia kazi za kila siku za wakala, kwa kawaida inatoa ufupisho wa haraka wa tiketi ambazo zinasubiri, zimepandishwa, mpya na zilizofunguliwa, kuachana nataarifa nyingine.

source: One of the most important features about Dashboard is that is completely customizable. That means you that can configure each part as you want, showing or hiding elements. It's even possible to relocate this elements within the same column by clicking on and dragging the element's header, and dropping them elsewhere. Each element is named "Widget", the system has some widgets ready to use out of the box, but the modular design of the dashboard screen is prepared to integrate custom widgets easily.
ja: ダッシュボードの最も重要な機能のひとつは完璧なカスタマイズ機能です。要素を表示あるいは非表示にすることで思い通りに各パートを構成することができることを意味します。要素のヘッダをクリックしながらドラッグし要素をどこにでもドロップすることで同じ列の中でこの要素を再配置することさえ可能です。システムは、ボックスから使用する準備ができているいくつかのウィジェットを持っています。しかし、ダッシュボード画面のモジュール設計は、カスタム・ウィジェットを簡単に統合する準備ができています。
ru: Важным достоинством экрана Дайджест является его полная настраиваемость. Это означает, что вы можете настроить каждую из частей экрана, скрывая или отображая их. Можно изменят набор и порядок отображения колонок в таблицах, менять в них порядок сортировки и пр. Каждый из элементов называется "Виджет". В системе имеется набор готовых виджетов, но модульная структура экрана готова к легкой интерации в нее пользовательских виджетов.
sw: Moja ya sifa kubwa za Dashibodi ni kwamba inaweza kugeuzwa kabisa kukufaa. Hii inamaanisha unaweza kusanidi kila upande kadri utakavyo, kuonyesha au kuficha elementi. Pia inawezekana kuhamisha makazi ya hizi elemnti katika safuwima moja kwa kubofya na kukokota kichwa cha elementi, na kuzidondosha mahali pengine. Kila elementi ina jina "Kifaa", mfumo una baadhi ya vifaa vya kutumia nje ya boksi, lakini usanifu uliojikita kwenye moduli wa skrini ya dashibodi umeandaliwa kuunganisha vifaa vingine vya kawaida kwa urahisi.

source: The content of this screen is arranged in two main columns, on the left column you normally can see information about tickets classified by their states like: reminder, escalated, new, and open. On each of this widgets you can filter the results to see all of the tickets that you are allowed to access, tickets you have locked, the ones that are located in agent defiend queues, among other filters. There are also other kind of widgets in this column and they are all described below.
ja: この画面のコンテンツは２つのメインカラムに整列され、その左カラムで各状態（リマインダ、エスカレーション、新規、対応中といった）で分類されたチケットに関する情報を見ることができます。この各ウィジェットでは、他のフィルターの中で、アクセスすることを認められるチケット、ロックしたチケット、および他のフィルタ中に担当者が定義したキューにあるチケットのをすべて見るために結果をフィルタすることができます。このカラムには他の種類のウィジェットもあり、それらすべてを以下の述べます。
ru: В левой колонке находится информация о заявках: напоминания, эскалации, новые или открытые. В каждой из категорий можно просматривать все заявки, к которым у вас есть доступ, сколько заявок заблокировано и сколько находится в "Моих Очередях". Есть, также другие виды виджетов и все они описаны ниже.
sw: Maudhui ya hii skrini imepangwa katika safuwima mbili kuu muhimu, kwenye safuwima ya kushoto unaweza kuona taarifa kuhusu tiketi zilizopangwa kwa hali zake kama: kikumbusho, iliyopandishwa, mpya, na wazi. Katika kila kifaa unaweza kuchuja matokeo kuona tiketi zote ambazo unaruhusiwa kufikia, tiketi ulizofunga, zile ambazo zipo kwenye foleni iliyofafanuliwa na wakala, pamoja na vichujio vingine. Pia kuna aina nyingine za vifaa katika hii safuwima na vimefafanuliwa chini.

source: Dashboard widgets
ja: ダッシュボード・ウィジェット
ru: Виджеты Панели Управления
sw: Vifaa vya dashibodi

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="Dashboard widgets" scale="40" fileref="screenshots/dashboard-left-column-widgets.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="ダッシュボード・ウィジェット" scale="40" fileref="screenshots/dashboard-left-column-widgets.png"></graphic>

source: Left column dashboard widgets.
ja: 左列 ダッシュボード・ウィジェット
ru: Виджеты левой стороны Дайджеста.
sw: Vifaa vya dashibodi vya safuwima ya kushoto.

source: Ticket List Widgets
ja: チケット・リスト・ウィジェット
ru: Виджеты списков заявок
sw: Vifaa vya Orodha ya Tiketi

source: Widgets under this category share same overall behavior, look and feel. This widgets shows a list of tickets on a determined state. the amount of tickets display on each list page can be configured in widget options (they appear when you hover the mouse pointer over the top right part of the widget). This widgets support the following filters:
ja: このカテゴリーの下のウィジェットは全体的な同じ挙動、ルック・アンド・フィールを共有します。このウィジェットは決定した状態のチケットのリストを表示します。チケット数は各リスト・ページに表示します。リスト・ページは、ウィジェット・オプション(あなたがウィジェットの右上部上にマウスポインタを置くとそれらが現われます)で構成することができます。このウィジェットは次のフィルタを支援します:
ru: Виджеты этой категории имеют примерно одинаковый вид и смысл. Они отображают списки заявок в определенных, заданных, состояниях. Количество строк в таблицах, набор колонок и их порядок отображения настраивается с помощью кнопки "Параметры" (она появляется при наведении указателя мыши на правый верхний угол виджета). Эти виджеты поддерживают следующие фильтры:
sw: Vifaa ndani ya hii kategori vina tabia za ujumla zinazofanana, muonekano na hisia. Hivi vifaa vinaonyesha orodha ya tiketi katika hali iliyoamuliwa. Idadi ya tiketi zilizoonyeshwa katika kila orodha zinaweza kusanidiwa katika machaguo ya vifaa (zinatokea ukiambaa juu na kipanya juu ya upande wa juu kulia wa kifaa). Hiki kifaa kina usaidizi kwa vichujio vifwatavyo:

source: My locked tickets
ja: 自身のロック・チケット
ru: Мои заблокированные заявки
sw: Tiketi zangu zilizofungwa

source: The tickets that the logged agent has locked.
ja: ログインした担当者がロックされたチケット
ru: Список заблокированных заявок агента.
sw: Tiketio ambazo wakala aliyeingia amezifunga.

source: My watched tickets
ja: 自身の監視チケット
ru: Мои наблюдаемые заявки
sw: Tiketi zangu zinazoangaliwa

source: The tickets that the logged agent has in his/her watched list, requires Ticket::Watcher setting to be turned on to be displayed.
ja: ログインした担当者がウオッチリストを持っているチケット。それを表示するためにTicket::Watcher 設定をオンにすることが必要です。
ru: Заявки агента, которые находятся в списке наблюдаемых. Параметр Ticket::Watcher должен быть включен для их отображения.
sw: Tiketi ambazo wakala aliyeingia kwenye mfumo anazo kwenye orodha yake ya zilizo chini ya uangalizi, zinahitaji mpangilio wa Tiketi::Muangalizi kuwashwa ili kuonyeshwa.

source: My responsibilities
ja: 自身の責任者
ru: Заявки, где я ответственный
sw: Majukumu yangu

source: The tickets that the logged agent is set as responsible, Ticket::Responsible setting is required to be turned on in order to make this filter visible.
ja: ログインしている担当者が責任者として設定されているチケット。Ticket::Responsible設定は、このフィルターを可視化できるようにオンにする必要があります。
ru: Заявки, для которых агент является ответственным. Параметр Ticket::Responsible должен быть включен, чтобы этот фильтр работал.
sw: Tiketi ambazo wakala aliye kwenye mfumo amewekwa kama mhusika, mpangilio Tiketi::Jukumu unatakiwa kuwashwa ili kufanya hiki kichujio kuonekana.
