Repository: DSigmund/doc-admin
Catalog: i18n/doc-admin.*.po
Languages: ja, ru, sw

source: To create a certificate, perform the following operations in the command line (we assume that the OTRS administrator has to create a SSL certificate for test and learning purposes. In case you already have a certified SSL certificate for the encryption, use it and skip these steps):
ja: 証明書を作成するためには、コマンドライン中から次のオペレーションを行なってください:(我々は、OTRS管理者がテスト用のSSL証明書および学習する目的を作成しなければならないと考えます。暗号化用の保証されたSSL証明書を既に持った場合それを使用して、これらのステップをスキップしてください。)
ru: Для создания сертификата, проделайте следующие операции в командной строке (предположим, что OTRS-администратор должен создать SSL-сертификат с целью тестирования и обучения. В случае, если у вас уже есть SSL-сертификат для шифрования, используйте его и пропустите следующие шаги):
sw: Kutengeneza hati, fanya operesheni zifuatazo katika tungo amri (tunaamini msimamizi wa OTRS inabidi atengeneze hati ya SSL kwa ajili ya kujaribisha na kujifunza. Kama tayari una hati ya SL iliyothibitishwa kwa ajili ya usimbaji fiche, itumie na ruka hizi hatua):

source: Establish your own Certification Authority for SSL. You need it to certify the request for your own SSL certificate (see Script below).
ja: SSLのために自分の認証局を開設してください。自分のSSL証明書の要請を証明するためにそれを必要とする(下記のスクリプトを参照)。
ru: Создание собственного Центра Сертификации (Certification Authority) для SSL. Вы должны подтвердить запрос на собственный SSL-сертификат (см. нижеприведенный сценарий).
sw: Anzisha Mamlaka yako ya Uhalalishaji kwa ajili ya SSL. unahitaji kuthibitisha maombi ya hati yako ya SSL (ona Hati chini).

source: <emphasis>Script: Establishing a Certification Authority for SSL.</emphasis>
ja: <emphasis>スクリプト: SSLのために認証局を設立</emphasis>
ru: <emphasis>Сценарий: Создание Центра Сертификации (Certification Authority) для SSL.</emphasis>
sw: <emphasis>Hati: Kuweka Mamlaka ya Uhalalishaji kwa ajili ya SSL.</emphasis>

source: Generate a certificate request (see Script below).
ja: 証明書リクエストを生成してください(下記のスクリプトを参照)
ru: Создание запроса сертификата (см. Сценарий ниже).
sw: Zalisha maombi ya cheti (ona Hati chini).

source: <emphasis>Script: Creating a certificate request.</emphasis>
ja: <emphasis>スクリプト: 証明書リクエストの作成</emphasis>
ru: <emphasis>Сценарий: Создание запроса сертификаата.</emphasis>
sw: <emphasis>Hati: Kutengeneza maombi ya cheti.</emphasis>

source: Signing of the certificate request. The certificate request can either be signed and thereby certified by your own CA, or made more credible by being signed by another external certified CA (see Script below).
ja: 証明書リクエストは署名され、それによってあなた自身のCAに証明されます。あるいは別の外部の保証されたCAによって署名されることによりさらに信頼性を高められます。（下記スクリプト参照）
ru: Подпись запроса сертификата. Запрос сертификата может быть подписан, и таким образом сертифицирован вашим собственным центром сертификации (CA), что более правдоподобно, чем использование других, внешних CA (см. нижеприведенный сценарий).
sw: Kusaini maombi ya hati. Maombi ya hati yanaweza kusainiwa na kuthibitishwa na Mamlaka yako ya Uhalalishaji, au ili kuaminika zaidi kwa kusainiwa na Mamlaka nyingine ya Uhalalishaji iliyothibitishwa. (ona chini).

source: <emphasis>Script: Signing of the certificate request.</emphasis>
ja: <emphasis>スクリプト:証明書リクエストの署名</emphasis>
ru: <emphasis>Сценарий: Подпись запроса сертификата.</emphasis>
sw: <emphasis>Hati: Kusaini maombi ya cheti.</emphasis>

source: Generate your own certificate, and all data going with it, using the signed certificate request (see Script below).
ja: あなた自身の証明書を生成して下さい。そしてそれに伴い、署名された証明書を使う、すべてのデータを生成して下さい。（下記スクリプト参照）
ru: Создание своего собственного сертификата, и все данные собираются с ним, используя запрос сертификата (см. Сценарий ниже).
sw: Zalisha hati yako mwenyewe, na data zote zinaoendana nazo, kwa kutumia maombi ya hati yaliyosainiwa (ona Hati chini).

source: <emphasis>Script: Generating a new certificate.</emphasis>
ja: <emphasis>スクリプト:新規証明書の生成</emphasis>
ru: <emphasis>Сценарий: Создание нового сертификата.</emphasis>
sw: <emphasis>Hati: Kuzalisha cheti kipya.</emphasis>

source: Now that these operations have been performed, the S/MIME setup must be completed in OTRS.
ja: 今、これらのオペレーションが実行され、S/MIMEセットアップはOTRSの中で完成したはずです。
ru: Теперь эти операции выполнены, установка S/MIME в OTRS должена быть завершена.
sw: Sasa kwa kuwa hizi operesheni zimefanyika, kuseti S/MIME lazima kukamilike katika OTRS.

source: This part of the setup is carried out in the Admin page, choosing the link <link linkend="adminarea-smime">"SMIME"</link>. In case the general S/MIME support in OTRS has not yet been enabled, the mask points this out to the administrator and provides an appropriate link for enabling it.
ja: セットアップのこの部分はリンク<link linkend="adminarea-smime">"SMIME"</link>を選んで、管理者ページで実行されます。OTRSで一般的なS/MIMEサポートがまだ可能にされてない場合、マスク(mask)は管理者にこれを指摘し、それを可能にするために適切なリンクを提供します。
ru: Эта часть установки осуществляется в Панели Администрирования, выбрав ссылку <link linkend="adminarea-smime">"SMIME"</link>. В случае, если в OTRS нету поддержки S/MIME, маска указывает администратору удобные ссылки чтобы активировать поддержку S/MIME.
sw: hiki kipande cha kuseti kinafanyika katika ukurasa wa Msimamizi, kuchagua kiungo <link linkend="adminarea-smime">"SMIME"</link>. Ikiwa msaada wa S/MIME wa kawaida kwenye OTRS haujawezeshwa, barakoa itanbainisha hii kwa msimamizi na kutoa kiungo cha kuiwezesha.

source: With the SysConfig group <link linkend="ConfigReference_Framework:Crypt::SMIME">"Crypt::SMIME"</link>, you can also enable and configure the general S/MIME support.
ja: SysConfig group で<link linkend="ConfigReference_Framework:Crypt::SMIME">"Crypt::SMIME"</link> S/MIME に関する全般の設定が行えます
ru: С помощью группы параметров SysConfig <link linkend="ConfigReference_Framework:Crypt::SMIME">"Crypt::SMIME"</link>, вы можете также включить и настроить общую поддержку протоколов S/MIME.
sw: Na kundi la SysConfig <link linkend="ConfigReference_Framework:Crypt::SMIME">"Crypt::SMIME"</link>, unaweza kuwezesha na kusanidi msaada wa ujumla wa S/MIME.

source: Here you can activate S/MIME support, and define the paths for the OpenSSL command and the directory for the certificates. The key file created above must be stored in the directory indicated here. Otherwise OpenSSL cannot use it.
ja: ここで、S/MIME支援を活性化し、OpenSSLコマンド用のパスおよび証明書用のディレクトリーを定義することができます。上に作成されたキー・ファイルは、ここで示されたディレクトリーに格納されなければいけません。そうでなければ、OpenSSLは使用できません。
ru: Здесь можно активировать поддержку S/MIME, определить пути для команд OpenSSL, и директории для сертификатов. Файл ключей должен хранится в директории, указанной здесь. В противном случае OpenSSL не будет их использовать.
sw: Hana unweza kuamilisha msaada wa S/MIME, na kufafanua njia za anri ya OpenSSL na mpangilio orodha wa hati. Faili la ufunguo lililo tengnezwa hapo juu lazima lihifadhiwe kwenye mpangilio orodha ulioonyeshwa hapa. La sivyo OpenSSL haiwezi kulitumia.

source: The next step is performed in the <link linkend="adminarea-smime">S/MIME configuration on the OTRS Admin page</link>. Here, you can import the private key(s) of the OTRS system and the public keys of other communication partners. Enter the public key that has been created in the beginning of this section and added to OTRS.
ja: 次のステップは<link linkend="adminarea-smime">OTRS管理ページ上のS/MIME構成</link>で行われます。ここで、OTRSシステムの秘密鍵および他のコミュニケーション・パートナーの公開鍵(複数)をインポートすることができます。このセクションの最初に作成し、OTRSに追加した公開鍵を入力してください。
ru: Следующим шагом, который следует выполнить - перейти по ссылке <link linkend="adminarea-smime"> Настройка S/MIME в Панели Администрирования</link>. Здесь можно импортировать закрытые ключи OTRS-системы и открытые ключи других партнеров. Введите публичный ключ, который был создан и добавлен в OTRS в начале этого раздела.
sw: Hatua inayofwata inafanywa kwenye <link linkend="adminarea-smime"> usanidi wa S/MIME katika ukurasa wa Msimamizi wa OTRS</link>. Hapa unaweza kuagiza ufunguo binafsi wa (za) mfumo wa OTRS na funguo za umma za mawasiliano ya wabia wengine. Ingiza ufunguo wa umma ambao umetengenezwa mwanzoni mwa kifungu hiki na kuongezwa kwenye OTRS.

source: Obviously, all public S/MIME keys of communication partners can be imported using the <link linkend="adminarea-customers">customer administration tool</link> as well.
ja: 言うまでもなく、コミュニケーション・パートナーの全てのパブリックS/MIMEキーは<link linkend="adminarea-customers">顧客管理ツール</link>を使用してインポートすることもできます。
ru: Перейдя по ссылке <link linkend="adminarea-customers">Инструменты администрирования клиентов</link> можно импортировать все открытые S/MIME ключи партнеров по общению.
sw: Kwa kawaida, funguo zote za umma za S/MIME za mawasiliano ya washiriki zinaweza kuagizwa kwa kutumia <link linkend="adminarea-customers">kifaa cha usimamizi wa mteja</link> pia.

source: Time related functions
ja: 時間関連機能
ru: Функции связанные с временем
sw: Shughuli zinazoendana na muda

source: Setting up business hours, holidays and time zones
ja: 業務時間、祝祭日とタイムゾーンの設定
ru: Настройка периода рабочего времени, празников и часовых поясов
sw: Kuseti masaa, sikuku na majira ya biashara

source: Business Hours
ja: 業務時間
ru: Рабочее время
sw: Masaa ya Biashara

source: Only during business hours can tickets escalate, notifications for escalated and pending tickets be sent, and tickets be unlocked.
ja: 業務時間内にのみエスカレーション・チケットを作成することができます。エスカレーションの通知や送信された保留チケットロックされていないチケットも同様です。
ru: Заявки эскалируются, уведомления для эскалированных и ожидающих заявок отправляются и заявки разблокируются только в рабочее время.
sw: Katika masaa ya biashara tu ndio tiketi zinaweza kupanda, taarifa za tiketi zilizopandishwa na tiketi zinazosubiri zinatumwa, na tiketi zinafunguliwa.

source: Fixed date holidays
ja: 固定の期日、祝祭日
ru: Праздники с фиксированными датами
sw: Sikukuu zenye tarehe za kudumu

source: Tickets will not escalate nor get unlocked on dates defined in TimeVacationDays.
ja: チケットはエスカレーションしませんしまた、TimeVacationDaysに定義された日付にアンロックされません。
ru: Заявки не будт эскалироваться, ни разблокироваться в сроки, определенные как "Специально зарезервированные дни".
sw: Tiketi hazitapandishwa wala kufunguliwa katika siku zilizofafanuliwa kama MudaSikuZaSikukuu.

source: By default, OTRS ships with the <emphasis>German</emphasis> holidays installed.
ja: OTRS出荷のデフォルトで<emphasis>ドイツの</emphasis>祝祭日をインストールしています。
ru: По умолчанию, OTRS работает по <emphasis>Немецким</emphasis> выходным.
sw: Kwa chaguo-msingi OTRS inasafirishwa na sikukuu za <emphasis>German</emphasis> zimesakinishwa.

source: Tickets will not escalate and will not be unlocked on dates defined in TimeVacationDaysOneTime.
ja: チケットはエスカレーションしませんしまた、TimeVacationDaysに定義された日付にアンロックされません。
ru: Заявки не будут эскалироваться и не будут разблокироваться в период времени определенный как TimeVacationDaysOneTime.
sw: Tiketi hazitapandishwa na hazitafunguliwa katika tarehe zilizofafanuliwa katika MudaSikuZaSikukuuMaraMoja

source: OTRS does not ship with any One-Time holidays pre-installed. This means that you need to add holidays, such as Easter or Thanksgiving, to the system when configuring OTRS.
ja: OTRSは、一度だけの休日をつけて出荷しません。イースターまたは感謝祭のような休日はOTRSを構成する際にご自身でシステムに追加して下さい。
ru: OTRS поставляется без единого предустановленного One-Time-праздника. Это означает, что во время настройки системы OTRS, нужно самостоятельно добавить празники, такие как Пасха, День Благодарения.
sw: OTRS haisafirishwi na sikukuu yoyote ya Wakati-Mmoja ikiwa imesakinishwa. Hii ina maanisha unatakiwa kuongeza sikukuu, kama Pasaka au Sikuku ya Shukrani, kwenye mfumo wakati wa kusanidi OTRS.

source: Automated Unlocking
ja: 自動アンロック
ru: Автоматические Разблокировки
sw: Ufunguaji Otomatiki

source: Locked tickets can be automatically unlocked by the system. This feature might be useful if, for example, an agent has locked tickets that need to be processed, but he can't work on them for some reason, say because he is out of the office on an emergency. The automated unlock feature unlocks tickets after a given time to ensure that no locked tickets will be forgotten, thereby allowing other agents to process them.
ja: ロックされたチケットは、システムによって自動的に対応中にすることができます。この機能はこんな場合に有用でしょう。例えば、担当者が処理される必要のあるチケットをロックしているが、彼が何らかの理由でそれらを処理できなければ、「彼は今緊急の用事のためオフィスの外にいます」ということができます。自動アンロック機能は、ロックされたチケットがないことが忘れられないことを確実にするために与えられた時間の後でチケットをアンロックします。
ru: Заблокированные заявки могут быть разблокированы системой автоматически. Эта опция может быть полезной, если, например, агент заблокировал заявки, которые нужно обработать, но не работал с ними по определенной причине, например был в отпуске. Чтобы убедится в том, что заблокированные заявки не будут забыты и их обработают другие агенты, автоматическая разблокировка разблокирует заблокированные заявки при истечении определенного времени.
sw: Tiketi zilizofungwa zinaweza kufunguliwa kiotomatiki na mfumo. Hiki kipengele kinaweza kuwa cha muhimu, kwa mfano, wakala amefunga tiketi ambazo zinatakiwa kuchakatishwa, lakini hawezi kuzifanyia kazi kwa sababu fulani, tuseme yuko nje ya ofisi kwa dharura. Kipengele otomatiki cha kufungua kinafungua tiketi baada ya muda fulani kuhakikisha hakuna tiketi zilizofungwa zitakazosahaulika, hivyo kuruhusu mawakala wengine kuzichakatisha.

source: The amount of time before a ticket is unlocked can be specified in the <link linkend="adminarea-queue">queue settings</link> for every queue. The module <filename>bin/otrs.UnlockTickets.pl</filename>, which is executed periodically as a cron job, performs the automated unlocking of tickets.
ja: チケットが対応中にされる前の時間の量は、すべてのキューのための<link linkend="adminarea-queue">キュー設定</link>の中で指定することができます。モジュール <filename>bin/otrs.UnlockTickets.pl</filename>（cronジョブとして周期的に実行される)は、チケットの自動アンロックします。アンロック中のチケットに関する通知は以下の担当者のみに送信されます。
ru: Перейдя по ссылке <link linkend="adminarea-queue">настройки очереди</link> для каждой заявки можно установить количество времени, при истечении которого она будет разблокирована. Модуль, <filename>bin/otrs.UnlockTickets.pl</filename>, который периодически вызывается как задание планировщика задач cron job, выполняет автоматическую разблокировку заявок.
sw: Idadi ya muda kabla tiketi haijafunguliwa inaweza kuwekwa bayana katika <link linkend="adminarea-queue">mipangilio ya foleni</link> kwa kila foleni. Moduli <filename>bin/otrs.UnlockTickets.pl</filename>, ambayo inatekelezwa kwa kipindi fulani kama kazi ya mfumo iliyopangwa, inafanya ufunguaji otomatiki wa tiketi.

source: Notifications on unlocked tickets are sent out only to those agents that have the queue with the unlocked tickets set in "My queues", and that have activated the notification on unlocked tickets in their personal <link linkend="user-preferences">preferences</link>.
ja: 「マイ・キュー」にあるアンロックされたチケット・セットを持つキューを持っている担当者。個人的<link linkend="user-preferences">選択（選好）</link>のアンロック・チケットに関する通知を活性化した担当者。
ru: Уведомления о разблокированных заявках отсылаются только тем агентам, которые добавили очередь с разблокированными заявками в "Мои очереди", и активировали в своих <link linkend="user-preferences">настройках</link> функцию уведомлений о разблокированных заявоках.
sw: Taarifa kuhusu tiketi zilizofunguliwa zinatumwa nje kwa wale mawakala wenye foleni zilizosetiwa tiketi zilizofunguliwa kwenye 'Foleni zangu', na wame amilisha taarifa kwenye tiketi zilizofunguliwa katika <link linkend="user-preferences">mapendeleo</link> yao binafsi.

source: Tickets will be unlocked if all of the following conditions are met:
ja: 次の条件がすべて満たされれば、チケットはアンロックされます:
ru: Заявки будут заблокированы в том случае, если выполнятся следующие условия:
sw: Tiketi zitafunguliwa kama masharti yote yafuatayo yamefikiwa:

source: There is an <emphasis>unlock timeout</emphasis> defined for the queue the ticket is in.
ja: チケットがあるキューのために定義された<emphasis>アンロック・タイムアウト</emphasis>があります。
ru: Для очереди в которой хранится заявка определяется <emphasis>время разблокировки</emphasis> .
sw: Kuna <emphasis>muda wa mwisho wa kufungua</emphasis> umefafanuliwa kwenye foleni ambayo tiketi imo.

source: The ticket is set to <emphasis>locked</emphasis>.
ja: チケットは<emphasis>ロック済</emphasis>にセットされています。
ru: Заявке присвоен статус <emphasis>заблокирована</emphasis>.
sw: Tiketi imesetiwa kuwa <emphasis>imefungwa</emphasis>.

source: The ticket state is <emphasis>open</emphasis>.
ja: チケットの状態は<emphasis>対応中</emphasis>です。
ru: Заявке присвоен статус <emphasis>открыатая</emphasis>.
sw: Hali ya tiketi ni <emphasis>wazi</emphasis>.

source: The unlock timer will be reset if an agent adds a new external article to the ticket. It can be of any of the following types: <emphasis>email-external</emphasis>, <emphasis>phone</emphasis>, <emphasis>fax</emphasis>, <emphasis>sms</emphasis>, or <emphasis>note-external</emphasis>.
ja: アンロック・タイマーは担当者がチケットに新しい外部記事を追加すればリセットされます。それは次のタイプのうちのいずれかでしょう。: <emphasis>外部Eメール</emphasis>、<emphasis>電話</emphasis>、<emphasis>ファックス</emphasis>、<emphasis>sms</emphasis>あるいは<emphasis>外部ノート</emphasis>。
ru: Если агент добавляет в заявку новую статью - таймер разблокировки будет сброшен. Он может быть любым из следующих типов: <emphasis>внешний-email</emphasis>, <emphasis>телефон</emphasis>, <emphasis>факс</emphasis>, <emphasis>смс</emphasis>, или <emphasis>внешнее примечание</emphasis>.
sw: Muda wa kufungua utasetiwa upya kama wakala akiongeza makala mpya ya nje kwenye tiketi. Inaweza kuwa ya aina yoyote kati ya zifuatazo: <emphasis>barua pepe-nje</emphasis>, <emphasis>simu</emphasis>, <emphasis>faksi</emphasis>, <emphasis>sms</emphasis>, au <emphasis>notisi-nje</emphasis>.

source: Also, if the last article in the ticket is created by an agent, and a customer adds another one, either via web or email response, the unlock timer will be reset.
ja: さらに、チケット中の最後の記事が担当者によって作成され、顧客が別のものを加えれば、ウェブあるいはEメール応答のいずれかによって、アンロック・タイマーはリセットされるでしょう。
ru: Кроме этого, если последняя статья в заявке создана агентом, и клиент добавляет еще одну, либо через веб-интерфейс либо по электронной почте, таймер разблокировки также будет сброшен.
sw: Pia, kama makala ya mwisho katika tiketi imetengenezwa na wakala, na mteja akaongeza nyingine, aidha kwa kupitia majibu ya tovuti au barua pepe, muda wa kufungua utasetiwa upya.

source: The last event that will reset the unlock timer is when the ticket is assigned to another agent.
ja: アンロック・タイマーをリセットする最後のイベントは、チケットがもう一人の担当者にいつ割り当てられるかです。
ru: Последнее событие, которое будет сбрасывать таймер разблокировки, когда заявка передается другому агенту.
sw: Tukio la mwisho ambalo lita seti upya muda wa kufungua ni pale tiketi imegawiwa kwa wakala mwingine.

source: Customizing the PDF output
ja: PDF出力のカスタマイズ
ru: Настройка вывода в формате PDF
sw: Kugeuza kukufaa matokeo ya PDF

source: This section handles the configurable options for PDF output in OTRS.
ja: このセクションは、OTRSの中のPDF出力に対する構成可能なオプションを扱います。
ru: В этом разделе приводится настройка опций для экспорта данных из OTRS в PDF.
sw: Hiki kifungu kinashughulikia machaguo yanayoweza kusanidiwa kwa ajili ya matokeo ya PDF kwenye OTRS.

source: The Perl CPAN modules PDF::API2 and Compress::Zlib must be installed for the generation of pdf files. In many distributions they are available as packages and can be easily installed, using the respective package manager. In case this is not possible, they have to be installed with CPAN. For further information about installing Perl modules, please refer to the <link linkend="installation-of-perl-modules">"Installation of Perl modules"</link> section.
ja: Perl CPANモジュールPDF::API2およびCompress::Zlibはpdfファイルの生成のためにインストールされなければいけません。多くのディストリビューションでは、それらはパッケージとして利用可能で、それぞれのパッケージ・マネージャーを使用して、容易にインストールすることができます。これが可能ではなかった場合、CPANでそれらをインストールしなければならない。Perlモジュールのインストールに関するさらに詳しい情報に関しては、<link linkend="installation-of-perl-modules">"Perlモジュールの設置"</link>セクションを参照してください。
ru: Для генерации pdf-файлов должны быть проинсталированы Perl-модули CPAN: PDF::API2 и Compress::Zlib. В большинстве дистрибутивов они доступны в виде пакетов и могут быть легко установлены с помощью соответсвтующего менедежера пакетов. В случае, если это не возможно, они должны быть установлены с помощью CPAN. За дополнительной информацией об установке Perl-модулей, обратитесь к главе <link linkend="installation-of-perl-modules">"Установка Perl-модулей"</link>.
sw: Moduli za Perl CPAN za PDF::API2 na Compress::Zlib lazima zisakinishwe kwa ajili ya uzalishaji wa mafaili ya pdf. Katika usambazaji mwingi zinapatikana kama vifurushi na vinaweza kusakinishwa kirahisi, kwa kutumia meneja kifurushi husika. Ikiwa hii haiwezekani, inabidi zisakinishwe na CPAN. Kwa taarifa zaidi kuhusu kusakinisha moduli za Perl, tafadhali pitia kifungu cha <link linkend="installation-of-perl-modules">"Usakinishaji wa moduli za Perl"</link>.

source: Generic Interface
ja: 一般インターフェイス
sw: Kiolesura cha Ujumla

source: The OTRS Generic Interface consists of a multiple layer framework that lets OTRS communicate with other systems via a web service. This communication could be bi-directional:
ja: OTRSの一般インターフェースは、OTRSをウェブサービスによって他のシステムと通信させる複合レイヤーのフレームワークから成ります。このコミュニケーションは双方向になりえます。:
ru: OTRS Generic Interface состоит измногоуровневого интерфейса, позволяющего OTRS взаимодействовать с другими системами с помощью веб-сервисов. Это взаимодействие может быть двунаправленной:
sw: Kiolesura cha Ujumla cha OTRS kina matabaka mengi ya viunzi ambavyo vinaruhusu OTRS kuwasiliana na mifumo mingine kupitia huduma ya tovuti. Haya mawasiliano yanweza kuwa ya pande mbili.

source: <emphasis>OTRS as Provider: </emphasis> OTRS acts as a server listening to requests from the External System, processing the information, performing the requested action, and answering the request.
ja: <emphasis>供給者としてのOTRS:</emphasis> OTRSは、外部システムからのリクエストを聞き、要求されたアクションを行なって、情報を処理し、リクエストに答えるサーバーとして働きます。
ru: <emphasis>OTRS как Provider: </emphasis> OTRS заставляет сервер отслеживать запросы от внешней системы, обрабатывать информацию, выполняя запрошенное действие, и отвечать на запрос.
sw: <emphasis>OTRS kama Mtoaji: </emphasis> OTRS inakuwa kama seva inasikiliza maombi kutoka kwenye Mfumo wa Nje, inachakatisha taarifa, kufanya vitendo vilivyoombwa, na kujibu maombi.

source: <emphasis>OTRS as Requester: </emphasis> OTRS acts as a client collecting information, sending the request to the Remote System, and waiting for the response.
ja: <emphasis>依頼者としてのOTRS:</emphasis> OTRSは、遠隔のシステムにリクエストを送り、レスポンスを待って、クライアント情報収集者として働きます。
ru: <emphasis>OTRS как Requester: </emphasis> OTRS работает как клиент, собирающий информацию, посылая запрос к Внешней системе, и ожидает ответа.
sw: <emphasis>OTRS kama Muombaji: </emphasis> OTRS inakuwa kama mteja inakusanya taarifa, kutuma maombi kwa Mifumo ya Nje, na kusubiri majibu.

source: Web Services
ja: ウェブサービス
ru: Веб-сервисы
sw: Huduma za Tovuti

source: A Web Service is a communication method between two systems, in our case OTRS and a Remote System.
ja: Webサービスは、私たちの場合、OTRSとリモート・システムとの間のコミュニケーション方法です。
ru: Веб-сервисы это метод взаимодействия между двумя системами, в нашем случае, OTRS и удаленной системой/Remote System.
sw: Huduma ya Tovuti ni njia ya mawasiliano kati ya mifumo miwili, katika kesi yetu ni OTRS na Mifumo ya Mbali.
