Repository: DSigmund/doc-admin
Catalog: i18n/doc-admin.*.po
Languages: ja, ru, sw

source: Overview of all configuration parameters
ja: 全ての構成パラメタの概要
ru: Обзор всех параметров конфигурации
sw: Mapitio ya parameta za usanidi

source: The content of this appendix is generated automatically with xml2docbook.pl.
ja: この添付書類の内容はxml2docbook.pl.で自動的に生成されます。
ru: Содержание этого добавления генерируется автоматически с xml2docbook.pl.
sw: Maudhui ya hiki kiambatisho yanatengenezwa kiotomatiki na xml2docbook.pl

source: en
ja: ja

source: OTRS 3.3 - Admin Manual
ja: OTRS 3.3 - 管理者マニュアル

source: This work is copyrighted by OTRS AG.
ja: この著作はOTRS AGによって著作権で保護されています。
ru: Эта работа защищена авторским правом OTRS AG.
sw: Kazi hii ina hakimiliki ya OTRS AG

source: You may copy it in whole or in part as long as the copies retain this copyright statement.
ja: コピーがこの著作権宣言文を保持する限り、全体あるいは一部分をコピーしても良いです。
ru: Это руководство может быть скопировано целиком или частично, при условии, что это уведомление об авторских правах будет включено в каждую копию.
sw: Unaweza nakili yote au sehemu ya yote ilimradi nakala ziwe na taarifa ya hakimiliki.

source: The source code of this document can be found at <ulink url="http://otrs.github.io">github</ulink>, in the repository <ulink url="https://github.com/OTRS/doc-admin">doc-admin</ulink>.
ja: このドキュメントのソース・コードは<ulink url="http://otrs.github.io">github</ulink>のリポジトリ<ulink url="https://github.com/OTRS/doc-admin">doc-admin</ulink>で見つけることができます。
ru: Исходный код этого документа можно найти на <ulink url="http://otrs.github.io">github</ulink>, в репозитории <ulink url="https://github.com/OTRS/doc-admin">doc-admin</ulink>.
sw: Kanuni chanzo za huu waraka unapatikana katika <ulink url="http://otrs.github.io">github</ulink>, kwenye <ulink url="https://github.com/OTRS/doc-admin">waraka-msimamizi</ulink>.

source: UNIX is a registered trademark of X/Open Company Limited. Linux is a registered trademark of Linus Torvalds.
ja: UNIX は X/Open Company Limited. の登録商標です。 Linux は Linus Torvalds の登録商標です。
ru: UNIX является зарегистрированной торговой маркой компании X/Open Company Limited. Linux является зарегистрированной торговой маркой Линуса Торвальдса (Linus Torvalds).
sw: UNIX ni alama ya biashara iliyosajiliwa ya X/Open Company Limited. Linux ni alama ya biashara iliyosajiliwa ya Linus Torvalds.

source: MS-DOS, Windows, Windows 95, Windows 98, Windows NT, Windows 2000, Windows XP, Windows 2003, Windows Vista and Windows 7 are registered trademarks of Microsoft Corporation. Other trademarks and registered trademarks are: SUSE and YaST of SUSE Linux GmbH, Red Hat and Fedora are registered trademarks of Red Hat, Inc. Mandrake is a registered trademark of MandrakeSoft, SA. Debian is a registered trademark of Software in the Public Interest, Inc. MySQL and the MySQL Logo are registered trademarks of Oracle Corporation and/or its affiliates.
ja: MS-DOS, Windows, Windows 95, Windows 98, Windows NT, Windows 2000, Windows XP, Windows 2003, WindowsVista, Windows 7 は、Microsoft Corporation の登録商標です。その他の商標及び登録商標: SUSE と YaST は SUSE Linux GmbH の, Red Hat と Fedora は Red Hat, Inc の登録商標です。 Mandrake は MandrakeSoft, SA の登録商標です。Debian は Software in the Public Interest, Inc の登録商標です。MySQL と the MySQL Logo は Oracle Corporation と、あるいは、その系列企業の登録商標です。
ru: MS-DOS, Windows, Windows 95, Windows 98, Windows NT, Windows 2000, Windows XP, Windows 2003, Windows Vista и Windows 7 являются зарегистрированными торговыми марками Корпорации Microsoft (Microsoft Corporation). Другими торговыми марками и зарегистрированными торговыми марками есть: SUSE и YaST компании SUSE Linux GmbH, Red Hat и Fedora являются зарегистрированными торговыми марками компании Red Hat, Inc. Mandrake является зарегистрированной торговой маркой компании MandrakeSoft, SA. Debian является зарегистрированной торговой маркой организации Software in the Public Interest, Inc. MySQL и логотип MySQL являются зарегистрированными торговыми марками корпорации Oracle Corporation и/или ее филиалов.
sw: MS-DOS, Windows, Windows 95, Windows 98, Windows NT, Windows 2000, Windows XP, Windows 2003, Windows Vista na Windows 7 ni alama za biashara zilizosajiliwa za shirika la Microsoft. Alama nyingine za biashara zilizosajiliwa ni: SUSE na YaST za SUSE Linux GmbH, Red Hat na Fedora ni alama za biashara za Red Hat, Inc. Mandrake ni alama ya biashara ya MandrakeSoft, SA. Debian ni alama ya biashara ya Software in the Public Interest, Inc. MySQL na nembo ya MySQL ni alama za biashara za Oracle Corporation na washirika wake.

source: All trade names are used without the guarantee for their free use and are possibly registered trade marks.
ja: 全ての登録名は、無償利用の保障なしに使用されており、そして恐らくそれらは登録商標です。
ru: Все торговые марки используются без гарантий их свободного использования и, возможно, являются зарегистрированными торговыми марками.
sw: Majina yote ya biashara yanatumika bila kithibitisho cha matumizi yake ya bure na kuna uwezekano ni alama za biashara zilizosajiliwa.

source: OTRS AG essentially follows the notations of the manufacturers. Other products mentioned in this manual may be trademarks of the respective manufacturer.
ja: OTRS AGは、基本的にメーカーの記法に従います。その他の製品は各製造者の登録商標で記載しています。
ru: OTRS AG, по существу, следует обозначениям производителей. Другие продукты, упомянутые в этом руководстве, могут быть торговыми марками соответствующих производителей.
sw: OTRS AG kwa msingi inafuata nukuu za watengenezaji. Bidhaa nyingine zilizotajwa kwenye huu mwongozo zinaweza kuwa alama ya biashara ya mtengenezaji husika.

source: Introduction
ja: 導入
ru: Введение
sw: Utangulizi

source: Administration
ja: 管理
ru: Администрирование
sw: Utawala

source: Email settings
ja: Eメール設定
ru: Настройки электронной почты
sw: Mpangilio wa barua pepe

source: Ticket settings
ja: チケット設定
ru: Настройки Заявки
sw: Mpangilio wa tiketi

source: Customization
ja: カスタマイズ
ru: Настройка
sw: Kugeuza kukufaa

source: Trouble Ticket Systems - The Basics
ja: トラブル・チケット・システム - 基礎
ru: Системы Обработки Заявок - Основы
sw: Trouble Ticket Systems - Vya msingi

source: This chapter offers a brief introduction to trouble ticket systems, along with an explanation of the core concept of a trouble ticket. A quick example illustrates the advantages of using such a system.
ja: この章ではトラブル・チケットの主要概念の説明とともにトラブル・チケット・システムの手短な紹介を提供します。例示により手っ取り早くこのようなシステムを使うメリットについて説明します。
ru: В этой главе дается краткий обзор идеи заявок в целом, и систем обработки заявок, в частности. Краткий пример иллюстрирует преимущества использования системы обработки заявок.
sw: Hii sura inatoa utangulizi wa trouble ticketing systems kwa ufupi, pamoja na maelezo ya maana ya msingi ya trouble ticket. Mfano wa haraka unaeleza faida za kutumia mfumo kama huu.

source: What is a trouble ticket system, and why do you need one?
ja: トラブル・チケット・システムとは何でしょうか？なぜあなたはそれを必要としているのでしょうか？
ru: Что такое система обработки заявок и зачем она нужна?
sw: Trouble ticket system ni nini, na kwanini unaihitaji?

source: The following example describes what a trouble ticket system is, and how you might benefit from using such a system at your company.
ja: 次の例ではトラブル・チケット・システムとは何か、そしてどのようにあなたが会社でそのようなシステムが役立つかを述べています。
ru: Следующий пример показывает, что собой являет система обработки заявок и как можно сэкономить много времени и денег, используя подобную систему в своей компании.
sw: Mfano ufwatao unaeleza trouble ticket system ni nini, na jinsi gani utafaidika na mfumo huu katika kampuni yako.

source: Let's imagine that Max is a manufacturer of video recorders. Max receives many messages from customers needing help with the devices. Some days, he is unable to respond promptly or even acknowledge the messages. Some customers get impatient and write a second message with the same question. All messages containing support requests are stored in a single inbox folder. The requests are not sorted, and Max responds to the messages using a regular email program.
ja: マックス氏は、ビデオレコーダーの製造業者だと想像して下さい。マックス氏は製品サポートを必要とするお客様から多くのメッセージを受け取っています。ある日、彼は速やかに返答することもメッセージを受け入れることもできなくなりました。一部の顧客は対応の遅さに我慢ができず同じ質問をするために 2 度めのメッセージを送ります。サポート依頼を含むすべてのメッセージは、単一の受信トレイ フォルダーに格納されます。サポート依頼はソートされておらず、マックス氏は、通常のEメール プログラムを使用してメッセージに応答します。
ru: Давайте представим, что Максим занимается производством видеомагнитофонов. Максим получает много писем от клиентов, которые нуждаются в помощи по устройству. Спустя несколько дней, у него нету свободного времени чтобы оперативно ответить на все письма клиентов или хотя бы просмотреть их. Некоторые клиенты не хотят долго ждать и пишут второе письмо с тем же вопросом. Все письма, содержащие просьбы о поддержке хранятся в одном почтовом ящике. Запросы не сортируются и Максим отвечает на письма пользуясь обычной программой для работы с электронной почтой.
sw: Tufikirie kwamba Max ni mtengenezaji wa rekoda za video. Max anapokea meseji nyingi kutoka kwa wateja wakihitaji msaada wa vifaa vyao. Siku nyingine anshindwa kujibu papo hapo au hata kukiri kupokea meseji hizo. Baadhi ya wateja wanakosa uvumilivu na kutuma meseji ile ile kwa mara ya pili. Meseji zote zenye maombi ya usaidizi zinahifadhiwa kwenye kisanduku pokezi kimoja. Maombi hayapangwi, na Max anajibu meseji hizo kwa kutumia programu ya mara kwa mara ya barua pepe.

source: Since Max cannot reply fast enough to all the messages, he is assisted by the developers Joe and John in this. Joe and John use the same mail system, accessing the same inbox. They don't realize that Max often gets two identical requests from one frustrated customer. Sometimes they both end up responding separately to the same request, with the customer receiving two different answers. Furthermore, Max is unaware of the details of their responses. He is also unaware of the details of the customer problems and their resolutions, such as which problems occur with high frequency, or how much time and money he has to spend on customer support.
ja: マックス氏はすべてのメッセージに対して十分に速やかに返信できないため、彼は開発者のジョー氏とジョン氏に助けてもらっています。ジョー氏とジョン氏は同じメールシステムを使い、同じメールボックスにアクセスします。彼らはマックス氏がしばしば一人の不満を持った顧客から２件の全く同じ要求を受けていることに気づいていません。ときどき彼ら二人は全く同じサポート依頼に対して別々に返答をし、顧客は二つの異なる返答を受信してしまうはめになります。その上、マックス氏は彼らの返信の詳細について知りさえしないのです。また彼は、どの問題がより頻繁に起こっているいるのかといった顧客の問題やそれらの解決の詳細についても、あるいは、顧客サポートにどれほどの時間やお金が使われているかについても気づいてはいません。
ru: Поскольку Максим не успевает быстро дать ответ на все письма, его инженеры: Андрей и Александр берутся помочь Максиму. Для работы с почтой Андрей и Александр используют один и тот же почтовый ящик, который хранит все письма клиентов. Они ничего не подозревают о том, что Максим получил два одинаковых письма с вопросом о помощи от отчаявшегося клиента. Временами они оба отвечают на один и тот же запрос, и клиент получает два различных ответа. Более того, Максим не имеет представления о содержимом этих ответов. Также он не знает подробностей большинства проблем его клиентов и о том как они решаются, какие проблемы возникают чаще всего, а также, сколько времени и денег он должен потратить на поддержку клиентов.
sw: Kwa kuwa Max hawezi kujibu kwa haraka meseji zote, anasaidiwa na wasanifu Joe na John katika hili. Joe na John wanatumia mfumo huo huo wa barua pepe, wakifikia kisanduku pokezi kile kile. Hawatambui kwamba Max anaweza kupokea maombi mawili kutoka kwa mteja mmoja mwenye hasira. Wakati mwingine wanatoa majibu tofauti kwa ombi moja lililojirudia, mteja anapokea majibu mawili tofauti. Kwa zaidi Max hajui undani wa majibu yao. Pia hajui undani wa matatizo ya wateja na masuluhisho yao, kama matatizo gani yanatokea mara nyingi, au kiasi gani cha muda na pesa anatumia kwenye usaidizi wa wateja.

source: At a meeting, a colleague tells Max about trouble ticket systems and how they can solve Max's problems with customer support. After looking for information on the Internet, Max decides to install OTRS on a computer that is accessible from the web by both his customers and his employees. Now, the customer requests are no longer sent to Max's private inbox but to the mail account that is used for OTRS. The ticket system is connected to this mailbox and saves all requests in its database. For every new request, the system automatically generates an answer and sends it to the customer so that the customer knows that his request has arrived and will be answered soon. OTRS generates an explicit reference, the ticket number, for every single request. Customers are now happy because their requests are acknowledged and it is not necessary to send a second message with the same question. Max, John, and Joe can now log into OTRS with a simple web browser and answer the requests. Since the system locks a ticket that is answered, no message is edited twice.
ja: 会議にて同僚はマックス氏に対して、トラブル・チケット・システムが、如何にマックスが顧客サポートで抱えている問題を解決可能であるかを伝えました。インターネットで情報を調査したのち、マックス氏は、コンピュータにOTRSをインストールすることに決めました。それは彼の顧客と彼の従業員の両者がウェブからアクセスできるものです。現在では顧客のサポート要求はもうマックス氏の個人メールボックスに送られることはなくOTRS用に使用されるメールアカウントに送信されます。チケットシステムはこのメールボックスに接続しすべての顧客の要求をデータベースに保存します。新しい要求毎に、システムは自動的に解答を生成し、それを顧客に送ります。そのため顧客は要求が受信されて速やかに要求に対し解答されるだろうとわかります。OTRSは明確な参照番号、すなわち、チケット番号を生成し、要求毎に対して与えます。現在では顧客は喜んでいます。なぜなら顧客の要求は認識され、同じ内容の２度目の要求メッセージを送らなくても良くなったからです。マックス氏、ジョン氏そしてジョー氏は現在では、シンプルにウェブからOTRSにログインして顧客の要求に回答しています。システムは回答中のチケットをロックするので、そのメッセージを同時に他の誰かに編集されることはありません。
ru: На собрании коллега рассказывает Максиму о системах обработки заявок и как они могут решить его проблемы с поддержкой клиентов. После поиска информации в Интернете, Максим принимает решение установить OTRS - Открытую Систему Обработки Заявок, далее просто OTRS, на компьютере, который будет доступен из веб как для клиентов компании так и для ее сотрудников. С этого момента, запросы клиентов больше не приходят на частный почтовый ящик Максима, теперь они направляются на почтовый ящик, который используется для OTRS. OTRS подключена к этому почтовому ящику и автоматически сохраняет все запросы в своей базе данных. Система генерирует авто-ответ для каждого нового запроса и отправляет его клиенту, так что теперь клиент может быть уверен в том, что его запрос поступил в обработку и ответ будет дан в ближайшее время. Для каждого запроса OTRS создает прямую ссылку - номер заявки. Теперь клиенты довольны, они получают быстрый ответ на свою заявку и им уже нет никакого смысла писать повтороне письмо с тем же вопросом. Максим, Андрей и Александр могут спокойно отвечать на поступившые запросы используя обычный веб-браузер для работы с OTRS. Также, следует отметить тот факт, что ни одно сообщение клиента не будет отредактировано дважды, поскольку система автоматически блокирует заявку, для которой создается ответ.
sw: Katika mkutano, mwenzake akamweleza Max kuhusu mfumo wa trouble ticket na jinsi unavyoweza kutatua matatizo ya Max ya usaidiziwa wa mteja. Baada ya kuangalia taarifa kwenye mtandao, Max akaamua kusanikisha OTRS kwenye kompyuta ambayo inapatikana kwenye tovuti kwa wateja na wafanyakazi wake. Sasa, maombi ya wateja hayatumwi kwenye kisanduku chake binafsi cha barua pepe bali kwenye akaunti ya barua pepe ya OTRS. Mfumo wa tiketi umeunganishwa na kikasha barua hiki na inahifadhi maombi yote kwenye hifadhidata yake. Kwa kila ombi jipya, mfumo unatengeneza jibu kiotomatiki na kulituma kwa mteja ili mteja atambue maombi yake yamepokelewa na atajibiwa hivi karibuni. OTRS inatengeneza kirejeo wazi, nambari ya tiketi, kwa kila ombi moja. Wateja sasa wana furaha kwa sababu maombi ya yanajibiwa na sio lazima kutuma ombi la pili kwa swali lile lile. Max, John na Joe sasa wanaweza kuingia kwenye OTRS na kivinjari tovuti na kujibu maombi. Kwa kuwa mfumo unafunga tiketi iliyojibiwa, hakuna meseji inayojibiwa mara mbili.

source: Let's imagine that Mr. Smith makes a request to Max's company, and his message is processed by OTRS. John gives a brief reply to his question. But Mr. Smith has a follow-up question, which he posts via a reply to John's mail. Since John is busy, Max now answers Mr. Smith's message. The history function of OTRS allows Max to see the full sequence of communications on this request, and he responds with a more detailed reply. Mr. Smith does not know that multiple service representatives were involved in resolving his request, and he is happy with the details that arrived in Max's last reply.
ja: スミス氏がマックス・カンパニーにサポート要求をして、彼のメッセージがOTRSで処理されたと想像してみましょう。ジョン氏は彼の要求に短い解答をします。しかしスミス氏は彼の質問に対するジョンの解答に対して引き続き質問をしたいと思っています。ジョン氏は多忙のためマックスがスミス氏のメッセージに解答します。マックス氏は、OTRSの履歴機能によってこの要求に関するコミュニケーションの全ての流れを把握することができます。スミス氏は複数のサービス担当者が 彼の要求を解決するためにかかわっていることを知らないのですが、彼はマックス氏の最後の解答が到着しその詳細について大変満足しています。
ru: Давайте представим что г-н Гришко делает запрос в компанию Максима и его сообщение обрабатывается системой OTRS. Александр дает краткий ответ на его вопрос. Но у г-на Гришко есть дополнительный вопрос и на следующий день он отвечает на письмо Александра. Поскольку у Александра и своих дел хватает, на письмо г-на Гришко отвечает Максим. Способность OTRS хранить историю позволяет Максиму просмотреть всю цепочку переписки по этому запросу и написать более подробный ответ г-ну Гришко. Г-н Гришко, в свою очередь, даже не догадывается, что в процесс общения были вовлечены два разных человека, он доволен советами относительно решения своей проблемы, которые пришли в последнеем сообщении от Максима.
sw: Tufikirie kwamba Mr. Smith ametuma ombi kwa kampuni ya Max, na meseji yake inafanyiwa mchakato na OTRS. John anatoa jibu fupi kwa swali lake. Lakini Mr. Smith ana swali linalofuata, ambalo analituma kama jibu kwa barua pepe ya John. Kwa kuwa John ametingwa, Max sasa anajibu meseji ya Mr. Smith. Kipengele cha historia kinamruhusu Max aone mtiririko mzima wa mawasiliano kwenye ombi hili, na anajibu kwa undani zaidi. Mr. Smith hajui kama watoa huduma zaidi ya mmoja wahehusika katika kutatua tatizo lake, na amefurahia maelezo ya majibu ya mwisho ya Max.

source: Of course, this is only a short preview of the possibilities and features of trouble ticket systems. But if your company has to attend to a high volume of customer requests through emails and phone calls, and if different service representatives need to respond at different times, a ticket system can be of great assistance. It can help streamline work flow processes, add efficiencies, and improve your overall productivity. A ticket system helps you to flexibly structure your Support or Help Desk environment. Communications between customers and service staff become more transparent. The net result is an increase in service effectiveness. And no doubt, satisfied customers will translate into better financial results for your company.
ja: むろん、これはトラブル・チケット・システムのほんのわずかの可能性と特徴を垣間見たに過ぎません。しかし、もしあなたの会社がEメールと電話を通して大量の顧客要求を処理しなければならないならば、そして、もし異なるサービス担当者が異なる時間に対応する必要があるならば、チケット・システムは大変役立つことができます。むろん、これはトラブル・チケット・システムのほんのわずかの可能性と特徴を垣間見たに過ぎません。しかし、あなたの会社がEメールと電話を使って大量の顧客要求を処理しなければならないならば、そして、もし異なるサービス担当者が異なる時間に対応する必要があるならば、チケット・システムは大変役立ちます。またチケット・システムは、ワークフロー・プロセスを合理化する助けとなり、効率化を促進し、全体的に生産性を改善します。チケットシステムは柔軟にサポートやヘルプデスク環境を構築することができます。顧客と2人のサービススタッフ間のコミュニケーションはよりわかりやすくなります。最終的な成果は、サービスの効率性が向上することです。そしてきっとその顧客の満足度は、会社により良い財務実績をもたらすことでしょう。
ru: Конечно, это всего лишь краткий обзор функциональных возможностей и особеностей систем обработки заявок. Но в случае, если в вашу компанию приходит множество запросов от клиентов через письма электронной почты и телефонные звонки и они должны обрабатываться в разное время, - система обработки заявок поможет существенно сэкономить время и деньги, позволит структурировать всю систему поддержки клиентов, сделать более прозрачным процесс обмена информацией между клиентами и компаниями, что неотменно приведет к повышению эффективности как для клиентов так и для обслуживающего персонала и позитивно скажется на финансовом положении компании.
sw: Bila shaka, haya ni mapitio mafupi ya viwezekanavyo na vipengele vya mifumo ya trouble ticket. Lakini kama kampuni yako inabidi ihudumie maombi mengi kutoka kwa wateja kupitia barua pepe na simu, na kama watoa huduma tofauti inabidi wajibu kwa muda tofauti, tiketi itakuwa na usaidizi mkubwa. Inaweza kusaidia kurahisisha mtiririko wa kazi, kuongeza ufanisi, na kuboresha utendaji kwa ujumla. Mfumo wa tiketi unasaidia kutengeneza muundo rahisi wa mazingira ya usaidizi au meza ya usaidizi. Mawasiliano kati ya wateja na watoa huduma yanakuwa wazi zaidi. Matokeo ya mwisho ni ufanisi wa huduma. Na bila shaka, wateja walioridhika watabadilika kuwa matokeo mazuri ya biashara ya kampuni yako.

source: What is a trouble ticket?
ja: トラブル チケットとは？
ru: Что такое заявка?
sw: Trouble ticket ni nini?

source: A trouble ticket is similar to a medical report created for a hospital patient. When a patient first visits the hospital, a medical report is created to hold all necessary personal and medical information on him. Over multiple visits, as he is attended to by the same or additional doctors, the attending doctor updates the report by adding new information on the patient's health and the ongoing treatment. This allows any other doctors or the nursing staff to get a complete picture on the case at hand. When the patient recovers and leaves the hospital, all information from the medical report is archived and the report is closed.
ja: トラブル チケットは、病院の患者のために作成した医療レポートに似ています。患者が病院を訪れるとまず、すべての必要な個人と医療情報を保持するために医療レポートが作成されます。何度も通院すると、患者は前回と同じあるいは他の医師に診察され、診察医は、患者の健康及び治療中の処置に関する情報を追加しレポートを更新します。こうすることで他のどの医師や看護スタッフがすぐに患者の状態を完全に把握することができます。患者が回復し退院するとき、医療レポートから得られるすべての情報は保存されレポートは閉じられます。
ru: Заявка очень похожа на медицинскую карточку пациента больницы. Медицинская карточка создается, когда пациент посещает больницу впервые, все важные данные о пациенте, такие как: личные данные, информация о состоянии его здоровья, медицинском осмотре записываются в медицинскую карточку. С каждым новым визитом пациента в больницу, каждый из лечащих врачей добавляет в медицинскую карточку информацию о состоянии пациента, истории болезни и, используемые для лечения лекарственные препараты. Таким образом другие лечащие врачи и медсестры могут видеть, подробную картину состояния пациента. Когда пациент выздоровел и выписался из больницы, медицинская карточка закрывается и вся информация передается в архив.
sw: Trouble ticket ni sawa na ripoti ya matibabu iliyotengenezwa kwa ajili ya mgonjwa. Mgonjwa akienda hospitali kwa mara ya kwanza, ripoti ya matibabu itatengenezwa kushikilia taarifa zote binafsi na za matibabu zinazomhusu. Baada ya kuhudhuria mara nyingi, na kuhudumiwa na daktari yule yule au wengine, daktari husika anasasisha ripoti kwa kuongeza taarifa mpya za mgonjwa na matibabu yanayoendelea. Hii inawezesha madaktari wengine na manesi kuweza kupata picha nzima ya kesi ya mgonjwa waliokuwa nayo. Mgonjwa akipona na kuruhusiwa kutoka hospitalini, taarifa zote za mgonjwa zinahifadhiwa kwenye nyaraka na ripoti inafungwa.
