Repository: DSigmund/doc-admin
Catalog: i18n/doc-admin.*.po
Languages: ja, ru, sw

source: Controllers are collections of similar Operations or Invokers. For example, a Ticket controller might contain several standard ticket operations. Custom controllers can be implemented, for example a "TicketExternalCompany" controller which may contain similar functions as the standard Ticket controller, but with a different data interface, or function names (to adapt to the Remote System function names) or complete different code.
ja: コントローラーは同様のオペレーションあるいは依頼アクション(Invokers)の集合です。例えば、チケット・コントローラーはいくつかの標準チケット・オペレーションを含んでいます。カスタム・コントローラは実装可能です。例えば「チケット外部会社」コントローラーは標準チケット・コントローラーと同様の機能を含みます。しかし異なるデータ・インターフェイスまたは機能名（リモート・システム機能名に適応する）または異なるコードを完成します。
sw: Wadhibiti ni mkusanyiko wa Operesheni zinazofanana au Wachochezi. Kwa mfano, mdhibiti wa Tiketi anaweza kuwa na operesheni za kawaida za tiketi. Wadhibiti wa kawaida wanaweza kutekelezeka, kwa mfano mdhibiti "TiketiNjeKampuni" ambayo inaweza kuwa na kazi sawa na mdhibiti wa kawaida wa Tiketi, lakini ana kiolesura tofauti cha data, au majina ya kazi (ili kukabiliana na majina ya Mfumo wa Mbali) au kanuni tofauti kabisa.

source: One application for Generic Interface could be to synchronize information with one Remote System that only can talk with another Remote System of the same kind. In this case new controllers needs to be developed and the Operations and Invokers has to emulate the Remote System behavior in such way that the interface that OTRS exposes is similar to the Remote System's interface.
ja: 一般インターフェースのための1つのアプリケーションは、同じ種類のもう一つのリモートシステムと話すことだけができるようなリモートシステムと情報を同期できるようになります。この場合、新規コントローラーは開発される必要があります。そして、オペレーションと依頼アクション(Invokers)は、リモートシステムの振る舞いをエミュレートしなければいけません。その振る舞いは、OTRSが提供するインターフェイスがリモートシステムのインターフェイスと同様です。
sw: Kazi moja ya Kiolesura cha Ujumla inaweza kuwa kulandanisha taarifa za Mfumo mmoja wa Mbali unaoweza kuongea na Mfumo mwingine wa Mbali unaofanana tu. Katika kesi hii wadhibiti wapya inabidi watengenezwe na Operesheni na Wachochezi inabidi waige tabia za Mfumo wa Mbali ili kiolesura ambacho OTRS itaonyesha kifanane na kiolesura cha Mfumo wa Mbali.

source: Operation (OTRS as a provider)
ja: オペレーション(供給者としてのOTRS)
ru: Операция (OTRS как поставщик услуг)
sw: Operesheni (OTRS kama mtoaji)

source: An Operation is a single action that can be performed within OTRS. All operations have the same programming interface, they receive the data into one specific parameter, and return a data structure with a success status, potential error message and returning data.
ja: オペレーションはOTRSの内に行なうことができる単一の行為です。オペレーションにはすべて同じプログラミングインターフェースがあります、それらは1つの特定のパラメタへデータを受け取り、成功ステータス、潜在的なエラーメッセージおよび返るデータを持ったデータ構造を返します。
sw: Operesheni ni kitendo kimoja kinachoweza kufanywa ndani ya OTRS. Operesheni zote zina kiolesura cha kuundia programu za ngamizi kinachofanana, zinapokea data katika parameta moja maalumu, na kurudisha muundo wa data wenye hali ya mafanikio, ujumbe wa kasoro zilizotokea na kurudisha data.

source: Normally operations uses the already mapped data (internal) to call core modules and perform actions in OTRS like: Create a Ticket, Update a User, Invalidate a Queue, Send a Notification, etc. An operation has full access to the OTRS API to perform the action.
ja: 通常、オペレーションは、コアモジュールを呼び出すために、すでにマップされたデータ（内部）を使います。そしてOTRSでアクション（チケット作成、ユーザー更新、キューの無効か、通知送信）を実行します。オペレーションはアクションを実行するOTRS APIへのフルの権限を持っています。
sw: Kwa kawaida operesheni zinatumia data (za ndani) ambazo tayari zimeunganika kuita moduli viini na kufanya vitendo kama: Tengeneza Tiketi, Sasisha Mtumiaji, Batilisha Foleni, Tuma Taarifa, na kadh. Operesheni ina ufikivu kamili kwenye API ya OTRS kufanya kitendo hicho.

source: Invoker (OTRS as a requester)
ja: 依頼アクション (依頼者としてのOTRS)
ru: Invoker - запрашивающая сторона (OTRS как запрашивающая сторона, клинет)
sw: Mchochezi (OTRS kama muombaji)

source: An Invoker is an action that OTRS performs against a Remote System. Invokers use the OTRS Core modules to process and collect the needed information to create the request. When the information is ready it has to be mapped to the Remote System format in order to be sent to the Remote System, that will process the information execute the action and send the response back, to either process the success or handle errors.
ja: 依頼アクション（Invokers）とは、OTRSがリモートシステムに対して行うアクションのことです。依頼アクション(Invokers)は、リクエストを作成する必要とされる情報を処理し収集するためにOTRSコア・モジュールを使用します。情報が準備ができている場合、リモート・システムに送るためにリモート・システムのフォーマットにそれをマッピングしなければなりません。それはアクションを実行する情報を処理し、成功を処理するためか、エラーを取り扱うためのいずれかのために返答を送信します。
sw: Mchochezi ni kitendo ambacho OTRS inafanya dhidi ya Mfumo wa Mbali. Wachochezi wanatumia moduli za kiini cha OTRS kuchakatisha na kukusanya taarifa zote zinazotakiwa kutengeneza maombi. Taarifa zikiwa tayari inabidi ziunganishwe na umbizo la Mfumo wa Mbali ili zitumwe kwenda kwenye Mfumo wa Mbali, hiyo itachakatisha taarifa itatekeleza kitendo na kutuma majibu, ili aidha kuchakatisha mafanikio au kushughulikia makosa.

source: Connectors
ja: コネクタ
ru: Коннекторы (Connectors)
sw: Viunganishi

source: A Connector is in essence a set of actions that are either called Operations if OTRS acts as a web service provider or Invokers if OTRS acts as a web service requester. But it can also include special Mappings or Transports.
ja: コネクタは、OTRSがウェブサービス供給者あるいは依頼アクションとして働く場合、あるいは、OTRSがウェブサービス依頼者として働く場合、オペレーションとも呼ばれるアクションのセットの核心になります。しかし、さらに、それは特別のマッピングあるいはトランスポートも含むことができます。
sw: Kiunganisho ni seti ya vitendo ambavyo aidha vinaitwa Operesheni kama OTRS inasimama kama mtoaji wa huduma ya wavuti au Wachochezi kama OTRS itasimama kama muombaji huduma ya wavuti. Pia inaweza kujumuisha Miunganiko au Usafirishaji.

source: One Connector can either have only Operations, Only Invokers or both. A connector can even use parts of other connectors like the Mappings or Transports if they are not to specific for the Connector that is trying to implement them.
ja: 1つのコネクタは、オペレーションのみ、依頼アクション(Invokers)のみ、あるいはその両方だけ、であり得ます。コネクタはマッピングやトランスポートのように他のコネクタのパーツを利用することさえ可能です。そのようなことは何もコネクタにとっては特殊なことではなくむしろそれらを実装しようとしている。
sw: Kiunganisho kimoja kinaweza kuwa na Operesheni tu, Wachochezi tu au zote. Kiunganisho kinaweza kutumia sehemu za viunganisho vingine kama Miunganiko au Usafirishaji kama siyo maalumu kwa kiunganisho kinachojaribu kuzitekeleza.

source: In other words a Connector is not limited to just the Controller layer but it can be extended to Data Mapping or Network Transport layers if needed.
ja: 言いかえれば、コネクタは単なるコントローラー層に制限されていない。しかし、もし必要ならばそれはデータマッピングまたはネットワークのトランスポート層まで拡張することができます。
sw: Kwa maneno mengine kiunganisho hakijajikita kwa tabaka moja la kidhibiti lakini inaweza kutanuliwa kwenye Muunganiko wa Data au matabaka ya Usafirishaji wa Mtandao kama itahitajika.

source: Due to the modular design of the Generic Interface a Connector can be seen as a plug-in; this means that by adding Connectors the capabilities of the generic interface can be extended using: OTRS Feature add ons, OTRS Custom modules, 3rd Party modules, and so on.
ja: 一般インターフェースのモジュール設計により、コネクタはプラグ・インと見なすことができます。;これは、コネクタを加えることによって、次のものを使用して、一般インターフェースの能力を拡張することができることを意味します: 使用法：OTRS機能追加、OTRSカスタム・モジュール、サードパーティ・モジュール等。
sw: Kutokana na usanifu wa moduli wa Kiolesura cha Ujumla Kiunganishi kinaweza kuonekana kama programu-jalizi; hii inamaanisha kwa kuongeza Viunganishi uwezo wa kiolesura cha ujumla kinaweza kupanuliwa kwa kutumia: vifaa vya nyongeza vya OTRS, moduli Zilizogeuzwa kukufaa za OTRS, moduli za mshiriki wa 3, na mengineyo.

source: Bundled Connectors
ja: バンドル・コネクタ
ru: Комплект Коннекторов (Connectors)
sw: Kifungu cha Viunganishi

source: Included with this version of OTRS the following connectors are ready to be used.
ja: OTRSのこのバージョンで含まれて、次のコネクタは、使用される準備ができています。
ru: В комплекте с этой версией OTRS следующие коннекторы готовы к использованию.
sw: Iliyojumuishwa na hili toleo la OTRS viunganishi vifuatavyo viko tayari kutumika.

source: Session
ja: セッション
sw: Kipindi

source: Session Connector
ja: セッション・コネクタ
sw: Kiunganishi cha Kipindi

source: This connector is capable to create a valid SessionID that can be used in any other operation.
ja: このコネクタは他のオペレーションの中で使用することができる有効なSessionIDを作成するのに有能である。
ru: Этот коннектор может создать действительный SessionID, который в дальнейшем может быть использован в любой другой операции.
sw: Kiungo hiki kinaweza kutengeneza Kitambulisho halali cha Kipindi ambacho kinaweza kutumika katika operesheni nyingine yoyote.

source: Provides:
ja: 提供：
ru: Поставщики:
sw: Inatoa:

source: Operations:
ja: オペレーション:
ru: Операции:
sw: Operesheni:

source: SessionCreate
ja: セッション作成
sw: TengenezaKipindi:

source: Operations
ja: オペレーション
ru: Операции
sw: Operesheni

source: Creates a new new valid SessionID to be used in other operations from other connectors like TicketCreate.
ja: SessionCreateは、TicketCreateのような他のコネクタからの他のオペレーションの中で使用される、新規新規有効なSessionIDを作成します。
sw: Inatengeneza Kitambulisho kipya halali kitakachotumika katika operesheni nyingine kutoka kwenye viunganishi vingine kama TengenezaTiketi.

source: To use the SessionID in other operations from other connectors it is necessary that the operation implements authentication by SessionID. All the rest of the bundled operations are capable of accepting a valid SessionID as an authentication method.
ja: 他のコネクタからの他のオペレーションの中でSessionIDを使用するために、オペレーションはSessionIDによって認証を実装する必要がある。バンドルされたオペレーションの残りはすべて認証方法として有効なSessionIDを受け入れることができます。
sw: Kutumia Kitambulisho cha Kipindi katika operesheni nyingine kutoka kwenye viunganishi vingine ni muhimu kwamba operesheni ifanye uthibitisho kwa kutumia Kitambulisho cha Kipindi. Vifurushi vingine vya operesheni vinaweza kukubali Kitambulisho cha Kipindi halali kama njia ya uthibitisho.

source: Possible Attributes:
ja: 可能な属性:
ru: Возможные Атрибуты:
sw: Sifa ziwezekanazo:

source: <SessionCreate> <!--You have a MANDATORY CHOICE of the next 2 items at this level--> <!--Optional:--> <UserLogin>?</UserLogin> <!--Optional:--> <CustomerUserLogin>?</CustomerUserLogin> <!--Optional:--> <Password>?</Password> </SessionCreate>
ja: <SessionCreate> <!--このレベルでは次の２つの必須選択項目があります。--> <!--Optional:--> <UserLogin>?</UserLogin> <!--Optional:--> <CustomerUserLogin>?</CustomerUserLogin> <!--Optional:--> <Password>?</Password> </SessionCreate>

source: Ticket Connector
ja: チケット・コネクタ
ru: Коннектор Заявки
sw: Kiunganishi cha Tiketi

source: This connector supplies the basic functionality to interact with tickets
ja: このコネクタは、チケットとダイアログするために基本機能を供給します。
ru: Этот коннектор использует базовую функциональность для взаимодействия с заявками
sw: Hiki kiunganishi kinatoa programu-tumizi za msingi kuwasiliana na tiketi

source: TicketUpdate
ja: TicketCreate(チケット作成)
sw: SasishaTiketi

source: TicketGet
ja: TicketGet(チケット取得)
sw: PataTiketi

source: TicketSearch
ja: TicketSearch(チケット検索)
sw: TafutaTiketi

source: Provides an interface to create a ticket in OTRS. A ticket must contain an Article and can contain several attachments, all defined Dynamic Fields can be also set on TicketCreate operation.
ja: TicketCreateは、OTRSにチケットを作成するインターフェースを提供します。チケットは記事を含んでいなければいけないし、いくつか添付を含むことができます。全ての定義された動的フィールドも、TicketCreateオペレーション上でセットすることができます。
ru: Предоставляет интерфейс для создания заявки в OTRS. Заявка должна содержать сообщение и может содержать несколько вложений, все заданные динамические поля, также могут получить значения при операции "Создать заявку/TicketCreate"
sw: Inatoa kiolesura cha kutengeneza tiketi katika OTRS. Tiketi lazima iwe na Makala na inaweza kuwa na viambatanishi mbali mbali, Sehemu Zinazobadilika zote zilizofafanuliwa zinaweza pia kusetiwa katika operesheni ya TiketiTengeneza.

source: <TicketCreate> <!--You have a MANDATORY CHOICE of the next 3 items at this level--> <!--Optional:--> <UserLogin>?</UserLogin> <!--Optional:--> <CustomerUserLogin>?</CustomerUserLogin> <!--Optional:--> <SessionID>?</SessionID> <!--Optional:--> <Password>?</Password> <Ticket> <Title>?</Title> <!--You have a MANDATORY CHOICE of the next 2 items at this level--> <!--Optional:--> <QueueID>?</QueueID> <!--Optional:--> <Queue>?</Queue> <!--You have a CHOICE of the next 2 items at this level--> <!--Optional:--> <TypeID>?</TypeID> <!--Optional:--> <Type>?</Type> <!--You have a CHOICE of the next 2 items at this level--> <!--Optional:--> <ServiceID>?</ServiceID> <!--Optional:--> <Service>?</Service> <!--You have a CHOICE of the next 2 items at this level--> <!--Optional:--> <SLAID>?</SLAID> <!--Optional:--> <SLA>?</SLA> <!--You have a MANDATORY CHOICE of the next 2 items at this level--> <!--Optional:--> <StateID>?</StateID> <!--Optional:--> <State>?</State> <!--You have a MANDATORY CHOICE of the next 2 items at this level--> <!--Optional:--> <PriorityID>?</PriorityID> <!--Optional:--> <Priority>?</Priority> <!--You have a CHOICE of the next 2 items at this level--> <!--Optional:--> <OwnerID>?</OwnerID> <!--Optional:--> <Owner>?</Owner> <!--You have a CHOICE of the next 2 items at this level--> <!--Optional:--> <ResponsibleID>?</ResponsibleID> <!--Optional:--> <Responsible>?</Responsible> <CustomerUser>?</CustomerUser> <!--Optional:--> <CustomerID>?</CustomerID> <!--Optional:--> <PendingTime> <Year>?</Year> <Month>?</Month> <Day>?</Day> <Hour>?</Hour> <Minute>?</Minute> </PendingTime> </Ticket> <Article> <!--You have a CHOICE of the next 2 items at this level--> <!--Optional:--> <ArticleTypeID>?</ArticleTypeID> <!--Optional:--> <ArticleType>?</ArticleType> <!--You have a CHOICE of the next 2 items at this level--> <!--Optional:--> <SenderTypeID>?</SenderTypeID> <!--Optional:--> <SenderType>?</SenderType> <!--Optional:--> <From>?</From> <Subject>?</Subject> <Body>?</Body> <!--You have a CHOICE of the next 2 items at this level--> <!--Optional:--> <ContentType>?</ContentType> <Charset>?</Charset> <MimeType>?</MimeType> <!--Optional:--> <HistoryType>?</HistoryType> <!--Optional:--> <HistoryComment>?</HistoryComment> <!--Optional:--> <AutoResponseType>?</AutoResponseType> <!--Optional:--> <TimeUnit>?</TimeUnit> <!--Optional:--> <NoAgentNotify>?</NoAgentNotify> <!--Zero or more repetitions:--> <ForceNotificationToUserID>?</ForceNotificationToUserID> <!--Zero or more repetitions:--> <ExcludeNotificationToUserID>?</ExcludeNotificationToUserID> <!--Zero or more repetitions:--> <ExcludeMuteNotificationToUserID>?</ExcludeMuteNotificationToUserID> </Article> <!--Zero or more repetitions:--> <DynamicField> <Name>?</Name> <!--1 or more repetitions:--> <Value>?</Value> </DynamicField> <!--Zero or more repetitions:--> <Attachment> <Content>cid:61886944659</Content> <ContentType>?</ContentType> <Filename>?</Filename> </Attachment> </TicketCreate>
ja: <TicketCreate> <!--このレベルでは次の３つの必須選択項目があります。--> <!--Optional:--> <UserLogin>?</UserLogin> <!--Optional:--> <CustomerUserLogin>?</CustomerUserLogin> <!--Optional:--> <SessionID>?</SessionID> <!--Optional:--> <Password>?</Password> <Ticket> <Title>?</Title> <!--このレベルでは次の２つの必須選択項目があります。--> <!--Optional:--> <QueueID>?</QueueID> <!--Optional:--> <Queue>?</Queue> <!--このレベルでは次の２つの選択項目があります。--> <!--Optional:--> <TypeID>?</TypeID> <!--Optional:--> <Type>?</Type> <!--このレベルでは次の２つの選択項目があります。--> <!--Optional:--> <ServiceID>?</ServiceID> <!--Optional:--> <Service>?</Service> <!--このレベルでは次の２つの選択項目があります。--> <!--Optional:--> <SLAID>?</SLAID> <!--Optional:--> <SLA>?</SLA> <!--このレベルでは次の3つの必須選択項目があります。--> <!--Optional:--> <StateID>?</StateID> <!--Optional:--> <State>?</State> <!--このレベルでは次の２つの必須選択項目があります。--> <!--Optional:--> <PriorityID>?</PriorityID> <!--Optional:--> <Priority>?</Priority> <!--このレベルでは次の２つの選択項目があります。--> <!--Optional:--> <OwnerID>?</OwnerID> <!--Optional:--> <Owner>?</Owner> <!--このレベルでは次の２つの選択項目があります。--> <!--Optional:--> <ResponsibleID>?</ResponsibleID> <!--Optional:--> <Responsible>?</Responsible> <CustomerUser>?</CustomerUser> <!--Optional:--> <CustomerID>?</CustomerID> <!--Optional:--> <PendingTime> <Year>?</Year> <Month>?</Month> <Day>?</Day> <Hour>?</Hour> <Minute>?</Minute> </PendingTime> </Ticket> <Article> <!--このレベルでは次の２つの選択項目があります。--> <!--Optional:--> <ArticleTypeID>?</ArticleTypeID> <!--Optional:--> <ArticleType>?</ArticleType> <!--このレベルでは次の２つの選択項目があります。--> <!--Optional:--> <SenderTypeID>?</SenderTypeID> <!--Optional:--> <SenderType>?</SenderType> <!--Optional:--> <From>?</From> <Subject>?</Subject> <Body>?</Body> <!--このレベルでは次の２つの選択項目があります。--> <!--Optional:--> <ContentType>?</ContentType> <Charset>?</Charset> <MimeType>?</MimeType> <!--Optional:--> <HistoryType>?</HistoryType> <!--Optional:--> <HistoryComment>?</HistoryComment> <!--Optional:--> <AutoResponseType>?</AutoResponseType> <!--Optional:--> <TimeUnit>?</TimeUnit> <!--Optional:--> <NoAgentNotify>?</NoAgentNotify> <!--０回以上の繰り返し:--> <ForceNotificationToUserID>?</ForceNotificationToUserID> <!--０回以上の繰り返し:--> <ExcludeNotificationToUserID>?</ExcludeNotificationToUserID> <!--０回以上の繰り返し:--> <ExcludeMuteNotificationToUserID>?</ExcludeMuteNotificationToUserID> </Article> <!--０回以上の繰り返し:--> <DynamicField> <Name>?</Name> <!--1回以上の繰り返し:--> <Value>?</Value> </DynamicField> <!--０回以上の繰り返し:--> <Attachment> <Content>cid:61886944659</Content> <ContentType>?</ContentType> <Filename>?</Filename> </Attachment> </TicketCreate>

source: TicketUpdate operation adds the capability to modify attributes from an existing ticket or to add a new article, including attachments and all defined dynamic fields for the ticket and the new article.
ja: チケット更新オペレーションは、既存のチケットからの属性を修正するかあるいは新規記事を追加する能力を追加します。その記事は、チケットと新規記事のための添付と全ての定義済動的フィールドを含みます。
ru: Операция "Изменение заявки/TicketUpdate" добавляет возможность изменения атрибутов существующей заявки или добавить новое сообщение/заметку, включая вложения и все определенные динамические поля для заявки и нового сообщения.
sw: Operesheni ya SasishaTiketi inaongeza uwezo wa kubadili sifa kutoka kwenye tiketi iliyopo au kuongeza makala mpya, ikijumuisha na viambatanisho na sehemu zinazobadilika zote zilizofafanuliwa kwa ajili ya tiketi na makala mpya.

source: It is not necessary to create a new article to modify a ticket attribute.
ja: チケット属性を修正する新規記事を作成することは必要ではありません。
ru: Нет необходимости создавать новое сообщение/заметку для изменения атрибутов заявки.
sw: Sio lazima kutengeneza makala mpya kubadilisha sifa ya tiketi.

source: <TicketUpdate> <!--You have a MANDATORY CHOICE of the next 3 items at this level--> <!--Optional:--> <UserLogin>?</UserLogin> <!--Optional:--> <CustomerUserLogin>?</CustomerUserLogin> <!--Optional:--> <SessionID>?</SessionID> <!--Optional:--> <Password>?</Password> <!--You have a CHOICE of the next 2 items at this level--> <TicketID>?</TicketID> <TicketNumber>?</TicketNumber> <!--Optional:--> <Ticket> <!--Optional:--> <Title>?</Title> <!--You have a CHOICE of the next 2 items at this level--> <!--Optional:--> <QueueID>?</QueueID> <!--Optional:--> <Queue>?</Queue> <!--You have a CHOICE of the next 2 items at this level--> <!--Optional:--> <TypeID>?</TypeID> <!--Optional:--> <Type>?</Type> <!--You have a CHOICE of the next 2 items at this level--> <!--Optional:--> <ServiceID>?</ServiceID> <!--Optional:--> <Service>?</Service> <!--You have a CHOICE of the next 2 items at this level--> <!--Optional:--> <SLAID>?</SLAID> <!--Optional:--> <SLA>?</SLA> <!--You have a CHOICE of the next 2 items at this level--> <!--Optional:--> <StateID>?</StateID> <!--Optional:--> <State>?</State> <!--You have a CHOICE of the next 2 items at this level--> <!--Optional:--> <PriorityID>?</PriorityID> <!--Optional:--> <Priority>?</Priority> <!--You have a CHOICE of the next 2 items at this level--> <!--Optional:--> <OwnerID>?</OwnerID> <!--Optional:--> <Owner>?</Owner> <!--You have a CHOICE of the next 2 items at this level--> <!--Optional:--> <ResponsibleID>?</ResponsibleID> <!--Optional:--> <Responsible>?</Responsible> <!--Optional:--> <CustomerUser>?</CustomerUser> <!--Optional:--> <CustomerID>?</CustomerID> <!--Optional:--> <PendingTime> <Year>?</Year> <Month>?</Month> <Day>?</Day> <Hour>?</Hour> <Minute>?</Minute> </PendingTime> </Ticket> <!--Optional:--> <Article> <!--You have a CHOICE of the next 2 items at this level--> <!--Optional:--> <ArticleTypeID>?</ArticleTypeID> <!--Optional:--> <ArticleType>?</ArticleType> <!--You have a CHOICE of the next 2 items at this level--> <!--Optional:--> <SenderTypeID>?</SenderTypeID> <!--Optional:--> <SenderType>?</SenderType> <!--Optional:--> <From>?</From> <Subject>?</Subject> <Body>?</Body> <!--You have a CHOICE of the next 2 items at this level--> <!--Optional:--> <ContentType>?</ContentType> <Charset>?</Charset> <MimeType>?</MimeType> <!--Optional:--> <HistoryType>?</HistoryType> <!--Optional:--> <HistoryComment>?</HistoryComment> <!--Optional:--> <AutoResponseType>?</AutoResponseType> <!--Optional:--> <TimeUnit>?</TimeUnit> <!--Optional:--> <NoAgentNotify>?</NoAgentNotify> <!--Zero or more repetitions:--> <ForceNotificationToUserID>?</ForceNotificationToUserID> <!--Zero or more repetitions:--> <ExcludeNotificationToUserID>?</ExcludeNotificationToUserID> <!--Zero or more repetitions:--> <ExcludeMuteNotificationToUserID>?</ExcludeMuteNotificationToUserID> </Article> <!--Zero or more repetitions:--> <DynamicField> <Name>?</Name> <!--1 or more repetitions:--> <Value>?</Value> </DynamicField> <!--Zero or more repetitions:--> <Attachment> <Content>cid:166861569966</Content> <ContentType>?</ContentType> <Filename>?</Filename> </Attachment> </TicketUpdate>
ja: <TicketUpdate> <!--このレベルでは次の３つの必須選択項目があります。--> <!--Optional:--> <UserLogin>?</UserLogin> <!--Optional:--> <CustomerUserLogin>?</CustomerUserLogin> <!--Optional:--> <SessionID>?</SessionID> <!--Optional:--> <Password>?</Password> <!--このレベルでは次の２つの選択項目があります。--> <TicketID>?</TicketID> <TicketNumber>?</TicketNumber> <!--Optional:--> <Ticket> <!--Optional:--> <Title>?</Title> <!--このレベルでは次の２つの選択項目があります。--> <!--Optional:--> <QueueID>?</QueueID> <!--Optional:--> <Queue>?</Queue> <!--このレベルでは次の２つの選択項目があります。--> <!--Optional:--> <TypeID>?</TypeID> <!--Optional:--> <Type>?</Type> <!--このレベルでは次の２つの選択項目があります。--> <!--Optional:--> <ServiceID>?</ServiceID> <!--Optional:--> <Service>?</Service> <!--このレベルでは次の２つの選択項目があります。--> <!--Optional:--> <SLAID>?</SLAID> <!--Optional:--> <SLA>?</SLA> <!--このレベルでは次の２つの選択項目があります。--> <!--Optional:--> <StateID>?</StateID> <!--Optional:--> <State>?</State> <!--このレベルでは次の２つの選択項目があります。--> <!--Optional:--> <PriorityID>?</PriorityID> <!--Optional:--> <Priority>?</Priority> <!--このレベルでは次の２つの選択項目があります。--> <!--Optional:--> <OwnerID>?</OwnerID> <!--Optional:--> <Owner>?</Owner> <!--このレベルでは次の２つの選択項目があります。--> <!--Optional:--> <ResponsibleID>?</ResponsibleID> <!--Optional:--> <Responsible>?</Responsible> <!--Optional:--> <CustomerUser>?</CustomerUser> <!--Optional:--> <CustomerID>?</CustomerID> <!--Optional:--> <PendingTime> <Year>?</Year> <Month>?</Month> <Day>?</Day> <Hour>?</Hour> <Minute>?</Minute> </PendingTime> </Ticket> <!--Optional:--> <Article> <!--このレベルでは次の２つの選択項目があります。--> <!--Optional:--> <ArticleTypeID>?</ArticleTypeID> <!--Optional:--> <ArticleType>?</ArticleType> <!--このレベルでは次の２つの選択項目があります。--> <!--Optional:--> <SenderTypeID>?</SenderTypeID> <!--Optional:--> <SenderType>?</SenderType> <!--Optional:--> <From>?</From> <Subject>?</Subject> <Body>?</Body> <!--このレベルでは次の２つの選択項目があります。--> <!--Optional:--> <ContentType>?</ContentType> <Charset>?</Charset> <MimeType>?</MimeType> <!--Optional:--> <HistoryType>?</HistoryType> <!--Optional:--> <HistoryComment>?</HistoryComment> <!--Optional:--> <AutoResponseType>?</AutoResponseType> <!--Optional:--> <TimeUnit>?</TimeUnit> <!--Optional:--> <NoAgentNotify>?</NoAgentNotify> <!--Zero or more repetitions:--> <ForceNotificationToUserID>?</ForceNotificationToUserID> <!--Zero or more repetitions:--> <ExcludeNotificationToUserID>?</ExcludeNotificationToUserID> <!--Zero or more repetitions:--> <ExcludeMuteNotificationToUserID>?</ExcludeMuteNotificationToUserID> </Article> <!--Zero or more repetitions:--> <DynamicField> <Name>?</Name> <!--1 or more repetitions:--> <Value>?</Value> </DynamicField> <!--Zero or more repetitions:--> <Attachment> <Content>cid:166861569966</Content> <ContentType>?</ContentType> <Filename>?</Filename> </Attachment> </TicketUpdate>
