Repository: DSigmund/doc-admin
Catalog: i18n/doc-admin.*.po
Languages: ja, ru, sw

source: OTRS will generate a strong password for you. It's possible to enter your own password if you prefer this. The password will be written to the configuration file <filename>Kernel/Config.pm</filename> so there is no need to remember this password.
ja: OTRSは、強いパスワードを生成します。望めば自分のパスワードを入力することも可能です。パスワードは構成ファイル<filename>Kernel/Config.pm</filename>に書かれるのでこのパスワードを思い出す必要はありません。
ru: OTRS сгенерирует надежный пароль для вас. Можно ввести свой собственный пароль. Пароль будет записан в конфигурационном файле <filename>Kernel/Config.pm</filename>, так что запоминать его необязательно.
sw: OTRS itatengeneza nywila imara kwa ajili yako. Inawezekana kuweka nywila yako mwenyewe kama ukitaka. Nywila itaandikwa kwenye faili la usanidi <filename>Kernel/Config.pm</filename> kwahiyo hakuna haja ya kukumbuka nywila hii.

source: installer.pl screen - Create database all settings
ja: installer.pl 画面 - 作成 データベース 全ての設定
ru: installer.pl screen - Создание базы данных, все настройки
sw: skrini ya installer.pl - Tengeneza hifadhidata mipangilio yote

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="installer.pl - screenshot" scale="40" fileref="screenshots/installer5.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="installer.pl - スクリーンショット" scale="40" fileref="screenshots/installer5.png"></graphic>

source: <emphasis>Figure: Database settings.</emphasis>
ja: <emphasis>図：データベース設定</emphasis>
ru: <emphasis>Рисунок: Настройки базы данных.</emphasis>
sw: <emphasis>Kielelezo: Mipangilio ya hifadhidata.</emphasis>

source: 6. The database will be created if needed, and populated, as shown in this image. Click 'Next' to go to the next screen.
ja: 6. 必要ならデータベースは作成され、この図で示されるように追加されます。次のスクリーンに行くために「次へ」をクリックしてください。
ru: 6. База данных будет создана и заполнена, как показано на рисунке. Нажмите "Далее" для перехода к следующему экрану.
sw: 6. Hifadhidata itatengenezwa kama itahitajika, na kujazwa, kama ilivyoonyeshwa kwenye hii taswira. Bofya kitufe cha kuendelea kwenda kwenye skrini inayofuata.

source: installer.pl screen - Create Database setup successful
ja: installer.pl 画面 - 作成 データベース 設定成功
ru: installer.pl - Создание базы данных завершена успешно
sw: skrini ya installer.pl - Tengeneza mpangilio wa Hifadhidata kikamilifu

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="installer.pl - screenshot" scale="40" fileref="screenshots/installer6.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="installer.pl - 画面" scale="40" fileref="screenshots/installer6.png"></graphic>

source: <emphasis>Figure: Successful database setup.</emphasis>
ja: <emphasis>図：データベース設定の成功</emphasis>
ru: <emphasis>Рисунок: Уведомление об успешной установке базы данных.</emphasis>
sw: <emphasis>Kielelezo: Uanzishaji hifadhidata kwa mafanikio.</emphasis>

source: 7. Provide all the required system settings and click on 'Next' (see Figure below).
ja: 7. 必要なすべてのシステム設定を提供し、「次に」をクリックしてください(下図参照)。
ru: 7. Укажите все необходимые настройки системы и нажмите кнопку 'Далее' (см. Рисунок ниже).
sw: 7. Toa mipangilio yote ya mfumo na bofya kwenye kitufe cha kuendelea (ona Kielelezo chini).

source: installer.pl screen - System Settings
ja: installer.pl 画面 - システム設定
ru: installer.pl страница - Настройки Системы
sw: skrini ya installer.pl - Mipangilio ya Mfumo

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="installer.pl - screenshot" scale="40" fileref="screenshots/installer7.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="installer.pl - スクリーンショット" scale="40" fileref="screenshots/installer7.png"></graphic>

source: <emphasis>Figure: System settings.</emphasis>
ja: <emphasis>図：システム設定</emphasis>
ru: <emphasis>Рисунок: Настройки системы.</emphasis>
sw: <emphasis>Kielelezo: Mipangilio ya mfumo.</emphasis>

source: 8. If desired, you can provide the needed data to configure your inbound and outbound mail, or skip this step by pressing the right button at the bottom of the screen (see Figure below).
ja: 8. 希望するならば、受信、発信メールを構成する必要なデータを提供し、あるいは、画面の下部を右クリックを押すことでこのステップを割愛します。(下図参照)。
ru: 8. Если хотите, можно указать необходимые данные для настройки входящей и выходящей почты, можете пропустить этот шаг, нажав кнопку в нижней части экрана (см. Рисунок ниже).
sw: 8. Kama ikihitajika, unaweza kutoa data zinazotakiwa kusanidi barua zinazoingia na zinazotoka , au kuruka hatua hii kwa kubonyeza kitufe cha kulia upande wa chini wa skrini (ona Kielelezo chini).

source: installer.pl screen - Mail Configuration
ja: installer.pl 画面 - メール構成
ru: installer.pl страница - Настройка Почты
sw: skrini ya installer.pl - Usanidi wa Barua pepe

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="installer.pl - screenshot" scale="40" fileref="screenshots/installer8.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="installer.pl - スクリーンショット" scale="40" fileref="screenshots/installer8.png"></graphic>

source: <emphasis>Figure: Mail configuration.</emphasis>
ja: <emphasis>図：メール構成</emphasis>
ru: <emphasis>Рисунок: Настройка электронной почты.</emphasis>
sw: <emphasis>Kielelezo: Usanidi wa barua.</emphasis>

source: 9. Congratulations! Now the installation of OTRS is finished and you should be able to work with the system (see Figure below). To log into the web interface of OTRS, use the address <ulink url="http://localhost/otrs/index.pl"> <citetitle>http://localhost/otrs/index.pl</citetitle> </ulink> from your web browser. Log in as OTRS administrator, using the username 'root@localhost' and the generated password. After that, you can configure the system to meet your needs.
ja: 9. おめでとうございます! これで、OTRSのインストレーションは終了です。そして、システムで稼働できるに違いありません(下記の図を参照)。OTRSのウェブ・インターフェースにログインするために、ブラウザからアドレス<ulink url="http://localhost/otrs/index.pl"> <citetitle>http://localhost/otrs/index.pl</citetitle> </ulink>を使用します。ユーザー名 'root@localhost' および生成されたパスワードを使用して、OTRS管理者としてログインしてください。その後、要求を満たすシステムを構成することができます。
ru: 9. Поздравляем! Установка OTRS завершена и можно начинать работу с системой (см. Рисунок ниже). Для входа в веб-интерфейс OTRS, откройте веб-браузер и наберите в адресной строке <ulink url="http://localhost/otrs/index.pl"> <citetitle>http://localhost/otrs/index.pl</citetitle> </ulink>. Чтобы войти в систему OTRS с правами администратора, используйте логин 'root@localhost' и сгенерированный системой пароль. Затем вы можете настроить систему в соответствии с вашими требованиями.
sw: 9. Hongera! Sasa usakinishaji wa OTRS umemalizika na unatakiwa kuweza kufanya kazi na mfumo (ona Kielelezo chini). Kuingia kwenye kilesura cha mtumiaji wa OTRS, tumia anwani <ulink url="http://localhost/otrs/index.pl"> <citetitle>http://localhost/otrs/index.pl</citetitle> </ulink> kutoka kwenye kivinjari wavuti chako. Ingia kama msimamizi wa OTRS, kwa kutumia jina la mtumiaji 'root@localhost' na nywila iliyozalishwa. Baada ya hapo, unaweza kusanidi mfumo kufikia mahitaji yako.

source: Please write down the generated password for the 'root@localhost' account.
ja: 'root@localhost' アカウント用に生成したパスワードを書き留めておいて下さい。
ru: Пожалуйста, запишите пароль сгенерированный системой для учетной записи 'root@localhost'.
sw: Tafadhali andika nywila iliyozalishwa kwa ajili ya akaunti ya 'root@localhost'.

source: installer.pl screen - Finished
ja: installer.pl 画面 - 完了
ru: installer.pl страница - Завершено
sw: skrini ya installer.pl - Imemalizika

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="installer.pl - screenshot" scale="40" fileref="screenshots/installer9.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="installer.pl - スクリーンショット" scale="40" fileref="screenshots/installer9.png"></graphic>

source: <emphasis>Figure: Web installer final screen.</emphasis>
ja: <emphasis>図：ウェブ・インストラー最終画面</emphasis>
ru: <emphasis>Рисунок: Финальная страница Веб установщика.</emphasis>
sw: <emphasis>Kielelezo: Skrini ya mwisho ya kisakinishi cha wavuti.</emphasis>

source: Additional Resources
ja: 追加の資料
ru: Дополнительные ресурсы
sw: Rasilimali za Ziada

source: We try to support you with the very latest information about OTRS. We also give you an opportunity to provide us with your feedback.
ja: 私達はOTRSに関する正に最新情報でサポートしようとします。さらにフィードバックを提供する機会も与えます。
ru: Мы стараемся снабжать вас самой последней информацией об OTRS и предоставляем вам возможность оставить нам свой отзыв.
sw: Tunajaribu kukusaidia na taarifa mpya kuhusu OTRS. Pia tunakupa nafasi ya wewe kutupatia maoni yako.

source: Website OTRS Group
ja: OTRSグループのウェブサイト
sw: Kundi la OTRS la tovuti.

source: You can find the website of the OTRS Group, the company behind OTRS, at <ulink url="http://www.otrs.com/"><citetitle>http://www.otrs.com</citetitle></ulink>. It contains a lot of product-related information, such as white papers, release notes, case studies and so on.
ja: <ulink url="http://www.otrs.com/"><citetitle>http://www.otrs.com</citetitle></ulink>で、OTRSグループ(OTRSを支える集団)のウェブサイトを見つけることができます。それは、白書、リリース・ノート、事例研究などのような多くの製品関連情報を含んでいます。
sw: Unaweza kupata tovuti ya OTRS Group, kampuni nyuma ya OTRS, katika <ulink url="http://www.otrs.com/"><citetitle>http://www.otrs.com</citetitle></ulink>. Ina taarifa nyingi zinazohusiana na bidhaa, kama karatasi nyeupe, tini za toleo, mifano ya utafiti na kadhalika.

source: Mailing lists
ja: メーリングリスト
sw: Orodha za watumiwa

source: The Table A-1 displays our various community mailing lists.
ja: テーブルA-1はさまざまなコミュニティのメーリングリストを表示します。
sw: Jedwali A-1 linaonyesha orodha ya watumiwa wetu wa jamii.

source: Mailinglists
ja: メーリングリスト
ru: Списки рассылки
sw: Orodhazawatumiwa

source: Homepage
ja: ホームページ
ru: Домашняя страница
sw: Ukurasa wa nyumbani

source: Low traffic list, in English, for announcements of new OTRS releases and security issues.
ja: 新しいOTRSリリースおよびセキュリティ問題に関するアナウンスのためリスト。英語で、転送量は少量です。
ru: Низкий трафик, на английском языке, для объявлений о новых релизах OTRS и решениях о безопасности.
sw: Orodha ya hali chini ya msongamano, kwa Kiingereza, kwa ajili ya matangazo ya matoleo mapya ya OTRS na masuala ya usalama.

source: Medium to high traffic list, in English, where you can find all sorts of relevant questions and support for the product.
ja: 全ての関連質問および製品サポートについてのリスト。英語で、流量は中/多量です。
ru: От среднего до высокого объема трафика, на английском языке, где вы можете найти все виды вопросов, касающихся поддержки и продукта.
sw: Orodha ya hali ya kati kwenda juu ya msongamano, kwa Kiingereza, ambapo unaweza kupata maswali ya aina zote yanayohusika na msaada kuhusu bidhaa.

source: Medium to high traffic list, in German, where you can find all sorts of relevant questions and support for the product.
ja: 全ての関連質問および製品サポートについてのリスト。ドイツ語で、流量は中/多量です。
ru: От среднего до высокого объема трафика, на немецком языке, где вы можете найти все виды вопросов, касающихся поддержки и продукта.
sw: Orodha ya hali ya kati kwenda juu ya msongamano, kwa Kijerumani, ambapo unaweza kupata maswali ya aina zote yanayohusika na msaada kuhusu bidhaa.

source: Medium traffic list, in English, where the OTRS developers discuss various design and implementation issues.
ja: OTRS開発者がさまざまなデザインや実装の問題を議論するリスト。英語で、流量は中度です。
ru: Средний трафик на английском языке, где OTRS-разработчики обсуждают различные планы и вопросы реализации.
sw: Orodha ya hali ya kati, kwa Kiingereza, ambapo waundaji wa OTRS wanajadili masuala mbali mbali ya usanifu na utekelezaji.

source: Low traffic list, in English, for internationalization and localization questions. If you are or want to become a translator of the OTRS project or have any problems with one of our applications in an international environment, this is where you should connect.
ja: 国際化および現地化に関する質問に関して。OTRSプロジェクトの翻訳者になりたいか、国際的環境でアプリケーションに関してどんな問題でもあれば、接続するのはここです。英語で、流量は少量です。
ru: Небольшое количество пользователей на английском языке с вопросами интернационализации и локализации. Если вы есть или только хотите стать переводчиком проекта OTRS или имеете проблемы с одним из наших приложений, это именно то место, куда вам нужно.
sw: Orodha ya hali ya chini, kwa kiingereza, kwa ajili ya maswali ya kuafanya iwe ya kimataifa na ya ujanibishaji. Kama wewe ni au unataka kuwa mtafsiri wa mradi wa OTRS au una matatizo na moja ya programu-tumizi zetu katika mazingira ya kimataifa, hapa ndipo unatakiwa kujiunganisha.

source: To subscribe to any of these lists, visit the following link: <ulink url="http://lists.otrs.org/"><citetitle>http://lists.otrs.org/</citetitle></ulink>.
ja: これらのメーリングリストのいずれかを購読するには以下のリンクを訪問して下さい。<ulink url="http://lists.otrs.org/"><citetitle>http://lists.otrs.org/</citetitle></ulink>。
sw: Kujiunga na nojawapo kati ya hizi orodha, tembelea kiungo kifuatacho:<ulink url="http://lists.otrs.org/"><citetitle>http://lists.otrs.org/</citetitle></ulink>.

source: User Forums
ja: ユーザ・フォーラム
sw: Majukwaa ya watumiaji

source: You can find community user forums at <ulink url="http://forums.otrs.org/"><citetitle>http://forums.otrs.org</citetitle></ulink>. It allows you to get in contact with users all around the world and exchange experiences regarding the use of OTRS.
ja: <ulink url="http://forums.otrs.org/"><citetitle>http://forums.otrs.org</citetitle></ulink>でコミュニティー・ユーザ・フォーラムを見つけることができます。そこでは、世界中のユーザに接し、OTRSの使用に関する経験を交換することができます。
sw: Unaweza kutafuta majukwaa ya watumiaji wa jamii katika <ulink url="http://forums.otrs.org/"><citetitle>http://forums.otrs.org</citetitle></ulink>. Itakuwezesha kuwasiliana na watumiaji dunia nzima na kubadilishana uzoefu kuhusu matumizi ya OTRS.

source: Bug tracking
ja: バグ・トラッキング
ru: Трекинг ошибок
sw: Ufuatiliaji makosa

source: To submit bugs visit <ulink url="http://bugs.otrs.org/"><citetitle>http://bugs.otrs.org/</citetitle></ulink> (see Figure below). Please take note of the difference between a bug and a configuration issue. Configuration issues are problems that you encounter when setting a system, or general questions regarding the use of OTRS. Bug reports should only be used for issues with the source code of OTRS itself, or to file enhancements for OTRS. All your bug reports and enhancement requests are very welcome in the bug tracker.
ja: バグを送信するために<ulink url="http://bugs.otrs.org/"><citetitle>http://bugs.otrs.org/</citetitle></ulink>を訪ねて下さい(下記の図を参照)。バグと構成問題間の違いについてノートをとってください。構成問題は、システムを設定する時遭遇する問題、あるいはOTRSの使用に関する一般的な質問です。バグ・レポートは、OTRSのソース・コード自体の問題あるいはOTRSの改善をファイルするためのみに使用されるべきです。全てのバグ・レポートおよび改善要求を、バグ・トラッカー非常に歓迎します。
sw: Kuwasilisha makosa tembelea <ulink url="http://bugs.otrs.org/"><citetitle>http://bugs.otrs.org/</citetitle></ulink> (ona Kielelezo chini). Tafadhali tambua tofauti kati ya kosa na swala la usanidi. Maswala ya usanidi ni matatizo unayokutana nayo wakati wa kupangilia mfumo, au maswali ya ujumla kuhusu utumiaji wa OTRS. Ripoti za makosa zinatakiwa kutumiwa kwa maswala ya kanuni chanzo ya OTRS yenyewe, au uendelezaji wa mafaili ya OTRS. Ripoti zako zote za makosa na maombi ya uendelezaji yanakaribishwa sana katika kifutiliaji makosa.

source: Bugtracking Tool
ja: バグ・トラッキング・ツール
ru: Инструмент отслеживания информации об ошибках
sw: Kifaa cha ufwatiliajimakosa

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="bugtracking tool" scale="40" fileref="screenshots/bugs-otrs-org.png"></graphic>
ja: <placeholder type="screeninfo" id="0"/> <graphic srccredit="バグ・トラッキング・ツール" scale="40" fileref="screenshots/bugs-otrs-org.png"></graphic>

source: <emphasis>Figure: Bug tracker.</emphasis>
ja: <emphasis>図：バグ・トラッカー</emphasis>
sw: <emphasis>Kielelezo: Kifwatiliaji makosa .</emphasis>

source: For configuration issues, you should either use the <ulink url="http://www.otrs.com/en/solutions/service-contracts/"><citetitle>commercial support, available from OTRS.com</citetitle></ulink>, or the public mailing lists.
ja: 構成問題については、<ulink url="http://www.otrs.com/en/solutions/service-contracts/"><citetitle>OTRS.comから利用可能な商用サポート</citetitle></ulink>、あるいは公式メーリング・リストのどちらかを利用すべきです。
sw: Kwa masuala ya usanidi, unatakiwa aidha kutumia <ulink url="http://www.otrs.com/en/solutions/service-contracts/"><citetitle> msaada wa biashara, unaopatikana kutoka OTRS.com</citetitle></ulink>,au orodha ya umma ya barua.

source: You help us improve the product by reporting bugs. We appreciate your input!
ja: みなさんのバグ・レポートによって製品が改善されます。みなさんのインプットに感謝します！
sw: Unatusaidia kuboresha bidhaa kwa kutuarifu kuhusu makosa. Tunakushukuru kwa mchango wako!

source: Commercial Support
ja: 商用サポート
sw: Usaidizi wa ki biashara

source: For services (support, consulting, development, and training) you can contact the company behind OTRS, OTRS AG. Our offices are located in Germany, USA, Mexico, the Netherlands, and in other countries. Visit our website for contact information: <ulink url="http://www.otrs.com/en/corporate-navigation/contact/"><citetitle>http://www.otrs.com/en/corporate-navigation/contact/</citetitle></ulink>
ja: サービス（サポート、コンサルティング、開発およびトレーニング）については、OTRSの支援団体、OTRS AGと連絡をとることができます。私たちのオフィスはドイツ、アメリカ、メキシコ、オランダおよび他の国々に位置します。連絡先情報のために私たちのウェブサイトを訪れてください:<ulink url="http://www.otrs.com/en/corporate-navigation/contact/"><citetitle>http://www.otrs.com/en/corporate-navigation/contact/</citetitle></ulink>
sw: Kwa huduma (msaada, ushauri, uundaji, na mafunzo) unaweza kuwasiliana na kampuni iliyo nyuma ya OTRS, OTRS AG. Ofisi zetu zipo Ujerumani, USA, Mexico, Ubelgiji, na nchi nyingine. Tembelea tovuti yetu kwa taarifa za mawasiliano: <ulink url="http://www.otrs.com/en/corporate-navigation/contact/"><citetitle>http://www.otrs.com/en/corporate-navigation/contact/</citetitle></ulink>

source: Name
ru: Название
sw: Jina

source: CreateTime
sw: Tengeneza muda

source: CreateBy
sw: Imetengenezwa na

source: ChangeTime
sw: Badilisha muda

source: ChangeBy
sw: Ilibadilishwa na

source: State
sw: Hali

source: StartActivity
sw: AnzaShughuli

source: StartActivityDialog
sw: AnzaShughuliMaongezi

source: Cond1
sw: Sharti1

source: StateID
sw: IDyaHali

source: 001-ACL-ProcessProperties
sw: 001-ACL-SifaMchakato

source: ProcessEntityID
sw: KitambulishoChaChomboChaMchakato

source: ActivityEntityID
sw: KitambulishoChaChomboChaShughuli

source: ActivityDialogEntityID
sw: KitambulishoChaChomboChaMaongeziYaShughuli

source: TicketIndexModule
sw: ModuliKielelezoTiketi

source: <ulink url="http://varlena.com/GeneralBits/Tidbits/annotated_conf_e.html"> <citetitle>http://varlena.com/GeneralBits/Tidbits/annotated_conf_e.html</citetitle> </ulink>
sw: <ulink url="http://varlena.com/GeneralBits/Tidbits/annotated_conf_e.html"> <citetitle>http://varlena.com/GeneralBits/Tidbits/annotated_conf_e.html</citetitle> </ulink> Type your translation here

source: Radius
sw: Nusukipenyo

source: Scheduler init.d files
ru: Файлы Init.d Планировщика
sw: Mafaili ya init.d ya mratibu

source: Init Script
ru: Сценарий инициализации
sw: Hati ya Init

source: otrs-scheduler-linux
sw: otrs-mratibu-linux

source: Microsoft Windows uses the file <command>OTRS_HOME/bin/otrs.Scheduler4Win.pl</command>.
sw: Microsoft Windows inatumia faili <command>OTRS_HOME/bin/otrs.Scheduler4Win.pl</command>.

source: The distribution of incoming messages can be controlled if they need to be sorted by queue or by the content of the "To:" field. For the Dispatching field, if "Dispatching by selected queue" is selected, all incoming messages will be sorted into the specified queue. The address where the mail was sent to is disregarded in this case. If "Dispatching by email To: field" is selected, the system checks if a queue is linked with the address in the To: field of the incoming mail. You can link an address to a queue in the <link linkend="adminarea-emailaddresses">E-mail address management</link> section of the Admin page. If the address in the To: field is linked with a queue, the new message will be sorted into the linked queue. If no link is found between the address in the To: field and any queue, then the message flows into the "Raw" queue in the system, which is the <link linkend="ConfigReference_Ticket:Core::PostMaster:PostmasterDefaultQueue">PostmasterDefaultQueue</link> after a default installation.
ru: Можно контролировать распределением входящих сообщений, если они должны сортироваться по очередям или содержимому поля "Кому". Если для Диспетчеризации выбрана опция "Диспетчеризация по выбранной очереди", то все входящие сообщения будут отсортированы в указанной очереди. В таком случае адрес, с которого отправили сообщение не учитывается. Если для диспетчеризации выбрана опция "Диспетчеризация писем по полю Кому", система для входящих писем проверяет, связана ли эта очередь с адресом электронной почты в поле Кому. Перейдя по ссылке <link linkend="adminarea-emailaddresses">Управление E-mail-адресами</link> в Панели Администрирования, можно связать определенный адрес с очередью. Если не найдено никакой связи между адресом в поле "Кому" то сообщение будет сохранятся в системе в очереди "Raw" , которая задана в <link linkend="ConfigReference_Ticket:Core::PostMaster:PostmasterDefaultQueue"> PostmasterDefaultQueue </link> по умолчанию после установки системы.
sw: Usambazaji wa ujumbe unaoingia unaweza kudhibitiwa kama inahitajika kupangwa kwa foleni au kwa maudhui ya sehemu "Kwa:". Kwa sehemu ya kutuma, kama "Utumaji kwa foleni iliyochaguliwa" imechaguliwa, ujumbe unaoingia utapangwa kwenye foleni maalumu. Anuani ambako barua ilitumwa inapuuzwa kwa sasa. Kama "Utumaji kwa barua pepe sehemu Kwa: " imechaguliwa, mfumo unakagua kama foleni imeunganishwa na anuani ya kwenye sehemu Kwa: ya barua inayoingia. Unaweza kuunganisha anuani kwenye foleni katika kifungu cha <link linkend="adminarea-emailaddresses">Usimamizi wa anuani ya barua pepe</link> cha ukurasa wa Msimamizi. Kama anuani ya sehemu Kwa: imeunganishwa na foleni, ujumbe mpya utapangwa kwenye foleni zilizounganishwa. Kama hakuna kiungo kilichopatikana kati ya anuani kwenye sehemu Kwa: na foleni yoyote, basi ujumbe utaingia kwenye foleni "Mbichi" katika mfumo, ambayo ni <link linkend="ConfigReference_Ticket:Core::PostMaster:PostmasterDefaultQueue">FoleniChaguo-msingiYaMkuuwaposta </link> baada ya usakinishaji wa kawaida.

source: FromAddressRegExp
sw: KutokaAnwaniRegExp

source: NumberRegExp
sw: NambaRegExp

source: SearchInSubject
sw: TafutaInSomo

source: SearchInBody
sw: Tafuta katika Kiini

source: DynamicField
sw: SehemuInayobadilika

source: SenderType
sw: AinaYaMtumaji
