Repository: DSigmund/doc-admin
Catalog: i18n/doc-admin.*.po
Languages: ja, ru, sw

source: OTRS needs some more modules than can be installed by the RPM. You can post-install them manually. You can check what modules you are missing by running the <filename>bin/otrs.CheckModules.pl</filename> script located in the <filename>/opt/otrs</filename> directory. Some modules are only needed for optional functionality, such as communication with IMAP(S) servers or PDF generation. On SLES you should add an external repository to the zypper configuration in order to get the modules needed for your system. Choose the module needed for your OS version from here: <ulink url="http://download.opensuse.org/repositories/devel:/languages:/perl/">http://download.opensuse.org/repositories/devel:/languages:/perl/</ulink>. Add the repository like this for SLES 11 SP2:
ja: OTRSは、RPMによってインストールすることができるモジュールよりさらに幾つか多くのモジュールを必要とします。それらを手動で後からインストールすることができます。<filename>/opt/otrs</filename>ディレクトリーにある<filename>bin/otrs.CheckModules.pl</filename> スクリプトを実行して、不足しているのがどのモジュールかをチェックすることができます。いくつかのモジュールは、IMAP(S)サーバーかPDF生成とのコミュニケーションのようなオプションの機能性にだけ必要とされます。SLESではシステムにモジュールを必要とするために外部リポジトリをzypper構成に追加すべきです。OSバージョンに必要とされたモジュールをここから選択してください:<ulink url="http://download.opensuse.org/repositories/devel:/languages:/perl/">http://download.opensuse.org/repositories/devel:/languages:/perl/</ulink>。SLE 11 SP2用にこのようにリポジトリを追加します。
ru: OTRS требуются некоторые дополнительные модули, кроме тех, что устанавливаются с помощью RPM. Вы можете доустановить их вручную. Выяснить, какие дополнительные модули требуются, можно с помощью скрипта <filename>bin/otrs.CheckModules.pl</filename> размещенного в каталоге <filename>/opt/otrs</filename>. Некоторые модули требуются только в случае включения дополнительных опций, например для взаимодействия с серверами IMAP(S) или вывода в формате PDF. При использовании SLES необходимо подключить внешнее хранилище для конфигурации zypper для доступа к модулям, требующимся вашей системе. Выберите модуль для вашей версии ОС отсюда: <ulink url="http://download.opensuse.org/repositories/devel:/languages:/perl/">http://download.opensuse.org/repositories/devel:/languages:/perl/</ulink>. Добавьте репозиторий, например, для SLES 11 SP2:
sw: OTRS inahitaji moduli zaidi ya zinazoweza kusakinishwa na RPM. Unaweza kuzisakinisha baadaye kwa mikono. Unaweza kukagua moduli gani hauna kwa kuanzisha hati <filename>bin/otrs.CheckModules.pl</filename> inayopatikana kwenye mpangilio orodha <filename>/opt/otrs</filename>. Baadhi ya moduli zinahitajika kwa ajili ya sifa za hiari tu, kama mawasiliano na seva ya(za) IMAP au uzalishaji wa PDF. Kwenye SLES unatakiwa kuongeza hifadhi ya nje kwenye usanidi wa zypper ili kupata moduli zinazohitajika kwa ajili ya mfumo wako. Chagua moduli inayohitajika na toleo lako la mfumo endeshi kutoka hapa: <ulink url="http://download.opensuse.org/repositories/devel:/languages:/perl/">http://download.opensuse.org/repositories/devel:/languages:/perl/</ulink>.Ongeza hifadhi kama hii kwa ajili ya SLES 11 SP2:

source: On openSUSE 12.3 the extra repository is only needed for the Mail::IMAPClient module, which you'd only need if you need to collect mails from an IMAP server secured with TLS. The corresponding line would look like this:
ja: openSUSE 12.3では、別のリポジトリがMail::IMAPClientモジュールにだけ必要とされます。TLSで安全なIMAPサーバーからメールを集める必要があるときだけ、それを必要とするでしょう。対応する行は以下ご欄ください:
ru: В ОС openSUSE 12.3, внешний репозиторий требуется только для модуля Mail::IMAPClient, который необходим в случае, если вы забираете почту с сервера IMAP с TLS. Соответствующая строка будет выглядеть так:
sw: Kwenye openSUSE 12.3 hifadhi ya ziada inahitajika kwa ajili ya moduli Mail::IMAPClient tu, kama utahitaji kama unahitaji kukusanya barua kutoka kwenye seva ya IMAP inayolindwa na TLS. Mstari husika utaonekana kama hivi:

source: The first time you use zypper after you added this repository, you will be prompted to add its key. Now you can install missing modules like below.
ja: このリポジトリ追加後、はじめてzypperを使用時、そのキーを追加するように促されるでしょう。これで以下のように、不足しているモジュールをインストールすることができます。
ru: В первый раз, при использовании zypper после добавления строки с указанием репозитария, вас попросят ввести его ключ. Теперь, вы можете установить пропущенные модули, как показано ниже.
sw: Mara ya kwanza unatumia zypper baada ya kuongeza hii hifadhi, utaombwa kuweka ufunguo wake. Sasa unaweza kusakinisha moduli zinazokosekana kama hapa chini.

source: The next step is to configure OTRS using the web installer, as described <link linkend="web-installer">in this section</link>.
ja: 次のステップでは<link linkend="web-installer">このセクションで</link>記述されるように、ウェブ・インストーラーを使用して、OTRSを構成します。
ru: Следующим шагом является настройка OTRS с помощью веб - установщика, как описано в <link linkend="web-installer">в этом разделе</link>.
sw: Hatua inayofuata ni kusanidi OTRS kwa kutumia kisakinishi cha wavuti, kama ilivyoelezewa <link linkend="web-installer">katika kifungu hiki</link>.

source: Installing OTRS on a Red Hat Enterprise Linux or CentOS system
ja: Red Hat Enterprise Linux あるいは CentOS システムへのOTRSのインストール
ru: Установка OTRS в операционной системе Red Hat Enterprise Linux или CentOS
sw: Kusakinisha OTRS katika mifumo endeshi ya Red Hat Enterprise Linux au CentOS system

source: This section describes the installation of our RPM package on a Red Hat Enterprise Linux (RHEL) or CentOS server. For OTRS 3.3 and up, RHEL 6 or CentOS 6 is a requirement, version 5 is not supported. Before you start the installation, please visit <ulink url="http://www.otrs.com/downloads"> <citetitle>http://www.otrs.com/downloads</citetitle> </ulink> and make sure you use the latest OTRS RPM package available.
ja: このセクションは、Red Hat Enterprise Linux (RHEL)あるいはCentOSサーバー上のRPMのパッケージの構成について記述します。OTRS 3.3以上については、RHEL 6あるいはCentOS 6が必須です、バージョン5はサポートされません。インストールを始める前に、<ulink url="http://www.otrs.com/downloads"><citetitle>http://www.otrs.com/downloads</citetitle> </ulink>を訪れ、利用可能な最新のOTRS RPMのパッケージを使用しているかを確認してください。
ru: В этом разделе описывается установка встроенных RPM пакетов на дистрибутив Red Hat Enterprise Linux (RHEL) или CentOS. Для OTRS 3.3 и выше, требуются RHEL 6 или CentOS 6, версия 5 не поддерживается. До начала установки посетите <ulink url="http://www.otrs.com/downloads"> <citetitle>http://www.otrs.com/downloads</citetitle> </ulink>, чтобы убедиться, что вы используете самые последние версии OTRS RPM пакетов.
sw: Hiki kifungu kinaelezea usakinishaji wa kifurushi chetu cha RPM kwenye seva ya Red Hat Enterprise Linux (RHEL) au CentOS. Kwa OTRS 3.3 na kuendelea, RHEL 6 au CentOS 6 inahitajika, toleo la 5 halina msaada. Kabla ya kuanza usakinishaji, tafadhali tembelea <ulink url="http://www.otrs.com/downloads"> <citetitle>http://www.otrs.com/downloads</citetitle> </ulink> na hakikisha unatumia kifurushi cha hivi karibuni cha OTRS RPM kinachopatikana.

source: You can use OTRS using different database back-ends: MySQL, PostgreSQL, Oracle or Microsoft SQL Server. The most popular database to deploy OTRS on is MySQL. This chapter shows the steps you need to take to configure MySQL on a RHEL-based server. Of course you can install the database on a dedicated database server if needed for scalability or other purposes.
ja: 異なるデータベースバックエンドを使用して、OTRSを使用することができます:MySQL、PostgreSQL、OracleあるいはMicrosoft SQL Server。OTRSを上に展開させる最もポピュラーなデータベースはMySQLです。本章は、RHELベースのサーバ上のMySQLを構成するために必要なステップを示します。もちろん、拡張性あるいは他の目的に必要ならばデータベースを専用データベース・サーバにインストールすることもできます。
ru: Для работы с OTRS можно использовать различные СУБД: MySQL, PostgreSQL, Oracle или Microsoft SQL Server. Наиболее популярной является MySQL. Эта глава показывает необходимые шаги для настройки MySQL на сервер с RHEL. Конечно, вы можете установить СУБД на выделенный сервер баз данных в целях масштабируемости или иных других.
sw: Unaweza kutumia OTRS kwa kutumia mazingira ya nyuma tofauti: MySQL, PostgreSQL, Oracle or Microsoft SQL Server. Hifadhidata maarufu kuweka kwenye OTRS ni MySQL. Hii sura inaonyesha hatua unazohitaji kupitia kusanidi MySQL kwenye seva ya RHEL. Bila shaka unaweza kusakinisha hifadhidata kwenye seva ya hifadhidata iliyojitolea kwa ajili ya kubadilisha kirahisi na sababu nyingine.

source: This will install MySQL with the default options on your system. You'll need to change the defaults in order to make it suitable for OTRS. With a text editor open the file <filename>/etc/my.cnf</filename> and add the next two lines under the [mysqld] section:
ja: これは、デフォルト・オプションを持つMySQLをシステムにインストールします。それをOTRSに適しているようにデフォルトを変更する必要があります。テキストエディターで、ファイル<filename>/etc/my.cnf</filename>を開き、[mysqld]セクションの下の次の2行を追加します:
ru: Будет установлена MySQL со стандартными настройками. Необходимо сделать некоторые изменения, для лучшей совместимости с OTRS. С помощью текстового редактора откройте файл <filename>/etc/my.cnf</filename> добавьте следующие две строки в секции [mysqld]:
sw: Hii itasakinisha MySQL na machaguo-msingi kwenye mfumo wako. Utahitaji kubadili machaguo-msingi ili kufanya iwe kwa ajili ya OTRS yako. Kwa kutumia kihariri nakala fungua faili <filename>/etc/my.cnf</filename> na ongeza mistari miwili inayofwata chini ya kifungu [mysqld]:

source: Now execute <command>service mysqld start</command> to re-start the database server and activate these changes. Then run <command>/usr/bin/mysql_secure_installation</command> and follow the on-screen instructions to set a database root password, remove anonymous access and remove the test database. Lastly, run <command>chkconfig mysqld on</command> in order to make sure mysql is automatically started at server startup time.
ja: ここで、データベース・サーバを再起動し、かつこれらの変更を活性化するために<command>service mysqld start</command>を実行します。次に、<command>/usr/bin/mysql_secure_installation</command>を実行して、データベースrootパスワードをセットし、匿名のアクセスを削除し、テスト・データベースを削除し、スクリーン上の指示に従ってください。最後に、mysqlがサーバ開始時に自動開始されることを確認するために<command>chkconfig mysqld on</command>を実行してください。
ru: Теперь выполните <command>rcmysql restart</command> для рестарта сервера баз данных и включения сделанных изменений. Затем выполните <command>/usr/bin/mysql_secure_installation</command> и следуйте инструкцим на экране для установки пароля для пользователя root СУБД, удаления анонимного доступа и удаления тестовой базы данных. Наконец, исполните <command>chkconfig -a mysql</command> для проверки настройки автоматического запуска mysql одновременно со стартом сервера.
sw: Sasa tekeleza <command>service mysqld start</command> kuanzisha upya seva ya hifadhidata na kuamilisha mabadiliko haya. Kisha anzisha <command>/usr/bin/mysql_secure_installation</command> na fuata maelekezo ya kwenye skrini kuseti nywila mzizi ya hifadhidata, kuondoa ufikivu bila jina na kuondoa hifadhidata ya majaribio. Mwisho, anzisha <command>chkconfig mysqld on</command> ili kuhakikisha mysql inaanza kiotomatiki muda seva inapoanza.

source: Install OTRS with via the command line using <command>yum</command>. This will also pull in some dependencies such as the apache web server and some Perl modules. Make sure you copied the OTRS RPM file to the current directory.
ja: コマンド<command>yum</command>を使用するコマンドラインからOTRSをインストールします。これは、さらにApacheウェブサーバおよびいくつかのPerlモジュールのようないくつかの依存性を誘起するでしょう。カレント・ディレクトリにOTRS RPMのファイルをコピーしたことを確認してください。
ru: Установите OTRS с использованием <command>yum</command> из командной строки. При этом будут выполнены связанные задачи, такие как установка веб-сервера Apache и ряда модулей Perl. Убедитесь, что OTRS RPM файл скопирован в текущий каталог.
sw: Sakinisha OTRS kupitia tungo amri kwa kutumia <command>yum</command>. Hii pia itavuta utegemezi kama seva ya wavuti ya apache na baadhi ya moduli za Perl. Hakikisha umenakili faili la OTRS RPM kwenda kwenye mpangilio orodha wa sasa.

source: The OTRS installation is complete. Now you should make sure that Apache is started and that it starts whenever the server reboots.
ja: OTRS設置は完了しました。ここでApacheが開始し、サーバがリブートする場合は常に、Apacheが開始することを確認すべきです。
ru: Установка OTRS завершена. Осталось убедиться, что Apache запущен и будет всегда стартовать при любой презагрузке сервера.
sw: Usakinishaji wa OTRS umekamilika. Sasa unatakiwa kuhakikisha kwamba Apache imeanzishwa na kwamba inaanza wakati wote seva inapojiwasha upya.

source: OTRS needs some more modules than can be installed by the RPM. You can post-install them manually. You can check what modules you are missing by running the <filename>bin/otrs.CheckModules.pl</filename> script located in the <filename>/opt/otrs</filename> directory. Some modules are only needed for optional functionality, such as communication with IMAP(S) servers or PDF generation. On Red Hat or CentOS we recommend installing these modules from the EPEL repository, a repository maintained by the Fedora project, which provides high quality packages for RHEL and derivatives. Check for more information <ulink url="http://fedoraproject.org/wiki/EPEL">the EPEL web site</ulink>.
ja: OTRSは、RPMによってインストールすることができるよりさらに幾つかのモジュールを必要とします。それらを手動で後でインストールすることができます。<filename>/opt/otrs</filename>ディレクトリーにある<filename>bin/otrs.CheckModules.pl</filename>スクリプトを実行して、不足しているのがどのモジュールかをチェックすることができます。いくつかのモジュールは、IMAP(S)サーバーかPDF生成とのコミュニケーションのようなオプションの機能性にのみ必要とされます。Red HatまたはCentOSの上でEPELリポジトリからのこれらのモジュールのインストールを推奨します。そのリポジトリは、RHELとそのは派生のための高品質パッケージを供給しているFedora projectによって維持管理されています。より詳細な情報は以下を御覧ください。<ulink url="http://fedoraproject.org/wiki/EPEL">the EPELウェブサイト</ulink>。
ru: OTRS требуются некоторые дополнительные модули, кроме тех, что устанавливаются с помощью RPM. Вы можете доустановить их вручную. Выяснить, какие дополнительные модули требуются, можно с помощью скрипта <filename>bin/otrs.CheckModules.pl</filename> размещенного в каталоге <filename>/opt/otrs</filename>. Некоторые модули требуются только в случае включения дополнительных опций, например для взаимодействия с серверами IMAP(S) или вывода в формате PDF. На среверах с Red Hat или CentOS мы рекомендуем устанавливать эти модули из репозитория EPEL, который поддерживается проектом Fedora и производит высококачественные пакеты для RHEL и его ответвлений. Более подробно см. на <ulink url="http://fedoraproject.org/wiki/EPEL">EPEL web сайт</ulink>.
sw: OTRS inahitaji baadhi ya moduli zaidi ya zilizosakinishwa na RPM. Unaweza kuzisakinisha baadaye kwa mikono. Unaweza kuona moduli gani unakosa kwa kuanzisha hati <filename>bin/otrs.CheckModules.pl</filename> iliyopo kwenye mpangilio orodha <filename>/opt/otrs</filename>. Baadhi ya moduli zinahitajika tu kwa ajili ya sifa za hiari, kama mawasiliano na seva ya (za) IMAP au uzalishaji wa PDF. Kwenye Redhat au CentOS tunashauri kusakinisha hizi moduli kutoka kwenye hifadhi ya EPEL, hifadhi inayodumishwa na mradi wa Fedora, ambayo inatoa vifurushi vya ubora wa juu kwa ajili ya RHEL na vipngele vyake. Kwa taarifa zaidi angalia <ulink url="http://fedoraproject.org/wiki/EPEL">tovuti ya EPEL </ulink>.

source: If you're on RHEL 6 or CentOS 6, you can get the latest package for EPEL from <ulink url="http://download.fedoraproject.org/pub/epel/6/i386/repoview/epel-release.html">this site</ulink>. You can add this repository to yum it in one go by copying the RPM URL you find on this page and executing this command:
ja: RHEL 6あるいはCentOS 6をご利用の場合、EPELのために最新のパッケージを得ることができます。<ulink url="http://download.fedoraproject.org/pub/epel/6/i386/repoview/epel-release.html">このサイト</ulink>から。このページで見つけたRPM URLをコピーして、このコマンドを実行することによって、このリポジトリをyumに追加できます：
ru: Если вы работаете на RHEL 6 или CentOS 6, ниболее свежие пакеты для EPEL можно загрузить с <ulink url="http://download.fedoraproject.org/pub/epel/6/i386/repoview/epel-release.html">этого сайта</ulink>. Вы можете добавить этот репозиторий к yum в один шаг, копированием RPM URL, которую вы найдете на этой странице, и выполнив эту команду:
sw: Kama uko kwenye RHEL 6 au CentOS 6, unaweza kupata kifurushi cha hivi karibuni kutoka <ulink url="http://download.fedoraproject.org/pub/epel/6/i386/repoview/epel-release.html">tovuti hii</ulink>. Unaweza kuongeza hii hifadhi kwenye yum moja kwa moja kwa kunakili URL ya RPM utakayoikuta kwenye kurasa hii na kutekeleza hili agizo:

source: The first time you use yum after you added this repository, you will be prompted to add its key. Now you can install missing modules like below.
ja: このリポジトリを追加後、yumの初回使用時、そのキーを加えるように促されます。ここで不足しているモジュールを以下のようにインストールすることができます。
ru: В первый раз, при использовании yum после добавления строки с указанием репозитария, вас попросят ввести его ключ. Теперь, вы можете установить пропущенные модули, как показано ниже.
sw: Mara ya kwanza kutumia yum baada ya kuongeza hifadhi hii, utaombwa kuweka ufunguo wake. Sasa unaweza kusakinisha moduli zinazokosekana kama hapa chini:

source: Installation of Oracle database driver on Red Hat / CentOS
ja: Red HatまたはCentOSでのOracleデータベース・ドライバのインストレーション
ru: Установка драйвера базы данных Oracle на Red Hat / CentOS
sw: Usakinishaji wa kiendeshi cha hifadhidata ya Oracle kwenye Red Hat / CentOS

source: If you want to deploy OTRS on an Oracle database, you'll need to compile and install the <application>DBD::Oracle</application> database driver. This is slightly more complicated than installing any of the other packages; this is because Oracle is a proprietary database and Red Hat nor the CentOS project are allowed to distribute drivers in their RPM repositories.
ja: Oracleデータベース上のOTRSを展開させたければ、<application>DBD::Oracle</application>データベース・ドライバをコンパイルし、インストールする必要があります。これは他のどのパッケージのインストールよりわずかに複雑です;これはオラクルが所有権のあるデータベースであり、Red HatもCentOSもRPMレポジトリにドライバを配布することが許可されないプロジェクトだからという理由だからです。
ru: Для подключения СУБД Oracle к OTRS необходимо скомпилировать и установить <application>DBD::Oracle</application> драйвер для базы данных. Это немного сложнее чем установка других пакетов, т.к. Oracle является проприетарной СУБД и, так же как ни Red Hat ни CentOS, не разрешает публикацию драйверов в своих RPM репозиториях.
sw: Kama unataka kutumia OTRS kwenye hifadhidata Oracle, utahitaji kukusanya-zalisha na kusakinisha kiendeshi cha hifadhidata <application>DBD::Oracle</application>. Hii ni ngumu kidogo kusakinisha zaidi ya vifurushi vingine; hii ni kwasababu Oracle ni hifadhidata inayomilikiwa kibinafsi na si mradi wa Red Hat wala Centos unaruhusiwa kusambaza viendeshi katika hifadhi zao za RPM.

source: First of all, we'd need to install <application>gcc</application>, <application>make</application> and <application>CPAN</application> so we can compile and install the driver. Below you see the command on CentOS; on other versions it might look a little different.
ja: まず、ドライバーをコンパイルしインストールできるように、<application>gcc</application>, <application>make</application> 及び <application>CPAN</application>をインストールする必要があります。以下、CentOSに関するコマンドを見てみましょう;他のバージョンにおいては、それが少し異なっているように見えるかもしれません。
ru: Прежде всего необходимо установить <application>gcc</application>, <application>make</application> и <application>CPAN</application>, после чего можно приступить к компиляции и установке драйвера. Ниже приведена команда для CentOS; для других версий она может выглядеть несколько иначе.
sw: Kwanza kabisa tutahitaji kusakinisha <application>gcc</application>, <application>make</application> na <application>CPAN</application> ili tuweze kukusanya-zalisha na kusakinisha kiendeshi. Chini unaona amri katika CentOS; katika matoleo mengine inaweza kuonekana tofauti kidogo.

source: The next step is to obtain and install the database client. For this you would need to sign up for a free account at the Oracle website. You can download the drivers from this page: <ulink url="http://www.oracle.com/technetwork/database/features/instant-client/index-097480.html"> http://www.oracle.com/technetwork/database/features/instant-client/index-097480.html</ulink> Please choose the Linux x86 or x86-64 version corresponding to the architecture of your system. You can check this with the <command>uname -i</command>. It is either 'x86_64' for x86-64 or 'i386' for x86. You should download the packages 'Instant Client Package - Basic', 'Instant Client Package - SQL*Plus', and 'Instant Client Package - SDK'. Save them to a location on your disk. Now as the root user you can install the packages using the following command:
ja: 次のステップは、データベース・クライアントを入手しインストールすることです。これについては、オラクルのウェブサイトで無料アカウントのサインアップをする必要があるでしょう。このページからドライバをダウンロードすることができます:<ulink url="http://www.oracle.com/technetwork/database/features/instant-client/index-097480.html"> http://www.oracle.com/technetwork/database/features/instant-client/index-097480.html</ulink>システムのアーキテクチャーに対応するLinux x86 か x86-64バージョンを選んでください。コマンド<command>uname -i</command>でこれをチェックすることができます。それは、x86-64のための「x86_64」あるいはx86のための「i386」のいずれかです。以下のパッケージをダウンロードするべきです：'Instant Client Package - Basic', 'Instant Client Package - SQL*Plus', and 'Instant Client Package - SDK'。それらをディスクに保存してください。ここで、rootユーザーとして、次のコマンドを使用して、パッケージをインストールすることができます:
ru: Следующим шагом является получение и установка клиента базы данных. Для этого надо зарегистрироваться и получить свободный аккаунт на сайте Oracle. Вы можете загрузить драйверы с этой страницы: <ulink url="http://www.oracle.com/technetwork/database/features/instant-client/index-097480.html"> http://www.oracle.com/technetwork/database/features/instant-client/index-097480.html</ulink> Выберите версию для Linux x86 или x86-64, в зависимости от вашей системы. Вы можете узнать это с помощью команды <command>uname -i</command>. Это будет 'x86_64' для x86-64 или 'i386' для x86. Загрузите пакеты 'Instant Client Package - Basic', 'Instant Client Package - SQL*Plus', и 'Instant Client Package - SDK'. Сохраните их себе на диск. Теперь, от имени пользователя root вы можете установить пакеты с помощью следующей команды:
sw: Hatua inayofuata ni kupata na kusakinisha programu ya hifadhidata. Kwa hili utahitaji kujiunga kwa ajili ya akaunti ya bure katika tovuti ya Oracle. Unaweza kupakua viendeshi katika ukurasa huu: <ulink url="http://www.oracle.com/technetwork/database/features/instant-client/index-097480.html"> http://www.oracle.com/technetwork/database/features/instant-client/index-097480.html</ulink> Tafadhali chagua toleo la x86 au x86-64 la Linux kwa kutegemea na muundo wa mfumo wako. Unaweza kukagua hili kwa kutumia <command>uname -i</command>. Ni aidha 'x86_64' kwa ajili ya x86-64 au 'i386' kwa ajili ya x86. Unatakiwa kupakua vifurushi 'Instant Client Package - Basic', 'Instant Client Package - SQL*Plus', na 'Instant Client Package - SDK'. Zihifadhi mahali kwenye diski yako. Sasa kama mtumiaji mzizi unaweza kusakinisha vifurushi hivyo kwa kutumia amri ifuatayo:

source: After this you should set two environment variables and compile the DBD::Oracle driver. Again, perform these tasks as the root user. The steps are outlined below. Please note that for briefness some lines outputted by the commands have been removed.
ja: この後、2つの環境変数をセットし、DBD::Oracleドライバーをコンパイルするべきです。再び、rootユーザとしてこれらのタスクを行なってください。以下にステップを概説します。コマンドが除去されたことで出力行が数行短くなっていることにお気づき下さい。
ru: После этого нужно задать значения двум переменным окружения и скомпилировать DBD::Oracle драйвер. Еще раз напомним, что выполнять это необходимо от имени пользователя root. Эти шаги изложены ниже. Обратите внимание, что для краткости некоторые строки, выдаваемые командой были удалены.
sw: Baada ya hii unatakiwa kuseti vishika nafasi vya mazingira viwili na kusanya-zalisha kiendeshi cha DBD::Oracle. Kwa mara nyingine, fanya kazi hizi kama mtumiaji mzizi. Hatua zimeorodheshwa chini. Tafadhali tambua kwa ajili ya ufupisho baadhi ya mistari iliyotolewa na amri imeondolewa.
