Repository: DSigmund/doc-admin
Catalog: i18n/doc-admin.*.po
Languages: ja, ru, sw

source: Get OTRSCloneDB script to clone databases
ru: Загрузите скрипт OTRSCloneDB для клонирования базы данных

source: Please go to the admin menu of the windows based system and install the newest version of OTRSCloneDB package into your OTRS:
ru: Перейдите в меню администратора системы на Windows и установите новейшую версию OTRSCloneDB в OTRS:

source: You can install the OTRSCloneDB package directly from the package manager. Select "OTRS Extensions" from the dropdown list on the left and click on the button "Update repository information" below. Then the OTRSCloneDB package will be shown in a list where you can click on "Install".
ru: Вы можете установить пакет OTRSCloneDB непосредственно с помощью менеджера пакетов. Выберите "OTRS Extensions/Дополнения OTRS" из выпадающего списка слева и кликните по кнопке "Обновить информацию репозитария" ниже. Когда с строка с OTRSCloneDB будет отражена в списке, выберите ее и нажмите "Установить".

source: You could also download the package manually from the OTRS FTP server and install the package manually as described below. <ulink url="http://ftp.otrs.org/pub/otrs/packages/"> <citetitle>http://ftp.otrs.org/pub/otrs/packages/</citetitle> </ulink>
ru: Можно, также, загрузить пакет вручную с OTRS FTP сервера и установить его вручную, как описано ниже. <ulink url="http://ftp.otrs.org/pub/otrs/packages/"> <citetitle>http://ftp.otrs.org/pub/otrs/packages/</citetitle> </ulink>

source: Please download the package with the highest version number:
ru: Загрузите пакет с наибольшим номером версии:

source: Download OTRSCloneDB - screenshot
ru: Загрузка OTRSCloneDB - скриншот

source: and install it to your windows based installation:
ru: и установите его в вашу систему на Windows:

source: Install OTRSCloneDB - screenshot
ru: Установка OTRSCloneDB - скриншот

source: It is also no problem if you have installed some additional features or custom developments on your OTRS. You just need to take care that all of your installed packages are also compatible with unix based systems. For packages provided by OTRS this is the case.
ru: Если у вас были установлены какие-то расширения OTRS/feature addons или собственные разработки, проблем быть не должно. Надо только убедиться, что все из ваших установленных пакетов также имеют совместимость с системами на unix. С пакетами, предоставляемыми OTRS дело обстоит именно так.

source: Enable remote access for the postgresql database of target system
ru: Включите удаленный доступ к базам postgresql вашей целевой системе

source: The OTSRCloneDB script will copy the database data over the network, so we need to enable remote access to the database. The setup is different for the different databases, we will describe opening remote access for a postgresql database here.
ru: Скрипт OTSRCloneDB скопирует базу данных по сети, для этого должен быть включен удаленный доступ к базам данных. Установка различается для различных СУБД, мы здесь опишем включение удаленного доступа к postgresql.

source: After logging into your target system via SSH you need to change into the postgresql directory:
ru: После входа в вашу целевую систему с использованием SSH, необходимо изменить путь к каталогу postgresql:

source: Add the following line at the end of the file:
ru: Добавьте следующую строку в конец файла:

source: Save the file.
ru: Сохраните файл.

source: Restart your postgresql server
ru: Перезапустите сервер postgresql

source: Stop OTRS services
ru: Остановите сервисы OTRS

source: Stop all running services of your target system:
ru: Остановите работающие сервисы на целевой системе:

source: Drop the existing database of your target system to have an empty database for the clone data
ru: Сделайте "drop" существующей БД вашей целевой системы, чтобы иметь пустую базу для клонирования данных

source: The OTRSCloneDB script will not remove the data in the existing otrs database of the target system, so we need to do this manually:
ru: Скрипт OTRSCloneDB не удаляет данные в существующей базе OTRS, поэтому придется это сделать вручную:

source: Change the user to the postgresql user: <placeholder type="screen" id="0"/>
ru: Замените пользователя на пользователя postgresql: <placeholder type="screen" id="0"/>

source: Drop the existing otrs database: <placeholder type="screen" id="0"/>
ru: Очистите существующую БД otrs: <placeholder type="screen" id="0"/>

source: Create a new otrs database for the otrs user: <placeholder type="screen" id="0"/>
ru: Создайте новую БД OTRS для пользователя otrs: <placeholder type="screen" id="0"/>

source: Go back to root user: <placeholder type="screen" id="0"/>
ru: Верните пользователя root: <placeholder type="screen" id="0"/>

source: Get the postgresql password of your database
ru: Получить пароль postgresql вашей БД

source: Change into the OTRS directory of your target system:
ru: Перейдите в каталог OTRS вашей целевой системы:

source: and take a look at the configuration file of your target system:
ru: и давайте посмотрим на конфигурационный файл вашей целевой системы::

source: You will find your database password if you scroll down a bit:
ru: Вы найдете пароль для вашей БД если немного пролистаете файл вниз:

source: Get target database password - screenshot
ru: Получение пароля БД вашей целевой системы - скриншот

source: <placeholder type="screeninfo" id="0"/> <graphic srccredit="Get target database password - screenshot" scale="80" fileref="screenshots/win-gather-db-data-1.png"></graphic>
ru: <placeholder type="screeninfo" id="0"/> <graphic srccredit="Получение пароля БД вашей целевой системы - скриншот" scale="80" fileref="screenshots/win-gather-db-data-1.png"></graphic>

source: In our example:
ru: В нашем примере:

source: <placeholder type="screen" id="0"/> Write the pasword down on a piece of paper.
ru: <placeholder type="screen" id="0"/> Запишите пароль, где-нибудь.

source: Clone your database into the target system
ru: Скопируйте вашу БД на вашу целевую систему

source: Switch back to your windows based installation and open the SysConfig admin menu. Please select the group "OTRSCloneDB" and the subgroup "Configuration":
ru: Переключитесь обратно на систему под Windows и откройте меню администрирования SysConfig. Выберите группу "OTRSCloneDB" и подгруппу "Configuration":

source: Configurate OTRSCloneDB SysConfig 1 - screenshot
ru: Настройте OTRSCloneDB SysConfig 1 - скриншот

source: We need to configure the SysConfig option OTRSCloneDB::TargetSettings with the following values:
ru: Нужно настроить параметр SysConfig - OTRSCloneDB::TargetSettings, со следующими значениями:

source: TargetDatabaseHost => 192.168.137.20 (Here you need to enter the ip address of your target system) TargetDatabase => otrs TargetDatabaseUser => otrs TargetDatabasePw => I88cm34A1B6xrl3 (Here you need to set the password of your target system) TargetDatabaseType => postgresql
ru: TargetDatabaseHost => 192.168.137.20 (Здесь необходимо ввести ip адрес вашей целевой системы) TargetDatabase => otrs TargetDatabaseUser => otrs TargetDatabasePw => I88cm34A1B6xrl3 (Здесь необходимо ввести пароль на вашей целевой системе) TargetDatabaseType => postgresql

source: Configurate OTRSCloneDB SysConfig 2 - screenshot
ru: Настройте OTRSCloneDB SysConfig 2 - скриншот

source: To run the OTRSCloneDB script we need to switch to the command prompt of our windows based otrs and to change into the base directory of our OTRS installation:
ru: Для запуска скрипта OTRSCloneDB необходимо переключиться в режим командной строки в вашей Windows otrs системе в корневой каталог:

source: If you are using StrawberryPerl, then you maybe need to activate your shell for perl:
ru: Если вы используете StrawberryPerl, то, возможно, потребуется активировать оболочку perl:

source: Run OTRSCloneDB script 1 - screenshot
ru: Запуск OTRSCloneDB script 1 - скриншот

source: The OTRSCloneDB script is located in the bin directory of the otrs directory.
ru: Скрипт OTRSCloneDB расположен в каталоге bin каталога otrs.

source: Run the OTRSCloneDB script:
ru: Запуск скрипта OTRSCloneDB:

source: Now you should see some information about the script and its parameters.
ru: Теперь вы можете увидеть некоторую информацию о скрипте и его параметрах.

source: Run OTRSCloneDB script 2 - screenshot
ru: Запуск OTRSCloneDB script 2 - скриншот

source: Note... Errors which occur at running without any parameters could relate to wrong login data for the database or problems with the database connection.
ru: Внимание... Ошибки которые появляются при запуске без параметров говорят о неверном имени входа для БД или проблемами с подключением к СУБД.

source: If no errors occurred, check if the dry run is successful:
ru: Если ошибок не обнаружено, проверьте, что чистый запуск проходит успешно:

source: Run OTRSCloneDB script 3 - screenshot
ru: Запуск OTRSCloneDB script 3 - скриншот

source: Start the cloning of your database and cross your fingers:
ru: Начните копирование вашей БД и "молитесь":

source: An example of a successfully run look like this:
ru: Пример успешного выполнения выглядит так:

source: Copy the following files from your windows based system to the target system
ru: Скопируйте следующие файлы из вашей windows системы в целевую систему

source: You need to copy some files from your windows based system to the target system. You can do this for example with a free tool like "WinSCP" (just search the internet for "WinSCP"). Copy the following files from your windows based system:
ru: Необходимо скопировать некоторые файлы из старой системы. Это можно сделать, например, с помощью "WinSCP" (можно найти в интернете по фразе "WinSCP"). Скопируйте из нее следующие файлы:

source: to your target system:
ru: в вашу целевую систему:

source: <placeholder type="screen" id="0"/> Open the file /opt/otrs/Kernel/Config/Files/ZZZAuto.pm on the target system and replace all paths like "C:/otrs/OTRS/" with "/opt/otrs/"!
ru: <placeholder type="screen" id="0"/> Откройте файл /opt/otrs/Kernel/Config/Files/ZZZAuto.pm в целевой системе и замените все пути типа "C:/otrs/OTRS/" на "/opt/otrs/"!

source: If you have have manually changes in your Kernel/Config.pm then please copy these changes to the target system's Kernel/Config.pm. Don't copy it 1:1 because you will now have different database settings and the file paths on the target system are different from windows!
ru: Если вы вручную правили Kernel/Config.pm - скопируйте сделанные изменения в целевую систему. Не копируйте их 1:1, т.к. в новой системе другие настройки БД и пути к файлам!

source: Reinstall all packages
ru: Переустановить все пакеты

source: Reinstall all packages with the package manager to get all custom files back.
ru: Переустановите все пакеты с помощью Менеджера пакетов для получения всех дополнительных файлов обратно.

source: Fix all permissions in your OTRS system again:
ru: Исправить все права в вашей OTRS системе снова:

source: Disable remote access for the postgresql database of your target system
ru: Выключите удаленный доступ к базам postgresql вашей целевой системе

source: Undo all steps you did to enable the remote access for the postgresql database to your target system.
ru: Выполните обратно все шаги, сделанные при включении удаленного доступа к базам postgresql в вашей целевой системе.

source: Change into postgresql directory:
ru: Смените каталог на postgresql:

source: Remove the following line at the end of the file:
ru: Удалите следующую строку в конеце файла:

source: Start OTRS services
ru: Запуск сервисов OTRS

source: Start services of your target system:
ru: Запустите сервисы на вашей новой системе:

source: Now you should be able to open the OTRS of your target system in the browser with the imported data of your windows based system.
ru: Теперь вы сможете войти в OTRS в браузере целевой системы и работать с импортированными данными из старой системы на Windows.

source: The OTRS website with source code, documentation and news is available at <ulink url="http://otrs.org/">http://www.otrs.com/</ulink>. Here you can also find information about commercial services and trainings from OTRS Group, the creator of OTRS.
ru: Сайт OTRS с исходными кодами, документацией и новостями доступен по ссылке <ulink url="http://otrs.org/">http://www.otrs.com/</ulink>. Здесь вы также можете найти информацию о коммерческих сервисах и тренингах, предоставляемых разработчиком OTRS - OTRS Group.

source: For services (support, consulting, development, and training) you can contact the company behind OTRS, OTRS AG. Our offices are located in Germany, USA, Mexico, the Netherlands, and in other countries. Visit our website for <ulink url="http://www.otrs.com/buy">contact information</ulink>.
ru: За услугами (по поддержке, консультированию, разработке и обучению) вы можете обращаться не только в центральный офис OTRS AG. Наши офисы расположены в Германии, США, Мексике, Нидерландах и других странах. Посетите наш сайт <ulink url="http://www.otrs.com/buy">Контакты</ulink>.

source: Mailing Lists
ru: Почтовые рассылки

source: To report software defects, please visit <ulink url="http://bugs.otrs.org/">http://bugs.otrs.org/</ulink> (see Figure below). Please take note of the difference between a bug and a configuration issue. Configuration issues are problems that you encounter when setting a system, or general questions regarding the use of OTRS. Bug reports should only be used for issues with the source code of OTRS or other open source OTRS modules itself. For configuration issues, you should either use the <ulink url="http://www.otrs.com/solutions/service-contracts/">commercial support, available from OTRS.com</ulink>, or the public mailing lists.
ru: Для сообщений об ошибках в ПО, обращайтесь в <ulink url="http://bugs.otrs.org/">http://bugs.otrs.org/</ulink> (смотри рисунок ниже). Отличайте ошибки от вопросов конфигурации. Вопросы конфигурации/настройки это проблемы возникающие при при установке системы или общие вопросы использования OTRS. Отчеты об ошибках используются при проблемах исходного кода самой OTRS или связанных с ним модулей open source. Для вопросов конфигурации используйте <ulink url="http://www.otrs.com/solutions/service-contracts/">коммерческая поддержка, доступная от OTRS.com</ulink>, или публичные почтовые рассылки.

source: You help us a lot to improve the product by reporting bugs. We appreciate your input!
ru: Вы очень помогаете нам для улучшения продукта, сообщая об ошибках. Мы высоко ценим ваш вклад!
